[
    {
        "text": " Anthropic product head Mike Kger joins us to talk about how AI model development is accelerating and what we should look out for as things continue to move faster. That's coming up right after this. Welcome to Big Technology Podcast, a show for coolheaded and nuanced conversation of the tech world and beyond. Well, Anthropic has a new model out, Sonnet 4.5, just months after the series of Claude 4 models came out. So things are moving fast and we're going to figure out why they're moving much faster and what the implications are for the AI industry and businesses as a whole. And we're joined today by the perfect guest to do it. Anthropic product head Mike Kger is here with us. Mike, it's good to see you again. Welcome to the show. It's good to be here. Thanks, Alex. So I remember sitting in the audience for Anthropic's first developer day. And it's funny because in the AI world, you sort of you go and what is it? cat years or dog years, I don't even know. Every every month feels like a year. And this was in May, May 2025. And I remember yourself and Dario were on stage saying, \"Yes, we're we releasing Claude 4 but you know, we're going to release the next iterations much faster than we ever have previously and we're already at 4.5. How is it happening?\" I think there's a couple of things that we're seeing. I mean even just thinking about I mean May again feels like a year ago I think doggeears is about right. I think there's a couple of things. One is we've been working much more with sort of enduser sort of customers of for example of our platform. and with that we can hear like a much faster feedback loop of hey signet 4 is great in these ways. We wish it was better in these ways. And you're starting to get customers that really push the models in really interesting ways. And that ends up being very helpful for us on the research side because then we can say all right these are problems to be tackled in the next version of cloud. So for example one of them was you know claude you know sonet 4 and even opus for opus is our biggest model is good at writing code but you know tends to get sidetracked or lost if it's working over longer time horizons. that was a real emphasis of sonnet 4.5 or you know we you know put a lot of data into the context basically how the model is what it's thinking about in a given point but at some point that gets filled up and how do you then manage you know to keep working on those things so having that feedback loop really helps and also gives us a lot of urgency because it means that there's sort of sort of almost like bugs in some ways",
        "start": 0.16,
        "duration": 304.721
    },
    {
        "text": "some point that gets filled up and how do you then manage you know to keep working on those things so having that feedback loop really helps and also gives us a lot of urgency because it means that there's sort of sort of almost like bugs in some ways at least like feature requests that you want to go fix. So that's that's one piece. The other one is we've just streamlined a lot more of our model release story. So I think having now seen you know I joined shortly before sonnet 3.5 which was back in like May of last year. So really long time ago in AI years from then to now just the sort of operational upleveling that I think we've seen in terms of you know how do we do how do we get early access feedback from customers? How do we give like the remainder of customers like a good heads up so they can la they can co-launch on launch day? What does even that morning look like on roll out? I was talking to a customer. He's like, I've seen a lot of lab rollouts of of models and this was like the smoothest I've seen which I like took as like a big endorsement of how much we've like streamlined that model release process. That just makes it so that like every release doesn't feel like, you know, this very, you know, bespoke, very difficult process. It can be much more a great like we know what we're doing. Here's the date. to the extent that research can be predictable which it can't be but within that domain how do we actually make that as smooth as possible right and maybe I'm looking at this from a dumb outsers perspective but the one thing that I didn't hear you mention was scale and you know hearing so much about the scaling laws especially from anthropic you know part of me believe that like okay four is you know cloud 4 is x number of GPUs and 4.5 is I number of GPUs and five will be Z number of GPUs. So does the numbers in your model release you know rubric correlate at all with the scale of the data centers that you're trading on and the scale of the data. I mean I think what's been interesting is at different points and if you talk to to Jared Cavlin who's our chief scientist he'll he'll I think tell you much the same is the scaling laws I think paint a picture of what is possible but is not predetermined like to actually get there there's a lot of actually really difficult both machine learning and engineering work. So I think one thing that's been notable to your question about scale over the last you know 6 months is how much it's been really engineering like if you're going to do both pre-training and post-training on",
        "start": 152.8,
        "duration": 570.8810000000002
    },
    {
        "text": "a lot of actually really difficult both machine learning and engineering work. So I think one thing that's been notable to your question about scale over the last you know 6 months is how much it's been really engineering like if you're going to do both pre-training and post-training on accelerators how do you make that reliable how do you keep that you know how you keep that run as we call it like going even if you know some portion of it has an issue so a lot of the I think to your question a lot of the the improvement in our ability to deliver these models really has come from our ability to run these large training runs at scale which you know again fundamentally an engineering and machine learning problem I think both have improved I think if I pointed at something between sonnet 4 and 45 a lot of it really has been on the engineering side to just be able to scale up especially a lot of the post- training work if I'm reading you're right it's not necessarily gains that anthropic is seeing from scaling up the data centers it is algorithmic work that is being done by your teams to make the models better they really come together I think it's the algorithmic work and then the ability to maximize the amount of compute that we can use like on those algorithmic improvements. So they really kind of go hand inand sometimes directly hand inand in that you know either an idea that works at small scale when you scale it up doesn't work as well and then other times an idea only works when you get enough data and scale in there as well. So it really becomes, you know, when we when I think about our our team, we actually just brought in a new CTO. and a lot of I think his remit will be how do you really partner research and our like kind of core engineering teams together to achieve that kind of scale. Okay. And another thing I was expecting you to say, which I'm not sure if I've heard yet, is that teams within Anthropic have used the coding capabilities of your AI models to be able to ship faster. Is that a sort of supporting character here or is it is it the star? I think it's it's a good I'll have to think about that for a sec. I think it's a little bit of both. I would actually say there's there's a thing that is emergent even beyond the coding capabilities which is the ability of Claude to be a really active participant in the process. And here's what I mean by that. you know I think about the way Claude was being used around even sonnet 4. was you know help write code you know to to launch these models help write the product code for sure",
        "start": 286.88,
        "duration": 821.7610000000001
    },
    {
        "text": "be a really active participant in the process. And here's what I mean by that. you know I think about the way Claude was being used around even sonnet 4. was you know help write code you know to to launch these models help write the product code for sure you can imagine cloud code itself is like a very sort of we use cloud code to develop cloud code very much in a loop I think that the biggest delta between four and four five is that now we have much more of claude as an agent or almost like a co-orker in for example our slack channels so for example we have something we built that's clawed on call. So if you've been an engineer one of the things you have to do is you know you take the metaphorical pager which is basically you're on call for a week or two to manage a system and you know if you get paged you'll show up and say like all right there's certain number of things that could be wrong. I got to go check these graphs. I got to maybe try this out. And one thing that we've built using the cloud agent SDK, which we also released alongside its sonet 4.5 publicly, but we've been using internally for a while, is the ability for for cloud to basically show up first in those incident channels and already have a sense of what might be going on and be able to answer really quickly, hey, can you do some data diving while I work on something else? and so we've increasingly had Claude play these sort of yeah, these really collaborative roles within our company even beyond the ability to code. And it's again using the same technology as cloud code under the hood but it's accelerating the company in being more efficient or better able to scale up or better able to understand it. So I think the answer to your question is it's support it's a supporting role on the sort of building side but it's playing a much more fundamental role in terms of the actual operational side. So let me see if I can zero into it. So instead of basically being autocomplete for coding this is actually going out and being proactive examining things and then coming back with insights. Exactly. And we have similar sort of you know agents is the I guess the industry term of art now. But I feel like agents can mean so many things to different people right now. What does agents mean to you if you're going to if we're going to start talking about agents? I I need a definition of this word because I'm struggling to figure it out. I think the purest definition and this is not so pure because I'm probably going to use like 20 words to do it. So maybe we can edit it down together. But it's going",
        "start": 415.039,
        "duration": 1070.001
    },
    {
        "text": "agents? I I need a definition of this word because I'm struggling to figure it out. I think the purest definition and this is not so pure because I'm probably going to use like 20 words to do it. So maybe we can edit it down together. But it's going and and and sort of run actions over long time horizons using a variety of tools where the kind of steps are not predetermined. They're able to solve problems dynamically based on what information emerges on it. So there's, you know, I I I I end up having this sort of agent kind of scorecard that I've been using internally as we think about our own products. And there's a bunch of characteristics that I look at. This is way more than 20 words, Alex. So, , as attributes I look at are things like autonomy. So, how long can the can the agent run unconstrained? So, Sonic 4.5 is a big leap there. Proactivity, like is the agent able to not just react to questions, but actually start to sort of suggest either ideas or or or interject. , ability to use tools. , and often a variety of tools. Some of them might be research tools. Some of them might be , you know, being able to write to a database. , memory. So can the agent sort of learn over time and and improve its ability to to perform a task? I always say like the hundth task with an agent should be much better than the first because that should be the case for human employees as well. and then communication is it showing up in all the right places, right? And so for us we think you know these these entities these agents are going to start showing up in all places where you do work whether that's your your Slack or your teams. For example, we launched a research preview of cloud in Chrome. Like we think of cloud, you need to be in all of these places where you're doing work so that you can actually bring it to work rather than having to bring work to it. So I even have this like spider, you know, spider chart of like attributes. So for any given agent that we're building internally, we sort of like grade it on all these different attributes and we can say, \"All right, great. For our the next quarter, our investment is going to be on autonomy or it's going to be on memory.\" And we can kind of kind of pick our pick our attributes that we're working on. No, that that was a good definition of agents actually. I think that's the most complete definition I've heard. So here's like an overriding question that's coming up as we talk. Is the improvement that much most of the improvement that we're going to see at least in the near term in AI is it just",
        "start": 539.04,
        "duration": 1311.9220000000005
    },
    {
        "text": "definition of agents actually. I think that's the most complete definition I've heard. So here's like an overriding question that's coming up as we talk. Is the improvement that much most of the improvement that we're going to see at least in the near term in AI is it just of the orchestration of these models getting them to be able to take multiple steps as opposed to I think what was sort of the defining characteristic of the earlier days of LM LMS which was basically just make it bigger make it generally smarter maybe get some PhDs to feed some information to it in post training and then you'll just you know see what happens as you I think that there's going to be some fields or disciplines where that sort of extremely sort of precise depth in a particular task or domain will continue to be important. but I think I'm much more excited and just like overall I think we're spending a lot more of our time even from the product side around that. I think it's actually two pieces. one is that orchestration. , and then two is how do you take the work that Claude is doing from like pretty good to great. , and so, you know, we launched ability for Claude to create Word and PowerPoint and Excel files that you can then download and and bring into those apps. , and if you get to like 50% as good as you would have done yourself, I don't think that's good enough and it won't speed you up. And in fact, it's like I don't know, I could have just done this myself and now now then at least I would have known what it's done. When you start clearing this sort of like 75 to 80% threshold, of course, is not scientific, but it's kind of like a little bit of a vibes based thing. then it starts actually being able to really accelerate work. And so that's the other emphasis too. It's and that's interesting that that some of that is post-trading. Some of that's actually also giving a lot of really good examples to Claude and really working closely to with how the model is producing outputs that are what we think of as like professional quality. Right. And I look I know we're 15 minutes in, so I think we should probably take a minute to talk about the concrete things that you've improved in Claude between 4 and 4.5. Do you want to just give us briefly a little bit of a list of the things that get better with the new model? Yeah, I think the the ones that I think are are highlights maybe I'll I'll I'll buck it into three. One is from a price performance perspective. So 4.5 s 4.5 basically outdoes Opus, our largest model in effectively every category but does so while running faster and at a fifth the",
        "start": 665.04,
        "duration": 1590.802
    },
    {
        "text": "think the the ones that I think are are highlights maybe I'll I'll I'll buck it into three. One is from a price performance perspective. So 4.5 s 4.5 basically outdoes Opus, our largest model in effectively every category but does so while running faster and at a fifth the were in May at you know code with Claude, we were announcing announcing Opus 4. you now have a model that is better than that and even its successor Opus 4.1 but does so at a flip the cost which is very like you know opens up a whole new set of of use cases for that kind of intelligence that's that's one on the price performance piece. the second one is on its ability not just to to code for for longer but just execute agentically for longer. We talked a little bit about agents, but what we saw was actually I put a fun video of this on my ex account, which is we asked every claude from Claude 1 to Claude, you know, 4.5 to recreate claw.ai, so like our flagship AI product. And 4.5 was really the first one that was able to do it and to and it actually produced something of, you know, quality. It actually works. You can log in, you can use an API key, all of those things as well. , and so that ability to like execute agentically, work for long time horizons. We had one customer had it work for 30 hours. Of course, that's not going to be every task, but like that's the kind of upper bound that we're starting to see is another big improvement. And then the third one is moving some of those post- training wins beyond just code to other domains we think are really important. So, for example, financial analysis is an area that we've been really interested in. And we launched cloud for financial services a couple of months ago. and we incorporated that into the model training in Son 4.5 as well. So when you look at things like benchmarks like finance agent different domains like the legal domain as well the model is improving not just on code which is obviously important but also these other domains that are you might actually use code to solve these challenges but the point is not to write code the point is to solve a financial analysis for example. Okay. And I definitely want to get into these various agents in a moment but let me ask you this. you mentioned that the new Sonnet 4.5 model is more performant than Opus the big model in the last release or the four release and and it's cheaper. So how how do you do that? I think it's I mean we talked a little bit about scale that's one piece which is you know that just really being training Sonnet 45 on like significant scale. another one is improvements in the post-training work",
        "start": 806.8,
        "duration": 1855.282
    },
    {
        "text": "release and and it's cheaper. So how how do you do that? I think it's I mean we talked a little bit about scale that's one piece which is you know that just really being training Sonnet 45 on like significant scale. another one is improvements in the post-training work third one is really sort of closing the loop on what we hear from customers around what are the things that they wished either Opus or Sonnet were better at and then getting that right. So one we hear all the time is instruction following like if I tell Sonnet to do this thing I need it to do the thing very reliably even if it's AI even if it tries to be creative like there's times where you really want it to to be more prescriptive and we put a bunch of work into instruction following for for this sonnet too. So I want to talk about these agents. So, I've got a list of four different types that you highlighted upon release. Finance, personal assistant agents, customer support, and deep research. And I just want to talk about who they're for. So, the finance agents are interesting. So, it says you say you could build agents that can understand your portfolio and goals as well as help you evaluate investments by accessing external APIs. personal assistant agents. Build agents that can help you book travel and manage your calendar as well as schedule appointments, put together briefs, and more by connecting your internal data sources and tracking context across applications. I think to set these up, it looks like it's a decent amount of work. Like you'd have to, for instance, with the finance agent understand what an API is. So, it's not going to be something that I think most people would take off the shelf. So, who is this set of agents for? And do you have plans to make this technology more accessible? So let's say, you know, I'm a finance, not even a finance professional. Let's just say I'm someone that wants to have AI run through my portfolio. Can I eventually be able to easily set that up and run it without having to know any of this fancy tech stuff? Yeah, I mean that that is absolutely the goal. So there's agents that we'll build ourselves and kind of deploy end to end. And I'll talk a little bit on the personal assistance side next, but I think by and large these will be agents that we can help power for, you know, companies that have, you know, that particular domain expertise that they're bringing it to bear. One of the first companies I ever worked with at Anthropic, , was intuitit. We were powering their sort of tax advisory service. And, you know, Enthropic, we're never going to build a tax product. , but in it has the largest one. And so, being able to power their sort of tax",
        "start": 940.48,
        "duration": 2113.683000000001
    },
    {
        "text": "first companies I ever worked with at Anthropic, , was intuitit. We were powering their sort of tax advisory service. And, you know, Enthropic, we're never going to build a tax product. , but in it has the largest one. And so, being able to power their sort of tax imagine all these other places, too. We've been working more closely with Microsoft even for some agents even within their office suite. So being able to take the financial analysis capability and the financial planning capability and bring it closer to an Excel user for example, I think that's the way you unlock the maximal value of some of these as well. And I think you'll see us sort of demonstrate these capabilities, but in terms of the first party products we build, we're pretty thoughtful about which ones we end up going deep on cuz to your point, it's to reach the scale that we I think these, you know, products deserve to reach. you want somebody who's really thinking through the whole endto-end user experience and probably has some of the pre-existing connectors already kind of set up as well. But I think it's important also to build some of these ourselves. So you talked about the the personal assistant case. One of the things that we've had a lot of fun with on our mobile apps is using ondevice capabilities as well. And so I actually just saw that Apple featured us today as our you know like like new features like for for Sonic 4.5 and one of the things that they were fe featuring was on on iOS and Android now. it can Claude can sort of read your calendar, read your reminders, like compose text messages without really any setup at all. So that's ideal, right? which is like you got those pre-existing connectors, you're not sort of spending a lot of time sort of initializing the the just getting it set up to even get any work done as well. But I guess to be more succinct and answer your question, there's some that we'll build ourselves and in those we'll try to, you know, do our best to sort of simplify the setup process. But I'm also very excited for embedding these agents in existing products that are out there that then have all that data built in. And so as I read through your blog post, I also started to think a little bit about Dario's prediction about the white collar blood bath. methods like impossible not to where he says you know within a few years you might see 50% of white collar work automated by these AI bots u looking at it being able to do these finance tasks or customer support tasks or even be a personal assistant I'm just curious from your perspective as the person running product here is this something that you're like merily running towards trying to automate human work or like",
        "start": 1072.799,
        "duration": 2374.1640000000034
    },
    {
        "text": "bots u looking at it being able to do these finance tasks or customer support tasks or even be a personal assistant I'm just curious from your perspective as the person running product here is this something that you're like merily running towards trying to automate human work or like we have you know kind of like product principles we try to work kind of towards and it's actually interesting like I think we had very or different not entirely different but kind of a different set of product principles even at Instagram I think it's important to sort of like figure out what like who you're building for and how and and and and how you go about it and one of the like principles that we operate you know with is if you can build things that are complimentary or augmentative like bias towards those first And it's not to say that in the long run like overall these products like might not or probably will be doing more sort of automation or even replacement of work but we think that two things happen if you can build more augmentative products right so it's like not a finance agent that like takes all the work you know and does it all for you but it becomes more of a back and forth one is I think it helps people develop an intuition of what the AI is good at today and not good at so that kind of helps people position even their own sort of skills against that. So I think there's the intuition building. and then the second part is it I think extends the timeline by which people are making that adaptation. So I think if you see Daario out there talking about the you know likely labor impacts, it's not to sort of try to accelerate towards those but more around like hey we think this is coming. Let's start this conversation now. And I think in the products that we build can we sort of show that this is likely to come but still build a bridge between here and there by building more augmentative products. It's definitely a like a an there's art and science here. is I think we debate a lot within the product team as well like had a a great conversation with our head of design where he's like if we had a product where you hit a button and it did all your work for you that day like would that be a good product and would that be like an anthropicy product and we both came to conclusion like no like one of our kind of core brand tenants that we've like come out is like keep thinking and like we want it to be much more of this collaborative sort of accelerator of human thought rather than replacement for human thought and would like to keep that the case for as long as possible.",
        "start": 1204.08,
        "duration": 2631.6040000000025
    },
    {
        "text": "of core brand tenants that we've like come out is like keep thinking and like we want it to be much more of this collaborative sort of accelerator of human thought rather than replacement for human thought and would like to keep that the case for as long as possible. I feel about this stuff. , but I do think that the conversation around augmentation versus automation is still like so elementary and honestly like it's a fairly dumb way to look at. I'm not saying what you're saying is I'm just saying this the industry's you know perspective on this like are you automating or augmenting tasks because let me give you an example. If you automate, you know, some if you automate a job within your company, you've automated a job. The question is what happens next? And if you put that person who was doing that job on something leading a new project, for instance, or something higher value, you've now augmented it in a way that the word augment doesn't even come close to describing. So, it's really tough, I think, to to measure this stuff. And and I don't know, I just sort of feel conflicted about the way that the conversation has gone so far. What do you think? I think that that there's a lot to what you're saying, which is there's there's the point in time task, right? Like, oh, you know, managing my calendar or, you know, doing some research out about something that I'm I'm talking about. And then there's the broader context of what is the sort of role that that person even has within the company. And you know a lot of the things that we think about is people end up I think people end up feeling more like managers of AI than just users of AI. And we think a lot of it about this even with it's happening in engineering right where our best engineers are managing three or four cloud code instances running at once. and all of a sudden you've like had to think higher level like right what is the unit of task that I want each of these sort of subcloud codes to be doing. I think the same will be the case for how we interact with AI systems and there's going to be some blend of automation and augmentation there as well. The the way I think about this sort of the bullc case for this is twofold. One can you bring to bear sort of world expert level thinking of a particular discipline into companies that might not have had that before, right? either because that talent isn't present in that local market or because the company's just getting off the ground and they can't afford a like worldclass CPO somewhere, you know, or CTO. Can you like elevate the the kind of baseline there? So, I think that's one piece too. , and then the second",
        "start": 1336.08,
        "duration": 2912.2440000000024
    },
    {
        "text": "isn't present in that local market or because the company's just getting off the ground and they can't afford a like worldclass CPO somewhere, you know, or CTO. Can you like elevate the the kind of baseline there? So, I think that's one piece too. , and then the second I think emerge and be able to scale and maintain that sort of small team cohesion. And I think we did this really well with Instagram without having to like you know build a huge workforce from day one. And I think the kinds of companies that get built will change but I still think there's like a tremendous amount of economic opportunity throughout. It just might be you know more smaller companies rather than fewer bigger monolithic companies. Interesting. I mean coming from a guy where you were at Instagram was what 16 people when you sold it for a billion dollars and people said that was crazy. Exactly. So, I got a question once that was like, \"What when do you think the first single person billiond dollar company will emerge?\" I was like, \"Well, we had 13.\" It was like, you know, we were getting close. We're 13 at at sale and 16 at close. So, basically, it was yeah, just around then. So, yeah, I mean, we got a lot done with a little and I think a lot of that came from focus. , and , you know, there's probably work that we could have done even more efficiently, right? And I mean, I think if you sold waited a couple years to sell, it might have been worth double or triple that. So folks, if you're just by the way, if you don't know about Mike's previous work, he's the co-founder of Instagram. So we are going to get to some of the social media elements of of this or the the comparisons to social media building in the second half. But two more questions for you as we round out our first half. you mentioned memory. I think it's one of the most interesting parts of this work that's sort of I think underrated and underappreciated in the common conversation. can you talk about how building better memory within these bots is how important that is and how that's actually happening? I think the biggest sort of breakthrough or really key piece of what we've done on memory is rather than treat it as a sort of substitute for how the model might otherwise access information or sort of a system built on top of the model, we actually have trained it deeply into the model. And so u the model knows about the concept of memory which I know sounds kind of funny but you can really see it as you talk to it. And you can even wait you have to what does that mean? You have to talk about what that means model. So basically in training we give the",
        "start": 1476.64,
        "duration": 3167.845000000003
    },
    {
        "text": "the concept of memory which I know sounds kind of funny but you can really see it as you talk to it. And you can even wait you have to what does that mean? You have to talk about what that means model. So basically in training we give the to let it both read from update you know write memory. And what that means is it understands the concept that it like is capable of managing its own memory. And then in our platform, we actually now have that as a sort of, you know, basic building block that you can use. And what that means is as you're talking to to Claude with access memory tool, you can say, \"Hey, Claude, can you update your your memory about this?\" And it's it knows what that means. It'll say, \"Great, I'm going to update the memory.\" Or when it's you performing an action, if it thinks there's a good chance that it has some memory related to that, you know, action, it will retrieve that memory before doing the action. And previous systems, you would have to either build that yourself on top of it, , or Claude or any of these systems wouldn't be as good at using it. And so, , effectively, in the same way that, you know, we might have the thought, hey, I think I think I did this before or like I think this happened before. I'm going to go, you know, either like think about it for a sec or maybe even search my email. , how do you we've basically given Claude that same , , that same ability. And that can be sort of memory that's very like factbased like who are you interacting with? What should you do? But it can also be more task based like whenever I'm doing X make sure I remember to do Y. That's pretty amazing. And so what what will the memory get get you when you're using this? like better memory will it start to remember many more aspects or like the so I'll give you one example and this is so rudimentary but like if I ever use claude to do a podcast description I have a format prompt that I drop in first sentence should be this second sentence should be this and every single time I you know write that prompt I I have every time I ask for a description I have to use that exact prompt or else it will do whatever it wants in freelances when are we going to get to the point where these bots are going to be smart enough where when I tell it, remember this is the way that we do things here, it knows. And I'm sure that my problem is something that people have all across the board when they're trying to get these bots to work on the same things for them.",
        "start": 1608.88,
        "duration": 3403.364000000005
    },
    {
        "text": "be smart enough where when I tell it, remember this is the way that we do things here, it knows. And I'm sure that my problem is something that people have all across the board when they're trying to get these bots to work on the same things for them. launch coming up in the next like week or so that's going to really like there's both memory and then also the idea of, you know, what are the repeatable ways in which you want work to get done. , and so we'll have something really exciting there very soon. But from the memory perspective, , beyond the sort of like very sort of basic fact-based things like I'm Alex, I run a podcast and a and a newsletter and a site and, , that's somewhat helpful, but I think not not sufficient. Like getting to the point of, , hey, have I interacted with this person before? Like what happens last time I chatted with Mike? Can I like search over my memories there? or it can be hey whenever you generate these summaries like make sure that you always you know cite this piece or lead with a punchier sort of thing and it's able to sort of update and and learn over time the results. So that's the goal is again like if claud is like a very competent new hire, we wanted to get to the point where as you use it over time either on our platform or using our kind of firstparty products, it is improving and it just feels like a companion that you've actually helped train to your preferences. Where on the list of priorities is that capability? It sounds like it's probably very high for you. I know that it's high for OpenAI. Yeah, I think it's very it's really high for us. I think for us it's both it's high on the first party side but it's also very high on the on the platform piece as well. Okay. All right. Let's go to break. I want to ask you afterwards about what the moment building AI has in common and differs from in building social media which of course we just mentioned you were right at the center of. So let's do that right after this. And we're back here on Big Technology Podcast with Mike Kger. He is the head of product at Anthropic and the co-founder of Instagram. All right, let's let's talk about social media and AI. Very interesting. I mean, when we look around the AI industry, we see so many folks who've come from places like Facebook and Twitter now running large parts of these AI companies. Of course, yourself, co-founder of Instagram, head of product at Anthropic, Kevin Wheel, is running former head of in well, head of Instagram product as well, I think, is is running product at OpenAI. Fiji Simo who came from Facebook is running consumer",
        "start": 1729.679,
        "duration": 3670.8040000000046
    },
    {
        "text": "running large parts of these AI companies. Of course, yourself, co-founder of Instagram, head of product at Anthropic, Kevin Wheel, is running former head of in well, head of Instagram product as well, I think, is is running product at OpenAI. Fiji Simo who came from Facebook is running consumer go on. what does what does building these products have in common with building social media and how does it differ? I think there's there's maybe the you know abstracted from the actual product itself like what does it take to build good product? And I think that I think it's it's less that there's a lot of social media sort of oriented folks that have now moved into an AI. It's more that I think a lot of the best product people were focused on that you know even four years ago you know pre- chat GPT you know pre the emergence of a lot of these LLMs so I think it's a sort of like the most recent place that concentrate I I find that that often happens like the concentration of talent among a particular discipline and I think that was that was social media beforehand so that's partly one of them and and there it's you know all of the pieces around understanding what your data is telling you but also having the intuition around like what bets you want to place in terms of where you want to move into next. How do you assemble a great product team? How does product engineering and design and marketing work well together? All these different, you know, sort of aspects of that. So that there's that one and then I think there's the the the separate question of you know within social media like what are the similarities and differences. with claude it feels quite different in that you know we have more of a business audience like plenty of people use it for their individual pieces but it has less of that sort of you know social component right now. , it's definitely more word of mouth. Like the the most social thing that we've experienced is how people got excited about all the the merch and the pop-up we just did in New York where that was like a real like attractor moment where there was like more of that. But in general less of the sort of mechanics of of like capital Growth, right? The you know how many you know people did you bring in, what who did they invite, all of those different pieces. so maybe a little bit different there at least for from the the pieces that we're tackling with Claude. But of course as a lot of these or non-cloud tools move into more of this generation of like images and videos like there is much more of an over a strong overlap with what folks were were doing on the social media front.",
        "start": 1865.12,
        "duration": 3914.8020000000056
    },
    {
        "text": "pieces that we're tackling with Claude. But of course as a lot of these or non-cloud tools move into more of this generation of like images and videos like there is much more of an over a strong overlap with what folks were were doing on the social media front. mean I think the thing that really drove Facebook decisions was engagement and of course growth and maybe the two go hand in hand. And we always wonder about AI products. Like of course you want people to use them, but you don't want engagement for engagement sake cuz it's pretty expensive to serve these use cases. So where does engagement sit for you in the terms of the metrics that you're optimizing toward? We don't really look at engagement, at least not in the typical like at Instagram, we spend a lot of time looking at things like time spent, right? we do look at things like daily visitors as a proxy for a utility. So I think that's that's one piece that we look at as well. , but it's interesting like I I was talking to our mobile team yesterday like I think in the future people's interactions with something like cloud code might be much more mobile oriented and ideally like we're right by Salesforce Park or office. Like I would love to be able to kick off some coding task, go for a walk in Salesforce Park, maybe with a co-orker. maybe it pings me halfway through and has some clarification question and get back to my desk and it's done. it's a very different discipline than being hands- on keyboard. I also love that. that feels like a different discipline than what coding has, you know, evolved to to primarily being nowadays. And now it's more about like what are the creative ideas that I have that I want to see manifested. But in that world, I the time spent was quite low, right? It was maybe like kicking off the task and resolving some questions, but the value of what was produced was much higher. And so I think the interaction paradigm is just really really different in terms of what we end up looking at. And so I think much more about the the sort of value of work getting done than the sort of like interaction and and sort of yeah the long long sessions u that you might see at social media. I legitimately just had a founder that I interviewed tell me that her favorite use case is just using AI to get away from her computer which is something you've never really heard of before in technology. So, , I got to ask you, what do you think Mark Zuckerberg is trying to do with his very unique AI strategy? I I think I there's folks in there that I've known for a long time like like Nat who I really respect. So, I think",
        "start": 1989.679,
        "duration": 4173.762000000007
    },
    {
        "text": "in technology. So, , I got to ask you, what do you think Mark Zuckerberg is trying to do with his very unique AI strategy? I I think I there's folks in there that I've known for a long time like like Nat who I really respect. So, I think more experimentation around what like AI means for this kind of portfolio of companies. I think the sort of initial wave of well you know we've got some chatbot type stuff in the search bars was like not particularly transformative and I think the teams there likely know it and so yeah I think it'll or maybe what I hope we'll see is more experimentation that can kind of live outside of those of those surfaces like in the same way that with Instagram you know there was some ideas we had that didn't really belong in the app like hyperlapse or even nobody remembers Bolt but Bolt was our like very very fast messenger you know I think that experimentation once you get a service as widespread as Instagram or as widespread as Facebook or WhatsApp it's hard to introduce a new behavior there you know we did it with stories I think they've since done it with reals but it's almost like one you get one per generation and I think you want to have more of an experimentation kind of test bed beyond that and I suspect just like given what I know about how those folks think that there'll be more of that sort of experimentation interesting So, as as the co-founder of Instagram, I'm sure you've watched with interest as AI generated images and videos have filled social media feeds and even propelled like was Sora the Sora app to the number one spot on the app store. , do you think AI generated content and video maybe in this Cameo version where you can put yourself in the videos, do you think it it threatens or makes a run for replacing the human generated content that we have today or do you think that the human stuff is going to stay on top and this is a flash in the pan? Yeah, I mean I think there's here's what I'm not sure of yet. We saw this with Instagram that there were creative tools that would emerge and of course these were at a much more sort of basic level than the kind of capabilities that you're seeing with with VO and with Sora and with even some of these these other models. but you would see an emergence of a creative tool and whether they were able to sort of transcend that to being a network that you come back to was often not the case. and I think that was for a couple of reasons. one is at least in that generation of products like the creative content or the created content started getting a little bit sy over",
        "start": 2121.28,
        "duration": 4447.522000000011
    },
    {
        "text": "transcend that to being a network that you come back to was often not the case. and I think that was for a couple of reasons. one is at least in that generation of products like the creative content or the created content started getting a little bit sy over very highly stylized tool and the second one it's like the dynamics that make Instagram Instagram like the people you already know on there the people that you follow the creators that you know and of course this has shifted now and more of like a like pure algorithmic realsoriented piece or maybe I'm talking more about like the the the previous Instagram that was still had a heavy kind of follow component ends up being a thing that feels like, oh, I know what I'm I know who I'm interacting with here. And of course, Tik Tok has a very different take on things. So, to the extent that it's replacing I think the the things that would have to be true is one that there's the the content feels varied over time and not just sort of like, yeah, okay, I've kind of seen this this before. It's really interesting, but I've seen it before. and then two, is there value to being in that network over time? And do you find yourself opening it because there's like not just content that you're interested in, but maybe people that you care about or there's sort of communities that form within it. Cuz I think that's actually what Instagram got right is that you started seeing these emergent communities that maybe were just around taking photography, maybe they were oriented around living in a particular city. and they were very self-organizing. The only tool we gave people was hashtags. and that was enough to sort of spur the these communities. So, I think that's like the fundamental question to be to be answered still. Yeah, it's a great point and I think the cameo aspect where you can put yourself in the video may go some degree towards making that happen in these apps. But I also I'll tell you on Friday I couldn't put Sora down and we're at Wednesday and I don't I don't really feel compelled to open it right now. I think you're right that maybe all the AI content creation can have that level of sameness to it where you watch one video, you feel like you've watched them all and then maybe people come with creative come up with creative prompts and you know you see a new trend. But I think that's a spot-on point there that that's the challenge. Yeah. Well, , well, I mean, I think it it's it's all happening very quickly in terms of the the experimentation and so I think there's also this like ability for these tools to adapt as well and whether it'll sort of open the door to sort of a new Cambrian explosion",
        "start": 2261.92,
        "duration": 4722.163000000011
    },
    {
        "text": ", well, I mean, I think it it's it's all happening very quickly in terms of the the experimentation and so I think there's also this like ability for these tools to adapt as well and whether it'll sort of open the door to sort of a new Cambrian explosion another thing that I'm tracking really well. It feels like it's been very quiet on the social front for the last couple of years. because you know we've sort of like stabilized among you know a couple of really big players not a lot of new experimentation and yeah I I miss the you know 2010s of you know what if what if social products were like this and what if we took this differentiated take on things and not all most of them aren't going to work but at least like there is that value of like hell yeah I want to try that like that that is a different experience like you know even if it's again things that feel like maybe novelties like oh it's a photo app that takes the front and the back camera together like is that lasting network. No, but it painted the way towards something. Yeah, that was fun. And I I missed that, too. By the way, that happened, I think, in the 2020s, but I definitely missed the 2010s when I was you know, doing social media reporting at BuzzFeed and there would be a new app every every week and it was like, \"All right, well, what's Peach? Let's try this out.\" And then be gone, but there would be something new. Oh my god. Peach was classic. All time classic. It was. So, I want to talk to you about about community briefly. , where do you look to find, I guess, a community of of users and get your feedback? , and how important is Reddit to you? Because I've seen so much of the activity in the AI space move on to Reddit and I'm curious, are are you reading like our/Sarity or how deep into it are you? , that's a great question. So, it's interesting being I would say that there's like sort of somewhat overlapping but distinct communities that we look at. one is like being a platform, we have like a strong kind of customer base that often has a very sort of cleareyed perspective about where the models could continue to improve or what we could be doing better as a platform. And so this is very different than my time at Instagram where, you know, there were people that we talked to a bunch about how they they're using Instagram, but we didn't have this like more permanent notion of like an advisory board that we have here at Anthropic. And we just brought in a couple months ago Paul Smith as our new chief commercial officer and he's brought also this sort of community of",
        "start": 2400.72,
        "duration": 4956.882000000011
    },
    {
        "text": "they they're using Instagram, but we didn't have this like more permanent notion of like an advisory board that we have here at Anthropic. And we just brought in a couple months ago Paul Smith as our new chief commercial officer and he's brought also this sort of community of been talking to. So that's one kind of big delta which is like more stable sort of set of people that community that we're we're talking to. So that's one. we actually have a phenomenal user experience research team and that's a place where we end up being able to stay connected to how more of the power users that I think of as like our core demographic for something like cloud.ai AI are using the product and I love it. Like every month we do a product all hands and then my favorite chunk of that product all hands is basically the UXR team doing like a voice of the user piece and it's surprising sometimes because you know it's not necessarily who you might expect being like the software engineer archetype who for sure are using our products but there's also hey I'm you know a marketing manager I need to produce 20 decks a week and now I finally found a tool that I'm like using to to cut it out but here's my here's my feeling about it. Here are my fears about AI. Here's the promise of AI. So just a very humanizing kind of aspect of it. and then for sure you know I think still today I think like Twitterx and Reddit have a like strong pocket of of that AI community and we you know I think we've we've gotten better at engaging in that community than before. I think there was a time period where we were like well like there's a lot of volume. How do we react? And then like you don't want to be showing up only when there's like something that you want to like correct or something cuz then it feels very like corpo and not like authentic. And so I think we have found a better like ability to participate in some of those those communities. And you know it's good. It's they're they're often the like power users extreme users that are telling you something about the edge of what's possible and then you can kind of try to generalize it more more broadly too but less like r/s singularity and maybe more like r/cloudi. It's very mundane, but it's where a lot of folks are are hanging out. All right, cool. we spoke this whole conversation we haven't brought up the fact that well I haven't and and maybe this oversight on my end that that openai basically has seen how well anthropic has done on coding and said that this is you know a number one priority for the company and I mean every day you can look at openai leaders",
        "start": 2519.2,
        "duration": 5211.283000000012
    },
    {
        "text": "that well I haven't and and maybe this oversight on my end that that openai basically has seen how well anthropic has done on coding and said that this is you know a number one priority for the company and I mean every day you can look at openai leaders codeex product and talking about how how advanced they are on on coding skills so can you talk about how you assess openai challenge and what it's going to be like to sort of go headto-head with them on what has been anthropic bread and butter. Yeah, I mean I think it's definitely there was a maybe a window in the summer where it was surprising to me, I guess, in general how sort of alone we were in in sort of both paying attention and having a product out there. It's definitely gotten more sort of interesting and competitive, which I love. I think that that my favorite times at Instagram were also like when we had interesting competitors that we I think it pushes you forward in terms of like what like what is the product we want to build? What are the capabilities that we're we're going to need to have. so you know it's it's kind of like a game on an interesting moment as well for us. The coding piece beyond just the fact that coding is a really high value economic activity. I really see the model's ability to plan, write code, solve problems as not just being useful for software engineering, but being really critical path to the kind of like agentic behavior we want to build long term. So there's no way that would never be anything but like one of our, you know, top two or three priorities. And then it's a matter of how do we make sure that we're showing up with the right products that like deeply solve the right problems for people, right? Like maybe this ties all the way back to your question about like good product design and how I think about products. , it's one thing to score well on software engineering bench. That's important as like a benchmark, but it's way more important, I think, to get the feedback from people like great, those are really hard tasks that I was doing with Rust and in set 4 I couldn't do it. Open four could barely do it. Sonet 4.5 can do it. Like that I get very excited about because it means we're actually having like real world impact. So I think you'll see us if we're doing our jobs right on coding you know even in the in the presence of other players enter the space try to stay really focused on listening to how people are using these products in the wild and then ensuring that future model versions are sort of meeting people where they are in that you know high utility space.",
        "start": 2648.16,
        "duration": 5460.802000000015
    },
    {
        "text": "in the in the presence of other players enter the space try to stay really focused on listening to how people are using these products in the wild and then ensuring that future model versions are sort of meeting people where they are in that you know high utility space. enterprises they're all interested in generative AI they're not great at implementing it. They'll admit it the studies show it. Are they going to get it together? I think they will. I'm actually, you know, we're we're from from after our our our conversation, I'm I'm having a off-site with our product team and a lot of the focus for next year is continue to to go into the enterprise side of things. And I think there's a few things. There's the and we could probably do another whole like hour on this. I get very excited about this as well. There's a whole range from how do you take a product like cloud for enterprise that you know enterprises are already adopting, but make it really really useful. And we talked a little bit before about like output quality and just like how how much it's actually helping you. And like there's I think part of the valley of disillusionment or the trough of disillusionment that you might be seeing around enterprise AI adoption is the promise of these tools around they're going to save you time, they're going to like make like make your work better just wasn't fulfilled by the previous generation of products and they need to be if we're going to actually get like sticky adoption in the enterprise, right? And so that's a lot of what we're pushing on is like it's not like it's not like AI produced document slop. It's AI produced quality stuff that you can then iterate on and use and feel proud that you created just like I think people can feel proud about like here I built this thing using using cloud on the coding side and then there's all the way to you know beyond the cloud for enterprise piece like deeper integrations like internal transformation and what we're learning there to your question about how enterprises are are thinking about and adopting is at least for the foreseeable future we need to lean in much more in terms of helping enterprises get there and so we're doing much more of model now where either with our own engineers embedded in enterprises in partnership with Deote which we just announced this week can we actually like take our technology meet companies where they like what their highest needs are and then just co-develop and just you know lock ourselves in the building until we've solved their problem and then like learn from that experience and move on to the next enterprise. But I think it's very different than sort of the lean back sort of like we're just going to have enterprise products and hope that",
        "start": 2776.48,
        "duration": 5707.20200000002
    },
    {
        "text": "know lock ourselves in the building until we've solved their problem and then like learn from that experience and move on to the next enterprise. But I think it's very different than sort of the lean back sort of like we're just going to have enterprise products and hope that that that's the the reality. We just need to lean in way harder on on both ends of that spectrum. Bud.ai is the website. Mike Kger is the chief product officer at Anthropic. Mike, always great to speak with you. Thanks for coming on the show. Thanks for having me, Alex. All right, everybody. Thank you so much for listening and watching. We will see you on Friday to break down the week's news and we will see you then on Big Technology",
        "start": 2901.76,
        "duration": 5750.96100000002
    }
]