[
    {
        "text": " OpenAI is going big on enterprise in 2026. Disney brings the magic to AI video creation. The AI infrastructure trade is wobbling hard after tumbles from Oracle and Broadcom. And Meta Super Intelligence team is at odds with the rest of the company. Or is it? That's coming up right after this. Welcome to Big Technology Podcast Friday edition where we break down the news in our traditional coolheaded and nuanced [music] format. We have a great show for you today. We are going to go inside a meeting with OpenAI Sam Alman and top editors and media CEOs in New York to tell you what OpenAI is planning for 2026. [music] We're also going to discuss OpenAI and Disney's big deal and what it means for AI content creation in general. We're also seeing some tumbles in the AI infrastructure [music] trade. So, we'll talk about what that means. And of course, we're going to talk about this fascinating story from the New York Times that says Meta Super Intelligence team is at odds with the rest of the [music] company. And we will do our best to dissect the wording in that story and tell you whether that's actually true or not. So joining us as always on Fridays to do it is Ran John [music] Roy of Margins. Ranjan, great to see you. Welcome back. Good to see you. When I am able to do weird things with Mickey Mouse on Sora thanks to this new Disney and Open AI deal, I will declare artificial general intelligence. So, I'm ready. I'm ready. Is it a problem that my first thought when I saw this open AI Disney deal was like, I'm going to go straight to Sora and try to get a video of Mickey Mouse doing some form of illicit drugs. I didn't do it. I I knew that the content filter would get me, but that was my initial desire right off the bat. But we will do it. We will do it very soon thanks to this deal. Or will we? All right. So, but we're going to get into that in a moment. But let us begin our podcast this week by bringing you into the Rosewood, sorry, Rosemary's Midtown on Monday around noon time. And there at Rosemary's Midtown, a fine establishment near Grand Central Station in New York City, Sam Alman had lunch with editors and CEOs from places like The Atlantic, The New Yorker, and the New York Times. this is a group that included according to my reporting Andrew Ross Sorcin and New Yorker editor David Remnik, Atlantic CEO Nicholas Thompson, Fortune editor-inchief Allison Shantel and many others. And this group sits around for a unwieldy and wide-ranging conversation and Sam Alman is his typical disarming and charming self. And the most interesting thing that happened at this meeting outside maybe of Remnick asking Sam Alman if he felt like Oppenheimer",
        "start": 0.08,
        "duration": 339.84
    },
    {
        "text": "Fortune editor-inchief Allison Shantel and many others. And this group sits around for a unwieldy and wide-ranging conversation and Sam Alman is his typical disarming and charming self. And the most interesting thing that happened at this meeting outside maybe of Remnick asking Sam Alman if he felt like Oppenheimer is the priority going to be for open AI and what Altman said according to a couple of people who I've heard who I've spoken with who know what was said in that room Alman said that that if not the top a very big priority next year for open AI is going to be enterprise building AI for businesses which is interesting because if you think about OpenAI, it's been about a 70 30% split, 70% consumer, 30% enterprise. Anthropic has really been the company that's led in enterprise. but the category is the fastest growing software category in history. It's expected according to Gartner to bring in 37.5 billion in revenue next year, enterprise AI. That's up from zero in 2022 or effectively zero in 2022. Ranjan, turn it over to you. what do you make of this news? Is it the right decision from OpenAI and did did it surprise you at all? Well, I have very strong thoughts on this given longtime listeners will know I work for writer.com and our focus is enterprise AI and work with a number of Fortune 500 companies. So, I have a very clear view into what this world looks like. When I heard this news, it's definitely it makes for a splashy headline, but all it did for me is kind of just affirm the lack of focus. the lack of focus we talked a lot about for OpenAI last week. Are they going to develop an AI cloud? Is it going to be a consumer devices company? Any of the above? They did just hire the former Slack CEO. So that's obviously they're making moves into this. But to me, the most interesting part of this headline is that Sam Alman, that's what he said rather than any of the other things that OpenAI is saying. I can definitely get into, you know, what I view is going to happen in the enterprise world with AI next year, but but specific to Sam, it just felt like another off-the- cuff comment at that moment with for whatever was on his mind at that, you know, at that time. All right, I'm going to disagree with you strongly here, not only because I'm the one that wrote that splashy headline. This is big technology scoop, which we'll we'll link in the show notes. , but for two other reasons. One is Greg Brockman, the OpenAI co-founder, , looked at the tweet that I shared of my story and he sort of triple confirmed it and wrote, \"Enterprise AI is going to be a huge theme of 2026.\" I don't think that's an off-the cuff thing. And then",
        "start": 170.319,
        "duration": 630.1589999999999
    },
    {
        "text": "other reasons. One is Greg Brockman, the OpenAI co-founder, , looked at the tweet that I shared of my story and he sort of triple confirmed it and wrote, \"Enterprise AI is going to be a huge theme of 2026.\" I don't think that's an off-the cuff thing. And then a moment, but OpenAI had a had a new model ship. It's called GPT 5.2. And GPT 5.2 into is all about helping you do a better job of working with AI for business use cases and that includes you know examples where you could prompt a workforce planning planning sheet do better job with to-dos do like better deeper enterprise applications. So it is interesting. I I hear your lack of focus. right. Are they a consumer company? Are they a data company? A robotics company? Are they doing this with Johnny IV? Are they enterprise? but I I think they're really serious about enterprise. And I'll just say one thing and turn it back to you. This is why it makes sense to me from a logical standpoint. This is a very big business. And you know, Chachi PT has done a good job making the money. They're going to make maybe 20 billion this year or have a 20 billion run rate at the end of the year, but they're going to need to show substantial revenue growth next year. And one way to do that is by attacking this enterprise area, which is which is where the money is. No, I I agree it's going to be the biggest opportunity of 2026 and I again that's talking my own book as well. But but what I genuinely believe is going to happen is the way cursor and AI coding just completely exploded this year. I think is going to pass on to business end users and enterprises are going to actually see the promise of AI that has been there for the last few years and has not been realized. So, so I do believe it's a massive opportunity. But what I was thinking about when I read your story is, you know, how did Google approach this? How did Microsoft enterprise first from the beginning and then kind of working their way towards some kind of consumer applications? Google going in the opposite way having just a massive consumer business and then building Google cloud into this behemoth. But OpenAI is trying to do everything at once. And I don't believe you can't give up the consumer business and to try to do this in parallel when enterprises a completely different beast. And again, you have the Slack CEO, but who's going to get the final word over any decision? When Sam Alman wants to do AI erotica to actually juice engagement numbers, and that's going to freak out every enterprise CIO, who's going to get the last word on that? Well, that's a great question. By the way, we did get some clarity about",
        "start": 318.32,
        "duration": 933.92
    },
    {
        "text": "final word over any decision? When Sam Alman wants to do AI erotica to actually juice engagement numbers, and that's going to freak out every enterprise CIO, who's going to get the last word on that? Well, that's a great question. By the way, we did get some clarity about Most important most look forward to this Mickey Mouse weed and AI erotica. That's the [laughter] this is the future we want. Okay. And enterprise AI. I mean, if you can bundle it all together, but okay, it's [laughter] look, it's the same engine that that does it all. So, maybe that is an exciting thing, but it is it is a good point. when you sell to enterprises, you need to build out an enterprise sales infrastructure. This is something that took Google like what a decade to do with Google Cloud. It's much easier said than done. And OpenAI is going to have to figure this out. And I got a call today even from someone who works in enterprise AI sales and was like what do you think is how do you think they're going to build out a team there? And I'm like that's like the core the core problem that they're going to have to deal with. so we we'll see what happens there. But let's go let's actually look at like why they might have made this shift. So maybe it's about money, but maybe it's about something else because it does come on the heels of Google's Gemini effectively equaling and some might say surpassing and surpassing in some ways. Let's just say it's Google's Gemini is basically on par with with chat GP with GPT right now, the GPT models. Here's my thesis. OpenAI had been working on like effectively what it believed could be a straight shot towards AGI which it believed it could lead. Then an interesting thing has happened in the second half of this year. First of all, even though models are improving, you're starting to see the limits of the model. It's not broad improvement anymore. It's improvement in specific areas. And the second thing that's happened is the models have commoditized. So you've had both no straight shot to AGI and the models are commoditized and that means that the real competition is going to be based off of the applications here. And actually interestingly in the lunch what Sam Alman said was it is not a training problem. It is an application problem. It's not about the model's intelligence. It's about building the applications to get the most intelligence out of them. And so that is I think what we're seeing right now with these developments is open AI and I think everybody else in the AI world is realizing that you are maybe not going to get that far developing a better model because they are starting to tighten up. It is all about productization and that's why",
        "start": 472.08,
        "duration": 1209.5199999999995
    },
    {
        "text": "we're seeing right now with these developments is open AI and I think everybody else in the AI world is realizing that you are maybe not going to get that far developing a better model because they are starting to tighten up. It is all about productization and that's why AGI isn't going to solve or or even smarter models won't solve all the problems. There's just some limits there and now they're going to the application front. That's why you see the enterprise use case as the one bubbling up out of that company right now. I'm sorry. Can you repeat that, Alex? Cuz [snorts] I'm smiling here because as as anyone who listens regularly knows, this question of product and application versus the model. For a long time, I've been on team team product. And it's nice that Sam is finally coming around. Alex, are you coming around? Are you are you team product now? Well, it's so interesting because I was on CNBC this week and I was asked you know now that Google has what might be a better model is does that mean Google's won or is winning the AI race? And I bottled up my pride. I took a gulp and on national television I said this isn't the issue who has the better model and right now the marketplace is saying it's probably Gemini. So I would say it it absolutely isn't who has the better model right now. I think right now what matters is what you do with that model and how you distribute it. I might have to shut shut off my laptop and just [laughter] just my work here is done. I'm done. I mean, so specific to Open AI in this case though, I I still feel this is kind of Sam saying things because like he that cannot be the bet. You can't raise this much money and like say all of these things for so long and then just kind of about face and just go and and I say this recognizing Open AI has been great at the product layer. Like I think I've always believed that's actually been one of their stronger suits in terms of like they innovated on the they created the chat UI and made it a thing. So so they have strengthen that. But I mean if that's the case they're not worth what they're supposed to be worth just simply like as an application company they're not they're not open AI they're not worth that. So, I think like it's still surprising to me. Again, that's why I'm like not thinking fully through these statements and just kind of like reacting at that moment is how I feel and read this. Okay. So, I want to both explain why I've come along to team product for the moment and explain what's happening what I think is happening with OpenAI and it's not as dreadful as you think.",
        "start": 612.88,
        "duration": 1519.4399999999996
    },
    {
        "text": "kind of like reacting at that moment is how I feel and read this. Okay. So, I want to both explain why I've come along to team product for the moment and explain what's happening what I think is happening with OpenAI and it's not as dreadful as you think. product now matters more than the model because previously when I was on team model we were seeing real gains when the models got better and when the models got better they could just do more stuff and they hallucinated less and you're even seeing that with a little bit with the way that this GPT 5.2 2 model has been designed that it can do more more things for enterprise that it previously couldn't. But it wouldn't be a a real stretch for me to say that topline improvement of the models is leveling out that effectively we're not seeing those giant leaps. And when we don't see those giant leaps, you basically have started to lose this promise of like, well, we're just going to get to AGI and then AGI is going to solve everything. At this point, you have a model that's that's, you know, the the frontier models are very intelligent. And at this point, what you need to do is take that intelligence and channel it into different applications for business. And I think OpenAI could be worth the valuation. , even if it, and I'm really, this is funny because I'm really channeling you here. even if it doesn't get to AGI, it could really merit the valuation because if it makes its models valuable and applicable in many different professions, that's where it's going to see the economic boost. We just spoke about this on Wednesday with Malia Russell from Business Insider doing an entire episode about how AI can change the legal field. That's just one, you know, professional services area. And as these applications get better, can it do it for consulting? Can it do it for accounting? Can it have similar applications in research? Can it have similar applications in medicine? , all this is on the table now. And if it just adds that level of application and orchestration on top of the very smart models that it has today, maybe that's where it becomes this economically valuable powerhouse that it's been expecting to be. Ask two questions. one, why did Sam Alman when he was talking to Brad Gersonner and had that kind of outburst and talk about like don't question our revenue, we're going to get to 100 billion 28. Like why didn't he say enterprise? He mentioned AI, cloud, consumer devices. He did not say enterprise at the time. That I can't tell you. We can we can we both agree that whatever Sam did on that interview was maybe he was having a a bad day because he saw that Google was getting good which we've surmised here.",
        "start": 769.44,
        "duration": 1812.7199999999993
    },
    {
        "text": "consumer devices. He did not say enterprise at the time. That I can't tell you. We can we can we both agree that whatever Sam did on that interview was maybe he was having a a bad day because he saw that Google was getting good which we've surmised here. official okay that that's number one temper tantrum as the official product policy of OpenAI. Now now number two Sam says 100 billion in 2028 in revenue. How do you see that breaking down? because I had asked this and we got a like a very like good reaction from listeners and around like this question of when you say 100 billion and I we look I've looked for reporting haven't seen anything around what are their actual projections about what their business looks like and breaks down especially as all these new ideas the pharma idea drug development that Sarah Frier had mentioned like it's clearly on their mind you got to have some plan it's December 2025 if you're talking about 2 to 3 years now there's some plan in place what do you think that business is going to look like at 100 billion well I've told you that like we asked like where did they get these projections from and I think that's you they've been sprinkling some fairy dust on the on an Excel spreadsheet and hoping that gets them there I don't know I don't think they know exactly what's going to go there I think they're betting that rapidly that they've bet it previously that you know you scale up these models you add more data you add more compute and you will get rapidly rapid improvement in your ability in this your ability to to do things with these models and they will lead to economic activity. I just don't I I don't see how they get to that number that quickly because once we both know this because you're working in this I've done reporting on this once you get into enterprises what happens even if you have a product that works really well you have to engage in business transformation and even worse approvals and that does not move fast. That's what I'm saying that if that truly is the path to let's say 2027 the amount like that they're going to have to build the infrastructure which I'm sure they are starting to with the hiring of Denise Dresser but still like that's a big bet if pharma revenue from drug development and partnerships you you got to hire people you got to like build out that entire business. So if they're really getting to this point where these are true businesses that they want to build in lines of revenue, it's not just product at all. It's not even just application as you said. Yeah. It's it's a whole business plan. It's people. It's a salesforce. It's all of this stuff. So So that's the part that",
        "start": 918.639,
        "duration": 2106.399999999999
    },
    {
        "text": "these are true businesses that they want to build in lines of revenue, it's not just product at all. It's not even just application as you said. Yeah. It's it's a whole business plan. It's people. It's a salesforce. It's all of this stuff. So So that's the part that it's it's it's just tough to read in terms of like what they're actually thinking on this. Again, it's clear this is a bet based on the hires, but how they're actually where this sits in the Mickey Mouse smoking weed on Sora or whatever else in the totem pole of priorities within OpenAI. It's still unclear to me. So, I actually asked Fiji Simo, we had a press call with her about this new model. I asked her how important enterprise is to the company. She says enterprise is absolutely critical for us. we fundamentally transform we take our breakthroughs and turn them into intelligence that's useful for people and the professional space is a huge driver of creating value and turning that intelligence into usefulness for the world. So, but they are into this, but but where where does that sit next to ads? Like, well, ads are paused. But this Sorry, I I think you're hitting on the real issue here. And and this is something I also brought up to Fiji cuz I asked her a two-parter as you do on these things. As you do, as one does. How important is enterprise? And and now here's the risk. when you design for enterprise, if enterprise is really what you want, how do you then make sure that the chatbot that's so popular is still something that regular people want to use for consumer use cases. Here's Fiji's answer. She said, \", you're correct that some things are different between enterprise and consumer. We think that increasing intelligence overall benefits everyone and raises all boats. If we're building a personal assistant, it's going to be more important to figure out how to do shopping, how to do travel, how to do all of these things. Whereas on the enterprise, we are much more focused on complex long horizons and ambiguous tasks. I I remember GPT5 was viewed by many as a personality downgrade over chat GPT40. Now, maybe that's because it's not as sick of fantic or maybe it's because, you know, when you ask it what the weather is out, it it asks you, do you want me to like find five places where you can find an umbrella nearby? , clearly there's a balance between making something economically valuable and usable for enterprise and also making it personable. , this is why I believe they're really going to have to separate those two models out. But that's the risk is you might have this this cannibalization effect where you go for enterprise but then your 800 or 900 million weekly users who are using chatbt as a personal whatever consumer",
        "start": 1066.48,
        "duration": 2412.1579999999994
    },
    {
        "text": "is why I believe they're really going to have to separate those two models out. But that's the risk is you might have this this cannibalization effect where you go for enterprise but then your 800 or 900 million weekly users who are using chatbt as a personal whatever consumer to use this go somewhere else and Gemini had been working on making a warmer assistant over at Google. So it that's actually a really good point like let's take those two things the sicopantic nature and the following follow on annoying engagement tactics. Neither of those will work in the enterprise. Again, like even though I'm sure every business user wants a sycopantic assistant, still at a certain point, you have to get the right answer or you have to like be led in the right direction as opposed to simply the one that you already wanted to go to. And if you don't, there will be negative outcomes in terms of like user engagement. Would you like five additional things? like that kind of stuff just won't fly because when someone wants to do something it's just please do this work for me get it done and let's move on not I want to just sit here and kind of be pulled into this rabbit hole of engagement so so trying to develop the product simultaneously in those two directions which they kind of have to it's tough it's tough and she I mean she even said they want it both they want it both ways so it's clear they're shooting for that I think eventually they're going to have to split out into separate models. I mean, are you going to have the same I mean, people are going to do this. They're going to have relationships and they're going to have cyber sex with their chat GPT and then they're going to ask it to like organize their files. Like I think you might need two separate windows for that stuff. [laughter] I'm just going to leave that one [laughter] there. I'm just saying I'm not I'm not saying I want this to happen. Let's be realistic. This is going to happen. This is from Wired. Fij Fiji on the call said the company now plans to roll out its adult mode in the first quarter of 2026. Alman had previously indicated users over 18 would be allowed to have erotic conversations with chatbt. So for anyone who's looking forward to that just wait till Q1. We're almost there. Just a few more days. Put the countdown clock on. Get advent calendar until you can erotica. Yeah. All right. All right. We're going to go to a break. we have to gather ourselves here. let's go to a break. When we come back from the break, we're actually going to talk about another piece of the puzzle, which is again if ChachiPT, if OpenAI is going to be developing for enterprise. what does",
        "start": 1222.799,
        "duration": 2690.814
    },
    {
        "text": "to go to a break. we have to gather ourselves here. let's go to a break. When we come back from the break, we're actually going to talk about another piece of the puzzle, which is again if ChachiPT, if OpenAI is going to be developing for enterprise. what does what is Disney now getting getting involved with? Because Disney and OpenAI came to a very big agreement this week. We'll cover that. We'll cover the AI buildout. cover meta right after this. yeah, let's go to break. We'll go to break and come back right after this. And we're back here on Big Technology Podcast Friday edition. We're going to talk about this Disney and OpenAI deal. Before we do, quick promo on on Wednesday. this upcoming Wednesday, I'm going to have a conversation with none other than Jim Kramer from CNBC about the state of the AI bubble and whether it's a bubble, the AI trade, the market, his takes on personal investing. It's going to be a really fun show. So definitely stay tuned for Wednesday. I would definitely when that episode comes out, save it and maybe you can, you know, listen to it on the plane or in the drive as you go somewhere for the holidays. , oh, and then one more thing. It is the giving season and if you feel like giving back to Big Technology Podcast, we're always happy to get five star ratings on Spotify or Apple Podcast. That's a solid you could help help us with on in this holiday season. It will help us book better guests. I got real close to landing some Magnificent Seven CEOs in 2025. I think we'll get there if we show that we have a a big audience and of course fivestar ratings. and reviews are the best way to show it because they're the only publicly available metric that these companies can look at in terms of a podcast size. Okay. with that being said, let's talk about this Disney and OpenAI deal. It's from the Wall Street Journal. Disney on Thursday announced a blockbuster deal with OpenAI to invest $1 billion for an equity stake in the chat maker. As part of the deal, OpenAI will license more than 200 characters from Disney, so users can create AI generated videos in Sora. Through the three-year licensing arrangement, fans will be able to generate videos of themselves surfing with Stitch off the shores of Hawaii or wielding a lightsaber in front of R2-D2. , Ranjan, are you excited about this? How do you feel about this? And what do you think the stakes are? All right, let's let's separate my personal views on this whether which I'm kind of excited. I actually from like a creative standpoint, this is very interesting versus what this means for OpenAI the business. I think first on the personal side, I find this interesting. , it's",
        "start": 1366.08,
        "duration": 2992.8940000000007
    },
    {
        "text": "stakes are? All right, let's let's separate my personal views on this whether which I'm kind of excited. I actually from like a creative standpoint, this is very interesting versus what this means for OpenAI the business. I think first on the personal side, I find this interesting. , it's like it in the sense that like fandom and actually licensing IP for generative video I the moment I started playing with any of this I was convinced had to become a thing. So doing it in a kind of structured way I saw a bunch of kind of like people talking about how this is kind of the Apple Music. So this is the iTunes postnapster for any of the older folks in the room. , so like I think it's good that people are trying to figure this out and I think it's good for I do think it's good for fandom like of fans of Disney. I think it's it's it'll be fun. Right. Well, there's this whole question of like are the content creators going to fight this or are they going to lean into it effectively? I'm surprised at how quickly Disney has said you know what we because Disney is a company that likes control, right? wants it stuff in like familyfriendly environments like as like legitimately the second Mickey Mouse is like doing cocaine or voicing your chat chippy erotic pal things are going to be bad. Disney's going to be mad. I guess they believe in OpenAI's ability to turn this into like a quote unquote brand safe environment. I don't know. It's a it's a I think this is a major major deal and it's just going to lead to many other content deals being made you know with other studios. It's going to be fun for us the users to be able to do this type of thing. Yeah, I think going but like I was shocked too that Disney of all companies is the one that did it. I saw one tweet where it was like they know that people are going to do it anyways because OpenAI has a hands-off policy so they might as well kind of try to bring some structure to it which sounded more like extortion than anything else to me. But I felt like it was surprising on that side. But it also also shows that maybe they are trying to be a bit forwardlooking on it. Another element of this I thought was interesting was that they had sent the cease and desist letter to Google one of around copyright infringement. So it's clear they're choosing a horse in the race and they chose in a big way. So, so maybe it really the pressure they realize this is going to happen. We have we aren't able to control it. So, we have to try to at least take part in some kind of productive way is the only way I can",
        "start": 1518.72,
        "duration": 3276.7330000000034
    },
    {
        "text": "they chose in a big way. So, so maybe it really the pressure they realize this is going to happen. We have we aren't able to control it. So, we have to try to at least take part in some kind of productive way is the only way I can Yeah, that they sent a nasty nasty letter to Google saying they infringed that Google infringed on Disney's copyrights on a massive scale. , Google's response to me was fairly pathetic and disappointment disappointing. We have a long-standing and mutually beneficial relationship with Disney and will continue to engage with them. More generally, we use public data from the open web to build our AI and have built additional innovative , copyright controls. It just like shows God bless the God bless the PR professionals out there who have to come up with statements like that. I mean, doesn't this statement just betray the disregard that so many of these companies have for copyrighted work online? It drives me nuts. Yeah. I mean, for suing them. Yeah. No, that's why that that part of it I found interesting. Again, agreed. Like it's like we're going to not we're going to sue, but we're also going to take action here directly at you as well. So, so I think on that side it makes sense. The other the only way I was starting to think about this from Disney standpoint though is building fandom for your characters is the core of the business and they monetize it in a million ways. Like Disney the business is the one that understood that a movie is not just a movie. Like that character engaging with them in all different types of ways is there's a lot of money to be made there. anyone who's gone to Disney World and in recent years for how much those tickets cost, like they have Disney cruises, they have the the the entire ecosystem of Disney. So, so anything to actually boost that connection fans have with these characters should probably make them a lot of money. So, from that standpoint, I guess I can kind of see it. Yeah. And where is this going to appear? So, it'll both appear in in Sora, but Iger, Bob Iger, Disney CEO Bob Iger on Thursday on CNBC said that the plan is to curate some of these Sora videos and then put them on Disney Plus and allow them to create Sora powered videos on its streaming service. So, not only is this like the okay, go ahead, it's him saying this is also content for us. Okay, I both start to see that and can see some like genuinely creative things coming out of it. But on the other hand, the the world of usergenerated content and trying to like bring that into Disney Plus, I feel that actually kind of captures the tightly guarded garden of Disney versus making",
        "start": 1664.4,
        "duration": 3590.574000000003
    },
    {
        "text": "to see that and can see some like genuinely creative things coming out of it. But on the other hand, the the world of usergenerated content and trying to like bring that into Disney Plus, I feel that actually kind of captures the tightly guarded garden of Disney versus making Like that's not Disney and never has been. So that stuff still I don't think is going to happen really. All right. I I think let let me put it this way. I think whatever they end up doing here, this is a massive net positive for Disney. That's just the way I look at this story. It's a bold move. It's a risky move. Like we've been joking about Cocaine Mickey Mouse through the story, and that is a risk that I'm sure that they thought about. but this is going to get people more invested in the Disney characters. like this idea of like putting yourself in a scene with, you know, R2-D2 or whoever it is, Goofy. , it's just it's a cool thing for people. I think this is really going to work out well for them. Wait, one question I do have though, why does Disney have to invest in Open AI and commit to buying OpenAI Enterprise licenses if they're giving their characters to Open AI? I don't know this to be true, but my hunch in seeing the funding was that like the 1 billion investment that Disney's making in Open AI is has to be some form of circular funding. Like Disney like OpenAI is going to maybe pay Disney for the right to put its characters in Sora with Open AI stock and that might just be a a billion dollar trade. I don't know this to be true. It's just my speculation. I know. I I was trying to look into that as well and it it seemed to be a straight equity investment with warrants like from what I saw but to in my mind too that that's definitely where it went to start but maybe they're getting free Chachi PT enterprise licenses as part of this and this is actually the first push and for into enterprise in a big way for open AI. Okay, maybe maybe this is how it all comes together. [laughter] Maybe. All right, I want to tell you one more thing that I sort of came came to this week when I opened up Sora again. U I don't know if you've been seeing these Sora videos make their way around the internet, but they certainly have. And one thing that really annoys me about Sora, I mean, I see it on TikTok all the time passed off as the real video. And there is a particular Sora syntax that's like you can hear when when people are speaking when when people speak in Sora videos, it sounds like this. It sounds like, \"Oh my",
        "start": 1822.96,
        "duration": 3874.733000000004
    },
    {
        "text": "Sora, I mean, I see it on TikTok all the time passed off as the real video. And there is a particular Sora syntax that's like you can hear when when people are speaking when when people speak in Sora videos, it sounds like this. It sounds like, \"Oh my a wheelie. No way.\" Right? It has that sort of stilted like kind of maybe overly excited rhythmic. I Here's what I think sort of I want to run this by you. I think Sora trained on so its audio on so many video games that it is a distinctly video game type dialogue that you're hearing come through in these videos and that's why it's so distinct. I I like that theory. I'm actually more amazed. I've not been on Sora in a while. I actually just opened it right now as we're speaking and I see two tigers in French chef hats cooking. , but I wonder it's actually to the credit I don't come across it very much in my feeds and algorithms. , but the fact that if there's Sora voice because I remember when Tik Tok really started gaining prominence that there was that kind of monotone Tik Tok voice that was the default for any video created that actually became kind of a cultural artifact. So I think to Sor's credit if they actually are getting there that's actually impressive for the platform. But but I don't know like they're certainly not advertising any user numbers around it. And again, going back to the focus thing, they came out big. It kind of faded away a bit. Now, I guess it's a content creation tool to use for other platforms. So, so I'm not sure where they're going with it. Well, I did get some numbers from Apptopia this week. They sent them along. , so when Sora came out, it was doing around 240,000 downloads. looks like a day bumped up to around 400,000 or so per day. it has actually dropped significantly and this won't come as a surprise to you. It looks like it's like around maybe 150,000 downloads a day right now. So, this might just be what Apptopia still around. It might be around what Apptopia measured, but it just shows like a real decline there. And it's again, we've talked about this before. this like sort of sameness problem that every video every Sora video has a very similar feel. Yep. So, we'll keep monitoring it. We'll see. We'll see. Next year, big year for Sora maybe. And Mickey Mouse. I said weed Mickey Mouse for the for for the record. Oh, sorry. Did I I upgraded weed Mickey Mouse to cocaine Mickey. Oh, listen. I I dream big. We know. Hyper. Yeah. No, we know you Well, we know why excited he is. [laughter] Yeah. So, obviously what what Mickey is. It's not like that that personality is not stoner Mickey.",
        "start": 1967.12,
        "duration": 4163.933000000004
    },
    {
        "text": "sorry. Did I I upgraded weed Mickey Mouse to cocaine Mickey. Oh, listen. I I dream big. We know. Hyper. Yeah. No, we know you Well, we know why excited he is. [laughter] Yeah. So, obviously what what Mickey is. It's not like that that personality is not stoner Mickey. doing. But it will be it will be once I get my hands on that Sora. But what do you think magic means? for Disney. [laughter] I'm going to get sued. This just in. Broadcom and Oracle are struggling dramatically. But but you won't get sued. Disney will invest in you for that'll be good for that creative licensing. I have to tell you my I'm I am taking the the Sam Alman approach to Bob Iger and and not the Elon Musk. you are welcome. You are welcome to partner with me here. Do you think we'll get a lawyer letter? I hope not. I'm just joking about all this stuff. this is our job. We have to talk about the possibilities. We talk about infrastructure. Let's talk about infrastructure. [snorts] Rough week for Oracle and and Broadcom, right? These are the the sort of cornerstones of the AI infrastructure trade. Oracle, there's a report out today that Oracle is going to delay some of its data centers to OpenAI by from 27 to 2028. also the market is starting to see that their buildout for AI is lower margin than the rest of their data centers. Surprise, surprise. Broadcom also sort of getting hit on this. It's going to have it it has orders that are coming in for AI, but it just hasn't been as big as AI hardware, but hasn't been as big as a lot of people in the market believed. And so they're they're getting a haircut, both of them are. what do you think the the big story is here? Is it just that like this is a an these trades are based off have a level of uncertainty and every time they wobble the market just runs away because they know how bad it could get if it really goes south. Yeah. I think it's just we see real numbers each one of these times like or when was it September the Oracle partnership news first came out there was that day it was up 37% I think it was like now we're starting to see real numbers even with Oracle starting to understand like the actual logistics of building out these data centers independent of the actual demand for the compute but the actual work it's going to take to build these out that even if the demand is there is that going to be possible so I think like overall it's just bringing a degree of reality to this entire the trade like the entire infrastructure trade that just is you know reminding people that it's not going to be that straightforward right and Oracle brought delivered some",
        "start": 2114.24,
        "duration": 4452.254000000003
    },
    {
        "text": "there is that going to be possible so I think like overall it's just bringing a degree of reality to this entire the trade like the entire infrastructure trade that just is you know reminding people that it's not going to be that straightforward right and Oracle brought delivered some capital expenditures is from the journal on data centers will outrun revenue for several quarters to come and it's like why why is the market surprised here. Maybe the market believed so much in AI that it took this overly rosy picture of how this stuff can work. I don't know. Tell me a little bit about why you think the market was so positive. No, I think the market was positive because I think it really felt like the Oracle OpenAI announcement was the be kind of like the real mainstream moment for the infrastructure trade and this idea that it's not just going to be open AI, it's going to be all of the builders who are actually going to like drive the data center buildout and the like that's going to feed in all of that compute over the years as everyone is using more AI. It was a sound story. it kind of captured that moment of mania, but it's pretty quickly coming back down to earth. And and I think in a good way, like in the sense that having that more reasonable discussion around how this all plays out, it's just becoming a little more real and people are actually looking at some numbers because they're starting to come out at least a little bit. Even though these are all two to threeyear stories, still one quarter of data is one quarter of data, right? I mean, OpenAI is has a $300 million deal to buy computing from Oracle over 5 years. OpenAI is 55% from what I understand of the remaining performance obligation for Oracle. So, if OpenAI can't do it, it's pretty bad news for 300 billion. 300 billion 300 million billion. Yeah. it's just this sort of unholy combination of debt of dependency on OpenAI. I don't know. Well, the three letters you never want to hear were mentioned again this week. CDS, credit default swaps. Credit default swaps. So, so can you just for a second explain exactly what the issue is there again? Well, credit default swaps again as we've talked about in the past like the cost of insuring against the default of any kind of corporate credit and it's just the the higher that number goes the more expensive that insurance is the more it's indicating that the market believes a default is more likely and again these numbers start to be small at a certain point. now this week the Oracle CDS hit the highest intraday level since April 2009. So, so it's people are starting to recognize that this is something that maybe you want to be insured against and it's there is a",
        "start": 2258.64,
        "duration": 4787.613999999998
    },
    {
        "text": "again these numbers start to be small at a certain point. now this week the Oracle CDS hit the highest intraday level since April 2009. So, so it's people are starting to recognize that this is something that maybe you want to be insured against and it's there is a not priced in initially but but as we as we discussed before you never want to talk about CDS like anytime it's entering the mainstream conversation it's not a good thing for anyone and the more we start to hear about Oracle CDS I I mean, that's where everyone should get a little bit more worried. Did anything bad happen in mid to late 2009? Sorry, I'm forgetting. , 2008, 2008. That was the last time we were all talking actually from beginning of 2008 talking mentioning those three letters. I honestly outside of like CDS traders, I don't think anyone anywhere had ever thought about a credit default swap until 2008. So hopefully we don't hear that much more. Yeah. One last thing about this. This seems to be contained in the open AI axis, right? Like Broadcom, no Broadcom is Google though. They do Google Anthropic. So, but like seriously like Oracle Orweave is down today, Nvidia is down. Do you think that these these are like is it a systemic problem or is it sort of more contained right now or too early to tell? I think it's an industry problem. So I like I've seen kind of these like you can trade buckets of open the open AI ecosystem versus the Google ecosystem. I I still think whatever hits Oracle and Open AI will hit a Broadcom and a Google at least in the in terms of how people are pricing in the infrastructure side of things. So but I I I still don't think it's systemic. I think even though the stock market is gains have been heavily predicated on this, I still don't think it leads to some kind of like largecale like economic calamity. I think it's one of those market goes down a bit, 401ks get hit, people are a little unhappy, but I don't think it's systemic. Let me let me put it this way. Is this the beginning of the unraveling of the AI trade or do you think the AI trade remains strong? I think it is a shift in what the AI trade is. I think that to me that's [clears throat] like the biggest thing that I think everyone piled into the and actually if we are to believe Sam ultimate earlier and like the idea that the application layer is going to be this big battle you have to start to imagine like I mean building applications that run in a more compute efficient way start to become a competitive advantage especially if you're going to the enterprise where you need to be costefficient like all of that side of the story runs counter to",
        "start": 2428.48,
        "duration": 5079.213000000001
    },
    {
        "text": "battle you have to start to imagine like I mean building applications that run in a more compute efficient way start to become a competitive advantage especially if you're going to the enterprise where you need to be costefficient like all of that side of the story runs counter to infrastructure side of the story. Like there's some coexistence of them, but there's also like a lot of, you know, like opposing pressures within those two stories, and they're trying to tell them both. That's kind of what I think I'm going to go to Kramer with first question when we speak next week is basically like here's how the AI bubble bursts. , you can compute much more efficiently. We still don't have real clear indications that this stuff is going to be economically valuable on the scale that people imagine. So what we could see is a conversion from a high infrastructure cost, big buildup, big dreams to like getting more practical, getting more efficient, and then all of a sudden it becomes an economically useful thing, but not this, you know, sort of godpile of money chasing an all- knowing technology. Yeah. No, no, that that's I mean how I view it that like especially in the enterprise when people are going to be a lot more costconscious and like competitive around it that the innovation happens in terms of actually making these technologies more costefficient to actually run this run these processes and and workflows. So, so I think yeah, you can you can have AI generate Jensen said it's going to generate a 500 trillion dollars of GDP like up from a hundred trillion aggregate GDP. Maybe that's happens, but that doesn't mean that the infrastructure trade actually pans out. I know that sounds ridiculous, but I do think that's a possibility. A realistic possibility. Yeah. All right, let's close on this. Meta's new AI superstars are chafing against the rest of the company. from the New York Times. When Mark Zuckerberg revamped Meta's artificial intelligence operations this year, he recruited a new leader, Alexander Weing, a 28-year-old entrepreneur, to build a team of top researchers from rivals like OpenAI and Google. The team was placed in a siloed space next to Mr. Zuckerberg's office at the center of Meta's headquarters. Probably just this what the story says to remove them from the bureaucracy of the company. 5 months later, the divide has become more than physical. Mr. Wang has privately told people he disagreed with some of Zuckerberg's longtime lieutenants, including Chris Cox, the chief product officer, and Andrew Bosworth, the chief technology officer. , in one case, Mr. Cox and Mr. Bosworth wanted Mr. Wang's team to concentrate on using Instagram and Facebook data to help train Meta's new foundational AI model to improve the company's social media feeds and advertising business. But Mr. Wing, who is developing the model, pushed back. He argued that the goal should be to catch",
        "start": 2578.88,
        "duration": 5390.1730000000025
    },
    {
        "text": "Bosworth wanted Mr. Wang's team to concentrate on using Instagram and Facebook data to help train Meta's new foundational AI model to improve the company's social media feeds and advertising business. But Mr. Wing, who is developing the model, pushed back. He argued that the goal should be to catch Google before focusing on products. The people said, can I just share quickly what my perspective on this paragraph is, cuz it doesn't make too much sense to me. I mean, ideally, if you're running an a super intelligence operation within meta, you're going to use meta's Instagram and Facebook data to train, right? You'll have that data. That's that's proprietary data you can use to train. So why wouldn't you want to use that that data to train your models? and using that data doesn't necessarily improve, you know, only improve the social media feeds in the advertising business. It's a it's a training situation, not a product situation. Very weird story to me, I have to say. Maybe this is happening, but weird. Yeah, I I definitely found it weird as well in the sense that I mean meta properties probably have one of the richest data sets in the world. I mean the only comparison I can imagine is YouTube which like in terms of just richness of overall data but Meta's got plenty of video to work with as well now. So like to not to have some kind of difference in opinion and purity or preciousness around like we don't want to be sullied by the the advertising business. I think like that was surprising to me. But I think the bigger story is we talked about this from the beginning like this could be this could just fall on its face from a personality standpoint to bring in this level of personality around this splashiness the amount of money they're throwing at this already. I saw on Twitter a few people like announcing their departure within just a matter of months from TBD Lab. So I think that that's the more concerning part to me that if the politics of this are actually getting in the way of the technology that's not a good start for this, right? The time story does say that the departures have stabilized and maybe two out of a hundred have left after that first vesting period hit. I mean the interesting thing here is I think that I mean we'll see what happens because I I don't disagree there's definitely going to be clashes of interests. they did bring get brought I mean here here this is from the story the lab's researchers have come to view many meta executives as interested only in improving the social b social social media business while the lab's ambition to create is to create a godlike AI super intelligence I think that's natural I mean it's not very surprising to me although you could see that really",
        "start": 2735.92,
        "duration": 5677.135
    },
    {
        "text": "come to view many meta executives as interested only in improving the social b social social media business while the lab's ambition to create is to create a godlike AI super intelligence I think that's natural I mean it's not very surprising to me although you could see that really company but it seems like that was always part of the equation was like if you go to Meta like you're going to be there also to improve the core business along with developing intelligence. But I wonder I feel Google has handled I mean going back to the conversation from I think a couple of weeks ago around how savily Google handled the overall integration of AI within the company and kind of created that center. like it there's always going to be that natural tension. It could be a healthy tension I think but there has to be some kind of overarching like clarity within the these organizations around like you know what are we actually trying to do here and meta in the end they have a billion I mean sorry what am I talking about like four billion users now three billion users whatever it is what's a couple billion what's a couple billion Facebook friends no like improving the product just brings such a massive scale into anything that you do that focusing on that the actual potential business impact of that or even societal impact is so massive that trying to just be kept to the side and like be a pure research lab does not make much sense. but I mean they Mark Zuckerberg should bring some clarity to to that. You know how we're going to know this is really over is when Meta Super Intelligence Lab says it's focused on enterprise. [laughter] That's that's the end. That is I think that's that's when or they become an AI cloud/consumer wearables business. Well, you know, because they are they are what am I talking about? Rayban Metas. Yeah, exactly. All right, but let's leave it there. Jim Kramer on Wednesday. Ranjan, as always, [music] , great speaking with you here on Friday. Thanks for coming on. All right, see you next week. All right, everybody. Thank you for listening and watching. We will see you next time on Big Technology Podcast.",
        "start": 2883.04,
        "duration": 5907.111
    }
]