[
    {
        "text": " Where are the AI startups? Are they actually coming or will chat GPT gobble it all? We'll talk about it with Rick Heitzman of First Smart Capital right after this. Welcome to Big Technology Podcast, a show for coolheaded and nuance conversation of the tech world and beyond. Well, something we've been wondering on the show is where are all the individual AI startups? We know of course about Chat GPT and Claude and the big chat bots, but why hasn't there been a wave of individual startups building on top of generative AI that has emerged alongside this wave? And we have the perfect person to speak with us about this today because Rick Heitzman is here. He is the managing partner and founder of Firstart Capital and he is here with us in studio today to talk all about it. Rick, welcome to the show. Thank you. Thank you for having me. A longtime listener, first time guest, so it's always exciting. It's great to have you here. I love running into you before we're about to go on CNBC. Usually, , one of us is right before right after. So, today we actually have some time to speak with each other oneonone. I'm usually your opening act or the other way around. So, , let's let's go to the big question, right, which we started with here. , if you're if you believe that generative AI is a transformative technology or at least has the ability to make some waves in the tech world, which I think is, you know, basically consensus in in this world. , where are all the AI startups? , of course you have some point solutions like Harvey, which is really good for lawyers. , but if you took the functionality that's baked within generative AI and you sort of unleashed it to all these startup developers without chat GPT, my guess is we would see a swarm of AI startups. Something that you could use for fitness, something that you could use to find the best surf break, which I know is a application that you've played with, but we haven't seen that wave. So what's happening? So we we're starting to see some things you know it generally has to do with how specific and how big your data is and I think there's a couple things which create this dynamic that we're seeing in the market. First of all I think open AAI and chat GBT have done a great job of making a very good product that has both breath and depth. So, you know, the leader not being complacent is something, you know, we hope as venture capitalists that there's leaders and then they get lazy, they get complacent, they get slow and they get easy to disrupt. I think in this case, OpenAI has done an excellent job of not being any of those things. Hiring great people, continue to develop",
        "start": 0.16,
        "duration": 289.43999999999994
    },
    {
        "text": "know, we hope as venture capitalists that there's leaders and then they get lazy, they get complacent, they get slow and they get easy to disrupt. I think in this case, OpenAI has done an excellent job of not being any of those things. Hiring great people, continue to develop thing is a lot of the the data, so your AI is only good as your underlying data and your training data. So a lot of the training data in general consumer is general broad-based web and you know obviously you're seeing litigation around who's training on what on what data and is it all the books in the world is it all the crawlers on Google or all the crawlers on the open web. and there's there's not been a differenti differentiation based on data which is slightly different than you know you alluded to Harvey and some of the enterprise AI companies. We had a company Evolution IQ in insurance. There's Harvey in legal. There's Henry in commercial real estate. And they all have a very discreet and sometimes private data set that enables them to build a better model enables them to deliver a better end user application. But for you know you and I who are trying to find surf breaks or where to go on vacation or the best place to have a French dip in New York answer is for Charles. But if you're trying to find those things, and I'm not available on a podcast, you know, those things have generally been broad-based, chat, GPT or Perplexity. , and we frankly have been a bit frustrated by the lack of startups we've seen in their ability to invest along those lines. Right. By the way, Harvey Henry, I'm sensing a trend here. There's a trend. Yeah. Is it the newly? You just take a random guy's first name. I I think so. It's easy to say, easy to pronounce. We'll see. And there was Blue Nile and there was Amazon and there was a bunch of things in the '9s. Maybe this is the thing. Let's go in waves. There are memes. All right, but but let's drill down on this because I think this is a really important point, right? , just to give an example, there was I about 10 years ago when I was at BuzzFeed writing about consumer tech, there was this nutrition app that I would use and you would upload your meals and your thoughts and stuff like that and a real nutritionist would take a look and give you a a rating and and give you advice about how you were how you were tracking on your goals. Now, people laughed at me. I was like, you can just program that app with natural language, but you really can. And it's something I know it's not just me. Many people have been using Cha PT as a diet coach where you give it a",
        "start": 144.64,
        "duration": 553.3600000000001
    },
    {
        "text": "tracking on your goals. Now, people laughed at me. I was like, you can just program that app with natural language, but you really can. And it's something I know it's not just me. Many people have been using Cha PT as a diet coach where you give it a just say be my diet coach. You actually give it a goal. You say I want to keep under 2,000 calories a day or I want to eat whole foods and then you can upload photos. I can re see the photos, upload with text, talk about morning weigh-ins, give it the data, and it does a great job of keeping track of this stuff. now again without chat GPT is a going back to it's a really good product. Absolutely. It's a really good product that has breath and you know so it's it's solving your problem. But this is my question then from your perspective are we about to see a wave of consumer startups that never happen because that was a real startup that got millions of dollars of funding got a nice exit I think to a health insurance company. , and today you can't, it's hard for me to even conceptualize that that would get funding because a a VC might just say, why wouldn't I just do this in chat? We we've seen a lot. We've seen nutritionists, we've seen a bunch of different things that have come out, you know. So, I would say there's buckets of do you need a discrete application or you don't need a discrete application. Certain things for a bunch of different reasons, including regulatory and compliance in in areas like health tech, you need a discrete application. But certain things including general things like you know I'm eating this piece of salmon. How many calories does it have? Could you count it in your calories is something chat GBT is great for. So we've found sadly that you know we haven't seen this wave of startups that we believe are sustainable. So there's actually been a handful of startups that are rappers on chat GPT that are maybe a little bit better at at travel. They might be a little bit better at being your math tutor, but they're not that step function different. , and even if you go back to, you know, the areas of search, if you remember, there was search and then people said, \"Oh, there could be vertical search where we get really good at something.\" So, obviously Indeed is a very large company that was vertical search for jobs. Kayak was a very big multi-billion dollar outcome. That was vertical search for travel. and you know, you're able to break down that landscape and then think about where where that goes because with a a more narrow focus, you should be better at it. And I just think the the broad landscape of of of chat GPT has made",
        "start": 280.0,
        "duration": 823.5189999999999
    },
    {
        "text": "vertical search for travel. and you know, you're able to break down that landscape and then think about where where that goes because with a a more narrow focus, you should be better at it. And I just think the the broad landscape of of of chat GPT has made Yeah. And it's very interesting because OpenAI recently released data and of course it's coming from OpenAI. Yes. But data about how people use chat GPT, we've talked about it here on the show and the number one use that people go to it is for practical guidance. Yes. And let's just do a thought exercise. , if if there was no chat GPD and no broadly available, , generative AI technology. So, , think about it. You can't license an LLM. Yeah. But a company came to you, let's say 5 years ago, and they said, \"We have an app that with natural language will advise you on your relationship and tell you whether or not to , you know, break up with your boyfriend or girlfriend, for instance, or how to improve the relationship.\" , if they came to you and said, \"We have a natural language fitness coach.\" If they came to you and said, \"We have you upload photos or videos of your of your soccer practice and we'll talk to you about positioning and and form.\" Each one of those ideas to me sounds like they would be like billion-dollar ideas, right? Yeah. Very financable. Very if maybe not billion dollar ideas, we'll see where that goes, but very financable. If you think about life coaches, fitness coaches, sports coaches, anything where you have a tremendous amount of knowledge and you could take that knowledge and make it very specific to somebody, which you know, again going back to Harvey is not that different, right? Law is a huge huge pool of knowledge that you put a certain rules around it. You know, historically they just thought that was a thought exercise in rules. today we could call it LLM and then that produces better faster cheaper results of how to how to be more efficient in your life or job. I mean and even Harvey you know we talk about Harvey right which is again this is this legal AI that you can that knows your knows the laws knows the rules has these big context windows so you can go to it for like legal advice or a lawyer would use it you know to help but even Harvey to me doesn't even seem that defensible because what we're starting to see is bigger and bigger context windows exactly from these models. So like what Harvey's great at is it has the it's figure out a way to get the applicable law and then find a way to measure that against the questions you might have as a lawyer. We are going to get to the point I think",
        "start": 416.479,
        "duration": 1075.9200000000005
    },
    {
        "text": "from these models. So like what Harvey's great at is it has the it's figure out a way to get the applicable law and then find a way to measure that against the questions you might have as a lawyer. We are going to get to the point I think able to say download the zip file of all the law in the state. Yes. Upload it into the context window. Download the specifics of the case. Upload it into the context window and maybe get close to as good as Harvey is. Yeah. I mean, and that's a very specific thing on a case where you might need a specific attorney. If you think about probably 80%, unfortunately not a lawyer, but probably 80% of all legal work is this is Rick, he needs a will. This is, you know, here is a first mark company that's going through a series A financing. Could you just reproduce documents given these are the founders, these are the issues, and here's the term sheet. So there's a lot of wrote work that's done by the bottom of the legal pyramid which should be done better, faster, cheaper than a overworked, overtired associate, right? And so the question is where does it get done? And the argument that I'm making or trying to tease out here is does all this stuff end up just happening within the chat GPT interface? You know, I think it's kind of been this debate that's gone on where people say that any AI application is just a wrapper. Like Perplexity is just an AI wrapper that you do search in. and so then how do you invest? And so I I'm trying to like think through the beginning of our conversation here where we're talking about all these distinct and discreet different applications legal but you know even even more applicable coaching fitness search it's all going to happen within these broad multi- general purpose bots. And so then I like throw my hands up and say well what's gonna happen like what's gonna happen to start startup founders and investors lawyers what's gonna happen podcasters but no but but really in terms of the the economic activity but we can get to we are going to get to jobs but the economic activity probably probably two pieces and some one is slightly red teaming is all right so can Chad GBT be better at everything than everybody probably not there's going to be limitations you ask Sam Alman he'll say yes and then there's there's an asimtope where you know are the latest models the best models and are you still seeing even a step function improvement in chat GBT conventional wisdom is probably not you're seeing like oh it gets most of the things and that's good and what does that mean for the broad-based ecosystem to get maybe that last 10% do you need a specific model to travel or to law the",
        "start": 543.68,
        "duration": 1361.6000000000008
    },
    {
        "text": "function improvement in chat GBT conventional wisdom is probably not you're seeing like oh it gets most of the things and that's good and what does that mean for the broad-based ecosystem to get maybe that last 10% do you need a specific model to travel or to law the models will get better is through better data and then is there specific data which people might not trust in open AI or chat GPT and you know we're investors in a couple companies that does do data security what data are you sharing with what models are they staying inside your environment are we making sure that all our pieces of that data are not leaking out into a model or or into another part of that ecosystem so if you have a private walled garden of your data, your model, and your security. You know, will that be better because it's more specific to you even on a personal basis if you're talking about your relationship or where you're going on vacation or your finances or your will or on an enterprise basis. So, you know, here are all my legal documents on all my deals. I probably don't want that out in the world, but I want to have u some parameters around it or here are all my returns for my funds. I want to make sure that that's confidential. So, you know, are people going to get scared no differently than they they than they become suspicious of other large companies? Are they going to become overly suspicious of OpenAI, Chat, GBT, the larger models? And is that data privacy going to be a key limiter to how the next generation of companies evolve? I mean, I would imagine security is like a highly investable place here. We're we're spending a lot of time around that on every level of the data security, model security, you know, every around the enterprise environment, all of those pieces. I think we're maybe not even in the first inning. Yeah. We just did a podcast with Enon Costa, the co-founder of Whiz. Yes. And which just sold to Google for 32 billion. Biggest venture outcome ever. Ever. Yes. For now. For now. and we we we had comments coming in being like, \"You need to speak about this more often.\" Yes. And it was just like here's a general lay of the land but clearly there's there's real concern there. So okay so security security is one place. Yes. there's certain spec specific enterprise use cases elsewhere. Is there any would would a is there anywhere like on a consumer or I don't even know if should I call it traditional technology investment place where you you would see a generative AI startup like a startup let me put it this way a startup using generative AI at the heart of it that you would invest on the application layer I assume yeah",
        "start": 688.24,
        "duration": 1649.1190000000004
    },
    {
        "text": "even know if should I call it traditional technology investment place where you you would see a generative AI startup like a startup let me put it this way a startup using generative AI at the heart of it that you would invest on the application layer I assume yeah think we we like the enterprise space we're investors in a couple things in the enterprise AI they tend to have two things. They tend to have a defined set of customers which have a therefore a defined set of data and they have some rules around what is shared data and which which own data and that data is the competitive advantage not necessarily the model that outputs to the right application and the right answers and sometimes they use it within their own walled garden. So, if you were a company that says, \"I want to have all my leases historically, and therefore, I want to understand all my leases across all of my , you know, Starbucks franchises.\" All right. Well, getting very specific lease data is going to be very much different than getting, you know, generic answers from, you know, what downtown New York looks like in the open AI models. So th that having the specific data having specific rules around your company and having kind of a walled garden within a particular industry that that model could be tuned to that particular industry and then there's some benefits of maybe even collaboration or a co-op database that makes that more sustainable in the in the medium or long term. So, you know, if data is kind of the oxygen for a lot of these applications and models, , having some kind of ownership on that. So, I I think when people talk about tech startups, what makes a good tech startup? You I'm sure you have a philosophy. I think one of the the consistent philosophies I've heard is that it solves a problem. Yes. , and I think that's kind of nice. Like one of the nice parts like take the fitness example that I or the diet example is that you you get a company with that gets together with fitness experts or diet experts and says let's try to see what the problem is and pay a lot of attention to it and then try to solve it for people. Yeah. And now you have large language models that are like doing just as good or or not not just as good almost as good. And and so that would make that category less investable for you. Do we lose something if people instead of you know getting a chance to get this advice from the specialists are are instead of going to these apps that we've seen you know for the better part of 20 years come up and serve use cases and sometimes do a good job and sometimes not. But do we lose something if instead",
        "start": 834.959,
        "duration": 1935.0389999999998
    },
    {
        "text": "chance to get this advice from the specialists are are instead of going to these apps that we've seen you know for the better part of 20 years come up and serve use cases and sometimes do a good job and sometimes not. But do we lose something if instead these technology companies come up, all this basically gets handed over to chat bots that do like 75% as good of a job, but just don't take the startup and capital to to get there. Well, you hope that there is a bit of creative destruction, right? So, if you say they're doing 75, I was going to guess 80. You know, you pick a number in between and only the expert is going to sit on top of it and say, \"Hey, I'm going to be your dietician. I'm gonna use the back end of chat GPT like you would, but I'm gonna give you some more advice because I know you're going to this steakhouse tonight and you're trying to watch your cholesterol, whatever that may be. So does Chat GPT though. It probably made that reservation for you. It probably made and it knows what the menu is and knows what your goals are and how to do it. But there might maybe there's an interface on top of it which might even be a human. So how do you know and understand your discrete value ad? So your discrete value ad as a human is not being able to Google the restaurant menu and pick out fish. That's really good. Like a lot of money. They they they currently do. But it might be I know you better. I know that salmon might be the right answer for you, but you just but you just don't like salmon or you you know, you ate salmon the last two nights or whatever it is. So I I'm gonna find something specific to you that I know you'd like. or I talked to you today and you said, you know what, I'm not in the mood for fish or I I just wanna you know what, I just want to steak tonight. I I'm going to go down that path. So, their ability and maybe this becomes personalized over time, which your chatbot knows that you're tired because it's plugging in your Whoop data or it knows that you had salmon the last two nights because it also tracked your food and your restaurant reservations over the last two weeks. You know, it could get an additional level of personalization, but like every time through history, the human's job is to staying just ahead of that technology and understand where they could create unique and discreet value on top of technology. Yeah, I I think that's going to be tough. Maybe I'm I have confidence in the humans. Okay. I I do too. Yes. and and it's interesting to be even having this discussion because there's",
        "start": 980.24,
        "duration": 2192.5599999999995
    },
    {
        "text": "technology and understand where they could create unique and discreet value on top of technology. Yeah, I I think that's going to be tough. Maybe I'm I have confidence in the humans. Okay. I I do too. Yes. and and it's interesting to be even having this discussion because there's AI technology today. like at all of these tasks. It's not as good as a human today. Yes. But it's getting close enough to make the question much closer. And if you look at where it was five years ago and the progress it's made, it's getting closer. I mean, we're looking at a AI companionship and whether that's dating or whether that's for elderly people or whether that's for kids or whether that's for tutoring. and as we looked at it even last year or two years ago, we're like this this isn't very good. like I'm like I'm not sure, you know, my elderly grandmother or my kid is really going to engage with a chatbot that acts like this. Now it's really good. Now it's pretty clear. , and now you know people are engaging in, I'm sure you read about it all the time, more and more meaningful relationships or everyone could tell what was AI generated advertising or AI generated video or even AI generated actress and you know there's this now famous AI based actress who is is in a bidding war to be represented by the major talent agencies that you can't tell and that person is almost as good as a human and I think this is going to continue to happen, but it's going to be very disruptive for people who can't adjust their mindset or think about creating value to stay ahead of the curve. Yeah, there are some fascinating applications. I mean, of course, there's concerns here as well. People becoming overly dependent on these bots, the bots being sick of fantic, encouraging them to do self-destructive behavior. But on the other side, there's some amazing applications. we've talked about on the show here. There's u in Korea there is a like a stuffed animal with an LLM baked in that's like hanging out with elderly people who are lonely keeping them company and then when they sense issues or they check whether they're taking their medication and the person who's become friends with this LLM stuffed animal says I'm done taking my meds then they send a message to the nurse or I don't know or you know it's like the nth degree of I fallen I can't get up that you know all these things and you It started off very simplistically. I'm going to send a text at 8:00 every morning making sure that this elderly person took all five of their meds and you know maybe had to ask them and now it's become much more conversational much more engaging. It could be via chat, it could be via audio and voice",
        "start": 1111.2,
        "duration": 2478.0789999999997
    },
    {
        "text": "to send a text at 8:00 every morning making sure that this elderly person took all five of their meds and you know maybe had to ask them and now it's become much more conversational much more engaging. It could be via chat, it could be via audio and voice know someone have to go into each line of of a text thread. so that's becoming much more approachable. , but I'm not Yeah, I'm not sure if we're ready to to you know, there's always the dark side, which you touched on the self harm, the , you know, the different personalities actually that each of these bots have. , and thinking about that and what is the , and what's the unintended consequence of of something getting that good that quickly? And as an investor, is that something that you want to touch or you're No, we're looking we're spending a lot of time. I think, you know, AI companionship, , is an incredible thing. , and it's a broad-based companionship. It could be your medical buddy if you're an elderly person. It could be your math buddy if you're a student. It could be, , your friend who, and it could be it could be your surf buddy if you're trying to figure out where to go on vacation. So, all these buddies, some of which are going to be chat GPT, , you know, are going to be out there. , and then I think you have to think about, you know, how much is that self-directed? So how much is it understanding your personality and what you're inputting and are they sophanic? Are you know do you have a drill sergeant type nutritionist and is that what you want or what you need? You'll be able to tune it yourself or it will adapt because you're going to give it numbers and it will be like oh I was too hard on them. They stop talking to me. Now I'm a little more sickopantic. Yeah, they're losing weight. Sorry about that. You could have had the steak. You know French fries aren't the end of the world and you earned a cheat day. Okay, I will sign up for that. So now after spending our first bunch of minutes together talking about how AI is going to gobble things up maybe everything I'm going to now ask you whether we're in whether the tech industry or investors are putting too much money into AI. It sounds inconsistent but I think it could both be true because I think they both could be true. it's hard to say what too much money is. I mean what's what's been very clear is all the hyperscalers are investing as much as they possibly can and maybe even differently than probably prior times in history and the two ones I've seen cited the most are are the railroads and then the infrastructure of the internet",
        "start": 1256.08,
        "duration": 2746.638999999999
    },
    {
        "text": "is. I mean what's what's been very clear is all the hyperscalers are investing as much as they possibly can and maybe even differently than probably prior times in history and the two ones I've seen cited the most are are the railroads and then the infrastructure of the internet amazingly I was VC during that last time in the late 90s the they were those markets were largely reliant on external capital right you were if you were building out a select or if you were building out, you know, an internet infrastructure, dark fiber, you were relying on equity or debt from the capital markets and therefore when that shut off or that became more expensive or the markets didn't buy in, it was able to control that oxygen and that buildout. The different thing this time or one of the different things this time is that the hyperscalers are actually paying for this through their own earnings. So effectively, obviously the market gets to vote through your stock price, but they don't have to go out and say, \"I'm investing, you know, hund00 million in energy for my data centers, , and I'm just I'm just going to take, you know, this quarter, half of this quarter's ebida, and build that out because I believe that's an important part, an important use of my cash flow.\" And maybe the market will frown on Mark Zuckerberg if he chooses to do it, but he he he's not going to be beholden to anybody as you are when you go hatinand asking for capital. So I think this is not going to stop. And I also think the hyperscalers all of their ambitions are so big and so broad and they're all so pot committed. I don't think anyone's going to stop. So, you know, it's going to take something incredibly material where there's not an outside person who's saying, \"Hey, I'm stopping writing the checks for, you know, for you to buy dark fiber that you're not going to light up or I'm not going to, you know, build a railroad to nowhere because that doesn't make sense anymore despite where the hype was in the market.\" you know that has to be internal and that has to be hey I'm I'm bowing out of this part of the AI race which I think given the egos market caps and dollars involved I think that'd be too hard to do. So just give us some context here. do you know off the top of the head the largest check that First Mark has put into a company or can give us a ballpark? $200 million. Okay. Jensen just committed or recently committed a hundred billion dollars. Yes. to open AI one day one check I mean it's more than you know more than what's been a couple years certain certain in certain years of venture c of all venture capital so what so you obviously when you're",
        "start": 1392.48,
        "duration": 3032.400000000001
    },
    {
        "text": "just committed or recently committed a hundred billion dollars. Yes. to open AI one day one check I mean it's more than you know more than what's been a couple years certain certain in certain years of venture c of all venture capital so what so you obviously when you're think about what am I going to get in return yes what do what do you have to to get if you invest a hundred billion in a company do you need to get do you need to get a trillion dollars at least back in return it depends on who you are and that kind of goes So the the recycling or the circularness of some of these things and obviously the OpenAI Microsoft or OpenAI Oracle goes back to the Open AI Oracle deal and you know I'm going to I'm going to Rick give you money that you're going to invest in our infrastructure or how how does this cycle of capital work which tends to be towards the end of these cycles right where you can't generate enough money yourself you might have exhausted the capital pools externally so now we're going all give each other revenue and and cash flow to keep them keep the train going. So that is actually a little bit of a canary in the coal mine of how this is working. But and then also you know Nvidia is worth so much money that you know Jens can almost say hundred billion is is not that big of a deal if we believe this is a generational company and have somewhat of a leg to stand on, right? you know, and you know, not that long ago, hundred billion dollars was greater than the market cap of all but a few companies. So, you know, it's it's the numbers are so mind-blowingly disproportionate, it's hard to really contextualize them, right? And and we should say again with with many OpenAI investments, it's kind of funny math, at least to the beginning, it's 10 billion to start with plans to contribute another 90 billion in increments. And you know the best part of of one of the good parts of you know OpenAI being private is they could do a lot of these deals right where they don't you know definitely don't have to be disclosed obviously because Nvidia is public they're going to have to disclose that or Oracle or whatever it is that they're able to put up you know great topline numbers no different than maybe AOL did in the late 90s of hey here's the top line but it was really a contribution in kind and there's really some milestones to it and there's really some other things which also is very much a symbol of like a very frothy market of hey we're not talking about actual financial metrics or actual gap revenue or actual cash on the barrel head we're talking about a",
        "start": 1537.6,
        "duration": 3316.6400000000017
    },
    {
        "text": "and there's really some milestones to it and there's really some other things which also is very much a symbol of like a very frothy market of hey we're not talking about actual financial metrics or actual gap revenue or actual cash on the barrel head we're talking about a incash inind dollar amount which might not be real dollars right I think Jensen has referred to it as a partnership first and investment second and that's interesting because it would be by far the biggest investment in history Yes. Yes. And but but not an investment, right? Exactly. you've you've spoken sat across the table with lots of founders that are trying to pitch you on on fundraising. I'm sure there's a spectrum of really grounded founders to founders who will try to sell you a dream. And yes, I'm curious if you've ever and a lot of them were both and we've invested a lot that are both. So I'm curious if you ever heard anything like this. We've talked about this on the show. this is from Sam Alman when he was talking about the Nvidia investment. He says the stuff that will come out of the superbrain will be remarkable in a way I think we don't really know how to think about yet. is that if someone came and told that to you that what what what is coming what you're investing in will be so amazing we you don't even know how to wrap your head around it. What what's your reaction? , you know, I'm asking this, by the way, earnestly because like I I did have I did have a founder a couple years ago, several years ago, who basically said I asked them a question. They said, \"I can explain it to you, but it's probably not worth my time because you probably couldn't understand it.\" Okay. , and I said, \"Try me.\" And they said, \"No, I don't think I don't think you could get it.\" , amazingly, we invested and I think we made you invested after that. We made money. , so this is a good strategy then. It's Yeah, maybe it is. Maybe it is. no I I think the that is hey my ambitions are so broad and my expectations I'm setting I'm setting expectations so high words cannot do the expectations justice which also is another little canary in the coal mine of I actually maybe it's my personality I like concrete things of like hey we're going to do this we're going to be a big company and we're going to be a big company because we think we could sell a billion dollars of this product given how this world works. works out and you'd be like, \"Oh, that's big, hairy, audacious goal, but I could track that because that makes sense to me.\" But when people say, \"We're going to be the biggest company ever because we're going",
        "start": 1680.48,
        "duration": 3571.2800000000034
    },
    {
        "text": "sell a billion dollars of this product given how this world works. works out and you'd be like, \"Oh, that's big, hairy, audacious goal, but I could track that because that makes sense to me.\" But when people say, \"We're going to be the biggest company ever because we're going track.\" That's, you know, that it feels a little bit harder to track, but, you know, given what Sam has done, if anybody has earned the right to say things like that, you know, maybe him, Elon, rare air of folks who who could get away with that type of comment. Definitely. I mean there's there's a balance here between like you can appreciate and I certainly do what Sam has done at the helm of OpenAI and continues to do even though they've lost a lot of talent. Yes, the company continues to ship. But then when you're asking this broader question of is are things a little frothy and you see a quote like that in a story about this hundred billion dollar investment that is that's where I start billion dollar non-investment and and sub made substantive one of the key pillars of what's the the hundred million dollar partnership is they're going to do things that I couldn't explain to you because you wouldn't understand you're like you know that might be that might be on the cover of a book of what I saw what I saw at the top of the market by you know writer to be unnamed in five years. Yeah, I better get pitching that one. But but but then we should talk about then then what it means for the market right because you follow of course the the private markets the public markets and if you think about how much the public market is relying on Sam to do well Sam to deliver on that promise that he's made well Sam has to do that because the you have Microsoft Oracle Cororeweave Nvidia they are now all relying on OpenAI to deliver and I don't even know what more I mean to deliver what exactly and then you think about all those ecosystems So you know the energy companies are relying on coreweave to build out the infrastructure. You think about you know all the things that Microsoft's doing that are relying on some of the things that OpenAI is doing. you know if just nothing else the pure valuation that people are baking in given all the contracts or forward contracts or promises or partnerships or handshakes that are done that it's just escalating the expectation and commitment which again you know starts to starts to make you feel a bit uncomfortable at times right and I think the answer for open AAI has to be that in order to meet these enormous expectations I just set it up I don't I don't know what they're building towards that wasn't quite",
        "start": 1813.039,
        "duration": 3846.560000000003
    },
    {
        "text": "know starts to starts to make you feel a bit uncomfortable at times right and I think the answer for open AAI has to be that in order to meet these enormous expectations I just set it up I don't I don't know what they're building towards that wasn't quite automate a tremendous amount of white collar labor. So, yes, I want to talk about that and what's happening with Gen Z, who's at the seems like the spear's edge of this and not not able to find jobs right now. , I want to talk about that right after this. And we're back here with Rick Heitzman, managing director of First Mark Capital. , Rick, we talked before the break about how OpenAI is going to need to automate a lot of jobs. in order to justify this valuation. So let's just start broad as we begin the second half here. , are we marching towards technology companies like OpenAI, , like Anthropic, , basically trying to automate all work, all white collar work, and if they're successful, what happens? Well, I mean, I would say automating all work, right? Because if you think about some of the robotics things that are happening now, some factory automation things that are happening now, it's both blue collar and white collar. I think maybe differently than any kind of automation going back to you know farming where you know there's bulldozers and there's steam engines that are automating blue collar work it you know this has been very different and so I I do think and in talking to the bankers and the lawyers who usually hire a whole lot of folks or you know entry-level consulting firms BO firms they are pausing or taking a slower approach or a more thoughtful and cautious approach approach to how they fill in the bottom of the pyramid. , and that makes them, you know, rethink their their business. , you know, I do believe that they're going to rethink their business. I think you're going to lose some people, but those people are going to be repurposed, right? So, if you go back to the beginning of the 20th century, so beginning of the 20th century, about 93 people, 93% of Americans were in the agrarian economy, farmers basically. at the end of the 20th century it was about 3% of the American workforce as farmers and if you looked at just those two stats you like oh my god something horrible must have happened all these people must have lost their jobs what happened it was terri what happened oh it was the greatest century of an economy of any civilization's economy in the history of civilization you know the American 20th century and everything that happened So there is a a creative destruction that I think capitalism is really good at. And I think that you're you're see you saw that repurposement in the industrial revolution. You saw a repurposement",
        "start": 1952.399,
        "duration": 4158.241000000003
    },
    {
        "text": "economy in the history of civilization you know the American 20th century and everything that happened So there is a a creative destruction that I think capitalism is really good at. And I think that you're you're see you saw that repurposement in the industrial revolution. You saw a repurposement ability to have factories and all the techn technological advances during that century. I think you're going to see a rethinking about some of those things especially around white collar work. And you know there's a bunch of different things that are analogous to it. you know, word processors came out and they said, , I forget what it is. We call it 35 years ago, so I'll be imprecise. And they said, \"Oh my god, this is going to be the end of the legal industry.\" You know, now we're not going to need, you know, now people are going to be able to, you know, print these documents, use word processors. Since the I haven't word processors, there's four times more lawyers in America than there was at the time. You know, the same thing if you think about spreadsheets. , and you know, Lotus 123 comes out, there's going to be spreadsheets. And they said, \"Well, we're not going to need all these bankers. We're not going to need slide rules. We're going to have spreadsheets. We're going to automate this whole finance thing. There's more bankers than there were before spreadsheets by, you know, huge, huge factor. So, you know, what is it going to be now? We're able to automate a lot of white collar tasks. You're able to automate basic business processes today, probably better in the medium term. And do you believe that Gen Z is going to be creative enough and entrepreneurial enough to reinvent themselves? I think so. I have confidence in that. I do feel for I have friends who are going through recent college graduates and it's the worst I think it was the worst year last year since the financial crisis for recent college graduates. I have a son who's a junior in college. He feels anxiety of you know what does this mean? Is AI going to take my job? so I I I have empathy for that but I also push him to say well what what what could you do that AI can't do or what what are you thinking about that's thinking about something differently because the best people are going to be the people who understand it a little ahead of time and you know we're beginning to see people spin out law firms that their you know entire associate infrastructure is AI so you know they're able to be the partner who's able to add that level of judgment, client interface, all those things, and their backend is AI, and they're not beholdened to the pyramid model of law firms to be able to make their business work. So, , you're",
        "start": 2110.4,
        "duration": 4430.240000000006
    },
    {
        "text": "AI so you know they're able to be the partner who's able to add that level of judgment, client interface, all those things, and their backend is AI, and they're not beholdened to the pyramid model of law firms to be able to make their business work. So, , you're going to see creative destruction. I think that on the whole, we should all almost all of us will be better off for it. You know, I really go back and forth on it because on one hand, it it does seem like AI is becoming more and more capable. And again, you know, I just start in so many times in business, it's worth just starting at the money, right? Yes. The money is betting that all this all these jobs will be automated. Yes, that's what that money from Nvidia into OpenAI is is trying to do. , and then the question is what happens afterwards? And you could have it it seems like if they get there right in the time that Nvidia wants that investment to pay back, there's going to be massive disruption. Yeah. but then you also look at what happens in the day-to-day of of many companies. There's a great a thought-provoking Substack post in this Substack called Still Wandering and it was called The Death of the Corporate Job. And the author was trying to track what the what their friends and counterparts did in their work. here's what the author said. keep meeting people who describe their jobs using words they'd never use in normal conversations. They attend meetings about meetings. They create powerpoints that nobody reads, which get shared in emails that no one opens, which generate tasks that don't need doing. This post was liked 11,000 close to 12,000 times on Substack, which on Substack that's a lot lot of people, which means like I I Yeah, but it resonates with funny because it's true, right? like that the fact that that resonated that way with so many people who are in the knowledge economy it's just so telling and maybe AI eliminates that stuff and maybe this moment where we've had hiring consolidate or or stop in many ways is a realization by companies there's a great New Yorker political cartoon which is the same thing of you know someone types out an email and they say you know AI turn this into a 100page PowerPoint presentation and they turn it into a 100page powerpoint and they email it to their colleague and says AI take this 100page PowerPoint presentation and turn into a short email. So exactly so there everybody is using AI to automate different pieces. you know I I I just think that you know to have the have those people who are doing writing emails that no one reads or creating decks that people only weigh but not read. I think having them not do that is better for everyone,",
        "start": 2249.359,
        "duration": 4713.680000000008
    },
    {
        "text": "to automate different pieces. you know I I I just think that you know to have the have those people who are doing writing emails that no one reads or creating decks that people only weigh but not read. I think having them not do that is better for everyone, business looks like afterward. So there's like two possibilities. One is that all those people end up on higher value tasks. Two is companies go, \"Oh my goodness, we need onethird of the people.\" Yeah. And you're seeing some companies already do that. You know, some companies, you know, Shopify increased revenue and took out a fair amount of their employee base. you're not seeing engineers go away, but you're seeing companies keep engineering flat, but getting a lot more productivity doing due to all the coding tools. I think you're seeing a lot of kind of business process outsourcing or call centers and customer service things that are getting shrunk due to technology. so I do think there's going to be substantive job loss in certain fields. you hope that people will do some more meaningful work than you know having to go and we I think we're both very fortunate that our job is not writing pe not writing emails that people don't read or producing content that people don't listen to. I hope you're here for a good reason. We have an audience. I hope everyone out there. Yeah. Yes. so I think that I I think you're going to see more people doing different stuff. I mean you you part of that is the rise of the creator economy and you're seeing more people be entrepreneurial in the c creator economy and even as we've talked to folks out there in the creator economy it's often a side gig and sometimes either their their day job is not very meaningful not very lucrative or seems like it's a you know it's a cartoonish type thing and and they're they're finding meaning creativity and dollars in doing this side hustle and sometimes that side hustle terms into their main job and that becomes a more meaningful opportunity. I think it's going to happen more and more. Yeah. I mean that happened to me. I was started my career in marketing and sales and writing freelance journalism on the side and then flipped that to a full-time career and then flipped that into something that's now not just writing but is video, audio, some TV like we talked about which has been nice. But I actually, you know, it brings me back to my first job, , which was I would put together media plans that would go through those email chains and the decks that no one would read and eventually someone would approve it or not approve it. And of course, that's that that process has been disrupted by programmatic advertising where you just automate it all today. So maybe that would be a new",
        "start": 2392.56,
        "duration": 5000.56000000001
    },
    {
        "text": "go through those email chains and the decks that no one would read and eventually someone would approve it or not approve it. And of course, that's that that process has been disrupted by programmatic advertising where you just automate it all today. So maybe that would be a new job, that entry- level job that I had that got me into the workforce, you could chat GPT that and be done with it in 5 seconds. my my first job was a you know entry level investment banker that I was you know printing off documents and then keying that into a spreadsheet you know that's done that's been done for years I mean if you if you look at you know some of the basic capital IQ things and probably the first you know couple years of my career are now completely automated due to technology but even people who you know are now entering investment banking are doing different stuff and that's becoming more meaningful and there's more investment bankers than So I think although it's changing, it doesn't mean it's ending. And we talk about like there's a thriving economy out there somewhere. And then you think about what's happening with all right two groups of people. Gen Z Yep. who's really struggling like you mentioned to find jobs and also people that lose their jobs or leave their jobs are taking longer than usual to find new work. What is happening? It can't all be AI. Jerome Powell recently came out and said AI might contribute to it, but we're in a slow to high or slow to fire economy. And so what is the driving force behind this economy that feels to a lot of people to be, you know, doing well if you look at the topline numbers, but if you're an individual trying to, you know, navigate your career path, feels like everything is just stuck. I agree with almost everything you just said. I think that the economy is very strong and the fundamentals are strong and we see it in both our enterprise and consumer companies. So we actually feel good about the economy. the second piece of that is I do believe that you know companies are slow to hire and I think that you know coming off of which was a massively inefficient COVID time spurred by low interest rates, low cost of capital, work from home, it was basically the perfect way to create inefficiency that no accountability for dollars and no accountability for performance. So coming off of that companies now even five years later are saying okay I'm not going to I'm not going to do the sin I had yesterday I mean that's companies like individuals are always reactionary to the last phase. So you know companies like individuals are always reactionary to the last phase or their last mistake. so I think companies are now thinking about all right how are we more",
        "start": 2537.76,
        "duration": 5288.961000000011
    },
    {
        "text": "do the sin I had yesterday I mean that's companies like individuals are always reactionary to the last phase. So you know companies like individuals are always reactionary to the last phase or their last mistake. so I think companies are now thinking about all right how are we more we're spending that time and money wisely and we're not hiring someone to write emails that no one reads? So I think that's been slower but at the same time unemployment remains low and you know there is a sense of you know when I was coming out of school that there is some time like they told us when we were in school like if you quit your job or you lose your job you need to have a little bit of time because it takes months to find a new job. you know in in in some of the boom times when human capital has been tight over the last 20 years it's taken hours to find a new job. So I I think that you're you're moving more to historical norms as people are maybe because the economy is doing well maybe because the market's doing well because the managers are being more performance driven are moving more towards historical norms around performance. Okay. I want to use our remaining time to lightning round through a couple of your investments. You've invested in some fascinating companies, ones that I use all the time, ones that we talk about. U so let's just go through four of them if we can. We have about eight minutes. Discord. Yes. What do you think about the fact that so much of the the dynamism of social media has moved private, right? Mark Zuckerberg had this pivot to privacy and everyone's like he's into encryption. It's like no, he realizes social sharing is happening in the group chat. Yes. And that's where he wants things to happen. So talk a little bit about that. So I think and and moving to Discord servers, right? You have and is that good for us basically? well somewhat somewhat it is. I mean I I don't think everybody you know the old joke you know you don't have to broadcast anyone everybody you ever met you had for lunch. That that's not pushing forward anybody's life or economy and you don't need to see a picture of the tuna sandwich. So that's I think I'm somewhat glad we're out of that phase of social media. , at the same time, you know, therefore having servers that are very specific and whether you're in a Discord server for the next world baseball champion New York Yankees or whether you're in it for, you know, a League of Legends clan, you know, all of those things you find they're there. You know, the negative, as we've talked about, are these are very some of them are very intense echo chambers around particular beliefs that can spin",
        "start": 2684.24,
        "duration": 5558.802000000009
    },
    {
        "text": "Yankees or whether you're in it for, you know, a League of Legends clan, you know, all of those things you find they're there. You know, the negative, as we've talked about, are these are very some of them are very intense echo chambers around particular beliefs that can spin Discord does an excellent job of moderation to make sure that you know there's the right level of discourse in those Discord servers and it makes sure that works. But that's on the administrator of the Discord. It's on the administrator. Yeah. This of the of the server. So that is true. But I think you're going to see you're see more more social media move to semi-private that look more like group chats and and it can be around you know sports or music or technology or or relationships. just because I think that people might might be a little bit over living in public. Yeah. we love Discord over here big technology. we have a private Discord server for our paying subscribers. So, if you're interested, scroll down, sign up, and we'll get you a link. And I think it's the best thing that Big Technology has done in in years. The the conversation is high quality. It's interesting, and I love being in there. I get a lot of value out of it. Yeah. Cur, you know, and curation has been, you know, for the last 10 years of social media after the initial explosion, curation has been the most important thing to keeping a good thriving community. All right. DraftKings. Yes. Did Otani actually bet on baseball or was it his interpreter? I do not know that. do not know. I I I'm not sure if I if they would tell me if I asked. I think what do I think or what does DraftKings think? Let let me let me ask it in a in a little bit less facitious way. U obviously sports betting's been popularized. Yes. the leagues all promote it. Yes. The players are getting into it. Yes. Is that a problem? well, you're seeing more and more investigations and suspensions around the use and misuse of of gambling. So, I think, you know, like any new technology, it explodes out of the gates. It's a little bit of the wild west. I think, you know, DraftKings being a large public company who is a leader probably has more guard rails around it than maybe prediction markets or some of these you know sweep stakes types gray area markets. I think you know the government always struggles to keep up with where technology is going and it's oftent times focus on yesterday's problem not tomorrow's problem. So, I believe there's going to be more clearer rules around especially players, coaches, umpires, managers, and what they're able to do on on either gambling or prediction markets. Okay, let's talk about Shopify. Yes, you're an investor in Shopify. I am.",
        "start": 2821.92,
        "duration": 5868.08100000001
    },
    {
        "text": "times focus on yesterday's problem not tomorrow's problem. So, I believe there's going to be more clearer rules around especially players, coaches, umpires, managers, and what they're able to do on on either gambling or prediction markets. Okay, let's talk about Shopify. Yes, you're an investor in Shopify. I am. applications and websites to into chat bots? And if so, what happens? So, , I think that that's I don't think all it's never all or nothing. So, I think you're going to move to more chat bots. I think you're going to still need an ecosystem of whether it's, you know, headless stores or whether it's a back-end infrastructure of you're still whether you're buying a sweater because your AI girlfriend tells you it looks good and you're buying it in a chatbot based on your AI girlfriend. That's how I usually make most of my purchases. Yes. Yes. Your AI girlfriend is your stylist. That's that'd be a good t-shirt. for my AI girlfriend picked this out for me. That'd be great. so, you know, so but you know, there still needs to be a t-shirt which needs to be in a warehouse which needs to go in an envelope which needs to get shipped to you. There needs to be a payment process. There needs to be fraud around that payment. So, I think the commerce infrastructure is not going to go away regardless of who initiates that transaction. , and you know, whether you're, you know, getting that t-shirt on Teespring versus your AI girlfriend chatbot versus , you know, the gap, it's all going to it's all going to happen. So, I I don't I think it's it's somewhat disruptive on the front end, more to customer acquisition and and the front end of stores, but I think the commerce infrastructure is only going to continue to grow. , and I I I I don't see any way that e-commerce is is going to slow down any any foreseeable time. Right. So the interface might be a chatbot, but everything could be managed. Everything managed. You're still going to system. Yes, you're still again, you know, every just all those little pieces of flows of transaction processing and fraud prevention and you know where that goes and is there a return? And if you say, hey, you break up with your AI girlfriend and you don't want that t-shirt anymore, can you return it? There's all there's a a lot of things that have to happen besides just the front-end store. I think Shopify since we invested in the series A has built out but whether individually or through their ecosystem all kinds of things that are very hard to replicate. Okay. And then finally Airbnb. Okay. Is New York is New York's decision to ban Airbnb the greatest own goal in municipal history or something close to it? What do you mean the greatest own goal? I thought just a terrible shoot",
        "start": 2978.4,
        "duration": 6144.882000000007
    },
    {
        "text": "of things that are very hard to replicate. Okay. And then finally Airbnb. Okay. Is New York is New York's decision to ban Airbnb the greatest own goal in municipal history or something close to it? What do you mean the greatest own goal? I thought just a terrible shoot let me let me own it own goal. There was like when you kick it into your own net in soccer. I just heard a quote from a from a Jets player yesterday. He's like, \"Other teams shoot themselves in the foot and then we shoot ourselves in the head.\" It's like Grace. So, so all right. I just didn't catch it. So, I ask a question again. I'll respond to that again. Was Okay. You invested in Airbnb. Yes. Was New York City's decision to ban Airbnb one of the greatest disasters in municipal government history? Yeah. I mean it's definitely an own goal if we want to go use that format that you know you want to have a great vibrant ecosystem that allows free trade allows people to stay in places but and you want very little regulatory capture if you want a fervent place for you want New York to be open for traveling business people for tourism for everything that happens and you don't want the regulatory capture from the hospitality and hotel industry so I think that's it It it was silly. I think a lot of the large municipalities have played with it, but I think in in the you hope in the long run cooler heads prevail and everybody winds up doing the right thing. I understand the concerns that the rents might be too high and you don't want to have residential properties being converted into hotels, but there has to be a balance. And the fact that it just got banned, you know, effectively turned a hotel stay in New York City from something that was affordable. So, if you had guests, for instance, into something that's now $700 a night and that drives me nuts. And it's not like people are they should fix the underlying problem there. You're right. There's a housing issue in New York City. There's also a hotel revar issue. So you need to be able to do both. You hope that by providing incentive you could get people to do that and whether it's incentive that hey we're limiting the regulatory boundaries to get housing permits to be able to build more housing especially affordable housing or you're doing things to open up to make it easier for people to build you know any any type of residential properties here. That should have been the goal and not trying to not trying to do regulatory capture. All right, Rick, you have First Mark has a podcast. Do you want to talk a little bit about if people are interested in our conversation today where they can follow you or the podcast?",
        "start": 3120.079,
        "duration": 6410.161000000005
    },
    {
        "text": "should have been the goal and not trying to not trying to do regulatory capture. All right, Rick, you have First Mark has a podcast. Do you want to talk a little bit about if people are interested in our conversation today where they can follow you or the podcast? So, we do a bunch of different podcasts. you know, I you can follow me simple X address of just Rick. Rick. if you want to Where did you get that? it's a long long story. That's probably for phase for chapter two of our conversation. So, I'm Rick on Twitter X. you can find me there. I I actually you know have a very a very clean and deliberate Twitter largely about you know what I think is going on in the markets and what you know what we're seeing and hopefully be more clear about that. And then you know First Mark we have a a full parade of podcasts you should follow at first mark cap on Twitter and Instagram but also my partner Matt has a very large podcast called datadriven which talks about what he calls the MAD landscape machine learning artificial intelligence and data and that's really been on the forefront of AI with some of the best thinkers in AI on over the last actual decade. So I think we're we do produce a lot of content around data around financial technologies around a lot of things we do even okay computer that's part of the risk reversal ecosystem about what the state of the private markets are. So find me any of those places as well as on on our friend Scott Wapner's closing bell on CNBC which you're about to go to. So we'll get you to set. Rick, great to see you. Thanks for coming on the show. This was awesome. Thank you very much. I'm happy to be back anytime. Definitely. All right. We'll have to get the story of at Rick. So we will have you back for that and much more. All right, everybody. Thank you so much for watching and we'll see you next time on Big Technology Podcast.",
        "start": 3255.04,
        "duration": 6591.602000000002
    }
]