[
    {
        "text": " AI bubble fears are growing as Wall Street tries to do the math. Let's break it down in the Big Technology Podcast Friday edition special report on the AI bubble with DA Davidson, head of technology research, Gil Laura. That's coming up, a one topic special report Friday edition right after this. Welcome to Big Technology Podcast Friday edition where we break down the news in our traditional, coolheaded and nuanced format. Today we're actually going to bring a name that you've heard on the podcast before because we've read his analysis and bring him to life for you at least via voice. Gil Laura, who's the head of technology research at DAD Davidson is here with us to discuss it all. Gil, great to see you. Welcome to the show. Thanks for having me, Alex. So I have really appreciated your analysis. , often times when we see Wall Street analysts weigh in on trends, it's typically we typically hear from them about the things they think are going well, but less about the things they think are not going well. You're somebody who's who's really called balls and strikes. You've talked about, you know, the companies that are doing this the right way, the companies that are doing it the wrong way. And that analysis is super valuable because we find ourselves in this moment where Wall Street and really all of us are trying to figure out whether the AI investment curve is going to keep going the way it's been going or whether it's a bubble and everything is going to pop. So let me give you at least to start the argument that it is not a bubble. And this is coming from Reed Alberg at Semaphore. He says, \"AI is in a market of opportunity and uncertainty, not a bubble.\" He writes, \"The market punished AI stocks like Orweave and Palanteer this week. It seems like the world is convinced that the AI bubble is deflating, and nobody wants to be the last one out. This isn't just a Wall Street phenomenon. Every tech dinner I've been to lately, a good chunk of the conversation was spent on journalists peppering bullish tech executives about how long this really can last.\" And yet what the executives are saying makes sense. They are selling a product that customers can't get enough of. And the total addressable market for this product is virtually every person and company on the planet. And this week we saw AI companies touting rosy numbers from AMD CEO Lisa Sue predicting the AI compute market would grow to one trillion to anthropic getting profitable by 2028. So for all this talk of AI bubble, too much debt, I think Reed is making a really good point here which is that there is insatiable demand for the products and you do have public company CEOs like Lisu who like have to have some rigor behind the things they say talking about these major",
        "start": 0.08,
        "duration": 325.03899999999993
    },
    {
        "text": "AI bubble, too much debt, I think Reed is making a really good point here which is that there is insatiable demand for the products and you do have public company CEOs like Lisu who like have to have some rigor behind the things they say talking about these major Anthropic which are losing a lot of money planning to get profitable in a few years. So what's your read on this Gil? There's a lot to unpack there. And the framework that I do it with is to say both things are true. So AI is the most revolutionary technology that we've had in a really long time. Whether it's back to the internet or back to the industrial revolution. We'll only know in retrospect, but clearly the tools are very powerful and are getting better. All you need to know to do to know in order to realize that is just use them. may ask Chad GPT to do things for you that are hard that you would ask other people to do whether it's summarizing, writing, giving you advice and you see that not only is it incredibly capable but it's much better than it was a year ago and it's much better than the year before that. So yes, there is insatiable demand for this product. That is true. That's there's a lot of healthy behavior around that capability and the healthy behavior are reasonable, thoughtful business leaders like the ones at Microsoft, Amazon and Google that are making sound investments in growing the capacity to deliver AI and the reason they can make sound investments is that they have all the customers. They have all the business customers and by extension of their relationships with OpenAI and Anthropic, they have all the consumer relationships as well. And so when they make investments, they're using cash on their balance sheet. They have tremendous cash flow to back it up. They understand that it's a risky investment and they balance it out. So all of that is true. At the same time, we are seeing behaviors that are unhealthy. And that's where those of us that have lived through financial bubbles or technology bubbles are recognizing patterns that we've seen in the past and are saying, \"Hold on, this is unhealthy behavior.\" And and there are companies that are are exercising unhealthy behavior. And that's what we're being called we're trying to be to call out. And that's why there is a good reasonable debate here is what's healthy and what's unhealthy. And you mentioned several companies here, so I want to touch on a few of them because they represent some of this range. Halunteer is the best company in the world right now. I'm not going to even say the best software company. They're the best company in the world right now. Because what they are able to do is go into a company and ask them, \"What's",
        "start": 162.64,
        "duration": 645.2799999999995
    },
    {
        "text": "represent some of this range. Halunteer is the best company in the world right now. I'm not going to even say the best software company. They're the best company in the world right now. Because what they are able to do is go into a company and ask them, \"What's that you think AI can do for you?\" And then do it soup to nuts. And that's why you're seeing extraordinary growth rates there. and they're being incredibly successful both there and on the government side where they're doing sim similar things in just a more clandestine way. Then there's companies like Cororeweave which is the poster child for the bad behavior that I'm talking about. We're talking about a startup that is borrowing money to build data centers for another startup. They're both losing tremendous amounts of cash and yet they're somehow being able to raise this debt capital in order to fund this this buildout again without having the customers or or the the visibility into those investments paying off. So there's a whole range of behaviors between healthy and unhealthy and we just need to to sort that out so we don't make the mistakes of the past. And we we can delve into why I think debt is an unhealthy way to to invest in data centers. I think that's a worthwhile discussion because when we just say, \"Oh, we don't want debt financing.\" There's a reason for that and it's not just our experience from the past. Okay. Actually, let's go right there. right now. the debt is an issue. I'm thinking about companies like Oracle, which is taking on Oracle itself is taking on a tremendous amount of debt to fund its AI data center buildout. with this like promise that OpenAI will eventually pay them some revenue that it may or may not materialize. seems to me I mean as someone who's not spent too much time digging into the finances of Oracle that they're effectively leveraging the company on Sam Alman's ability to deliver revenue and effective maybe profitability growth for OpenAI. Then you have Meta which has had a lot of cash on the balance sheet and they're now using debt to fund their AI data center buildout. maybe with Meta you could say you know companies typically build this way and even though they have the cash it just makes more sense for them from financial standpoint because there are arguments to say okay fund it with debt who cares you'll pay it back everything's growing well. but I I actually will will turn it to you and and hear your perspective on why debt is such an issue here. We we've just started to see debt make its way into this conversation. So how why is it a problem and how concerned should we be? So, we have to go back to finance 101, right? There's certain things we we finance through equity, through",
        "start": 324.88,
        "duration": 957.9179999999997
    },
    {
        "text": "is such an issue here. We we've just started to see debt make its way into this conversation. So how why is it a problem and how concerned should we be? So, we have to go back to finance 101, right? There's certain things we we finance through equity, through we finance through debt, through an an obligation to pay down interest over time. And as a society, for the longest time, we've had those two pieces in their right place, right? So debt is when I have a predictable cash flow and an asset or and or an asset that can back that loan and then it makes sense for me to exchange capital now for future cash flows to the lender. So again the conditions are an asset that is longstanding that can back the loan and or predictable cash flows to support the loan payments. Right? That's why we have a mortgage. A mortgage is an example of both. All right, a mortgage is wait a second. If I if I stop paying my mortgage payments, the bank owns the house. And since they only lend me 80% of the value of the house, even if the value of the house goes down a little bit, they'll be fine. And they have an access to my income, which is relatively predictable even on Wall Street. And so they know that I'll pay my my mortgage payment. That's that's a loan that should be there, right? We use equity for investing in more speculative things for when we want to grow and we want to own that growth but we're not sure about what the cash flow is going to be. That's that's how a normal economy functions. When you start confusing the two, you get yourself in trouble. And that's what to your point Oracle is doing. They're saying, \"Well, I have this startup that's promising me $300 billion dollars of revenue at a high margin over the next five years. So, I'm gonna go borrow money to build out the infrastructure in order to deliver that.\" And and what Oracle has been exposed as is, hold on, OpenAI promised me 300 billion. They also promised Microsoft 200 billion, Amazon 38 billion, Cororeweave 25 billion. In total, 1.4 4 trillion. And who's this company that just promised all that? A company that at best will have $15 billion of revenue this year and will be losing more than that. So we'll be losing probably more than $20 billion this year. So are they in a position to for me to borrow money because I have certainty around those cash flows? No. That's that's bad behavior. And that's what we're talking about here is if you're borrowing money to make a speculative investment based on a speculative customer, that's bad behavior. And and frankly, that's what's dragged the the market down over the last few days is the realization that this bad behavior is happening. And",
        "start": 483.599,
        "duration": 1281.6000000000001
    },
    {
        "text": "And that's what we're talking about here is if you're borrowing money to make a speculative investment based on a speculative customer, that's bad behavior. And and frankly, that's what's dragged the the market down over the last few days is the realization that this bad behavior is happening. And but what are the consequences then if you can't I mean, all right, let's say Oracle, let's keep with this Oracle example, right? they can't they can't pay. you know they're building these data centers. it's one of those things that all right let's say the music stops and you know open AI is like all right there's not going to be any more AI improvement left or for any number of reasons AI development slows down. They're like actually we're not going to need those data centers or we don't have the money to pay you. What is is it it seems like that's just a local issue for Oracle. Is that or an econ is it that or is it an economywide problem? The answer to that is it depends on what magnitude we're talking about. Again, lessons of previous cycles and especially the financial cycle. If we have tens of billions of dollars of debt into an asset that stops being a productive asset, then if there's a problem, it's the people that issued that debt or own that debt that lose money. And the people that own stock in the companies that made those loans, Oracle, Cororeweave, etc., they'll lose if it's tens of billions of dollars. some financial firms will lose and and that's and and mostly the owners of that debt and that equity will lose. The problem starts happening when you get into hundreds of billions of dollars of debt, which is where we were headed, at least as of a couple of weeks ago. Again, OpenAI, this startup, great startup, great product, a startup committed $1.4 $4 trillion to all these entities. So those entities as well as OpenAI could go out and raise debt capital which means they were seeking they and their customers were seeking hundreds of billions of dollars of debt. If we are here 2 years from now and there's hundreds of billions of dollars of debt and the demand for AI stabilizes or we built enough data centers to support the demand we have at that point in time and the price for leasing pieces of AI for renting access to GPUs goes down. All of those assets then can't pay enough to pay the interest expense on that debt. all of that debt defaults at once. Now, we're talking about systemic risk. That's what folks are warning about right now is it's okay if some financial investors lose tens of billions of dollars here and there. If we have hundreds of billions of dollars of debt into what is really just one product with one price and that price goes down and all those assets become",
        "start": 647.6,
        "duration": 1601.7600000000002
    },
    {
        "text": "warning about right now is it's okay if some financial investors lose tens of billions of dollars here and there. If we have hundreds of billions of dollars of debt into what is really just one product with one price and that price goes down and all those assets become entire economy down. And again, we're all saying this from experience. Everybody should rewatch The Big Short and not just to see Christian Bale and Margot Robbie and Selena Gomez. It's a great movie that talks about how it's a little problem until everybody does it and then it's a big problem that affects everybody, right? Okay. So, one more question about this. Who are they borrowing from? Like who are the institutions that are giving them or the the investors or the individuals giving them this money? And if it I mean Gil, you lay it out so well. we don't know this is speculative. Shouldn't really use debt for speculation because again it could go under and then you could have a problem. who are they borrowing from and what do you think the calculations were from the people lending this money that they who obviously understood the things that you're saying and said, you know what, let's give them the give them the cash anyway. Well, the short answer is the largest institutions in the land. US Bank, JP Morgan, Mitsubishi Bank, those are the companies lending to to Coreeave. and and and again, the math they're doing, we believe, isn't the right math. Let me dig into that. What I mean by that a little bit. Again, this is a speculative asset. Just because we're all using it and excited about, which we laid out at the beginning, we are and it is exciting and we need a lot more compute. It's still a speculative asset in the sense that we don't know how much of it we're really going to need in two to five years because we don't have experience doing that. This is brand new. We don't know how much a GPU is going to rent in 5 years. And so when we get the revenue projections from Open AI that they're going to make like, you know, a hundred billion dollars a year, I guess I'm being exaggerating a bit. No, you can't trust you can't trust them because you just don't How do they know exactly? So, so one, AI may turn out as well as we we expect, but it may not. And two, OpenAI is not in a vacuum. They're competing. Part of the reason they're overpromising and and creating this too big to fail and and fake it till you make it and getting everybody else to have skin in the game. Part of the reason they're doing that is because they know they're competing with Meta and with Google and with Elon, people that have a lot more resources",
        "start": 809.92,
        "duration": 1892.081
    },
    {
        "text": "too big to fail and and fake it till you make it and getting everybody else to have skin in the game. Part of the reason they're doing that is because they know they're competing with Meta and with Google and with Elon, people that have a lot more resources we're going to have a hundred billion dollars of revenue by 2027, which Sam Alman just did,\" is completely disingenuous. He has no idea. He's competing against much bigger, more powerful companies that have technology that's at least as good as his. So, so lending money based on that is is dangerous because again these GPUs, you're building a data center, you're renting out GPUs, and right now maybe you're renting out a GPU for $4 an hour. And maybe that way the business makes sense. But these GPUs keep getting so much better every year that that same GPU in just three years may be only renting out at 40 cents an hour at which point the data center is literally worthless because that won't be enough to cover the expense of operating the data center. So this is where we get in trouble when somebody underwriting a JP Morgan or US Bank or Mitsubishi Bank ignores that. And to to answer your question, why would they do that? These are professionals. It's because they don't have the downside, right? They have a mandate to deploy capital into AI. They get a they got an order from their boss who got an order from their boss that says, \"We don't have enough AI in our portfolio. Go find me AI to invest in.\" And so somebody comes to them and says, \"Hey, look, I'm building a data center. Lend me money. I'll pay you 9%. That's fantastic interest.\" And you sign up for it. You get a big bonus that year based on signing that deal. If the deal goes sour, if if the data center is worthless in three years, you don't care. You're not giving your bonus back. That's the world we had back in the financial crisis. That's how we got in trouble then and that's how we could get in trouble now if we don't do something about it. So Gil, it's a great segue because you brought up the big short and this has definitely been a week where that is applicable because Michael Bur basically the star of that movie of that story. he who the guy who effectively shorted he shorted the housing market when he saw that we were engaging in extremely speculative loan behavior to people who should not get loans. he has started to well not started he has sounded a real alarm now and it is interesting because the incentives that you described are sound exactly similar to the incentives of the people writing loans for people for the subprime mortgages people who shouldn't have have have gotten that loan for a house they",
        "start": 957.36,
        "duration": 2189.4410000000007
    },
    {
        "text": "not started he has sounded a real alarm now and it is interesting because the incentives that you described are sound exactly similar to the incentives of the people writing loans for people for the subprime mortgages people who shouldn't have have have gotten that loan for a house they get their bonus anyway right it's the it mirrors that story and this week Bur made headlines because he'd shut down he completely shut down his his firm and he he basically you know described it to the valuations and the behavior we're seeing with AI and for the reason that you just outlined which is depreciation. Here's a tweet from him. Understanding depreciation by extending useful life of assets artificially boosting boosts earnings is one of the more common frauds of the modern era. Okay. So basically, if you don't if you don't if you don't accurately capture depreciation of the GPUs, he's effectively calling it a fraud. Massively ramping capex through purchase of Nvidia chips and servers on a 2 to threeyear product cycle should not result in the extension of useful lives of compute equipment. Yet that is exactly what all the hyperscalers have done. By my estimates, they will under state depreciation by 176 billion from 2026 to 2028. By 2028, Oracle, there's Oracle again, will overstate earnings by 26.9%, Meta by 20.8%, etc. But it gets worse. , and so that so that then Bur basically, you know, closes up shop. So what he's saying is that like all these companies say that these chips will depreciate over five or 6 years, but like you said, if the if the Nvidia chips get that much better, that much more quickly, we could have a much more accelerated depreciation, making the data centers that they're investing billions in today worthless, as you put it. How do you evaluate Bur's critique of the situation? Sounds like you agree with him. He's spot on. He's spot. By the way, Big Short is a story of how he was spot on, but he almost didn't make it. Right. A lot of the movie is about how long it takes to play out and you can be right, but if you're right too early, you you don't make it. And and the story is about him and the handful of people that did make it. There were a lot of people that were short the market for a long time and lost everything because they couldn't wait long enough. He was just in a position to wait. And he's spot on right now. And and look, depreciation gets wonky. So let me just hit it at a high level because it is really important to this conversation, right? Depreciation is based on an accounting standard that helps companies say well how I have an asset. How long is it used for? How long can that asset generate revenue for me? And if it if it can generate revenue for",
        "start": 1107.76,
        "duration": 2490.1620000000007
    },
    {
        "text": "because it is really important to this conversation, right? Depreciation is based on an accounting standard that helps companies say well how I have an asset. How long is it used for? How long can that asset generate revenue for me? And if it if it can generate revenue for the cost of acquiring that asset and spread it over five years as an expense for accounting purposes. Right? That's that's what accountants are there to do. And these accountants spent time 3 to 5 years ago with companies like Microsoft and Amazon and said, you know what, based on where the technology is now, we're looking at these chips and it looks to us like they can generate revenue for you for about five or six years. And and that's why we're going to allow you to depreciate that to extend your depreciation to five to six years because then you have less expenses and you look more profitable. So we're going to allow you to do that. But what's happened over the last 3 years is the technology has taken huge leaps forward. Jensen Wong has been preparing for this for decades and here we are and we can make the most of the the brilliant chips that he's designed and now he can make one every year that's 10 times better than the one he made the year before. And that's great. That's why we have all these great tools and that's why they're getting so much better. But back to those accountants, if you ask the accountants today, how long will this asset generate meaningful revenue, they would not answer five or six years, they would probably answer three years. And to Mr. Bur's point, if you told Amazon and Microsoft, and certainly if you told companies like Oracle and Cororeweave, no, no, no, no. these chips will only generate meaningful revenue for three years. Their profitability would decline very dramatically. So again, for Microsoft, Amazon, Google, I don't worry about that too much. They can handle it. For companies like Corweave and Oracle, it means like they'll never be able to raise any more capital again, which would which means they would all go away. So that's why this point is important. Even though it's a little wonky, it's in because when these companies come back and tell you, \"Oh, no, no, no. I have 5-year-old chips that work just fine.\" That's not the same thing. Saying, \"I have a 5-year-old chip that works just fine,\" doesn't mean that it can generate the same revenue that it did 5 years ago, which is the accounting question. So, that slight of hand by these companies to tell you that the chip still works. If it's only generating 1% of the revenue it generated five years ago, it's by all intents and purposes worthless. And so that's where we have to ask the accounts the right question and I think we will",
        "start": 1260.24,
        "duration": 2789.2810000000004
    },
    {
        "text": "hand by these companies to tell you that the chip still works. If it's only generating 1% of the revenue it generated five years ago, it's by all intents and purposes worthless. And so that's where we have to ask the accounts the right question and I think we will we're going to be correcting this dislocation which is what Mr. Bur is betting on. Right. Sat Yadello was on Dwaresh's podcast this week in an interview with him and Dylan Patel from Semi analysis and he basically was talking about this a couple what a year ago two years ago the the H100 Nvidia chip was state-of-the-art now we're already talking about the we Blackwell is deploying there's another generation coming out and the generation after that is is underway via Rubin which is going to make these H100s which again just came out a couple years ago. , you know, not I wouldn't say completely worthless, but , you were paying $30,000 per GPU a couple years ago. , it's going to be very hard to justify , you know, having that same value, which is what you're pointing out. But let's look at the other side here, which is , semi analysis has the counterpoint from Jordan Nanos. Okay. Jordan says there's basically no precedent to say the chip would wear would fail out would fail or fail or wear out in two to three years. the hardware manufacturers have contracts that are standard for 3 to 5 years and they offer extended warranties for 6 to 7 years. The proof of Bur's argument would be predicated on Nvidia releasing chips so dra that that so drastically outperform the current generation in two to three years that all hyperscalers everywhere are incentivized to go through another capexile capex cycle. They'd have to all buy new chips and rip out the existing ones. That seems like a much farther leap than saying we might be able to run these chips for five to six years in the data centers themselves. What do you think about that? A couple of things here. So, first of all, I think I like that Nvidia picks fun names like Vera Rubin and Richard Fineman to to name their chips. I like that as a naming convention. He's clearly a dork, right? In the best way possible. The other thing to note is that Dylan and and Daresh are roommates and boy is that a fun apartment to hang in hang out in, right? Those those two are some of the smartest people around and I love hearing them speak. , now that I've said that, I'll I'll bring you back to the fact that what they just said is is slight of hand, right? The fact that the chip works after 3 years doesn't mean it's going to generate the same revenue, right? You could have a working chip. I could have a a a 10-year-old Mac or",
        "start": 1411.84,
        "duration": 3081.522000000001
    },
    {
        "text": "you back to the fact that what they just said is is slight of hand, right? The fact that the chip works after 3 years doesn't mean it's going to generate the same revenue, right? You could have a working chip. I could have a a a 10-year-old Mac or I I wouldn't want to use it because it wouldn't be able to to do the things I need it to do. So just the fact that it doesn't break after three years doesn't mean that it can generate the same revenue that it did three years ago. So that's that's one level of slight of hand. The other thing they point to is oh don't worry about it. We do have 5-year-old chips that we're still renting out at decent prices. And that's really just a function of where we are right now in the expansion cycle. We are so short on chips to process these open these AI transaction these AI token generation inference transactions that people are renting out anything they can get their hands on. This is like used cars during COVID. People would pay a premium to a new car to to buy a used car because there were just no cars around. That doesn't mean that that used cars was worth more than a new car. It just means there was so much scarcity that people overpaid and that's where we are right now. That's not a a sustainable situation because everybody is building out data centers. And again, even if you took out the bad players that are lending that are borrowing money to build data centers, you still have Amazon, Microsoft, Google, Meta, Elon using cash flow to build data centers. So, we're building tremendous amount of capacity. Once that capacity even gets close to catching up, then then the old chips that can't do as many calculations for you will be worth a fraction. And this is where the market's going to end up right here. Markets are efficient. And and here's where the the equilibrium is. Here's where we'll get to to the balance of supply and demand is on dollar per per flop. Dollar per flop is to say dollar per calculation, right? Remember what these AI chips do is they generate tokens which is what we call words or numbers or images. And if a a Richard Fineman chip can generate X tokens per second and an H100 can generate 1 1 millionth of a token per second or take a million seconds to to generate a token, then the Richard Fineman chip is worth a million times more than an H100. Even if the H100's working, we won't use it because it can't keep up. it's not worth it because we'd rather use a chip that can generate the amount of tokens that we need. And so this is two different conversations. Will the chip work? It might, but will",
        "start": 1559.44,
        "duration": 3386.6429999999978
    },
    {
        "text": "H100. Even if the H100's working, we won't use it because it can't keep up. it's not worth it because we'd rather use a chip that can generate the amount of tokens that we need. And so this is two different conversations. Will the chip work? It might, but will to do enough computation to generate revenue? That's a completely different question. And that's where we think in a three-year time frame, three-year-old chips will just not be able to do enough computations to be worth keeping them on. So either we replace them or we use them for much less important things that will generate much less revenue. So again we have to be careful not confusing does it work with can it generate revenue. And just to go back to the bur point then what he's saying is there because these companies are writing the chip depreciation at 6 years or maybe who knows seven years but they're not going to actually be doing anything. that effectively they're going to be overstating their their profits and you know smart in smart investors is he saying that smart investors will catch on and then bing their valuations because of it or what's the risk there? That's exactly it is that all we're one account conversation away from having all these companies have to report much lower profits and you know we use we use profit multiples to value companies. So if a company has to depreciate most of its assets over three years instead of five years that means their profitability is going to go down proportionally and and we could have in in an stylized case the value of a company decline by 40% because an accountant said you have to depreciate this over three years instead of five years. That's why this is very real. Sounds wonky but this is very real. If you reduce a company's profitability by 40%, their value will go down by 40%. This is, by the way, this is why I thought it was important to have this conversation on the show because it is like when debt gets involved, that's when things start to get and and Bur's talking about more than debt, right? He's talking about because these depreciation costs can even hit the companies like the Microsofts that aren't taking on a tremendous amount of debt to do this. So, that's another issue. So these these conversations, debt, depreciation, this is where the rubber meets the road on the AI bubble conversation. It's one thing to say the valuations are out of whack. It's another to say here's actual the actual pressure points and these are the pressure points. That's right. And and again, I go back to Microsoft, Amazon, Google, they can handle it. They have a big business. It's diversified. This is only one part of the business. They can they can literally stop on a dime. Again, they're deploying cash cuz right now that cash",
        "start": 1715.12,
        "duration": 3704.721999999998
    },
    {
        "text": "points. That's right. And and again, I go back to Microsoft, Amazon, Google, they can handle it. They have a big business. It's diversified. This is only one part of the business. They can they can literally stop on a dime. Again, they're deploying cash cuz right now that cash generating 4% returns. And so they're saying, \"Well, this AI thing is huge. We think it can generate 15% returns based on our math. Let's use the 4% cash and deploy it here. We think we can get those returns. But by the way, the second we think that stops, we could stop our capex on a dime, go through a couple years where we don't do any capex while we absorb the previous investment.\" and those companies will be just fine. It's the companies that either have the debt or are lending the money or are or have equity investments in highly leveraged entities. Those are going to be the ones that can't handle that kind of a a transition. Is this does this all is it all sort of forgiven to use that term if open AI just delivers what Sam Alman promises? Yeah, maybe it's worth having the the our mental framework for looking at AI is that there's three camps, right? There's we have to take a weighted probability of three outcomes. There's the pessimist outcome which is AI is cute and it's useful but it's cute like like the metaverse or it it's cute like social media in which case it'll be a useful technology but really we're we're spending way too much money on it. Then there's the op and a lot of people are in that camp right now. I'm not sure I agree with that. There's the optimist scenario which is AI is the most powerful technology in in in in a long time. It will be so powerful that it will make us so much more productive that it will drive an acceleration in GDP growth that this is where Microsoft, Amazon, Google are are at from their perspective. And then there's a maximalist scenario which is we are maybe as close as a couple of years away from super intelligence. A technology that can do anything a human can do better than any human. In which case it's going to replace us on mass. Create untold wealth to whoever owns a piece of that. And therefore no investment we could possibly make is enough in order to get there. Especially if you believe that only one the one entity that gets there first will own everything. This is where Mark Zuckerberg lives. Sam Alman, Elon Musk, Dario Mod, they live in this maximalist camp of this is a race that we can't afford to lose and therefore we need to build everything we can. Now all three of these things are possible and so you have to plan ahead for that. But let's but most of us are in this",
        "start": 1876.559,
        "duration": 4017.1219999999967
    },
    {
        "text": "in this maximalist camp of this is a race that we can't afford to lose and therefore we need to build everything we can. Now all three of these things are possible and so you have to plan ahead for that. But let's but most of us are in this a lot. We just have to be thoughtful and careful about how we do it. So if we're wrong and it's the pessimist scenario, we don't bring everything down with us. Economy doesn't fall apart. You know, that would be and by the way, let's leave ourselves room. But maybe the maximalist scenario is right, too. So let's at least be near the rim when that happens so we can be competitive there. That's the healthy way to see all this and and again it it accounts for the fact that AI is very good. It will grow a lot. By the way, OpenAI when we step and talk about Open AI is is is as an entity and what it's doing. First of all, I want to I want to give them credit and put some blame as well. So, let's give them credit for the fact that in November of 2022, Google was sitting on GPT and it left it in what they call the pantry. They chose not to introduce GPT because they didn't know what to do with it or if it was a good idea to share it with the world. And OpenAI came out and said, \"This is unbelievable. People are going to love this.\" And they came out with a great consumer product that we now know as Chad GPT and now has 800 million weekly active users and is driven the fastest growth of any startup ever. Give them credit for that. Then let's talk about the detriment of their behavior recently. which is they have extended their ambition to a point where they've made all these commitments that they can't possibly live up to and as that's been exposed they've been dragging everybody down with them. So open AAI is just this unique entity. Now, if you were to ask me what should OpenAI do, some people do ask me that question. I would say just focus on Chad GPT. Just focus on having the best frontier model. Ramp Chad GPT. It's an amazing product. You have a head start. People are using Chad GPT as as the verb. Like they used to say, I Google this. People are saying I ch GPT this. If they just focused on that and grow it responsibly, they will be very successful. if they go down the current path overcommitting, deciding that they have to build their own data centers, they need their own hardware, they need their own chips, they won't make it. So hopefully for for the the benefit of of of their customers and their shareholders, I hope they focus on what they're really good at,",
        "start": 2034.0,
        "duration": 4300.800999999999
    },
    {
        "text": "overcommitting, deciding that they have to build their own data centers, they need their own hardware, they need their own chips, they won't make it. So hopefully for for the the benefit of of of their customers and their shareholders, I hope they focus on what they're really good at, Okay, I have more questions about this for you. We do need to take a break. So, let's hop away for a moment and come back and continue. I guess we're going to have to call this the AI bubble special report because there's so much to discuss. So, we'll continue talking about that and we will try to hit some of the news. so, we'll do that right after this. Finding the right tech talent isn't just hard, it's missionritical. And yet, many enterprise employers still rely on outdated methods or platforms that don't deliver. In today's market, hiring tech professionals isn't just about filling roles. It's about outpacing competitors. But with niche skills, hybrid preferences, and high salary expectations, it's never been more challenging to cut through the noise and connect with the right people. That's where Indeed comes in. Indeed consistently posts over 500,000 tech roles per month. And employers using its platform benefit from advanced targeting and a 2.1x lift in started applications when using tech network distribution. If I needed to hire top check top If I needed to hire top tier tech talent, I would go with Indeed. Post your first job and get $75 off at indeed.com/tealent. That's indeed.com/tealent to claim this offer. Indeed, built for what's now and for what's next in tech hiring. And we're back here on Big Technology Podcast Friday edition with Gil Laura, the head of technology research at DAD Davidson. Gil, we've been talking a lot about the potential the potential risks here of the AI buildout and we ended with OpenAI. Let's just go right back to Open AI here. is it possible that already, you know, you you kind of in the first half separated the companies that are behaving well with the companies that are not? , I just want to ask you this. Is it possible that companies are already too leveraged on Open AI? Here is the Wall Street Journal. Big tech soaring profits have an ugly underside. Open AAI's losses. , here's the story. Quarterly profit soared at Nvidia, Alphabet, Amazon, and Microsoft. Is AI revenue related? Poured in. Cash flows are mostly fine, albeit a lot is now going into building new data centers. Some of the money comes from actually selling AI services to businesses. But much of the AI related profits come from being a supplier to or an investor in the private companies building large language models behind AI chatbots and they're losing money as fast as they can raise it. OpenAI and Anthropic are sinkholes for AI losses that are the flip sides of the chunks of flip sides of the chunks of the public",
        "start": 2177.92,
        "duration": 4619.202000000002
    },
    {
        "text": "or an investor in the private companies building large language models behind AI chatbots and they're losing money as fast as they can raise it. OpenAI and Anthropic are sinkholes for AI losses that are the flip sides of the chunks of flip sides of the chunks of the public something like 60. Okay, here's here here it is. , opening eyes loss in the quarter equates to 65% of the rise in the underlying earnings of Microsoft, Nvidia, Alphabet, Amazon and Meta together. And that ignores Anthropic which Amazon recorded a profit of 9.5 billion from its holding in the lossmaking company in the quarter. So all these profits that we're seeing from these companies, not all, but certainly the majority is just the money that these two companies are spending on the buildout. How does that equate with this idea that, you know, I mean, maybe they're doing it responsibly, but certainly the the all these companies stock share prices have have jumped dramatically this year. And so again, going back to our bubble question, isn't that a problem, too? Yeah, absolutely. But let's let's parse that out a little bit. Let so first of all, OpenAI is is a really big part of Microsoft Azure growth and Microsoft Azure is the most important business within Microsoft. so let's let's focus on Microsoft and just say that this is actually less true about Amazon and Google. They're a lot less reliant on on Open AI and even Anthropic. but let's focus on Microsoft and say that half of their AI revenue approximately which is again a big piece of the Azure growth which is the biggest piece of Microsoft's growth is coming from Open AI. , let's talk about the other half of the AI growth for Microsoft. The other half of the eye growth is very healthy. That's companies because everybody's a Microsoft customer going to Microsoft and saying, \"I I I built this AI tool and I really need compute capacity to be able to use it. , I'll buy it from Azure.\" And then Microsoft says, \"That's great. we'll sell you the the GPUs, access to the GPUs, but then, you know, on top of that, we'll send you we'll sell you some database products and data warehouse products and data fabric products and and and oh, by the way, your your Microsoft 365 license is going to go up because you're going to use C-pilot and this is great for Microsoft. So, all the other AI stuff is absolutely great for Microsoft and it's a big reason why they've done so well. Then, let's talk about the open AI piece of this. Absolutely. This is the piece that's at risk because to your point, OpenAI is a negative gross margin business. They claim they're not, but they are, right? Which is to say it costs them more to answer your chat GPT question than they make revenue from",
        "start": 2340.4,
        "duration": 4894.642000000002
    },
    {
        "text": "AI piece of this. Absolutely. This is the piece that's at risk because to your point, OpenAI is a negative gross margin business. They claim they're not, but they are, right? Which is to say it costs them more to answer your chat GPT question than they make revenue from be aware of and concerned with, right? Especially if it's a big part of Microsoft revenue. It's like, wait a second, you're getting this for a company that losing money. I just saw this week there was someone who tweeted that like OpenAI Switcher says either they will answer you immediately with some slop or they'll go out and spend $10,000 on compute thinking through like your your query. because you're right, it does seem like with these especially with these queries that require a lot of reasoning, it just takes a lot of computing processing power. So I didn't mean to jump in but sorry. So that this is why it's dangerous, right? But let's let's think about here's an analogy that I think is very useful for understanding why this is okay from Microsoft perspective and that's Uber. If you remember when Uber started the rides were a lot less expensive than taxi. Let's say it was like a let's call it a $10 ride anywhere across town which was so attractive that everybody started using Uber. And and what what happened was we were we started using Uber a lot more than we used cabs before and it started replacing driving and we expanded the market for riding well beyond where it was because the price was so attractive. But then what happened is we changed our behavior and we started using it so much that Uber can then gradually ratchet up the price to a point where today Uber is a very profitable company because it's a $30 ride and and some people may may have may not be using it as much as they did when it was $10, but most of us are because we've changed our behavior and we see a lot of benefit in using it and now we're paying the appropriate price. The appropriate price wasn't $10. It was always $30. and now we're willing to pay $30 because we've learned over time that that's beneficial to us. We see value in it. We're willing to pay for it. The same thing should happen with these chats. And let's use chat GPT. It's still the leading one. Right? Right now, I may be paying $20 a month. Very few people are paying $200 a month. But my neighbor Jane, who has her own law firm, is using Chad GPT so much in her practice that she could postpone or even avoid hiring another associate. So let's say that associate was $100,000 a year. If she's paid $20 a month, even $200 a month, that creates so much value for her that in the future, if she",
        "start": 2480.24,
        "duration": 5189.442000000004
    },
    {
        "text": "using Chad GPT so much in her practice that she could postpone or even avoid hiring another associate. So let's say that associate was $100,000 a year. If she's paid $20 a month, even $200 a month, that creates so much value for her that in the future, if she never has to hire that associate, she could just use Chad GPT to summarize deposition, extract important information, help her strategize, , and and create documents, and she doesn't need to hire 100,000. She may be willing to pay 10, $20,000 a year. So, as we use Chad GPT a lot more broadly, we're going to be willing to go from a $20 a month price point to a much higher price point. So, at some point, this is a product that will be profitable. We just have to expand the usage so much that the people that are using it in a very u valuable way will be willing to pay what it's worth. That's the journey Uber went through and that's the journey we're going to go through. chat. What I would point out though is that unlike Uber and the ride share market which lent itself to winner takes most or winner takes all, chat is entirely not like that because I could have the same conversation with Gemini and Meta's going to give me the tools to do this and Grock is going to give me the tools to do this. So it's not a winner take all market which means that that process of getting to a price point that is beneficial enough may take longer and Google and Meta may decide that they never want to do that that they're willing to pay for all this compute to keep you in YouTube and keep you in Insta and that's where the risk is to a company like OpenAI and chat but if you're Microsoft that's okay because you'll just use your data center capac capacity to host Grock or or to host another chat that is worthwhile. And if not, you'll you'll rent that capacity out to your business customers that are using it to produce more value in their business and therefore willing to pay that premium and then buy databases and data warehouses, etc., etc. And that's why the market freaked out when Meta I guess was taking on this debt and increasing its capex because it's harder to see that direct line of it's going to be okay if you're a company like Meta versus a company like Microsoft that has the data centers. That's right. That's exactly right. And so a couple of things happened with Meta because Meta again is an unusual situation because they don't actually have business customers to rent this capacity to. It really is just Mr. Zuckerberg wanting a bigger and bigger toy, right? magical adventure and and again remember the reason that's happening is that he's a AI maximalist",
        "start": 2629.76,
        "duration": 5491.923000000006
    },
    {
        "text": "with Meta because Meta again is an unusual situation because they don't actually have business customers to rent this capacity to. It really is just Mr. Zuckerberg wanting a bigger and bigger toy, right? magical adventure and and again remember the reason that's happening is that he's a AI maximalist years away from having a tool so powerful he will get to rule it all that's why he's willing to spend and what he told investors last time was I am managing this unbelievable business I just grew ads ad revenue by 25% I'm unbelievably profitable doing that but instead of being disciplined and spending $25 % more next year. I'm going to go well beyond that and spend a lot more than 25% next year. And that's what investors said. That's it seems irresponsible, Mark. That's a lot of money you're spending this year. Why don't you just spend 25% more next year? And when he said, \"No, I'm going to go well beyond that.\" They they sold the stock. And the other thing that happened before Yeah. then he's okay with it. He owns the whole thing. as far as he's concerned, it's his money and and that's how he behaves and it's worked out for him so far. So, I don't know that I want to challenge him. The other thing that happened with Meta that was interesting is that when they went out to borrow, they didn't borrow the capital. They created a special purpose vehicle, right? They went out with Blue Owl and they said, you know, we'll put a couple of billion in Blue O. you put a couple more and then you can borrow 10 times that and build data center capacity for us and and the reason that hit a nerve is I don't know if you remember when we really started using the term specialurpose vehicle it's about 25 years ago with Enron right and and and now special purpose vehicle in itself not illegal hiding it was illegal and that's what Enron did and that's why incredibly we actually got to put somebody in jail. But a special purpose vehicle is is meta saying the capital markets are so irrational now in their ability to lend money to anybody to do build AI that we're going to use this as an infinite money glitch and we're going to have somebody else borrow the money. It's not going to go on debt as a b to our balance sheet. It's not going to go as capex ppn on our balance sheet. It's going to go somewhere else. We will have a line item in our balance sheet that says operating lease commitments, but it'll be a lot smaller and people don't pay attention as much to that line. And and why wouldn't they? If they can, why wouldn't they? And this is again one of those things that got people to say, \"Oh, this is unhealthy. We don't want to",
        "start": 2782.88,
        "duration": 5775.122000000009
    },
    {
        "text": "lease commitments, but it'll be a lot smaller and people don't pay attention as much to that line. And and why wouldn't they? If they can, why wouldn't they? And this is again one of those things that got people to say, \"Oh, this is unhealthy. We don't want to ended 25 years ago.\" Gil, can I keep you here for another couple minutes? I want to talk to you about this AI prisoners dilemma before we head out because because the question is again like we've talked a lot today I think appropriately about debt about depreciation about OpenAI's ability to pay back its or to actually meet its commitments. , but then there's this question of how anything becomes profitable and it's not so simple. And so I think what what I'm seeing here from Bloomberg is that there is a suggestion from the OddLots team that there's some game theory involved that might keep this unprofitable for a long time. So they're quoting this one report. An analyst suggested that there's a prisoners dilemma of sorts in inference pricing. Inference of course is when you actually use the models versus train them. If every inference application prices its services based on quality and charges by usage, the market might remain stable. But because market share is more important than margins for the equity investors and the venture capital investors supporting these inference firms, every firm has a greater incentive to offer flat rate pricing with unlimited usage triggering a race to the bottom. And by the way, that would apply to OpenAI and everyone. So he they say they say everyone subsidizes power users. Everyone posts hockey stick growth charts. Everyone eventually posts important pricing updates. Now, here's Bloomberg. AI isn't normal technology. It's not clear whether they will be at some point, whether there will be at some point ever when someone will be in position to say, you know what, this is good enough. It's cliche by now, but people talk about AI like they're building a new god or they talk about it like they're building nuclear bomb. And we have to get there before any country on Earth does. In fact, it's because of these huge stakes that in recent week there's been talk about how a US government might backs stop some of these companies some of the companies financing and debt. So, basically what they're I mean what they're saying is you you this is not acting like a rational technology because a everybody wants market share and b yeah they're they're willing to spend to get there and so what do you think about that? Is it is this going to be a persistent issue? How should we view this? Yes. Yes. Because so here here's the thing. Who who are the players in this game theory, right? It's Meta, it's Google, it's Microsoft, it's Amazon. It's companies that are used to winner",
        "start": 2926.319,
        "duration": 6057.201000000008
    },
    {
        "text": "about that? Is it is this going to be a persistent issue? How should we view this? Yes. Yes. Because so here here's the thing. Who who are the players in this game theory, right? It's Meta, it's Google, it's Microsoft, it's Amazon. It's companies that are used to winner markets as being winner take all market. Meaning if I don't win this market, I'll get none of it or at least not enough of it that will be meaningful to me. So they are willing to do anything to win. which to the point of that means they'll be willing to lose money for a long period of time so they have a chance to win. And what happens then is it's only the biggest most deepest pocket player that can win because they they can wait it out or at least communicate to everybody else that they're willing to wait it out. So that's that's where a company like Open Air has no chance because there they can't make it through another year or two at this level of spending. So they certainly won't be able to outlast Google Meta and Microsoft in this game, right? So and it explains a lot about Mr. Zuckerberg's behavior. Again, he's not just spending the money. He's telling us he's willing to spend anything to win. He's signaling to all the other players is I will not lose. So, you can keep throwing money at this. I'll keep throwing money at it longer. And that is exactly where we're at, which is why we may have persistent losses for a while here. because these companies have very deep pockets. Again, the smaller ones will either get absorbed by the big ones or just have to walk away. But those big ones believe this is winner takes all. By the way, you can tell I'm not sure it's winner takes all. I think we could be using different chat programs over time and companies will be using different AI. So, I'm not sure winners takes all. I do think that some of these companies can all succeed together, but I do think the analysis is correct and that they see it as winner takes all and they're doing what they can to not only stay in the game, but communicate to everybody else, signal to everybody else that they're staying in the game. And then the Bloomberg piece brings up this risk because of that, right? So that there could be not a credit crunch credit crunch but a collateral crunch right a collateral crunch is the sudden collapse in the value of assets underpinning all these loans. and then they quote this chief economist from Raymond James Jeff Sa who made this statement before the financial crisis. the risk is that the contagion spreads and morphs from this collateral crunch into a full-blown credit crunch. And that is exactly what happened in 2008. So is that is that I",
        "start": 3068.559,
        "duration": 6357.0410000000065
    },
    {
        "text": "they quote this chief economist from Raymond James Jeff Sa who made this statement before the financial crisis. the risk is that the contagion spreads and morphs from this collateral crunch into a full-blown credit crunch. And that is exactly what happened in 2008. So is that is that I what we've been talking about that you could you could see a contagion here from you know people being burned on a handful of of these deals. Maybe it's, you know, just throwing it out there. Maybe it's the Oracle deal. Maybe maybe Coreweave. And then saying, \"All right, I'm just not lending. I'm going to really tighten up my lending practices because this went bad. Yeah. And I think that's where we're headed. So again, we're tens of billions of in so of dollars of debt into this, which means if it goes away, then some people get hurt, but not the whole system. It's only if we get hundreds of billions of dollar in that will get hurt. Well, the more likely scenario is that what's happening right now in the market might scare these underwriters straight. they'll stop making these irresponsible loans and we'll go back to funding this out of cash flow by the companies that have the customers and have the wherewithal and again have the deep pockets to ride this out because if you play this scenario out what you'll realize is Meta Microsoft and and and Amazon Google fully expect all those companies that are barring to build data center to go bankrupt. This is great for them because that means that in when when they go bankrupt, they can buy assets at pennies on the dollar. So if I'm Microsoft, I know that in two or three years, I probably won't have to do any capex because I'll be able to buy data centers out of bankruptcy for pennies on the dollar. So I might as well let this play out. And if irresponsible lenders want to make these loans, it's their problem. I'm going to be able to capture those assets when I need it at pennies on the dollar. All right, Gil, last one for you. The one thing we haven't talked about is the potential bottleneck on power. Satyandela, for instance, was talking about this on what? Oh, on on Brad Gersonner's podcast. talking about how like he has chips he can't plug in because he can't power this. He doesn't have warm shelves. He can't power the shelves. Mustafa Sulleman CEO of Microsoft AI was on this show earlier this week talking about how they do have capacity for training but inference is a problem. Here's Zero Hedge who puts it in Zero Hedgeway. Has anyone done the math on how many hundreds of new nuclear power plants the US will need by 2028 for all these AI daily circles to be powered? What do you think about the power question? To me, it's a it's an",
        "start": 3221.04,
        "duration": 6658.162000000007
    },
    {
        "text": "Hedge who puts it in Zero Hedgeway. Has anyone done the math on how many hundreds of new nuclear power plants the US will need by 2028 for all these AI daily circles to be powered? What do you think about the power question? To me, it's a it's an is going to put the brakes on this, maybe it's just that the power will will run out. So, power is the the bottleneck. But what happens is in in a in a market-based economy such as ours is that when there's enough revenue and profits at stake, we work our way through bottlenecks. And that's what's happening and will happen here. So yes, the grid may not be able to give us enough the enough capacity to to turn on a data center because at peak they can't let us have us access to electricity. But with storage solutions, they could give us some. And then what these companies are doing is putting power what they call behind the meter, which is to say generators and turbines and diesel trucks because it's so lucrative that it's worth it for them to park 10 diesel trucks and run them so they can power those chips because they make so much money renting out those chips. So we will find a way. Markets find a way and we're going to find a way through this. It's just a matter of being creative and you know it's very lucrative if you're an electrician right now or an HVAC technician. Boy, are you making bank. You're you're you're getting flown on private jets to and making twice as much money so you can install a data center. So it's a good time to be electrician or HVAC technician. This is all gonna make a great movie one day, Gil. Yes. Hopefully not as devastating as Yes. I have Adrien Brody in playing me in the movie. Okay, sounds good. , this has been an AI bubble special report. Gil Laura, thank you so much for joining us. I I you know, I feel like I needed this. We needed this. It's the deep dive I've been waiting to do and I'm so glad we did it. So, thanks for coming on the show. Appreciate it, Alex. Enjoyed the conversation. Same here. All right, everybody. Thank you so much for listening and watching if you're on Spotify or YouTube. Nick Kle, the former president of global affairs at Meta, former deputy prime minister of the United Kingdom, is coming on on Wednesday to talk about whether we could trust Silicon Valley with super intelligence, and Nick has some really interesting thoughts about the economic value of super intelligence, whether it'll even make financial sense to own it. So, we hope that you tune in then. Thank you for listening and we'll see you next time on Big Technology Podcast.",
        "start": 3373.68,
        "duration": 6948.562000000011
    }
]