[
    {
        "text": " Let's talk about how AI will change the core of business software with Zeb Evans, the founder and CEO of ClickUp in a YouTube exclusive brought to you by ClickUp. And I'm thrilled to be here with Zeb today. Zeb, great to see you. Welcome to the show. Excited to be here, Alex. So, I want to start with you talking about user interfaces. I was having a conversation with an investor yesterday about how AI has the possibility to change the way that we interact with software. So the way that this investor described it was basically if you think about our desktop, we have a mail app, we have a messaging app, we have a calendar app, we have a browser. these may all have their own separate databases and none of them talk to each other. And I think in business software that's like really the case on steroids. Of course, of course there's APIs and connectors that way. but business software can often fail to be smart because that data and that experience is just not synthesized at all. And I I wonder if generative AI, you know, we're seeing the beginning now. Everyone's talking about automation and agents. , I wonder if the next step is really going to be a change in the way we interact with the software completely. , because instead of having maybe the AI go and use the software for you, it's possible that, you know, the the the actual way that you interact with these software programs is going to be very different. You know, someone building something like this yourself. I'd be curious to hear your take. It will definitely be very different. although I do not subscribe to the belief that everybody's going to want a single chat interface as their only interface within B2B software. , and I actually think what what will happen is every AI chat experience will need core primitives. And what we refer to primitives are things like a doc, slides, spreadsheet, kind of database, , and of course attachments and files. And those things will need to be built by the AI chat providers themselves. And we're actually already starting to to see this. so our philosophy and strategy really has has always been that software would converge that previously very separate niche vertical use case specific software categories would converge into to one and that's certainly what we've we've been focused on since the beginning. I think that what will change in the the near future and something that we're we are working on is what we call personalized software. and this is a very you know it's a collaboration software. So you have of course you have consistency across the data models, you have consistency across the collaboration experiences and the primitives, but your surface areas for your software, your homepage in ClickUp, your inbox that you come to, your task list will be extremely different based on which",
        "start": 0.08,
        "duration": 377.359
    },
    {
        "text": "software. So you have of course you have consistency across the data models, you have consistency across the collaboration experiences and the primitives, but your surface areas for your software, your homepage in ClickUp, your inbox that you come to, your task list will be extremely different based on which work on, based on your current priorities. and you could think of this what we think about it as is is almost vibe coding your front-end experience for a particular page or feature within collaboration products and I think that is is very much the future especially as we start to see more software converge right how are you going to be able to put 10 15 of your previously separate apps inside of one platform without it bloating the user experience and without it being extremely complex. it will need to be very personalized to just the things that you particularly work on. Okay. I want to ask ask you a question about something you said at the beginning of that answer, which is that you don't believe that we're going to end up having software that basically condenses everything into one platform. why is that? So I do believe that we'll have software that condenses into everything in one platform. That that is absolutely what we're focused on. What I don't believe is this notion that you're going to use just AI chat experience for all of your software needs and that you won't actually need UI or application layers to to back that up. And you know we we I think as as humans you always I mean take chat for example right chatting team chat you are always going to want a consistent experience where I can go see the history of all my messages regardless of how I send a message or receive it. you're going to want a a DM that you can go visualize that that history of your communications with a given person. And that same thing is true for all of those those core primitives. so I certainly don't believe, you know, that that everybody's going to want just to have a single AI chat all day long and they're not going to want to see any application layers or experiences. but I do believe that, you know, these separate software categories will all converge. I think AI will ultimately also converge with with software. So there was this sort of semi famous Benedict Evans tweet or thread whatever it might be at this point at the very beginning of the chat chase and his perspective was don't think about how you can layer AI on top of like a Microsoft Excel. Think about how basically it changes Excel completely. And I think where he was going with that is basically that business software or something like a Microsoft Excel would be instead of like you you know putting your numbers into a spreadsheet and then doing calculations on them,",
        "start": 188.8,
        "duration": 692.0799999999997
    },
    {
        "text": "Microsoft Excel. Think about how basically it changes Excel completely. And I think where he was going with that is basically that business software or something like a Microsoft Excel would be instead of like you you know putting your numbers into a spreadsheet and then doing calculations on them, chat interface and then ask for insights. that's not how you see it going. So, you're basically saying we're going to need some of those initial programs, but AI will make them smarter or tell me exactly where you land there. Oh, look, ultimately you need to to have it all. and I think this is, you know, it's very timely because you start to see Grock add spreadsheets. you start to see chat GPT also added Excel spreadsheets and CSV embedded inside of that that chat experience. and you know more importantly right now AI we're in a world where where AI is not good at calculating things yet. so generally you're having to spin up a virtual machine and run Python or something on there to actually perform those those spreadsheet calculations. So either way you have to build both sides of it. So you can you can start from this the spreadsheet and you can add the question the chat on top which is what Jim and I did. you also can start from the AI chat like chatgpt or gro and then you can add the spreadsheet on top of it. but ultimately you you do need both of them. Okay. And so talk a little bit you referenced ClickUp obviously that's the company you run. Talk a little bit about what you're building there. You mentioned that there's going to be you know personalized software for people that are using it. how does how does that work? We try to give you the best experience based on your intent. , and intent is is very tricky to figure out sometimes. If you have enough data, of course, it's very easy. So, if after a ClickUp user is using us for a week, two weeks, we really start to be able to personalize that experience pretty much automatically for them. They can give inputs. They can they can refine how things are prioritized and visualized. I am experimenting right now of viewing my inbox like a newspaper. and you know like an old school kind of news newspaper. We have a a branch that I was just trying that out on. and so it I I do think that it gives you a new level of like creativity and control as an enduser that just doesn't really exist today inside of at least inside of B2B software. I think you can go vibe code something that's consumerish but you struggle with adoption across teams. so we have always believed in horizontal massive horizontal platform primitives that are very flexible that allow you to accomplish any given use case any vertical use case and",
        "start": 348.0,
        "duration": 1011.7599999999998
    },
    {
        "text": "inside of B2B software. I think you can go vibe code something that's consumerish but you struggle with adoption across teams. so we have always believed in horizontal massive horizontal platform primitives that are very flexible that allow you to accomplish any given use case any vertical use case and productivity need inside of one platform because you know similar to I think what is getting a lot of attention now with AI is like underneath the hood why aren't all of these primitives the same you just have data models you have a database with a certain schema. , you have services for infrastructure, you have websockets, etc. , all of those things are are are very much needed and and leveraged appropriately for AI. , but they're also needed for any given they're common core components in any given SAS application that that you have. So, we've always taken the approach of build that very flexible. We call it convergence. , the only other company I'm aware of that that had a similar strategy is Rippling. They called it compound software. but it's the same the same approach and it just enables significantly greater flexibility in use cases and and also velocity in shipping product. So then talk a little bit from an end users perspective how they would go through it dayto-day. So let's take the inbox for example. Inbox in ClickUp is kind of a universal inbox for all of your notifications, your action items. , you can send events there, emails, and you can imagine typing, I essentially vibe coding your inbox and saying, \"Hey, I want these things to appear first. , I want everything about AI agents to appear at the top. I want all of the urgent things that mention me prioritized in order one through five , in a second section. And instead of it looking like a traditional inbox, , I'll go back to that newspaper example. make it look like an old school New York Times news newspaper. , and so it just gives you this this kind of like limitless creativity in in how you consume your notifications, consume your your your inbox. And that example can be relevant to really any given surface area, any any front-end application layer. You should be able to really deeply customize that experience. I think you can go too far if you don't add constraint and it becomes you know AI is look I'm total optimist in AI but it's not there yet in a in a lot of ways and it certainly is is also very it's very costly it's pretty pretty slow and it's ripe for errors if if you don't give it a bunch of guard rails so we are taking the approach where we will give it opinionated UI components and and framework to build on top of which minimizes issues that that would be created otherwise if you you let it do essentially anything",
        "start": 510.72,
        "duration": 1322.2419999999993
    },
    {
        "text": "if if you don't give it a bunch of guard rails so we are taking the approach where we will give it opinionated UI components and and framework to build on top of which minimizes issues that that would be created otherwise if you you let it do essentially anything language. Exactly. And are you you're sitting on top of email is it its own email server or is it something that sits on top of email and various different programs we synchronize in in real time pretty much any application outside of ClickUp. So you can connect Gmail or Outlook and we will in real time bring in all of your emails. Okay. And so then people can basically prompt their own not only UI but dashboards as well. We'll be able to give them new data and ways to look at the data that's coming through their platforms. Absolutely. That's that's the the power use case you you hit on is is the dashboard because it can be used for reporting, right? Those are the obvious things for reporting and analytics, but we're seeing some really cool use cases of of people almost like creating their own like apps as dashboards. because it can do more. Our dashboards can do way more than reporting. Anyway, you can have a chat. I can have a dock in there. I can have tasks. I can have a whiteboard inside there. You can have a spreadsheet. So, you imagine all of these like primitives, right? Going back to that that primitives analogy, it being created with AI and and if you give AI these these core primitives like a spreadsheet plus a doc plus these widgets that are able to show charts and really embedded anything inside of it, then you can create pretty cool applications and pretty cool use cases. we saw a a customer create a a bespoke like CRM solution that also had their clients have a a very personalized login experience that feels like their company. Wow, that's fascinating. So where do you think traditional business software is heading right now? I mean obviously there's like a lot of talk about you know does business software collapse into sort of this singular user interface or can you replace a lot of it with AI solutions. I'm curious if you think that's if you think that's the case and and how that how these these hopes might stack against the reality today which is that a lot of companies are struggling to even implement some of the basic use cases. I look I think we're we're very early still and things don't change as quick as everyone thinks that they do, right? Everyone thinks it's o overnight everything's going to be blown up. but I I don't subscribe to that. I do think a lot will will change to be clear and and I do think that software businesses that have a very simple",
        "start": 668.56,
        "duration": 1631.362999999999
    },
    {
        "text": "quick as everyone thinks that they do, right? Everyone thinks it's o overnight everything's going to be blown up. but I I don't subscribe to that. I do think a lot will will change to be clear and and I do think that software businesses that have a very simple sure. You can argue what will happen with software, but I think everyone agrees that you will be able and you already are able to build software much more efficiently than we could in the past. Therefore, every company will build more software, right? Not less. You're going to build more software if it's more efficient, if it's easier to create new products, easier for you to go into different markets. Of course, you will create more software. , so that goes along with our thesis of convergence of software. that software will converge ultimately given a long enough period of time. all of your software will be provided by one software provider. I believe one AI provider also and I don't think that there will just be one of them as far as monopoly goes. I think that there will there will be several not that many but several. And then along with that you will have this whole new category of what we call bespoke software where the small business that previously was not able to afford their own customized mobile application now can afford that. We don't believe that those people are going to go create their own though. You know I think that that's that there is definitely that notion of software gets eaten because everybody's going to go build their own software. If that was true, everybody would have built their own website by now. I mean, you've had website builders for for decade plus, good ones, really great ones. , but that is not the case with the vast majority of especially small businesses. They're not creating their own stuff. They're usually using an agency. They're usually using somebody that's using Canva or that's using a website builder them themselves to go do that. , and I think that that's what will happen in this next age. also for a unit software I guess that's what you would call it right this one software to system to rule them all couple questions for you what does it look like I mean are you able to does the ERP and the sales database and the marketing database just live in the same product and and then is this something that is going to be built by the incumbents like is this something you already mentioned openai and grock embedding spreadsheets. So, is this something that's going to be built by these big foundational research houses that need to turn profits or do you think it will be something that others build? I tend to think that the giants will build offerings but it will take them a long time. I",
        "start": 823.68,
        "duration": 1932.0019999999988
    },
    {
        "text": "So, is this something that's going to be built by these big foundational research houses that need to turn profits or do you think it will be something that others build? I tend to think that the giants will build offerings but it will take them a long time. I struggle cracking into B2B especially with collaboration. that is like a you know a core block in AI right now of AI chat it's it's your own chat right you're chatting with your own stuff and that's that's it there is no like element of collaboration and the context is also missing in in in the AI labs today but they know that right and and so that is is certainly part of of their strategy in the long term but yeah I do think to answer your question yeah I think that you will have one software provider that has ERP system of record it has all of your customer system of record. It has your marketing. certainly has HR and project management and work management along with team communication. Okay. But here's here's where it gets interesting. and that is that some of these companies everyone owns like a little FFTM or a little piece of the puzzle. And what happens if the providers end up shutting it off and then making it impossible to build this single software? Here's an article that you wrote in Fortune I think today. I'm the founder of a $4 billion software unicorn and I see data wars coming. Enterprise AI beware. You talk about how Salesforce for instance has cut off access in some ways to data from Slack. Yeah. And but I I over time I think that that is is is the reason why you'll see other providers pop up and have all of the offerings in one place. it it's a short very short-sighted move you know to to cut off your data access completely especially for something that is is not truly competitive right it was more about unifying their data to provide AI value so what will happen is when context becomes valuable it already is valuable in my eyes and anybody that I think has worked with AI deeply context is really the most important thing but as consumers and as businesses start to realize how valuable it is and that AI value actually becomes a a reality with that context, they will strive and demand all of that context together in in one place. and so if you know Salesforce doesn't offer that and they don't or they don't want to buy from Salesforce or another competitor comes along and does offer that that's where I think you start to see you know these single software providers take off. So is this basically the Salesforce's move you're saying? is its attempt to become this sort of central unit software. I mean there I was just talking about sales data. So sales data,",
        "start": 976.959,
        "duration": 2240.8019999999974
    },
    {
        "text": "that that's where I think you start to see you know these single software providers take off. So is this basically the Salesforce's move you're saying? is its attempt to become this sort of central unit software. I mean there I was just talking about sales data. So sales data, the move that they're making is is basically saying we want to control and be that singular software player and we're going to prevent others from doing it. So we're going to limit access from Slack Slack. I think that is is part of the strategy long term. I think that immediately though it they see it as a risk. I I think that there's there's there's no way of getting around that that they see it as as a big risk. that they have customers that are exporting all of their data and they're using all of that data outside of their core application. They have no engagement anymore, right? Then therefore they really are just a database. They just are that that system of record. and certainly it would make it a lot easier for customers to switch to another provider, a single software provider. Whereas Salesforce, yeah, they will try to provide all of the software, but all of their software is really buil built in very much in isolation. it it does not play well with each other and and it's not great for what I see as the future of software where you really have to build everything with the same application primitives the same framework and and the same modules the same components that's where you get a lot of leverage from and you're not going to get leverage from you know having five separate applications even though they're sold by one provider you don't really get the same convergence leverage and efficiency and productivity ity and AI context value from that the whole value of AI that people have talked about is the fact that you don't need everything to be sort of primitive primitivized and structured and you can take unstructured data from various systems that don't speak to each other and sort of use AI to extract that synthesize it make sense of it and then let you act on it you don't buy that no I do buy that from a so from a data perspective, it's it's different versus the front end the front-end application layer p perspective, right? And there's they're they're really two very unique things. because you have the back-end platform as the databases, as the data, the the context there, but then you have the front-end applications where all of the engagement happens, where the humans actually work, right? Where they see and visualize that stuff and where they engage, where they collaborate, where they actually do the do the work. Those two things are are needed to provide the greatest AI value. You need both of them. You need the context. You need",
        "start": 1135.36,
        "duration": 2542.640999999998
    },
    {
        "text": "the humans actually work, right? Where they see and visualize that stuff and where they engage, where they collaborate, where they actually do the do the work. Those two things are are needed to provide the greatest AI value. You need both of them. You need the context. You need engagement. You need that that human that is actually using that and providing really really valuable feedback. This is how we are able to to really make incredible strides with the quality of our AI and the value is the human feedback and and these these loops that start to happen autonomously where people downvote something and we learn from that automatically. We have an agent that goes and and fixes it really and adds an eval for it. so it continuously gets better and better and better. U but you certainly need that like unified data in in a very digestible way. So it's it it is to be clear I don't actually think that you I I believe to certainly that all the data in in one place is in similar data models is 100x more effective than trying to unify five 10 different data models and databases through an API and you can see this how it works I mean if you go connect MCP or even the connections from chat GPT you're very very very limited on the data that you can access. It sounds cool but you know I was I was I was connected my Google calendar the other day to claude and and to open AI and I was like hey what are my events for next week? I'm limited to maximum of 10 events, you know, hey, can you create a calendar event? I can't create a calendar event yet, you know, like it's it's just like it's very surface level. What you actually need is to synchronize all of that data and have optimized AI retrieval for for that data so that you can get the right context out because there's way too much context there for AI to be able to actually like decipher what matters. You need to be able to to first limit that and then give it to the LLM. And that's that's very difficult to do, right? I mean, that's been the problem with Apple Intelligence, I think, and some of the Alexa Plus delays that we've seen is that when you ask these bots to go in and find some information for you, if I'm reading you right, if I'm hearing you right, the answer is that they just are dealing with a con, you know, just an unbelievable amount of data. They're struggling to pull it out. , so how do you how do you then go and and put that infrastructure into limit and then find the right stuff from a data perspective? You know, by the way, we acquired a company a few years ago for enterprise search and the",
        "start": 1288.799,
        "duration": 2829.1999999999966
    },
    {
        "text": "struggling to pull it out. , so how do you how do you then go and and put that infrastructure into limit and then find the right stuff from a data perspective? You know, by the way, we acquired a company a few years ago for enterprise search and the built was allowing us to synchronize any application in real time and store that data in a universal database. So, a data model that is consistent across the board regardless of what application it is. We can plug into HubSpot and Salesforce and Slack and your task management platform if it was outside of ClickUp and we can synchronize that into one database in real time with permissions and privacy aware. And this what is what we optimize for AI retrieval. So, our our agents understand this this singular data model. It can do semantic search in one place. So it doesn't have to go kick off 10 APIs and then try and pull that back together and then do re-ranking. It's very slow. and it just doesn't work at scale using using APIs to to do that. so certainly this this is where the world will will be headed is is actually unifying that data into like a single database. And I do think that's part of the reason why you know Salesforce started putting up those those walls is because they they do want to be that provider. They want those those that database that full universal data model inside of their ecosystem, not somebody else's. And so, how do you adapt if they put the walls up like that for the Slack data for instance? Well, it's been a it's been a tailwind for us because and and I think it will continue to to be because we have a our team chat product which is our fastest growing product by far. , and it's accelerated the the growth ever since since did that. there is a you know that I I would say it's more early adopters that care about it right now that see that oh holy like I want to get away from this you know I need to be in more of like an open system and and they they started you know switching to our our our ecosystem and I think over over time as people see more and more value from context and team chat is extremely valuable context right the most up-to-date information generally is going to be there as people see that value is is there. They will demand more ecosystems that are friendly and allow you to pull in your data and and kind of use it use it freely without you know being handcuffed to a single Salesforce provider if they don't even have the other offerings. I think that's that's the the difference here too is you we have a lot of a lot of customers that yeah they they use Salesforce and",
        "start": 1433.919,
        "duration": 3110.158999999997
    },
    {
        "text": "use it use it freely without you know being handcuffed to a single Salesforce provider if they don't even have the other offerings. I think that's that's the the difference here too is you we have a lot of a lot of customers that yeah they they use Salesforce and right? they have Salesforce as their CRM backbone and ClickUp for for everything else. , and so, you know, Salesforce doesn't have a ClickUp offering, right? So, so they can't even to your point ear earlier like, yeah, maybe they'll get to that world where they do have an offering for everything, but they're not there right now. So, what they're doing is is they're forcing customers to separate their con their context. There is no way to unify the context. Even if they want to pay a million dollars, you can't really do it in Salesforce today. Interesting. So when in the early going my thought was maybe you would have a set of companies that are databases and then a set of companies that might you know draw from those databases and be the user experience on top of it. But I think what you're saying is it isn't going to be two separate ones. Like the only way to make this work is everything is in the same one together. Yep. Okay. Exactly. Figma's doing it too. Why is Figma also it's one of one that you've listed as well? Yeah, you know, they are and and I look, I I think if I was them in in their case, it's it's hard to say, you know, is it the right decision? Is it is it the wrong decision? because in in Figma's case, you know, they do have that engagement layer, like where people are actually working. They also have the platform, the data platform layer, like the source of truth of designs and the very detailed specs along with that. It's not just a screenshot. they have all of all of the actual components within the wireframes and yeah they they started locking it down too where where you know we were previously synchronizing all of your Figma prototypes and you could search across them and you know you could do AI across the the prototypes and recently they notified us that you know they've they are deprecating that across the board not just not just for us for for everyone and so that will you know that will will be a bit of I actually think that it does it will create problems where consumers are pissed off because they're using their favorite vibe coding tool right now and they're trying to plug it into Figma and when that access gets cut off you have to go use Figma's product right which is imagine I imagine that is is kind of the intention here is to go use their Figma make product for for vibe coding rather",
        "start": 1577.76,
        "duration": 3388.238999999996
    },
    {
        "text": "now and they're trying to plug it into Figma and when that access gets cut off you have to go use Figma's product right which is imagine I imagine that is is kind of the intention here is to go use their Figma make product for for vibe coding rather think maybe over the next quarter two quarters is that that's what we'll we'll so they are certainly headed towards that same direction though that convergence and and trying to get single you know provide a single offering platform that that provides nearly all the software for their for their given market which is you know designers right now. Yeah. It's interesting because your headline was you know there's going to be data wars and I was like oh is wars too strong of a term but no really is it's going to be like real business wars here. Absolutely. It'll it will be it will be it will be wars for sure. , and I think you're you're going to end up like waking up every day and you know see I think you'll see another headline of this company cut off this access to this access and you're using you know your your tool that you thought you were using to control everything connected to it. But but that those connections will will certainly stop I think as as convergence continues to happen. All right, Zeb, I I want to end here. there was this MIT study that I'm sure you've heard of it. 95% of businesses, I'm getting tired of repeating it already because we've talked about it so much. 95% of businesses get no ROI on their their AI spend. Let's not talk about a study. I'm actually curious to hear how you think about calculating ROI on enterprise AI. Like what is the right way to calculate ROI on enterprise AI spend? time saved is is what we care about and that is easier said than done to measure it. U but directionally you you can start to measure efficiency. You know, it's going to sound like I'm selling it, but it goes back to you have to be able to see all of the context. You you need to be able to see everything in order to measure efficiency. Any given missing context just throws all of all of the data off. But I would say that high level, you know, I'm not surprised at all. What we've always focused on is is the engagement piece. Everybody can, you know, go take the latest most complex agentic platforms and build something cool for an agent, right? A cool use case for an agent. But what matters is humans actually using that agent, right, at the right time, the right place in in the right way. And I believe that ambient AI is is the future here. And this is where we started to see the value really cracked. You know, of",
        "start": 1718.08,
        "duration": 3668.1579999999967
    },
    {
        "text": "an agent. But what matters is humans actually using that agent, right, at the right time, the right place in in the right way. And I believe that ambient AI is is the future here. And this is where we started to see the value really cracked. You know, of any question about, you know, your work or outside of your work. Great. But it requires the human going to AI to ask that question. And humans default to asking other humans questions, right? We're just it's very hard to change behavior. And so what we started doing was every time a human asks another human a question, we just ambiently sit there and see if we can answer this question with 80% confidence, we will actually just answer it. We will intercept it and answer it automatically. And we've answered over a million questions automatically without a user asking AI. They're asking an actual human human to do that. That's where I see the the real value coming from is is where AI is really just providing the value automatically. or asking you and confirming you that they to to provide the value, but it's just doing it there. You shouldn't have to go invoke AI to realize the value from it. More proactive AI. What you're proactive AI. Okay. Zeb, if people want to learn more about ClickUp, where do they go? ClickUp.com. Okay. All right. Well, you heard it here, folks. clickup.com. Zeb, thank you so much for coming on the show. Great speaking with you. Thanks so much for having me, Alex. All right. Thank you everybody for watching. We'll be back on the feed soon.",
        "start": 1859.279,
        "duration": 3818.158999999997
    }
]