[
    {
        "text": " Let's talk about how AI is changing the business world and where it might lead with Martin Mcgoya, the chairman and CEO of Globent in an interview today brought to you by Globent. Martin, great to see you. Welcome to the show. Great to see you, Alex. Thank you so much. Thank you so much for having me here. It's great to have you here. You have a view into many many businesses and a question we've been asking on the show is, is AI actually helping businesses? And if so, how is it helping businesses? So just to start off, where is AI doing a good job in business today and where could it be better? I think let's kick it off by the overall view on the on the technology itself. I think it's something that it's a massive revolution. this technology came to stay here for many many years and it promised that it will you know kind of change a good portion of how things have been doing today and that doesn't necessarily mean replace humans but also it will enhance on the other hand it will enhance how humans perform you know the same processes that we have today. So I think that all these next generation processes that will come with this new technology u can be divided I would say into two big categories one one which is pretty you know straightforward how to imagine them I mean if you're talking about customer service that's something that that is quite obvious how we can accelerate how we can concentrate on the difficult cases and take out all the easy cases to use the human you know intelligence to solve the difficult cases. in those things are is quite obvious and similar things like that are quite obvious. Then you have other things or other cases inside companies in which it's not that obvious how to use AI to make it and there's a lot of confusion and noise around how to analyze data, how to you know use these next generation technologies to have better understanding of of the data itself. how to analyze better how customers react to certain offers. And I think that there's a bunch of things in which AI must generate like the next generation of you know processes which are not AI used by humans but AI running the processes itself and then humans supervising that specific process. Right? So I would say that these two cases there are some cases in which it's much easier to imagine it and some of the cases which are more difficult to imagine and it requires humans rethinking the way processes are being done inside corporations. That led to a lot of change inside corporations. And it would take time and it would take a lot of effort because you know implementing these kind of probabilistic tools into deterministic engines like all the corporate information systems. It",
        "start": 0.16,
        "duration": 405.84000000000015
    },
    {
        "text": "rethinking the way processes are being done inside corporations. That led to a lot of change inside corporations. And it would take time and it would take a lot of effort because you know implementing these kind of probabilistic tools into deterministic engines like all the corporate information systems. It in the software industry you know when we have a problem there's a bug associated with that problem. we go and fix the bug and then the problem gets solved. Well, this is not the case any longer with with when you're talking with a probabilistic system. You don't know which are the things to touch whenever you know you are not getting the answer you want. So that creates like a whole new level of you know difficulties on how to put the answers of that probabilistic engine in the range that you need for that to be a good answer. right an enterprise class answer. So those projects it has been demonstrated already in these three years that are more difficult than what expected that it requires the right partners. It requires to have a lot of to pay a lot of attention to corporate security to you know how you put the guard rails of those you know probabilistic systems or LLMs when while you're there they are creating the answer and and this is a complex process by itself so I think that this next generation wave of change will come it will take a while and it will be a slow a slower than expected adoption on this complex side while the easy cases will be solved quite fast very fast and so can you tell our audience a little bit more about globun and and how you are tackling these problems we believe that all these AI AI things will kind of evolve in in a in a pretty I would say fast way but also there will there won't be in my opinion one model that will dominate the whole landscape instead we will have like different models having different you know spe specialties and the secret here to to future solutions don't rely on just paying attention to one model but to understand which is the best model to solve your specific problem. And I will separate the race for AI in two specific, you know, , portions. The first portion is who's going to get the best LLM or the best model for the specific business case. And that's one that's one race, right? And then the other race which I'm more interested in is how to apply those things to make real cases and how to apply those things to change the way companies operate. on that second race is our race is what we are doing every day in front of our customers. While then many know LLMs today we counted about 140 different models plus versions of the model that are integrated into our platforms. so so",
        "start": 202.4,
        "duration": 770.6400000000001
    },
    {
        "text": "to change the way companies operate. on that second race is our race is what we are doing every day in front of our customers. While then many know LLMs today we counted about 140 different models plus versions of the model that are integrated into our platforms. so so technologies here the difficult part for me is creating the agentic you know workflows to be able to solve the problem. So our approach to that has been to create a platform which we call globan enterprise AI. On one side it connects to 140 models in which you can choose whatever model you want to use for the specific case that you need to solve. On the other side, it connects to all the corporate information systems, SAP, Salesforce, any kind of service now or whatever corporate information system, even proprietary information systems, right? And then with those two things, you start creating the agentics workflow, the agentic workflow that you need to solve the problems that each company has. And then with those agents solving specific problems then we'll allow our customers in case they want to publish those agents and for them to help other organizations or other companies to solve those those same problems. So let's say we're solving now a problem for for a big energy company on procurement right and and but there that that problem is not just for one company but pretty much everybody has the same problem. So once we have that kind of procurement ready agent and we already have it now now we can extrapolate it to many other companies to use it. So our approach our playbook is that you don't need to get the paralysis analysis of understanding how the com extremely complex AI ecosystem is. But you need instead to get one step below that. do your things, connect your corporate information systems and let the world to evolve on which is the best system and then with very simple you know changes connect to the best model that you need instead of just maring with one model right so what we are offering to the market is we bring a very simple approach to change your company using AI without the need of getting a single partner right or a single model into the equation and with all the enterprise class things that you need when you need to take care of security, of accessibility, accountability, traceability, cost control. Well, all those things are things that we take care in our enterprise class platform which is called glob and enterprise AI that has to do with that with a playbook and a platform to adopt AI like the golden path for AI adoption and gen AI adoption for our customers. So this is the way we see it moving forward to help our customers to create that value and to make that those AI savings really tangible for our customers using a",
        "start": 388.08,
        "duration": 1139.5200000000004
    },
    {
        "text": "platform to adopt AI like the golden path for AI adoption and gen AI adoption for our customers. So this is the way we see it moving forward to help our customers to create that value and to make that those AI savings really tangible for our customers using a next generation technologies and how to navigate this extremely complex AI ecosystem that every day becomes more and more complex. And what I want to figure out is how this is applying in concrete ways with real companies. So can you just talk us through like one example of a use case where a company would come to you with a problem and generative AI has been the answer to solve it? We have many and and that's one of the main things how we are growing these days and u I would say that give you two or three examples. first on the e-commerce site, massive e-commerce site, they need to they have like a an army of people answering calls from the from their customers and they're you know saying okay so I bought these three glasses and one came broken. So what should I do? So so the system go ask for a picture. Then the system itself check that picture. If the picture is real and it connects with the same thing that they have on the back end, then they go to the next if if that's not the case, then it call a human. Puts a human in the loop. But if that is correct, they go to the next step which is comparing the nine options about full refund, total refund, partial refund or full return, partial return or no return. and then we analyze you know with an LLM which is the best option and then we suggest to the customer a final answer. So that very complex process that is slice into very thin layers of small decisions is one of the cases that we have solved many times. Now also we are as I said before big energy company, big procurement company to be able I mean big procurement problems to be able to acquire the things on time for their production and so so okay I need a valve. Okay that valve u the first question is do we have in the warehouse? If not do we have a contract with some vendor that can provide that valve? If not we need to go to an RFP and if not we need to go to somewhere else. So all that process is being automated in terms of having an AI agent running that procurement process and understanding from the moment we need the piece to the moment we deliver the piece how we shorten that time. on the software development space we have been using it with our Koda for many many clients. Koda is our coding agent in which we have taken care of a lot of",
        "start": 574.08,
        "duration": 1462.4000000000008
    },
    {
        "text": "the moment we need the piece to the moment we deliver the piece how we shorten that time. on the software development space we have been using it with our Koda for many many clients. Koda is our coding agent in which we have taken care of a lot of repeatability, reuse of pieces of code, how to connect with coding styles, many of the things that corporations really need when they develop software. And we have helped our companies not just to create new software products but also to to migrate for example from very old software to next generation software in a fraction of the time at a fraction of a cost and that has been extremely successful in some of our customers in the financial services space in in in Europe and in the US. so those are three specific cases in which we have been using AI and these next generation models, next frontier models as a a real help, real value for our customers. And can I ask you so you talked in the beginning about these are probabilistic systems. So when do you know let's say you're in the procurement phase that you can trust the system to automate it? Well, look, I think that all these probabilistic systems must must be matched with human supervision. I mean, there's not any of those systems can work without a human supervising at enterprise class with humans supervising what those systems produce. So I think at the end of the day you gain a lot of efficiency when you chain the agents together but you can never forget about humans just checking what those agents are producing because sometimes they could hallucinate they could do something that is wrong. so I think human intervention as always is very very important. but humans become much more efficient supervising those things than you know just running the whole process by themselves. So I think that this is a quite interesting way of understanding. I think also that with time and with models becoming better and I don't know if becoming better the the largest problem that you will face in any corporation is to put the right context in front of them all and that's the largest challenge. I mean one the context is correct the probabilities of hallucination goes much lower. So the largest question we need to answer to implement these things and make it you know enterprise class is about the generation of the context and in pretty much every company generating that context is extremely complex and that's why I'm saying this probability system when you meet mix them well it's about generating that context in the right mind in the right way for the current models not the future models current models to answer it right so most of our work has been how we prepare that context, how we prepare that prompt, how we create from the information we have the most",
        "start": 737.76,
        "duration": 1833.5190000000002
    },
    {
        "text": "context in the right mind in the right way for the current models not the future models current models to answer it right so most of our work has been how we prepare that context, how we prepare that prompt, how we create from the information we have the most And one step more is to check by human if that answer is correct. You don't need to check every single answer. And there's kind of a lot of efficiencies that can be made on checking one answer instead of checking middle answers. so the final answer sorry instead of checking middle answer but those checking points are are being you know generated connected to having an enterprise class answer and this is extremely important right that that context piece that you mentioned I think we shouldn't underestimate it right it's these bots are great when the context is right u but then when you see them try to incorporate a context that's too large or expansive, that's kind of when things start to mess up. I mean, I was just speaking with an Amazon executive about this and talking about Alexa Plus, and I think the conclusion that we reached is that the hardest part of this entire application is to, you know, narrow down or to direct the bot to the right stuff. And that's why we've seen I I think that's why we've seen delays there. And the Apple intelligence issue is if you try to get all the data into the thing at once and you're not careful about the way that it looks for it, you're going to have a mess. Yes, absolutely. And and one thing more I think that we have all been expecting AI to solve problems that basically are problems of of a poor context and the current technology we have even if it doesn't gets better in the coming years which is not the case. the current systems we have, the current technology we have, if you put the right context, it gives you the right answer and and you can decrease a lot hallucination percentages just by creating the right context. Now, is that easy? No, it's not easy. It's it depends on the it depends on the kind of work you want to do. But but that's one of the most difficult things. So agree 100% with with that Amazon executive that was saying that. So you mentioned about like we we their humans will be checking the work of the of the bots. and it just goes to the question of like what the workflow of the future will look like. You know a way we've teased it out here is asking will we incorporate the bots into the person to a human's workflow or do does the human get incorporated into the bots's workflow? And when you talk about like the person a human employee will have to check what the bot's output",
        "start": 926.56,
        "duration": 2146.3200000000006
    },
    {
        "text": "way we've teased it out here is asking will we incorporate the bots into the person to a human's workflow or do does the human get incorporated into the bots's workflow? And when you talk about like the person a human employee will have to check what the bot's output that it's you know the bot has a workflow and we become effectively auditors. Is that is that how you see it? Yeah. long answer short the answer is yes. Now let me let me try to be more specific. I will launch a new way of engaging with us which is called the AI pots. those AI bots are kind of the equivalent to produce software with humans but now being done by Agentic AI. so one once you buy a subscription to one of those AI pots AI agents on the back will produce that software that you want or that you need. And of course in order for that software to be enterprise class and to be up to the standards that we have been used to we need to have some human supervision checking yeah the software that these AI bot are generating is you know is correct. and that brings us to a whole new model of how to engage with you know a professional services company. You need to solve a problem. That problem gets solved by agentic AI. You have a monthly limit of tokens that represents like a proportion of the effort that that took to be created. You have full transparency on which are the assets that has been created, how many tokens each of those assets, you know, required. , but someone needs to check the integrity of those, you know, of those pieces of software. and someone must check and must use kind of a supervisory you know process to understand that what we are producing with those agents makes sense and it connects right with environment and connects right with the coding styles and and many of the things that at enterprise class you need. Sometimes it's funny to to hear some other you know companies talking about generating code. they're kind of reinventing the wheel each time they need to create something. And corporate, you know, software development when you're trying to blend into a a a repo that has one billion lines of code is not about that. A lot is about reusing what you already have there. So when you are creating that, if you're reinventing the wheel every time, then you're not doing the things right. So those human supervisions are taking care of course our koda take cares of that by itself but it's taking care of that we're using the right components each time we are trying to develop something instead of reinventing the wheel from the scratch so I think this is one of the most important things but to your question absolutely yes AI pot for us is an agentic",
        "start": 1086.96,
        "duration": 2493.7610000000004
    },
    {
        "text": "it's taking care of that we're using the right components each time we are trying to develop something instead of reinventing the wheel from the scratch so I think this is one of the most important things but to your question absolutely yes AI pot for us is an agentic humans to ensure at our cost that the quality of what we are producing is in line with what the company is expecting from Globat. so yes it's is aentic an agentic process being supervised by humans. The initial version of AI was humans accelerated by AI. The next generation is AI supervised by humans. It's like when you were talking about internet in the early days and internet was a tool to serve you know someformational websites and some emails and suddenly happens that someone invented commerce on top of internet and it was very successful and then someone invented social on that you know and then someone invented you know an application like yuber so those next generations ways of use AI are still to discovered and it will challenge many of the business models out there. I don't know if you if you if you saw the open AI agentic you know agentic commerce solution basically you're letting letting agents to buy for you. So instead of driving the traffic into let's say an Amazon, they will send the send the agent to Amazon, they would purchase and the the guy that was interested in buying that will not even know if they don't want even know what has been where where they buy the thing. They just getting you know like a blue t-shirt that's it. So this is changing how brands how how relevant are brands. This is changing how commerce is being executed. This is changing how massive entertainment companies are driving users to their websites. how they are controlling what is said about the brand. Everything my friend is changing. so this is one of the most amazing times in the history to have a company like us that is overlooking all those things and trying to make those things to work properly for corporations. And so for you selling your services and technology, you've you've shifted pricing, I think that's what you said. Does that mean you go from let's say like an hourly model to charging for the output of the agents? Like how does your pricing shift? Correct. we're we're changing from I mean we're still doing hourly model and fixed price models which are the dominant models at globant. but we're seeing like a new way of charging for it. It's like the same way that open charge you is like per tokens per consumption you know in this case would be like supervised tokens because you are sure that what is being produced is the quality that you need. So what we are charging is per consumption is a monthly subscription that includes a certain amount of of",
        "start": 1262.4,
        "duration": 2862.639000000001
    },
    {
        "text": "is like per tokens per consumption you know in this case would be like supervised tokens because you are sure that what is being produced is the quality that you need. So what we are charging is per consumption is a monthly subscription that includes a certain amount of of faster and you can consume them faster. You can create software more reliably. You can create like a much more AIcentric way of of of creating technology. and we're not using just for technology. We're using that for creative services too. We're using that for for enterprise migrations let's say SAP or whatever you know so we're using this AI pot concept for pretty much all our offering in the digital in the enterprise and the you know creative and and marketing services studio. So this is the the next generation of pricing I think is is is it will be more similar to what we do than to what it has been done in the industry for many many years. And by the way, I I haven't been Brian Globin since the last 22 years, right? And forever my largest, you know, concern was how to scale the company using technology. And we have been using AI since the last 10 years. You think we got a patent in 2020, very similar to Copilo. We didn't have enough money to to be able to scale it up. But but we knew Yeah. We knew the technology. and my big dream was at one one day I will be able to change the way I do this business and remove a lot of the friction that is present when you're trying to develop something. And let me give you a parallel. when Amazon started to sell servers just by the click of some you know things that you choose on a website and you put your credit card you well before that process was an extremely complex process it was about buying the servers getting the hosting getting the connectivity once you get the hosting all the capital expenditures of buying the servers for the peaks right and suddenly next generation offer came to the table and said you don't need to worry about all this just you know buy whatever you need and you will get a commission in a few. So they remove friction from the process of scaling up a company and my aim is to remove that friction from the process of creating technology in a supervised manner and and that's where we are going with our AI pots offering. Okay, I want to end on this. you you've used this word pastor. it seems to be the word of the of the the year the past couple years and you're somebody again who you see businesses with problems that they want to solve. Often they're coming to you to solve them with technology and now you have AI. how much faster is the business",
        "start": 1450.159,
        "duration": 3203.841000000001
    },
    {
        "text": "to be the word of the of the the year the past couple years and you're somebody again who you see businesses with problems that they want to solve. Often they're coming to you to solve them with technology and now you have AI. how much faster is the business faster is it going to get once companies start to figure out how to put this technology into action effectively? I think we're in the early days, my friend. , we're in the early days. I mean, things are moving fast in certain areas as I described at the very beginning and much slower in in many others. And and still remember, I mean, there must be five or six% of companies that are technically savvy to implement these technologies by itself. But then for the rest of the people it's like like a jundle that is growing every day and doubling every day in which you need to understand where to where h how to where are the roots to get somewhere and and and you know for 95% of the companies or maybe more 99% of the companies getting that real path is a big problem right it's a big problem because it's difficult to implement but also difficult to move in that jungle of AI complexity So I think that the speed of implementation of all these new technology, the speed of adoption of all these technology will be modulated by how companies like Globant can you know make that process faster for those customers that are not savvy technology savvy enough to make it happen. So I think that that study from the MIT saying there are some big portion of these implementations that are failing has a lot to do with that. Many companies don't have the way to scale this up. They don't have the playbook to scale this up. And that's a problem because then you start doing things and you're not getting the results. And when you don't get the results, well, I won't invest on that. Right? So I think there's a very good healthy I would say doses of realism that is happening on the AI space right now that is signaling that okay this technology came to stay is not that easy to implement it's not that easy to choose in that jungle but is something that can change our business so everything will depend on how many or how good we are right companies that go and are to bring that thing to the market and create real business change and real business acceleration for our customers. So I don't know that that that's that's my view on on that on that subject. Okay, great. And so if people want to check out Globant and see how you work with companies that are looking to put this into action, where would they go? they can go to globan.com or globan.ai and they will get you know the",
        "start": 1623.44,
        "duration": 3528.079000000001
    },
    {
        "text": "on on that on that subject. Okay, great. And so if people want to check out Globant and see how you work with companies that are looking to put this into action, where would they go? they can go to globan.com or globan.ai and they will get you know the technologies and make it happen fast. There's that word Martin. Great to meet you. Thanks for coming on the show. Thank you very much, Alex. Bye-bye. All right, everybody. Thank you for watching. We'll be back on the channel with another video soon.",
        "start": 1787.679,
        "duration": 3558.8010000000013
    }
]