[
    {
        "text": " Let's talk about whether AI will have us all transacting within chat bots [music] and whether your purchase data might help AI agents give you better recommendations. We're joined today by Rubel Burwalker, the global head of growth products and strategic partnerships of Visa in a conversation brought to you by Visa and Rubel. It's so great to see you. Welcome. Thanks for having Alex. Okay, so let me start with this question of conversational commerce or you know that's a jargon way of saying maybe we'll just all kind of talk to the things that to talk to chat bots and then be able to purchase right within them. It's been a it's been a dream of of social media companies of messaging companies for a long time that maybe one day because the messaging app will have your context and maybe some of your preferences that you'll prefer to shop there versus like let's say you know a website with a graphical user interface. but some are saying that maybe generative AI is the technology that can finally get the industry there that can finally get people saying you know what chatt for instance knows me and so therefore I'm going to ask it you know what jersey should I buy or what gift should I get and then it will go ahead and facilitate that. Do you believe that this is going to be the thing that finally enables this sort of long longunning tech dream to come true? look TLDDR I think the answer is yes. , but the long form answer to your question is we've actually seen commerce get intelligent quite in a in a relatively quick evolutionary manner over the last 15ish or so years. And what we're seeing that's happening with a Gentic is it's just like what we call the next evolution of how intelligent it could really really get. Look, as as as someone who's been at Visa for a very long time, I think I I see myself as a little bit of a historian, which is we've seen about in the last 35 years or so, we went from what we called originally online commerce, which was the original, you know, sort of like tea leaves or e-commerce was headed and e-commerce was all about access because you wanted to access goods and services and pay or get paid without actually being in in front of a merchant or a seller or a buyer. Then came mobile commerce which became all about accessibility which was you wanted to be able to buy pay get paid while on the move. And finally I think in the agentic era which is like another step in what we call intelligence in the way commerce is going to move. It's going to be all about autonomy and personalization which is everything you did you can now do it better with better data payloads with better personalization with you know",
        "start": 0.08,
        "duration": 325.51899999999995
    },
    {
        "text": "agentic era which is like another step in what we call intelligence in the way commerce is going to move. It's going to be all about autonomy and personalization which is everything you did you can now do it better with better data payloads with better personalization with you know you are as a human being and what sort of like preferences you really really have. So I again I think the short answer is yes. , and you know, the tools that are going to get there, a lot of those tools have been in development for a very, very long time. And I think now with the advent of what LLMs and Chad GPT and a bunch of other AI companies are doing, I actually think yeah, it's going to get it's going to get really, really fun. Okay. So, you are a believer then in this vision. And it sort of leads me to a natural follow-up, which is, do the chat bots sort of become the storefronts of tomorrow? Are they going to be the place where we do most of our transacting? How does a chatbot fit into the picture of, you know, transacting online? , it's it's the the way we think about it, Alex, is, you know, before online commerce existed. , you know, you walked into an AMC theater to buy a movie ticket, then you decided to buy sometimes online, then you sometimes decided to buy it because you clicked on an ad on a social media website through their app. And that doesn't mean that physical commerce went away. It just they were like the share shifted toward more channels in the way human beings actually interacted with it. And we think with the Gentic you're just going to see another channel that's going to be very helpful in certain types of commerce in certain segments of commerce. which doesn't mean that you know the existing channels are going to go away. I just think there's going to be a good amount of migration from how things work today to a portion of that is going to move to Agentic. So like that's right that's that's that's that's the hypothesis we are working with. Yeah. It's sort of like you know they we we have these conversations okay is the AI device going to replace the phone and the answer is always like no it's not but it's going to be there. It's going to factor. I I wonder though in terms of commerce it's very interesting because these bots you know I when I was reporting for instance on this this was 10 years ago Facebook Messenger had this platform where they wanted I'm sure you remember it they wanted you to transact there and one of the things that they always told me is if you're in a messaging app you're effectively you have a single source of your conversation so they know who you are",
        "start": 162.879,
        "duration": 588.9600000000003
    },
    {
        "text": "had this platform where they wanted I'm sure you remember it they wanted you to transact there and one of the things that they always told me is if you're in a messaging app you're effectively you have a single source of your conversation so they know who you are stored with LM it's even more advanced right it's like they know who you are. They have your payment information probably and they have a deep understanding of your interests, your preference, sometimes who's in your life. So the potential there to me seems vast. Indeed. And I think what's changed from the example you pointed correctly pointed out is now take all of that personalization and context and then you add how the LLMs and the agents interact with the outside world and their understanding of the outside world and then connecting those back to your preferences which is where you start to really really connect the dots. So while you may have had a payment credential stored in a messaging app for example and you know we've seen wallets in parts of Asia, Latin America do this very very well. Ultimately it was still while it was intelligent it's still dependent on sellers like onboarding themselves onto these platforms to make themselves available to consumers with their preferences. And I think in the new agogentic world, I think that becomes an even easier sort of like connection to make. So I think what he's saying is accurate. And I think it's going to become even more real with how quickly we're seeing how quickly we're seeing thisic bots like be so useful in things that human beings would ordinarily spend a lot of time doing. Right. explain how it becomes easier because that's a sort of it seems counterintuitive to me because you would imagine that you know storefronts or whatever still have to go through the same process to on board is it that the when you let's say you're using for instance I don't know the Atlas browser from OpenAI and you say book me a plane ticket you don't really need United to participate you know for the for the browser to go in and and make that deal I'm just I'm just spitballing here talk a little bit about these connections. Yeah. Actually in some ways in in in the use case that you just pointed out, I think a United becomes even more important because I am a you know like ardent United user. They know exactly what I like. They know I like the aisles isle versus window. They know what kind of meal preferences do I have. They have a long amount of history on how I like to fly. they have a very very good understanding that typically when I'm trying to go to say Asia I try to like fly direct like at you know like usually at night because then I can just sleep",
        "start": 296.88,
        "duration": 887.7599999999999
    },
    {
        "text": "They have a long amount of history on how I like to fly. they have a very very good understanding that typically when I'm trying to go to say Asia I try to like fly direct like at you know like usually at night because then I can just sleep United has an enormous amount of history and I typically try and stick to United although today if I'm looking for flights to go to Asia I could have probably have cheaper options but I prefer to just stick as a loyal member of United. Similarly sometimes I like using a specific bank card that I like that I have a lot of loyalty toward. So that definitely matters a lot. I think you know brands and brands knowing users and their preferences and sometimes it's guess money cost as a way to a role but I also believe like you know how does a brand feel like say you're flying Singapore Airlines and you really like the soft product in the way you get treated as a customer and those things don't really go away just because there is a better convenience of sort of like getting to the end answer. I almost might sort of like restate the problem statement which is if I am using a agentic surface whether it's a aentic browser or a conversational commerce type interface the question at least in my in my experience and everything that we hear from you know clients and merchants is typically less to do with go book me a plane ticket it almost always starts with a much much broader funnel of discovery which is and I'll give you my personal example I have two daughters they're very and we're trying to plan to go to Hawaii this Thanksgiving. So my question actually start with book me tickets to Hawaii. It's usually like, hey, I'm trying to go to Hawaii sometimes around sometime around Thanksgiving. What do you recommend is a good island to go to? What might be a good day to fly? Where do you think I should probably stay? And so it's starting like much much further up funnel before I even have decided which island to go to, which airline to take, which day to fly. And that sort of like leads me to doing an entire discovery process until I sort of like get to okay, I've decided I'm going to fly the day before Thanksgiving and I'm going to come back on the Sunday morning of so we can get some sleep because I have to go back to work the following day. I'm going to try and go to Maui and I'm going to try and stay at Marriott because, you know, I'm a big Marriott loyalty Bonvi member. And by the way, I really like it because they have like, you know, three extra pools which my seven-year-old daughter will really really enjoy going to. So payment at",
        "start": 448.08,
        "duration": 1138.9589999999996
    },
    {
        "text": "Maui and I'm going to try and stay at Marriott because, you know, I'm a big Marriott loyalty Bonvi member. And by the way, I really like it because they have like, you know, three extra pools which my seven-year-old daughter will really really enjoy going to. So payment at making a it's not even commerce yet it's still discovery and as I go through the discovery journey there is going to be an enormous amount of like you know brand influence personalization influence and I think the LLMs and the agentic surfaces can actually truly make that process so much easier. If I tried to do this a couple of years ago, it would have taken me a couple of hours. But now I think with the help of these tools, it's made it so much easier. And then the last mile, which is when you when you sort of go through your discovery process and then it gets converted into an actual commerce is where all the focus is is. I don't know if that answers your question, Alex. Yeah, it definitely does. And it's very interesting for me to hear your perspective because of course you're coming from Visa. That's why this conversation is interesting, right? because you you are in active discussions with the platforms about the way to facilitate this in the best way. and of course you I think Visa has ways if you're if you're Visa user you you might want Visa to help make this you know make the recommendations more personal. I'm just spitballing again but talk a little bit about the conversations that you're having with the platform and how you know Visa might be able to enable this in a way that you know we haven't seen yet. business. Yeah. I think look there's one thing we pride ourselves at Visa amongst many many things. The one thing is you know I wake up but Alex do you have a Visa card? Of course I do. and where you based again remind me are you East Coast? East Coast where? Yeah. So you know you can in New York you can probably you know get on a get on a plane of three airports that are close to you and fly to what 150 170 countries around the world. You can whip out your Visa card and it works exactly the same way no matter where you are and there is some form of magic in how that works and you feel like your money is safe and if you didn't get the good or the service that you paid for with your Visa card you feel like you can call your bank issuer for the card you know with the Visa guarantee and the brand and what it represents to a user. Now that's just true about what we try to do regardless of which channel a Visa card is being used whether you know you",
        "start": 575.839,
        "duration": 1393.5990000000002
    },
    {
        "text": "like you can call your bank issuer for the card you know with the Visa guarantee and the brand and what it represents to a user. Now that's just true about what we try to do regardless of which channel a Visa card is being used whether you know you Colbo Sri Lanka and decided to make a purchase or you decided to buy something from a seller in the Philippines or you decided to use your a mobile app and bought you know like you bought some stable coins or you bought a bunch of Bitcoin. It almost doesn't matter how you want to you how which channel and which market you want to use. You kind of want to use your Visa card and you expect it to work almost exactly the same way no matter where you are. And there is an enormous amount of machinery and work that goes in to make that real because remember every market is different. Every market has different nuances. It has different regulation. It has different data localization requirements. It has different you know things and the requirements that you need to meet. And when we think about agentic commerce, I think we are enormously focused on as these new incredibly great technology platforms come come to come to pass and consumers use them, we want to make sure that their Visa card in those platforms for any type of commerce that they want to do works exactly the same way regardless of what they're buying, whom they're buying it from, and where they're buying from. So, a lot of this is like not super sexy stuff, but it is the stuff that we want to make sure that works with as little friction and as little fraud as possible. And we spend an enormous amount of time with these platforms, with big tech companies, with our acquiring community, with the merchant community, with the issuing community to solve those problems. And obviously I think you asked about personalization and we actually think that personalization in general can be a very very helpful barometer to even further get to better discovery with the right consumer consent. We are big believers in data privacy. We are big believers in giving consumers full control over where their data is and things like that. that we've introduced things like data tokens help consumers with better signals that they have associated with their credentials that you know platforms can use to provide a better discovery process. So, so we sp we spend a lot of time doing these things. I'm curious to hear you talk a little bit more about what the discovery process could look like because this idea that, you know, we might provide the LLM with lots of information about us, I think we we're already there. I mean, we probably share more with LLMs than anything else. And we're being honest, some of us are in love with",
        "start": 705.04,
        "duration": 1670.5579999999993
    },
    {
        "text": "discovery process could look like because this idea that, you know, we might provide the LLM with lots of information about us, I think we we're already there. I mean, we probably share more with LLMs than anything else. And we're being honest, some of us are in love with So, how could this discovery process look as as as Visa gets involved? , I think the simplest way to think about it is, you know, you use your card to do a number of things in life and a lot of those are frankly not used at LLMs, right? you walk down the street to like Pete's or Starbucks coffee and you like to stay at the Ritz Golton versus like a Motel 6 and you typically like to fly United versus Spirit Airlines. Now those are just things that while your Aentic platform surface area LLM may have a lot of information about you, those are just like personal preferences tied to your long-term spending preferences. And what we believe is if the data is private, if it has full consumer consent, if it is totally tokenized and no raw data has actually moved anywhere, but can there be a bunch of signals that you know you compared to like other spenders that a agent or a company can sort of like consume based after you've like fully consented to it and after cons consuming say you say I want to go to Tokyo and I want to live in the I want to stay in the Ginsa district in Tokyo for a week. , you know, and give me hotel recommendations. Now, knowing that you like to stay at the Rcultton or knowing that you generally have a propensity to stay in like a signal that tells that you have a propensity to actually stay in a luxury hotel would be very helpful for a LLM to say, oh, you know what? Here are the options which we think could be a lot better fit for you than a bunch of other options that might not. And at the same time you might like living in host and you might like being you know closer to the community or you like you know some form of like a Airbnb type share rental. And I think all those signals really really matter to give you a much much more richer personalized some like recommendation. And if you get a much more personalized recommendation that recommendation getting converted into a commerce transaction just increases by a lot lot more. for us all in the service of you know making sure that we're making true commerce happen. Definitely. I was going to say that it it even makes sense like let's say I'm you know as I'm starting to use LMS more and more for search you know I have I say can I you find me hotel if it knows I have a certain hotel brand I like like",
        "start": 846.48,
        "duration": 1960.9589999999992
    },
    {
        "text": "going to say that it it even makes sense like let's say I'm you know as I'm starting to use LMS more and more for search you know I have I say can I you find me hotel if it knows I have a certain hotel brand I like like there or even as simple as like hey I'm at this conference where can I get a cup of coffee and what's open now if it knows I'm more of a Starbucks than a pizza person you know maybe that's where it goes and to me that's sort of again it's like the getting to this utility thing of where where you want to end up in conversational commerce where it's easier than everything else. Seems to me like that's the only way for it to take off. That's how it gets there. To totally and and and and the and the positive of that is that it's actually saving you an enormous amount of time, adding more discovery searches to get to the answer you really want. And it's sort of like almost like solving a time problem, a discovery problem in ways which we think is very very positive for the end user. Now, here's a question. So, we've talked a lot about Agentic stuff, , and we talk about Agentic, , AI and what's real and what's not and the risks and the benefits of it a lot, , on this channel. And I can't help but thinking as we talk, , we're obviously going to put a lot of trust into these things. what what is the visa reproach going to be if let's say my AI agent goes out and uses my Visa card and buys a lot of stuff for me that I didn't want. You mentioned you can trust Visa. You go anywhere, use Visa, Visa's got your back. Does it have my back if an agent goes out and buys some stuff that I really didn't want? look, that's that's the fundamental question. we spend an enormous amount of time fixing and thinking about and again like I can give you a parallel right what does that really really look like in a e-commerce world that's not agentic yet you know someone can't actually take your card and actually use it you know PII and PAN data get gets leaked all the time you know hackers have access to like credit card information stuff always happens and so everything that we design and build we are deeply deeply focused on how do we make the make sure that the vectors and the surface area of fraud is as minimal as possible. So in the visa intelligent commerce APIs that we introduced earlier this year and some of the work that we're doing with our partners, we are uber focused on ensuring that any visa credential that is used in an agentic environment has a high level of trust",
        "start": 994.8,
        "duration": 2241.358999999998
    },
    {
        "text": "minimal as possible. So in the visa intelligent commerce APIs that we introduced earlier this year and some of the work that we're doing with our partners, we are uber focused on ensuring that any visa credential that is used in an agentic environment has a high level of trust let me explain what that means. So if say if you have a Chase Sapphire card that you're using for a specific you know aentic app on your iPhone 16. Now if we can tie your root of identity to that app on that device and we can assign a token where if someone actually tried to use it anywhere else not like that's not you or not in that app or not in the device that transaction just wouldn't work. So we actually up front are working very very hard to create like high authentic high authentication when a visa credential is actually added for a purchase transaction in the beginning because that in itself just reduces the amount of fraud that could potentially occur when that happens. That's one. Then we we working you know with the industry about figuring out like how do you make sure that the right biometric authentication is captured at the time of giving a purchase intent right just because you have a card associated with a aentic app doesn't mean you're actually using it but at some point you're like actually I want to want you to go use this card to buy Taylor Swift tickets for next Friday and it might ask for like a biometric authentication of some kind assuming you know you haven't really used that card for a purchase before. So like and by the way those tend to have like very very very very high levels of network security that we work with the industry to ensure that happens. And then the third thing is we as this becomes more and more common or will become more and more common in the coming months and years, we've introduced incremental data payloads on things what we call in our APIs called payment instructions and signals where we actually try to match the consumer natural language intent to the thing the agent is going to buy before we in before we actually release the credential to be able what we call like a cryptogram before the credential can actually even be used for a visa for like a visa transaction. So now again those are the controls and limits we are trying to sort of like introduce in the payment journey to make sure that we're trying to keep as much fraud you know friendly fraud synthetic merchants bad agent behavior out. We don't and again again we're very very early days so it's very very hard to tell what the data is going to tell us. In some ways, we we're going to be like mapping and looking at this data very very closely as we've",
        "start": 1137.679,
        "duration": 2517.677999999999
    },
    {
        "text": "merchants bad agent behavior out. We don't and again again we're very very early days so it's very very hard to tell what the data is going to tell us. In some ways, we we're going to be like mapping and looking at this data very very closely as we've more and more transactions occur and start from an agentic environment. Like what kind of like you know behaviors are we seeing? Are we really seeing you know where you ask for a black bag and the agent bought a blue bag? Are we really seeing mistakes are going to happen at the merchant end? Are we really going to see some hallucination? We don't we don't know yet but we've made we've added the controls in place to make sure that we can try and reduce it. And as we learn and sort of like get more mature and smarter about the space, you know, we're going to evolve our product to make sure that it actually fits the consumer needs. It's a little bit of a trade-off between making sure that there's not a lot of consumer friction, but a consumer's money is being safe is kept safe. And we're going to hopefully sort of like use some of this data to do better on disputes and chargebacks and hopefully, you know, make sure that we are getting smarter and our community is getting smarter. So when you actually do call your bank and say I ordered a blue bag and a black not a black bag and if you have the captured data that actually said you actually said a blue bag it'll be a lot more easier for us and the banks and others to adjudicate whether the dispute was actually valid or not. So there's like it sort of like falls through the entire visa ecosystem that let's make sure that we reduce the the vector of fraud and then do the best we can to try and use data to make better judgment calls on like what does this really look like and then you know tweak our product to see how this all of this evolves in the coming months and years. How long do you think it's going to be till you have that data? I guess that's a way of asking like how when is this going to be real? Look, I think we're I think you're seeing starting to see versions of it become real, but it's again very early days and these tend to be like, you know, very very specific transactions. You're starting to see, you know, some of this go live in you're already seeing some form of aic transactions in different way, shapes, and forms with like various AI platforms. But again, it's very early. It's like at limited merchants. It's like, you know, in beta is largely in the United States. I I'd say in about 6 months or so we'll start to see like",
        "start": 1277.679,
        "duration": 2743.2769999999973
    },
    {
        "text": "of aic transactions in different way, shapes, and forms with like various AI platforms. But again, it's very early. It's like at limited merchants. It's like, you know, in beta is largely in the United States. I I'd say in about 6 months or so we'll start to see like data sets where we can start to like draw conclusions. That's like my best guess, but you know it all remains to be seen how quickly some of these things get adopted. Okay, so 6 months I mean that's pretty soon. So, we we will really start to see how this stuff is going to look like when it's out in people's hands, which is which is I think, you know, it's good news if you're counting on this to to be a a real movement within technology. And, you know, it's so interesting. We we often talk about like, you know, you know, Assistant X just go book my flight like it's like the most easy thing in the world. U but as actually hearing you talk about it, it's a very serious technology problem. I mean, a lot of work has to go on to m into making sure that that is something that actually can happen, especially if it's going to use your credit card. Yeah, that's totally right, Alex. And like and it's especially important that we get this right even though there's a lot of hard work involved in making sure you know the industry comes together and does this because unlike say you know when was Joe Peshy born, you can get the date wrong and nothing's you know not great. Exactly. But the money right like you know every line of code we write every protocol that we release every token that we issue on every card like just ensures that you know a student's paying their fee you know a parent is sending money home a small business is making another sale and we take that responsibility very very seriously when it comes to like the visa ecosystem now there is some work on the back end here to make this stuff work more seamlessly for instance Visa is working on something called the trusted agent protocol. Can you tell us a little bit more about that? Yeah, I'm I'm happy to. So one thing that we're starting to realize is as and when agents have payment credentials associated with them to make purchases you know you're going to see some really really good applications of that in you know some of the things that you know some open AAI and others have released like ACP is a good example AP2 is another very good example and you know we're working with them to figure out like how do we make sure that cards are safe and tokenized and all of that but ultimately you know we still we still have to make sure that there are like",
        "start": 1393.28,
        "duration": 3000.5559999999964
    },
    {
        "text": "good example AP2 is another very good example and you know we're working with them to figure out like how do we make sure that cards are safe and tokenized and all of that but ultimately you know we still we still have to make sure that there are like in nearly 200 markets and ultimately agents are going to go have to transact at them on behalf of consumers with depending on you know you can debate how much level of autonomy they're going to have and we want to make sure that the existing web infrastructure that that works today for e-commerce also works for an agentic commerce world but in order for that to happen there are different problems that have ar arisen now remember in the regular e-commerce world bots Bots were not a good thing, right? For the last 30 years, like bots meant things. Yeah. I mean, the, you know, the e-commerce industry have spent a lot of time trying to keep bots out because typically it meant that someone was actually trying to get in and do bad things. Now in the new world typically bots can actually represent a good thing which is bots can come in and you know they can either like scrape through your website and maybe commoditize you and do price discovery which is not so great as a merchant but they can also make a purchase on behalf of a user. So how do we make sure we differentiate in the existing web infrastructure what's good and what's bad. So we've done a bit of work with a number of our partners including you know partners like Cloudflare that do a really really good job at the CDN level to analyze bots and bot traffic and what to make available in a merchant environment like you know pricing or product discovery or product pages you know deploy that data to merchants to make those decisions and when a bot which has sort of like gone which has a visa token associated with it cloud can now recognize and say oh okay so this has a intent to buy which is great. So I can we can make that thing available to the merchant and merchant can actually make it accessible to like parts of the website they do want to access you know and you know obviously merchants have a lot of work to do to upgrade their infrastructure to make it merchant readable to make it agent readable but you know if they know there's an intent to buy that's a positive sign then in addition to that if we are able to pass some form of a consumer identifier to say oh it's really alexgmail.com I already have sold something to alex alexgmail.com in the past and I know Alex's preferences I can actually give it a better select rate I can give it a better product experience internally",
        "start": 1524.159,
        "duration": 3263.1959999999963
    },
    {
        "text": "are able to pass some form of a consumer identifier to say oh it's really alexgmail.com I already have sold something to alex alexgmail.com in the past and I know Alex's preferences I can actually give it a better select rate I can give it a better product experience internally merchant can know it has some form of like a payment credential associated with it doesn't have to be a card it could be any payment credential that's very very helpful for me to know so what we're trying to do through our trusted agent protocol that you know we like that the industry has adopted including all the networks which is it's positive in a way that it provides additional data for end merchants to make better decisions on can I let this agent in? Does this agent have a consumer identifier that's going to help me provide a better sort like you know product outcome to the agent to to buy? Does this p does this agent have a better pay like a payment credential that I could use for a payment experience? And we think ultimately the world is going to you know it's going to be you know we're going to see a lot of like fragmentation in the near term. We're going to see a lot of interesting protocols and a lot of different ways and experiences where this is going to work. And we're going to support all of them because we'd like to we want to make sure everything is compatible in the way Visa cards work with our authenticated tokens. But I think the trusted agent protocol just makes it very very easy to use the existing infrastructure the way it works with no real work from the merchants to be able to let agents shop on their websites. So that's where we're very very focused on right now. Okay. So we started big picture. Let's end big picture. One thing I like to say about this movement or industry or technology is there's still a lot of ifs. I mean even Sam Alman talks about how some of the investment might be a little too frothy. we know it's it's very useful today in some areas. and then the question is can it how will it whe whether it will reach its potential you know will LLM keep you know keep scaling and will reasoning actually prove out as a as a valuable technique that scales is the investment going to pay off? So let me turn it to you and ask you how real do you think this gets? Is this a a truly transformative technology or do you think we're like still in wait and see mode? And if you do believe it's transformative, what makes you confident about that? , it's an excellent question, Alex. I'll tell you purely from a commerce payments perspective, I truly do think it'll be very very transformational. ,",
        "start": 1658.799,
        "duration": 3521.516999999995
    },
    {
        "text": "or do you think we're like still in wait and see mode? And if you do believe it's transformative, what makes you confident about that? , it's an excellent question, Alex. I'll tell you purely from a commerce payments perspective, I truly do think it'll be very very transformational. , confidence because, you know, we actually do a lot of survey sampling with a lot with a with a lot of users around the world. We talked to a lot of merchants. We like and like a good example is we recently talked about how like four or five months ago we had seen an increase of roughly about 1,200%. In in aentic traffic to merchant websites that number in itself has 4xed in the last 5 months. So that's just data telling us that the traffic to websites for merchants that are you know selling to pay to get paid is increasing exponentially. That's just data. Like that's not a hypothesis. That's just what the data is telling us. Which means that clearly there is a level of discovery interest that is showing up. And ultimately the thing that we've learned is it's all it's all about the funnel. So you know you if you're in a mall and the more foot traffic you get, some of that foot traffic is eventually going to get converted into actual purchases. And it's really really hard to argue with that premise if like you're going to have a lot of users using Agentic platforms to look at goods and services and things to look at and buy at at all these merchants is eventually going to get converted into commerce. So like that's just what the data tells us. Personally for my personal life like I use I use agentic models like for like 6 7 hours a day in my daily life in almost everything that I do and almost everyone that I work with you know as anecdotal as that is it is it is becoming a very very integral part of how we do work how we do commerce how we do discovery and it's it's hard not to imagine a world where some of that is truly going to get converted into like real tangible commerce. Now, how big and how large would that be and how quickly that would be? Like there's like no crystal ball for us to know, but so far the everything that the data tells us is is exceeded every expectation that we had even like a year ago for what it's worth. Rebella, if people want to learn more about what you're up to, what Visa is up to, or if you have any favorite podcasts or blogs that you know, subscribe to that you want people to check out, anything you want to throw out there for our viewers at the end here? , well, I think this this podcast is as good as as as as as detailed a",
        "start": 1789.36,
        "duration": 3798.9549999999963
    },
    {
        "text": "you have any favorite podcasts or blogs that you know, subscribe to that you want people to check out, anything you want to throw out there for our viewers at the end here? , well, I think this this podcast is as good as as as as as detailed a commerce in a while. So, okay, love to hear that. Okay, Revel, thank you so much. Really appreciate you joining. Thanks, Alex. All right, thanks. Thanks everybody. We will be back on the channel with another [music] video soon. Thank you for watching.",
        "start": 1929.919,
        "duration": 3828.316999999996
    }
]