[
    {
        "text": " OpenAI board chair and Sierra CEO Brett Taylor joins us to talk about how AI is changing software, whether the technology can push past its limits, and to share some lessons from the world's top tech leaders. [music] That's coming up right after this. Welcome to Big Technology Podcast, a show for Coolheaded and Nuance conversation of the tech world and beyond. We have a great show for you today. We're going to talk about how AI is changing software [music] with Brett Taylor, the CEO of Sierra. for those of you who don't know Sierra, it was founded in 2023. [music] It is an AI customer engagement platform. It's doing 100 million in annual recurring [music] revenue. 50% of its customers have revenue of more than 1 billion and 20% of its customers [music] have revenue of more than 10 billion. So it's right at the center of everything happening in AI. And Brett is the perfect guest to discuss with us about how AI is changing software and where it's all going to [music] lead, what the future of the graphical user interface is, what the future of user interaction is, and of course, we're here at Qualcomm Space at Davos to break it all down. Brett, great to see you. Welcome to the show. Thanks for having me. Okay, so I want to speak with you first about the way that AI is changing software, about vibe coding, and whether we should buy into the hype. Let me just talk to you about two stories that came across my feed over the past day. Dave Clark, the former worldwide consumer CEO at Amazon, just wrote on LinkedIn, \"Between last night and today, I built a custom CRM that actually fits how we sell. We tried configuring an off-the-shelf CRM for our sales cycle. There are too many fields we don't need. We're missing the ones that we do need. It forces a pipeline flow that doesn't match reality and we spend more time fighting the tool than using it. So I built what we needed. It took a night and a morning. We I had another connection on LinkedIn tell me over the past 2 months I rebuilt my company's business the non-engineering parts of of it the processes using clawed code and I've never felt more empowered. I'm trying to figure out whether all these stories of people building their own custom software actually will actually will lead to the change that many of them are promising or or whether there's actual meat behind this. You know, is Dave Clark's CRM going to fall apart in a week and it was just a nice post for LinkedIn engagement or is something real actually happening here? I'm quite optimistic about this trend. , I actually think the term vibe coding will be like information superighway where it's a term we don't use in the future because the idea that your software is something that you can",
        "start": 0.08,
        "duration": 319.359
    },
    {
        "text": "for LinkedIn engagement or is something real actually happening here? I'm quite optimistic about this trend. , I actually think the term vibe coding will be like information superighway where it's a term we don't use in the future because the idea that your software is something that you can expect rather than a novel concept. I have two things that sound contradictory but I don't think they are. So first is most of the the cost of software is in maintaining it not building it. , and that's why most people would prefer to buy a solution off the shelf because you want to amortize the cost of maintaining software among thousands of clients and not have everyone bear it. Just think your ERP system and a new accounting standard comes out. If every company in the world has to go vibe code that new accounting standard, someone's going to get it wrong. I've heard this before, but won't the AI just be like, \"Okay, I'm picking that out of the internet. That's the new standard. Now I put it in.\" It may. But I think the bigger point I was going to make is right now I think we're just imagining vibe coding our existing solutions. If you think of something like a CRM, it's a bunch of forms and fields in a web browser. I'm not sure that's even the future of software. The future of software is agents. So rather than having a web browser with forms and fields that we click on, we will delegate tasks to agents that will operate against a database somewhat autonomously. So I think the interesting thing is I think everyone's looking at all the software use and say how fast could I vibe code that I wonder if it's the wrong question because I actually think the more disruptive thing happening to software is the software used today will not be the software we use tomorrow the form factor will be different the business models will be different the cons consumption patterns will be different if you're generating leads and opportunities for your sales team an agent will do that if you're you know essentially auditing your financials in your ERP system an AI agent will do at who's making those agents is the question. And will you buy those agents off the shelf or build them yourself? And I think that's still an open question. Whether you can vibe code a CRUD app in a web browser, I think is maybe an interesting question on Twitter, but I don't think it's the most interesting question in software. All right, let's just unpack this a bit. , so a CRM or customer relationship management technology. , if you have one of those software tools that goes from the graphic user graphical user interface to a chatbot, , what does the interaction look like? And isn't it valuable to have I mean, not to stand up",
        "start": 159.76,
        "duration": 577.0390000000001
    },
    {
        "text": "bit. , so a CRM or customer relationship management technology. , if you have one of those software tools that goes from the graphic user graphical user interface to a chatbot, , what does the interaction look like? And isn't it valuable to have I mean, not to stand up have those dashboards where you can basically see what's going on as opposed to like have to like type into a chatbot what's going on? Well, how I I don't fully see how chat and and agents can replace the software stack that exists today. The word agent comes from agency and it just means AI has some ability to autonomously reason and make decisions. And so it doesn't mean the concept of a dashboard will go away, but perhaps everyone at your organization will have a different dashboard. Your head of sales, your head of sales operations, the CEO probably all very different things they're interested in. So every morning that agent might reach out to you and give you just the information you need. It's a new form of dashboard, right? But it's custom for every individual. And the form factor of the software underneath is actually very different because if you think about what it means to craft a dashboard, it's a lot of like database joins and things like that. If you think about giving an AI access all to all the information it needs to give you personal insights, it's very very very different. And I think that's why whether it's the birth of the web browser or the smartphone or now large language models and AI, it's a disruptive moment in technology because the incumbent software players their advantages all of a sudden start to look a little bit like disadvantages and it doesn't mean they won't all pivot by the way but it opens the door for I'll say AI native companies who are building software sort of native to that form factor. So I do think it will change. I think the importance of dashboards will go down. a point of a dashboard is so a human can stare at it and derive some insights. I think that probably AI can serve a very meaningful role in deriving insights from your data. And if staring at a bunch of colorful lines on a screen is the best we have, I'm not sure that's true. It doesn't mean all dashboards are going away, but you have to imagine that these AI agents are becoming progressively more intelligent than you. And if you're not relying on it to help, you know, find insights in that data that you were previously staring at in a dashboard, your competitors probably are. So I think a lot is going to change. And I think the interesting thing in Silicon Valley, you as you said, I've been in this industry for a couple decades, is it's a race. the incumbents need to transform themselves. the disruptors or insurgents",
        "start": 291.919,
        "duration": 844.158
    },
    {
        "text": "dashboard, your competitors probably are. So I think a lot is going to change. And I think the interesting thing in Silicon Valley, you as you said, I've been in this industry for a couple decades, is it's a race. the incumbents need to transform themselves. the disruptors or insurgents are trying to compete to create AI native applications in each of these areas will the you know insurgents and and upstarts becoming the incumbents before the incumbents you know transform themselves and I don't think it's foregone conclusion for any one of the incumbents but I think it's a really fun time to be in this industry all right so as the words were coming out of my mouth I was saying I can't believe I'm standing up for dashboards and just note to self when I'm doing podcast. I'm not going to stop stand up for dashboards anymore. Terrible decision. I I I I hear you on that front. but let's let's talk a little bit then about about the disruptive power to today's incumbents. Right. So you talked a little bit about how businesses might disrupt other businesses. I think there's a a belief now that it's individuals with these tools are going to be able to build their own instances. and that will be the threat to incumbent software platforms. So reading between the lines of what you just said, I don't think you really believe that it is going to be an individual building their own custom technology. You still think that companies need to be able to do this. It may be true. You know, it's interesting. I think it's very hard to predict the second order effects of the marginal cost of software development going down so dramatically. But it's interesting. So, I was for our first customer conference at Sierra, I was doing research and I was looking up in the wayback machine old wired articles and I found one from I think it was 1997 and the article was about banks failing to launch websites with login forms and spending tens of millions of dollars with consulting companies and how hard it was to go from read only to enabling someone to log in to like check their balance. It's trivial now. You could vibe code that probably during the course of this podcast. Yet, you know, most people when they're starting a commerce storefront don't start from scratch. They go to Shopify. Why is that? Well, you know, well, making a website was incredibly difficult in 1994. Something like a Shopify just adds more and more capabilities. Maybe it helps you with fulfillment. maybe it integrates all the other systems you use for delivery CRM. maybe it helps you acquire ads to drive traffic to each of your listings. I think as AI becomes easier to make, you just make software that's more and more high leverage and more and more valuable. And at the end",
        "start": 426.88,
        "duration": 1112.6379999999992
    },
    {
        "text": "all the other systems you use for delivery CRM. maybe it helps you acquire ads to drive traffic to each of your listings. I think as AI becomes easier to make, you just make software that's more and more high leverage and more and more valuable. And at the end software companies. Dave Clark, you know, is one of the great technologists of the world and grew up at Amazon and understand software deeply. If you're a, you know, CPG company, you know, do you have that kind of skill at your organization? Maybe you do, maybe you don't. But I think at the end of the day, most companies don't want to be software companies. They want to buy solutions to their problems. And if there's an opportunity to do that, I think it's actually smart. I don't think you should be in the business of maintaining software if that's not the core of what you do. And I think that's true of most businesses. Just to give you an example, in tech, when I started my first company, we built our own servers and put them in a collocation facility. Now we have no data centers. We just use the cloud like every other startup in the world. It's an entire department that isn't at our company. And it means we can be more self-actualized in what we do. I think the same should be true of most companies. So I'm hopeful that actually in the future the form factor of acquiring software will be acquiring agents. There will be I believe a different business model which is outcomesbased pricing rather than just paying for the privilege of using that software. and I think there will still be software companies in the future. I may be wrong. I just think right now we lack the imagination to imagine what this software does and we're just projecting all this technology through the lens of what we currently use which is not what we will be using in the future. So the market the if you look at the index funds the market has dropped software like 10% this year software bundles is that the market misunderstanding what's happening because basically it's been in reaction to claude code and claude co-work so is it the market misunderstanding what's happening or is the market seeing the seed of something which is that there's something big changing in software and if people can do this in their backyards or in their basements as easily as it's taken you know companies these years to build, then there's going to be a shift somewhere. I think the stock market wonders. It's sort of funny to talk about the stock market as a person, but the market we're talking about chatbots as people. So, let's Great. Well, let's anthropomorphize both. I think the stock market doesn't know which of those incumbents will make the transition. And I think that's what",
        "start": 564.48,
        "duration": 1369.6789999999983
    },
    {
        "text": "wonders. It's sort of funny to talk about the stock market as a person, but the market we're talking about chatbots as people. So, let's Great. Well, let's anthropomorphize both. I think the stock market doesn't know which of those incumbents will make the transition. And I think that's what know I think it's interesting if you look at the multiples on AI AI stocks and we can debate what that is versus software stocks it's the halves and have nots right and I think it's largely the markets wondering which of these companies will make the transition if you look back at the transition from to the cloud you know Microsoft went through fits and starts but it eventually came out quite strong but it wasn't obvious for a period that they were companies like seable systems which most of your listeners may not even remember but that was the number one CRM before Salesforce existed did not make the transition and I think if you look at all the incumbent platforms out there my strong intuition is people are saying yeah there's a there's a play there these are strong companies you know will they actually pivot I think the interesting maybe counterintuitive point that I would make is I think business model transitions are harder than technology transitions I think it was harder for most on premises software companies to move to ratible subscription revenue than it was to necessarily make something that ran in a web browser. It's a very different business model, revenue recognition, even sales cycle from selling, you know, Windows 95 and then Windows 98 to just have a, you know, always on system. I would argue that actually I think agents will go the way of outcomesbased pricing where, you know, for example, at Sierra we charge per resolved case for our customer service agents. I think if you made an agent to audit your financials, you should pay per audit. That's a very different form factor as well. And I think companies going through these transitions have to disrupt their technology stack to disrupt their business model. it may even mean that the revenue dips for a period as they come back out. And any public company CEO will tell you that's easier said than done. and so I think that will actually be one of the more interesting stories in 10 years when we look back and say who made the transition and who didn't. All right, let's end this talking about one of your former employers. You were the co-CEO of Salesforce. we started talking about CRM. So, let's end this segment talking about CRM. Obviously, Salesforce is a place where, you know, salespeople log their their call information and then, you know, their leaders can see how they're doing and judge the pipeline and, you know, make predictions on the quarter. does Salesforce become a a chatbot or what is the future of a",
        "start": 694.32,
        "duration": 1649.3579999999993
    },
    {
        "text": "Obviously, Salesforce is a place where, you know, salespeople log their their call information and then, you know, their leaders can see how they're doing and judge the pipeline and, you know, make predictions on the quarter. does Salesforce become a a chatbot or what is the future of a first of all, Mark's a great leader. So, if you're going to pick like companies who can make the transition, founder, great leaders, so never count him out at all. It's also a multi-product company. , you know, the largest product in Salesforce's portfolio, at least when I was there, was Salesforce Service Cloud. They bought Slack, Tableau, Mulesoft. And so, I think if you think about Salesforce is just managing leads and opportunities, it's probably too narrow. And so, you know, Salesforce has all this these assets. And the question is what is the quote unquote agentic manifestation of the value proposition they provide? And you know I'm not close enough to them anymore to really say black and white but they have a lot of great assets, great leadership to do it, right? But that distance is valuable because you can give us like some perspective on what you think a company like that will look like. Well, I mean it's the same of all whether it's Service Now, SAP, Salesforce, Adobe. You have to say there's a framework from Clayton Christensen. He wrote this book competing against luck called jobs to be done. What job does your customer hire the software to do? , and it's not to edit a field in a database. It's to generate leads. It's to manage pipeline. It's whatever it is. And if you imagine that job through the lens of an AI agent, what is the purest form of that technology? , and I'm not sure I know the answers to all those questions because it hasn't been my job to think about it anymore and I've been working on Sierra, but that's the question is can you make that transition as a value proposition and then say what is the business model for that new value proposition and and as I said it's a race because there's for each of everything I said I guarantee there's five startups trying to compete for that right now as well. And it's a question of it's the classic innovator's dilemma. So taking a step back, we've been talking about enterprise, by the way, very interesting what's happening to enterprise. So I think it's worth spending the time talking about it, but let's let's take a step back and talk about consumer for a moment. , if the internet was to just start up today from scratch and knowing that we have conversational AI and large language models, what does it look like? Like do we have a Facebook and an Amazon and a Google or is it everything just mediated by a chatbot? What does the internet look like if it just starts",
        "start": 835.839,
        "duration": 1907.5989999999986
    },
    {
        "text": "today from scratch and knowing that we have conversational AI and large language models, what does it look like? Like do we have a Facebook and an Amazon and a Google or is it everything just mediated by a chatbot? What does the internet look like if it just starts It's hard for me to imagine starting from zero today because so much of what we have in chat GBT was a byproduct of the internet existing. but we're for the sake of this thought exercise we're just burning it down and starting burning it down and starting from scratch. so first I'll say I think when when I was in college when I started college the front door to the internet were portals. So, Yahoo and Excite and the like. And it [snorts] was sort of a quaint time. You could list every website that was worth reading in a directory like the yellow pages. Very quickly, I think Google launched in 1998 and then sort of became took over on Stanford campus and then, you know, by the early 2000s, most people were googling things and portals were didn't go away but were no longer the front door for most people's experiences. I think chat GPT is already the front door for the internet for many people and I would say if you look at like chat GPT Gemini and the like I think your personal AI agent will be your front door to the internet. and I say that to answer your question because I think it really changes the way you use the internet. rather than getting 10 blue links and clicking on them, you might delegate some of that responsibility to your agent to maybe I when I planned my family vacation to Copenhagen last year, ChachiBT did almost all the research for me and so it really changes your relationship because it changed your relationship with all the content that you know ChachiPT looked at. I didn't end up booking Airbnb, but I probably would have if it if it had let me. So I think we're moving from a world of you know just you know clicking on links to companies having agents. This is what Sierra does. We help companies like Sigma and Sirius XM Direct TV make AI agents can talk to their customers and consumers over the next three or four years will have their own agents and that's a very huge change because I think it's quite personal but what will you delegate to your agent? , , you know, some things you'll probably care a lot about. Some things you may say, \"Hey, just go book that hotel for me on my business trip.\" If you're going on a family vacation, you might spend a little more of my time looking at the listings. But in those moments where you're delegating basically decision-m to your agent, it really changes a lot of the mechanics and economics of the",
        "start": 967.44,
        "duration": 2190.3989999999976
    },
    {
        "text": "for me on my business trip.\" If you're going on a family vacation, you might spend a little more of my time looking at the listings. But in those moments where you're delegating basically decision-m to your agent, it really changes a lot of the mechanics and economics of the that have been awesome optimized towards persuasion of humans. All of a sudden, we're in this brand new world. , so I think the internet's going to change a lot. , I think it's largely going to be very consumer friendly just because we can accomplish more with less thanks to the prevalence of agents. But it will change pricing strategies, marketing strategies, discovery , in ways that I can't candidly even as someone sort of in the middle of it, I can't quite predict right now. But you can sort of see the change coming even if you don't see the end of it. So much of the web and so much of the internet , is premised on us visiting things , publications. if you have to visit them, that's the way the economics work. a site like Amazon, right, that you want, they want you to visit because they get the data and then they can tailor the experience to you. If you're not visiting sites anymore, then does the math fall apart? How does it work? I think business models will change with technology. you know I think the advertising supported internet was a byproduct of the distribution of the internet where a lot of companies said hey rather than having a payment as a gate to content you know providing it for free and providing ads as a better business model not all publications made that trade in fact somewhat interesting enough many of the healthiest publications didn't which is interesting I think certainly AI agents and consumer agents will drive similar changes to business models. , I'm not sure what they are yet to be honest with you. I still think fundamentally it's, you know, a market where people, it's like demand generation, demand fulfillment. You know, it's essentially finding people who might in the future be interested in your product and making sure they're aware of you. , this is largely happening on like Tik Tok and Instagram and Facebook today. Demand fulfillment which is largely happening on you know Google and Amazon today. With the prevalence of agents, what is the new world of demand generation? how do you make your products known to you but also maybe to your agent which is a funny thing to say and then when you are actually transacting what is sort of the paid equivalent of that and I think both of those are nent I don't think we know what they are but I think the the economy or like I'll say the digital economy will be fine it's it's going to change things it's just going to make things that used to be",
        "start": 1109.84,
        "duration": 2466.6389999999974
    },
    {
        "text": "of that and I think both of those are nent I don't think we know what they are but I think the the economy or like I'll say the digital economy will be fine it's it's going to change things it's just going to make things that used to be just like the whether it was the advent of the internet or the newsfeed. You know, this is not the even the fourth time over the past decade that there has been changes to that economy. And I think entrepreneurs and innovators will figure it out and it will I think we'll be great. I just don't know exactly what we'll look like yet. Yeah. I'm struck hearing your answers that a you think a lot will change and b it's still so uncertain what will actually change. We are in inning two of this nine inning game. Yeah. In my opinion. U so actually you've been play well you've been playing let's say it's a double header you were definitely on the field for the first nine innings of of the last the last game because you know if you look through internet history you've just been at the center of so many of these really important moments. you know it's amazing I keep seeing the name Brett Taylor whenever there's a big news story. So, it's great to be able to speak with you. Just for our audience, and I'm sure many of them know this, , you were the Twitter board chair during the sale to Elon Musk. You became the OpenAI board chair upon Sam Alman's return after he was fired over that weekend. , you were the co-CEO of Salesforce with Mark Beni off like we spoke about. You're the Facebook CTO as the company moved to mobile and you built Google Maps. So, , let's just introduce you to our audience on this one. How did you end up in the middle of so much tech history? Glutton for punishment. No, I'm just kidding. , I one of my favorite quotes is attributed to Alan K and I I haven't actually verified it from him. Alan K was a researcher at Xerox Park and he said the best way to predict the future is to invent it. And I love it just because I think it captures the mix of optimism and I'd say this sort of imperative I feel when there's a really compelling new technology to get my hands on it and help shape it as opposed to observe it passively from the sidelines. And it's interesting you talk about those different trends because I started my career at Google went through both social and mobile at Facebook and then you know learned enterprise software at Salesforce. At Sierra, we help companies build AI agents for their customer experience. So, think not having to wait on hold when you call up Sirius XM or, you know, even helping",
        "start": 1250.0,
        "duration": 2735.116999999998
    },
    {
        "text": "at Google went through both social and mobile at Facebook and then you know learned enterprise software at Salesforce. At Sierra, we help companies build AI agents for their customer experience. So, think not having to wait on hold when you call up Sirius XM or, you know, even helping Rocket Mortgage agent. Part of our value proposition is actually reflects that history. We say if it were like 1994, we'd be telling everyone why they needed a website. And if it were 2015, I guess I'd say here's why you should have a mobile application. And now it's 2026. And we say you need an AI agent and your AI agent is going to be your digital front door and most of your customer interactions will happen via your AI agent, not by from your mobile app or your website, even if they exist in those platforms. And I so it's really interesting just because my own personal history sort of tied up what I'm doing now. But it's so interesting because if you look at I love the history of computers and you I think Microsoft's mission at one point was to put a PC on every desktop. I think we only reached about two billion PCs. So, certainly maybe reached that mission in the western world, but certainly not in the developed world. Then the internet was developed and connected those PCs. And then thanks to Steve Jobs and and then obviously Android's evolution of that technology, we have more smartphones than people now. And they're all connected to the internet. But they're all building on top of one another. Like the smartphone would not have been the smartphone without the internet. And the internet wouldn't have existed without the PC. And now you have AI and it's building on top of all of those. And so what's so interesting about this like at least the way you articulated my career is it feels like this sense of acceleration like each of these new waves of technology is adopted seemingly five or tens times faster than the previous generation because they're all compounding. and that's what's so exciting about right now. We were talking about before the show just I've never felt a pace of change more rapid than the moment right now for you. I mean you've you've the timing has been really impeccable. Do do you have like I mean when something's shifting like when the shift let's say just from search to social happened. a lot of people might have seen something happening but there was still I think in the general public a feeling of like I don't know about social media. I don't want to put my whole you know life on the internet but you're like I want to be the CTO of Facebook. What do you think gave you that sort of gives you that sense of timing and the decision to move and go all in on this",
        "start": 1386.559,
        "duration": 2995.4389999999967
    },
    {
        "text": "I don't want to put my whole you know life on the internet but you're like I want to be the CTO of Facebook. What do you think gave you that sort of gives you that sense of timing and the decision to move and go all in on this it a lot of times. I think some of it is just luck. There's no doubt. I mean, I think it's arrogant to say otherwise. I'll just actually It's funny. I was reflecting on this. Well, my first [snorts] job was at Google, which has to be one of the best first jobs of all time. Nice job. Why the.com bubble had burst. So, [laughter] the job fair was like a bunch of tumble weed and like Microsoft and Google. And I was like, I'd prefer Google. And I knew Marissa Meyer had gone to work there. So just, you know, I say dumb luck, but it wasn't exactly I always wonder if I had started my career in 1999 would have been at Pets.com. You know, [laughter] I hope not, but I don't know. I did have the I just graduated at the right time. I just want to say we've done two shows at this space and that's the second Pets.com reference we've I feel bad for them. They had the cool sock puppet. Good for [laughter] them. I I would say if there's one thing that is you know I'm curious. I I really am curious about new technologies. I think it is hard to embrace change in your own business or change in technology if you immediately are reflexively negative about anything that you see. I encourage people who are skeptical about a technology to find someone whose opinion that you trust, who has a different opinion than you. have lunch or have dinner with them and say, \"Convince me that I'm wrong.\" , and I've done this with a few different technologies that I was skeptical about and I'd find, you know, a fellow entrepreneur that was really bullish on it and I'd say, I just want to I want to understand what you see. And I say that just because I not every hyped technology is, you know, worth the hype. But there's usually if smart people are interested in it, there's usually something really important that they see. And I think if you have that curiosity, you'll be more likely to be able to apply what's good about it to your business or to your life. And I definitely have that. I joke I've never met a pessimistic entrepreneur. And I'm definitely not one either. Yeah. So, it's interesting because we've just talked about these big shifts in technology. Search to social, , desktop to mobile, and now all of it to AI. , there's some people that say AI is the last invention, that there won't be another shift after this. Do you believe that? Not at all really. I",
        "start": 1519.2,
        "duration": 3255.4389999999976
    },
    {
        "text": "just talked about these big shifts in technology. Search to social, , desktop to mobile, and now all of it to AI. , there's some people that say AI is the last invention, that there won't be another shift after this. Do you believe that? Not at all really. I exercise. So the United States was found in 1776. At the time I don't know what percentage of our economy was agrarian, but I'm guessing it was like 95% of the country were farmers. And I always imagine taking I don't know who the most techsavvy founding father was, but Benjamin Franklin maybe. I don't know. And trying if he were teleported right here in between us, first of all, that would be a little cool. But secondly, like how long would it take him just to understand where all the food comes from? Probably a really long time because we've been automating essentially agriculture, food distribution for so long, we just take it for granted right now. I think, you know, we often see new technologies and see what it displaces that we currently do. , but we create an economy and a culture around our technology, not the other way around. And so in those past, you know, [snorts] 300 years or something, we've made power relatively abundant. We've made food abundant. We've made transportation relatively abundant. , and you know, just think about the fact that both of us flew here on airplanes, you know, 24 hours ago, and we're broadcasting over the internet. It's mind-blowing, [laughter] right? We don't think of it as mind-blowing, but it's mind-blowing. I think we just lack the imagination. I think that's delightful. I'm excited that in my lifetime, hopefully 25 years from now, there will be things that today I wouldn't understand and jobs I don't understand. technologies that were hopefully discovered by AI. And I think a lot of people look at AI because it can do things that we can't and it somehow thinks it takes away from our humanity. And I just disagree just like the car didn't take away from the horse. [laughter] It's just different. And I think I'm just optimistic about it. I don't mean there won't be meaningful disruptions. Technology is hard and we just talked about I selfidentify as a software engineer and even over the past four months that job has changed dramatically. the skills that made me what I am are less valuable now than they were you know four years ago. But I'm excited for that because I'm excited for the progress it means for humanity. All right, let's talk about Sierra. So you're seven quarters in which is wild because you're already doing 100 million in annual recurring revenue. you have 50% of your co customers have more than a billion in revenue and 20% of your customers have more than 10 billion in revenue. So you are selling in AI customer engagement you're selling into",
        "start": 1650.159,
        "duration": 3542.5579999999973
    },
    {
        "text": "which is wild because you're already doing 100 million in annual recurring revenue. you have 50% of your co customers have more than a billion in revenue and 20% of your customers have more than 10 billion in revenue. So you are selling in AI customer engagement you're selling into very big deals. some of your customers like SiriusXM will actually have your your platform take action. Right? So this is not chatbot. I think this is important to say. This is not chatbot. It's agentic. It's agents. It's when my satellite radio isn't working, the AI will reset it for me and I'll be able to listen again where that typically would have taken. And by the way, that that AI agent's sending a signal up to a satellite in space which is communicating with your car. How cool is that? No person involved. AI agents talking to satellites like and that's just a normal thing that we do now in 2026. It's pretty awesome. And so my question because that is that's a big deal, right? That requires Sirius to say, \"All right, Brett, go ahead and let your AI technology, which is probabilistic, right? Go ahead and send a signal to our satellites and we're going to trust everything is good.\" And that to me is the big question that I have about Sierra, which is there's been so much discussion about this AI rollout and what's you know gone right and wrong and and what's taken the AI projects from pilot into production and you've got it in production with these big companies that are trusting you with big actions. How have you gotten them to trust you with this stuff? I think it all starts with the customer and the consumer. , yeah, you were implying some of the risks of AI, which I'll talk about, but , if you were to survey your listeners and survey their sentiment about waiting on hold, it would surprise me if you could find one person who had a positive experience with that. I think we spend like years of our life waiting on hold. And the reason for it is somewhat like a mix of sort of business and technical. , until recently, the phone line was analog. There was no way to build a digital experience there. So if someone did call you on the phone, you had to staff a a call center to answer it. And if you want to not wait on hold, you had to overstaff that call center, right? With people would be sitting around most of the time doing nothing, which just cost a lot of money. And if you think of a consumer brand and let's say your average revenue per customer every month is $10, that might be less than the cost of a single phone call. So, you actually can't afford for most businesses literally can't afford to have a phone conversation with your customers. But",
        "start": 1795.679,
        "duration": 3813.4379999999965
    },
    {
        "text": "you think of a consumer brand and let's say your average revenue per customer every month is $10, that might be less than the cost of a single phone call. So, you actually can't afford for most businesses literally can't afford to have a phone conversation with your customers. But have an AI agent pick up the phone. You don't need to wait on hold. It could be multilingual. It can have perfect access to your systems. it can help you find if you know the retailer next in the UK. It can help you know find your order. if you if you order food in London and deliver, it can help you whether you're a driver or a consumer of that. , Sigma Health Insurance. , we went live with them in less than two months with Sierra and it can help you understand your benefits, process claims, all of these things are just really useful and and I think because consumers don't want to wait and they would like an answer now. And because you can do things with this technology because we've essentially digitized the last analog channel which is the telephone, it's unlocking new business models as well. One of my favorite examples of this is Rocket Mortgage, which for those of you not from the states is I think the largest consumer mortgage originator in the states. If you go to redfin.com, you can use an AI agent built on zero to find a home. You can go to then rocket.com and finance that home and get a mortgage and then with their new Mr. Porter acquisition service that loan all with AI agents. It's amazing. Right. Right. And this is this is the pain, right, that you're solving. But I want to hear a little bit more about the the discussions that you have with them. the fact that and and the persuasion where you've said trust our technology. They've looked at the technology. Is the technology good enough now because there was some doubts that it could handle such complex things. So talk a little bit about about that. How have you gotten them to trust Sierra with these actions because we we all agree that the pain is real? Yeah. Well, so I'll start with actually an important thing to to ground ourselves, no pun intended, and which is we're humans make a lot of mistakes, too. So, if you have an associate talking to your customers, the odds that every associate is going to do everything perfectly is essentially zero. , and I think we just have a higher expectation of computers, which is understandable, but you know, what these AI agents are doing aren't necessarily doing something that was previously perfect. And I think a lot of companies understand that. And if you for anyone who has a large sales team or customer service team, you know exactly what I'm talking about because you've",
        "start": 1934.399,
        "duration": 4080.0779999999954
    },
    {
        "text": "but you know, what these AI agents are doing aren't necessarily doing something that was previously perfect. And I think a lot of companies understand that. And if you for anyone who has a large sales team or customer service team, you know exactly what I'm talking about because you've where it didn't go well. So first I would actually argue counterintuitively AI agents are actually more reliable than most of the systems that they replace. It doesn't mean they're perfect, by the way. They're just more perfect than the very fallable [laughter] human operation systems that that preceded them. And the second thing is essentially what we do at Sierra is try to essentially put more robustness and determinism around these inherently non-deterministic systems. [clears throat] one of the the best ways we do that is through a technology called simulations. So all of our clients have a database of usually hundreds or sometimes even thousands of simulated conversations that they run before every release of their agent that simulates everything from an angry customer to an unusual case to background noise. Is it AIS talking to AIS? That's right. And it can simulate languages, accents, background noise. And it means that essentially before your agent goes live, your customers aren't finding all the flaws, your simulations are. For those engineers listening, you can think of it as almost a regression test suite for your agent. we also use AI monitors. So how can you use AI to monitor the AI to look for things like hallucinations? Was it saying something that wasn't in the data presented to it? or even subtle things like was the AI being frustrating to your customer. Was it being repetitive? and it enables you to you know the the joke that we say in the office is the solution to every problem in AI is more AI [laughter] and there's probably a limit to that but we really believe it and what's really fun about that is you know with AI monitors you can monitor all conversations so you can go well beyond the scale of your operations teams and even where you do want people looking at the conversations you can put the needles at the top of the hay stack. So your operations teams are just looking at the conversations that have potential issues. And so really creating a virtuous cycle of, you know, testing, monitoring, and human review to create what we hope is a virtuous cycle. So every day that your agent is live, it's more robust than the day before. It doesn't mean it's perfect. but it's really, you know, it's interesting. I'll just go back to like the way software's evolved over my career. In roughly, I think it was like the early 2000s. There's the Outlook worm that took over like everyone's desktop and it was before there were CISOs in most companies. Since then we've developed the role of the CISO. We've formalized the software",
        "start": 2070.24,
        "duration": 4361.838999999996
    },
    {
        "text": "the way software's evolved over my career. In roughly, I think it was like the early 2000s. There's the Outlook worm that took over like everyone's desktop and it was before there were CISOs in most companies. Since then we've developed the role of the CISO. We've formalized the software essentially a methodology to make software robust. We've essentially in AI agent development have this idea of an agent development life cycle. the same idea which is don't expect perfection but with this methodology and the product and the platform we've built you can make a robust agent and you can make it reliable and you can make it something that becomes more trustworthy over time. is is what you're saying then that with these AI agents it's not like self-driving cars, right? So self-driving for instance was it was I don't want to say trivial but the companies got it to 95% pretty fast and getting from 95 to 100 has been very difficult and we still don't have it rolled out even though seems like there's been progress that's been made but if you make one mistake there you know it's it's catastrophic whereas do you think that there's much more of a willingness to allow some errors with AI agents and the type of solution that you provide because you're your baseline is these fallible human workers and if you're if you make a couple fewer mistakes with AI, you're you're still doing a better job. I'm not sure there's a black white answer to that. I mean, certainly the reason why Sierra has become one of the fastest growing enterprise software companies of all time is because the technology is ready for many companies and many applications. But it doesn't mean it's ready for all. the you know challenge with self-driving cars is that the consequences of being wrong can be human injury. So it's rightfully sort of held to a very very high standard. I might argue held to a higher standard than human drivers which for sure it is. I I we might be safer if if regulators allowed it to roll out sooner but it's a whole separate discussion. What's interesting about the technology that we make at Sira is it's not you don't have to use it for all applications but if you think about recovering your password or finding your order or even finding a health care provider in this the network of your health insurance company AI agents can do that now and that's what our you know that's why we're being pulled by the largest healthcare financial services telecommunications and consumer companies in the world it doesn't mean it's ready for everything yet but that's that's why we exist you know if we were sitting here 3 or four years from now, I'll tell you the more and more missionritical applications that will be ready for it. And just take going back to where we",
        "start": 2213.04,
        "duration": 4642.158999999999
    },
    {
        "text": "it doesn't mean it's ready for everything yet but that's that's why we exist you know if we were sitting here 3 or four years from now, I'll tell you the more and more missionritical applications that will be ready for it. And just take going back to where we It's probably very safe for you to vibe code your blog right now. Should you vibe code the login system for a bank right now? I probably wouldn't recommend it. I mean if you want to stay in business. Yeah, exactly. I mean it's that's So it doesn't. And could you ask is vibe coding ready for production? What production application? And I think that's we're at that stage of innovation right now where the technology is immature. No one's claiming it's perfect. But the idea that you should wait until it's perfect to do anything I think is a death sentence for companies who have that that mentality. I think the better question is what processes at my company are ready for the current set of technologies. recognizing by the way that it's not a question of if it will make a mistake, but when it does, how do you detect it? How do you mitigate it? All the controls that you have in place. And I would make the argument that actually for most processes in most companies, the technology is ready today. And put another way, if we paused innovation at the foundation model layer, we would still have I think trillions of dollars of value in the economy with current technology. [clears throat] Okay. I want I have so many more questions to ask. We have 20 minutes left. So let's take a break and and we're going to come back right after this. And we're here with Brett Taylor. He's the CEO of Sierra, chair of Open AI. interesting thing you said before the break Brett that Sigma I think rolled out in what a couple of months with you guys. there is a whole industry of consultants that integrate systems and are you know basically connecting business processes and they take a year and they usually do it like 50% effective. what's going to happen to consultants in this world? Consultants is a broad category. you know you have strategic management consultants, you have systems integrators, you have you know outsourcing firms, you know that essentially can like build software on your behalf. I think all of them will have different impacts in this technology. The first principles view I have is software engineering agents are bringing down the cost of developing software. it's not going to go to zero, but it's you know it's going from extremely expensive to relatively inexpensive and that's a huge change and so where you had a dynamic where a company was outsourcing software development to save costs the cost of the AI agent might be less than the cost of the outsourced I'll say resource",
        "start": 2354.56,
        "duration": 4937.837999999996
    },
    {
        "text": "you know it's going from extremely expensive to relatively inexpensive and that's a huge change and so where you had a dynamic where a company was outsourcing software development to save costs the cost of the AI agent might be less than the cost of the outsourced I'll say resource term but often the term used in the industry and that'll disrupt that part of the industry but behind every technology technology project is a business transformation. , you know, if you're digitizing part of your business, the software is a means to the end, not the end to itself. And I think most consultants would say the change management that they participate in, the actual advice on how to do that and how to be competitive has always been the more valuable part of what they do. so I think a lot of these consulting firms will probably need to transition away from you know the billable hours of the hands on the keyboard and more towards change management strategic consulting and I think that will have some innate value. I think the having an outside in perspective is inherently valuable I think for a management team. So I don't think it's going to go away but [snorts] you know what is it that you're buying for them and how they provide it I think probably will change a lot. , and by the way, as we [snorts] also started, the software industry is also changing a lot. And so there's a lot of unknowns right now, but I think it's going to skew towards higher and higher leverage types of consulting just given the commoditization of of producing software, which is which is obviously happening with AI. Okay. So, you're the chair of OpenAI. , I want to talk a little bit about OpenAI and also like the broader foundational technology underneath. , first of all, they just decided that they're going to start showing ads. I think the funniest tweet that I saw in response to this was like AGI is nowhere close because if OpenAI thinks that they have to show you ads as opposed to like you know redevelop the way the world works then it's going to be a while. What's your response to that? so if you look at OpenAI's business model kind of three pillars the first is chat GPT monetize through subscriptions today and this is where Fiji announced sort of the ads principles where where the plans are to introduce some monetization component to that. Then you have the API which companies are using to essentially build applications on top of these models. And then you have agents which a lot probably the most meaningful of that is codeex which is a software engineering agent. I'm excited about developing all of those business models because I mean as has been covered by many people the cost of training these models and the cost of inference is incredibly",
        "start": 2504.079,
        "duration": 5224.957999999996
    },
    {
        "text": "agents which a lot probably the most meaningful of that is codeex which is a software engineering agent. I'm excited about developing all of those business models because I mean as has been covered by many people the cost of training these models and the cost of inference is incredibly sustainable towards our mission to ensure that artificial general intelligence benefits humanity, we need a sustainable business. And that really means you know monetizing the incredibly intelligent asset that we're producing which is these models. I also having been at a number of companies both Google and Facebook that effectively developed ads platforms. I think I think it's quite complimentary to these free offerings. I yeah I was at Google when we launched AdWords and the before and after of the monetization for the internet was it was strictly better on the other side of it because the ads were complemented what you searched for and it actually you know provided actually a lot of value to consumers. So I think there's always an art form because you just can't reduce trust. You need the chatb agent acting on your behalf and I'm confident the team can do it in a way that you know complements that experience rather than competes with it. and I'm excited for the the opportunity. But the argument that if there were real great economic value on the other side of the rainbow that their ads would be unnecessary, I don't buy that just because it's unclear like you know does just because OpenAI is making this technology doesn't mean we're like monetizing all the benefits to the economy either. And so you know I was just reading I don't know if this is true but I just was reading on axe that a mathematician proved one of the unproven conjectures using GBT 5.2 too. I hope it's true. I haven't personally verified it. That's that's amazing. That is progress for humanity, but it's not like, you know, send us the commission. I don't think there was a commission on it. And so I the mission hasn't changed. And I think this is just a way of you know, growing the OpenAI business so we can continue to finance what I think is the greatest research lab in the world. Okay. And let's talk about that research. So OpenAI spending a lot of money. we won't get into the ROI discussion. I feel like that's been we've had that on this show a lot. but I want to talk a little bit about what the what the argument would be for this technology starting to slow down. a year ago there was a discussion about whether the models were going to hit a wall. Clearly they haven't hit a wall but you could argue that they are getting better through through tricks. for instance a model can learn something by going to the internet and searching for it. But that doesn't get",
        "start": 2649.119,
        "duration": 5495.756999999998
    },
    {
        "text": "a discussion about whether the models were going to hit a wall. Clearly they haven't hit a wall but you could argue that they are getting better through through tricks. for instance a model can learn something by going to the internet and searching for it. But that doesn't get it's using these tricks or some people call it scaffolding orchestration to get most of these improvements and it's not like the underlying technology is getting that much faster. That's the argument. and so then maybe eventually the tricks will run out. What do you think about that? first of all, I think all all crit all criticism is important to listen to if you're in science and you want to make progress. My take first of all I think there's a one of the nuanced aspects of the progress we've seen particularly this past year is the models have gotten a lot more intelligent they may have been sufficiently intelligent like a year ago for most consumer applications like my trip planning to Copenhagen I'm not sure how much the reasoning capabilities of GPT52 would have benefited that trip planning we [snorts] were at peak travel agent I'm being a little facicious here but if you're using Yeah well but if you're using codecs to write software for you. The difference between GPT5 and GBT 5.2 was huge and you can see this online just all the developers using it because reasoning capabilities for authoring complex software is incredibly valuable. So I think one of the dynamics that's sort of playing out particularly for people using chat GBT and Gemini for I'll say casual everyday use which most of us are at this point is a lot of the model improvements are are not necessarily visible for those class of applications but incredibly visible if you're using it to say develop software or to prove an unproven math conjecture. so that's an interesting dynamic which is and I think it's going to probably over the next few years amplify which is for a given task the models from last year are sufficient and the new models will be necessary to achieve some semblance of super intelligence or artificial general intelligence but we're actually at sufficient intelligence for a lot of different applications. , and I think that's why it's really important when we're judging progress and cost and all these things that we'll actually probably have to start looking at through the lens of applications. If you're doing pharmaceutical like therapy discovery, you probably care a lot about the reasoning capabilities. If you're planning a trip a little less so to your point on accessing tools, I actually think this is strictly a positive. I think that one of the big breakthroughs with AI agents will be longunning tasks and and I think that using writing code searching the internet I think is great. I think it enables whenever you whe whether or not whatever your",
        "start": 2786.72,
        "duration": 5809.757999999996
    },
    {
        "text": "I actually think this is strictly a positive. I think that one of the big breakthroughs with AI agents will be longunning tasks and and I think that using writing code searching the internet I think is great. I think it enables whenever you whe whether or not whatever your on a second by second basis and having an AI agent that can respond to that is very important but more importantly it can access a private database. that can access, you know, a structured, you know, can access a system that's looking at a particular strand of DNA, whatever you might want to do. So, Tulios is incredibly important. Probably the the one thing that I think in AI circles and and I'm not an AI researcher, though, is to achieve true AGI, will we need reinforcement learning from the observations that this model makes, which most of the mainstream models don't do? I'm not sure about that and there's a really healthy debate about that but I I am I I don't characterize those tool use as like a hack. I think it's actually a structural input to longunning [clears throat] agents which will probably be what we need to to to create something close to AGI. Okay. so we've talked a little bit about your personal history. I just want to end here with a bit of a lightning round where we can talk about some of the leaders in the tech world that you've worked with. They're going to be big names that a lot of our audience will know. just give us one thing that you've learned from each and I want to start with Mark Beni off. Mark was amazing amazing at creating an ecosystem and a community around a company. I was really inspired by my first Dream Force and just seeing all the people that showed up there and realizing there's a difference between having customers and having a community and some that's definitely something I took away from him. All right, Mark Zuckerberg. Mark Zuckerberg was probably the longest longest term thinker I ever worked with. we used to go on long walks around Palo Alto talking about strategy and every time I thought I was thinking long term, he was thinking about two times longer than me. and I I've tried to model that now. It's like how am I thinking long term enough? And I think you can see it in just Facebook and Meta's performance over the past decade. like he's always looking at the horizon beyond the horizon which I deeply admire. Speaking of Zuckerberg's long-term thinking, do you think this big bet that they're making on artificial intelligence, right? I mean, they've poached many of the top engineers from the company that you're the board chair of. Do you think that's his belief that we are going to stop communicating with our human friends online and we'll start communicating with our digital friends instead?",
        "start": 2946.0,
        "duration": 6091.436999999999
    },
    {
        "text": "making on artificial intelligence, right? I mean, they've poached many of the top engineers from the company that you're the board chair of. Do you think that's his belief that we are going to stop communicating with our human friends online and we'll start communicating with our digital friends instead? communicating with our friends for a long time. I think this is just I mean Mark has a lot of conviction and is willing to put his money where his mouth is and I think that's a real admirable trait for a CEO. So I think that's all it is. I don't think it's a indictment on human relationships. Oh okay. I I will take the other side of that. I think we are we are many of us are I mean we have this like isn't it interesting we have this loneliness crisis and into the void is coming these bots that will tell you how great you are. Remember everything about you look out for your best interests. I actually am worried about sickopantic AI. I think it is some of the science I guess has been partially debunked but I I I like the anxious generation and it resonated with me just the negative impact of smartphones and social media particular on young people and I think with any of these new technologies there's a risk of addictiveness and and you know particularly the sort of sickopantic nature of some of these agents but I'm an optimist. I think technology broadly moves society forward and can unburden us from you know repetitive and medial tasks and enable us to be more selfaccul actualized. So, , I do think it's important to worry about, but I also think it's wrong to think it's an existential risk. And I think we should worry about it, mitigate those risks. , be smart with our kids and, you know, particularly kids in middle school and secondary school about when they get access to technology. But I'm really optimistic for the benefits. , Sam Alman, you've spent some time with him as the board chair of OpenAI. How how does he operate? What have you learned from him? Sam probably has the most ambitious vision of any founder that I've worked with and his superpower is aligning people to that vision. I was didn't have the good fortune of really knowing Steve Jobs but they always talked about the reality distortion field and why so many great engineers went and did great things like creating the Macintosh or creating the iPod and I see a lot of that in Sam. Then what is what is his grand plan for OpenAI? what is the long-term potential there to build AGI and ensure that it benefits humanity. and it's always been the mission of the foundation and it still is and the but that sentence offiscates a lot of the challenges of doing so. Just look at the even the",
        "start": 3089.359,
        "duration": 6375.115999999997
    },
    {
        "text": "for OpenAI? what is the long-term potential there to build AGI and ensure that it benefits humanity. and it's always been the mission of the foundation and it still is and the but that sentence offiscates a lot of the challenges of doing so. Just look at the even the don't think anyone knew when it was founded. So, , I think the hard part Sam's doing now is taking that vision and mapping out a decade long plan to get there, which is, I think, one of the most remarkable, , technical achievements in human history, and it's exciting to be a part of it. One interesting dynamic of that business and Sam's challenge is it does seem that everybody just catches up real quick, you know. I It's absolutely right. I mean that's just what I see going on right now sort of maybe ending where we started when I graduated from university. I was in Stanford when the dotcom bubble happened and then it burst in the middle of my undergraduate education. If you look at that period of the internet, most people knew that the internet was going to be impactful and most people even knew the key applications like e-commerce and search that would be impactful and it was this cutthroat competition to decide who would win in those markets. If you remember Alta Vista, which sort of the number one big user Yeah. And then you had, you know, Yahoo and Excite as the portals and you had on los.com los you had buy.com and Amazon and every country had their own. I think we're just in a similar state right now. you don't need to be have a PhD in artificial intelligence to think and say wow this is going to have a big impact on the economy and society. So you have all of the capital all the smart people in the world all focused on the same thing. So this degree of competition is completely in my opinion expected. it means it's super stressful for those of us in the middle of it. It's great for the world though. I mean competition drives innovation. It lowers cost. So I think it's just a great thing. if for those of us in the middle we don't get a lot of sleep because every day you wake up there's new competition. , but that's what's great about the like free market technology economy is like on the other side of this is I think we're going to have some amazing tools that benefit humanity and I'm excited to be a part of it. But a lot of those early pioneers fell off 100%. That's just the way it works. I think there'll be a period of consolidation. well, that's always my joke. Your perspective on the dot bubble is very different if you went all in on buy.com versus Amazon.com. And so you're going to have some",
        "start": 3232.4,
        "duration": 6646.397
    },
    {
        "text": "those early pioneers fell off 100%. That's just the way it works. I think there'll be a period of consolidation. well, that's always my joke. Your perspective on the dot bubble is very different if you went all in on buy.com versus Amazon.com. And so you're going to have some more likely sort of be consolidated. I think there's probably I don't say too much capital, but it's sort of being applied blindly to categories. Yeah, it's defin Oh, it's absolutely a bubble, but I think it doesn't mean that there's not truly generational companies being created at the same time. And I think both are true at the same time. And you know, that's why you know, venture capitalism for the weak of heart. And [laughter] you're going to see some people do very poorly and some people writing their proverbial book about the the great bets they made. And you know that's the world I grew up in and I think it's exciting though mildly stressful at times. Yeah. What about Marissa Meyer? Marissa was my first boss. I probably learned the importance of people and hiring. I came in through a program she made at Google called the associate product manager program where she hired new grads out of technical degrees and who wanted to become product managers. and she said rather than getting an MBA, get an MBA at Google. And a lot of the young people she recruited there ended up running big parts of Google, running companies now. , but she spent just a lot of her time curating the people at Google. I think was one of her greatest contributions to that company. And , I always remind myself, you know, it's like eating your vegetables. If you want your company to be great two years from now, focusing on the people you're bringing in now is probably the smartest thing. And I always think about her when I do that. Cheryl Samberg. Cheryl, this is going to sound funny. Cheryl always gave me the like harshest best feedback. [laughter] [clears throat] Like he [snorts] was like, \"Whoa, well, we're not cut we're not like cutting to the chase here, are we?\" [laughter] and I realized that so much of my career hadn't been really given feedback and and if someone actually cares about you, the their willingness to actually tell you what you need to hear, not what you want to hear, is a gift. And so, , I think it's very hard to give feedback because you think you think about the way it will make someone feel rather than thinking about you want them to be better at their career in the future. So, , I learned that from her and she's she's amazing at I think she's a mentor to like half of Silicon Valley for a reason. Do we put Larry and Sergey together? I feel like people just say Larry Sergey.",
        "start": 3369.68,
        "duration": 6900.5560000000005
    },
    {
        "text": "to be better at their career in the future. So, , I learned that from her and she's she's amazing at I think she's a mentor to like half of Silicon Valley for a reason. Do we put Larry and Sergey together? I feel like people just say Larry Sergey. , Larry for me always focused on long-term technology direction in a way that was remarkable. When I got to Google, I had no idea why we were building our own data centers and it was turned out to be an incredibly important part of the cost to serve of Google when we were making everything from Google Maps to App Engine, which became Google Cloud. his focus on like setting it up architecturally to have sort of unfair advantages of scale and and was remarkable just incredibly long-term technical view. I have this for I'm just going to ask it. What's your opinion of Elon Musk after your interactions with him? probably the greatest entrepreneur of our time. I mean, you know, you he's a company. He's created everything from SpaceX and look at the impact of Starlink, let alone Tesla and X. So, , you know, had some complicated interactions, but sort of the undisputed leader in that respect. Did he make a good choice buying X? , I'm not very close to it, so I haven't really followed it as much since since the transaction went through. So, I don't I don't have a strong opinion on it. Okay. I I've learned not to ask people in your position to predict like the next five years, but can you tell us what's going to happen over the next year? I think we will see a set of things like that math conjecture that's proven where society outside of the realm of like my social circles starts to acknowledge the impact that AI is going to have on science. And I think that will in a good way change the positive perception of AI when we realize this can help perhaps over time discover cures to unccured diseases make breakthroughs in physics, clean energy, battery storage where we'll get out of the discussion of AI as a chatbot and the discussion of AI as something that's going to move society forward. I'm really looking forward to that. Well, Brett, it's great that you came down here. This is our first conversation. and I've been looking forward to it for a long time and I hope it's [music] not our last. So, thanks again. Thanks for having me. All right, everybody. Thank you for listening and watching and thank you to Qualcomm for having us here at your space at Davos. We'll see you next time on Big Technology Podcast. Awesome. Thank you. Thank you so much. Great stuff. Thanks everybody. [applause]",
        "start": 3497.839,
        "duration": 7179.498999999999
    }
]