[
    {
        "text": " Anthropic looks unstoppable as a $10 billion funding round turns [music] into 20. Big tech earnings are in and there's no margin for error and SpaceX has an IPO date and is maybe acquiring XAI 2. That's coming up on a Big Technology Podcast Friday edition right after this. Welcome to Big Technology Podcast Friday edition where we break down the news in our traditional coolheaded and nuanced format. We have a great show for you today. We're going to talk about the numbers getting even bigger for Anthropic and OpenAI as they attempt to raise their latest funding rounds. We're also going to look at big tech earnings [music] and ask whether there's any room for error anymore, especially with Microsoft having one of its worst days in years. And then as we close, we'll talk about SpaceX and whether that IPO is going to come [music] this year and whether it will include XAI. It's going to be a great show. And joining us today is San [music] Francisco bureau chief of the Financial Times, Steven Moore. Stephen, great to see you again. Welcome. Yeah, great to be back on. Thank you. Okay, so let's start with the big tech, not the big tech. Let's start with the AI labs. , last week we talked about how OpenAI was in the middle of this historic fund raise and whether there would still be money left or how much money could they could possibly raise after this. Well, news showed up that Anthropic is actually also on the fundraising path and it's like these companies are always fundraising and they were actually going out for a $10 billion round and then they ended up raising or or doubling that round to 20 billion. Here's here's the Financial Times story. Anthropic is set to raise about $20 billion from venture capitalists and other investors, double the amount it had targeted and a sign of surging investor enthusiasm for the high-profile II startup. The fundraising deal, which is close to being finalized, would value the company at $350 billion. So, a little less than half than OpenAI. , but Anthropic is clearly having a moment. So, I'd love to hear your perspective, especially since the FT has done the reporting here about just how intense the interest has been in Anthropic and why you think that's the case. Well, as you say, like Dario Amade, his sister, the whole company, they're really having a moment in AI. You know, people have always been very loyal to Claude. You know, they've liked its style, but it's had multiple hit products coming out of this AI research startup. , not least Claude Code, Claude Workspace, and as a result, we're really seeing a huge amount of demand from investors of all stripes all around the world to be associated with this company. As you mentioned, we put out a story this week that they've doubled their latest funding round. They",
        "start": 0.08,
        "duration": 313.19999999999993
    },
    {
        "text": "least Claude Code, Claude Workspace, and as a result, we're really seeing a huge amount of demand from investors of all stripes all around the world to be associated with this company. As you mentioned, we put out a story this week that they've doubled their latest funding round. They they're actually going to raise around 20 and they had demand for five to six time that five to six times that amount. which is a crazy amount of money, right? Because this is just one of multiple AI startups in Silicon Valley raising at the moment, not least XAI and OpenAI as well. , and I think what this proves like 350 billion valuation is of course above Elon Musk's XAI at 250, but as you said like far below the rumored 750 billion valuation of OpenAI, but it really shows that they're able to keep pace at least in fundraising and and compete on compute with their their slightly larger peers. And we're in a situation now where people want to be associated with the name. like when we're reporting out these stories, we're finding it quite easy to add extra names to the list of VC and sovereign wealth fund backers. and interestingly as well, we're even seeing companies that had initially bet on their rivals like Microsoft and Nvidia putting money into Anthropic as well. Now, that's partly, you know, through self-interest. You know, they're big customers, but it's also because I think these these big tech companies, at least when I speak to them, they think it's good for the ecosystem. You don't just want to have one, two or three companies, you know, Elon Musk, Google and OpenI taking it all. Having anthropic is a very good buffer, you know, for the whole sector and and the whole world. Now, Dario when he goes and gives his public talks, he likes to say he always says this that that Anthropic went from a million what no 10 million to 100 million in revenue. No, they went from sorry 100 million to a billion and a billion last year to 10 billion. They've 10xed their their revenue year after year. do you think I mean how thinking through the exponential do you think that they could do that again? I mean I think they got close to 10 billion last year. They didn't quite 10x but they got close. Do you think they could get in the range of 100 billion? Because as these numbers get bigger the task to 10x becomes harder. It's not like an easy thing to do. [snorts] They're certainly on the right track to get there. you know, they they've got a lot of interest. They've embedded themselves in both very big corporations, but they also have like a you dedicated fans in like, you know, the developer community and like individuals. So, if you think about the revenues of some of the big tech",
        "start": 156.56,
        "duration": 596.4809999999998
    },
    {
        "text": "there. you know, they they've got a lot of interest. They've embedded themselves in both very big corporations, but they also have like a you dedicated fans in like, you know, the developer community and like individuals. So, if you think about the revenues of some of the big tech far off generating that much net profit in, you know, half of that in a quarter, right? So if you believe that OpenAI and Anthropic are the next, you know, you know, the next members of the Magnificent 7 or the Magnificent 9, there's no reason why they can't get to 100 billion in annual revenue. Now, of course, what has to happen for them to be viable companies long term is that their costs have to come down because remember these startups don't actually make any money at the moment. and if they are going to go for IPOs this year or next you know and they're hiring advisers, bankers and lawyers to do so eventually, you know, the whole of their balance sheet will be laid bare and people will be able to take take a better take a better look under the hood and determine whether they're viable long-term businesses. But certainly Anthropic is is going about things in the right way to secure its funding like lock in lock in more strategic partners long term. So yeah, I mean I think it's feasible, but you know this is remember this is these companies are have really only been in the public sphere and have been in have captured the imagination for two years. So we just don't really have that much data to see the trajectory of this. Right. And when you say they don't make any money, they're not just not making profit. Like these companies are losing they make money. They generate revenue. What they don't have is earnings. Correct. And one more thing that really struck me about this story. I mean of course we know that like as you mentioned Claude co-work Claude code are really driving you know at least the conversation that these investors pay attention to nuts which is really the the conversation on X right and the question is like who does that who who would you sort of rope in because of that buzz and you would think that if you have such an overs subscribed rounds it's like the traditional Twitter VCs that would come in but it's not u I mean maybe it's some of But the thing that really struck me is that it looks like Microsoft and Nvidia, , this is according to your story, have committed to invest a total of up to 15 billion in the company. You know, that's not Google, that's not Amazon, it's Microsoft and Nvidia. To me, that's, you know, people usually when they talk about the OpenAI universe, they talk about three companies. They talk about Microsoft, they talk about Nvidia, ,",
        "start": 300.32,
        "duration": 860.1609999999994
    },
    {
        "text": "a total of up to 15 billion in the company. You know, that's not Google, that's not Amazon, it's Microsoft and Nvidia. To me, that's, you know, people usually when they talk about the OpenAI universe, they talk about three companies. They talk about Microsoft, they talk about Nvidia, , Anthropic seems like it's attracted some of the biggest backers of OpenAI, which is interesting because I think you'll remember that the rumor was in the latest funding round Sam Alman was saying if you invest in any of our competitors, you're not going to be able to participate in future rounds. And now clearly maybe maybe Nvidia and Microsoft got a waiver or maybe they don't need one because of their size. But the fact that they're going to come in with such power and backthropic to me is remarkable. Yeah, it's it's extraordinary the way that the landscape has changed over the last 12 months. A story we wrote at the Financial Times about Sam Alman threatening to cut off investors that invested in rivals actually ended up in a lawsuit that Elon Musk brought against the company for anti-competitive practices. Now, Sam Alman said that he didn't say he'll cut you out of the funding round. He just said, \"We won't share any advanced data on our financials or give you our our tech road map in case you share it with our rivals.\" But it looks like since Microsoft renegotiated its relationship with OpenAI that all of this exclusivity is breaking down. , remember Amazon and Google have had the longest standing cloud and investing partnerships with Anthropic. They're now adding Microsoft Azure to that mix. They also do work with Oracle. So we're really seeing the whole sector like diversify and become more strongly intertwined as the prevailing thought is now that these models aren't all just going to commoditize and converge on the same thing, but they're going to specialize and they're going to be good for different things. And what Anthropic has really been able to show is is very good for developers and it's very good for enterprises. I mean, it's it's probably already lost the kind of consumer app battle to Open AI with Google, you know, making some small inroads in that, but not really for a company of its size. But in San Francisco, I'm sure you hear it in the bubble chamber. You know, if you follow an account called Overheard San Francisco, there's a joke going around. It's like one person walking down the street says, \"Oh, you know, Rome wasn't built in a day.\" And the other person shoots back and says, \", well, they didn't have clog code.\" Yeah. No, it definitely shows up in the data because I have some data from Apptopia that I'm looking at right now and in June 2025, so 6 7 months ago, the average time spent on the on the mobile app of Claude was about 10",
        "start": 434.08,
        "duration": 1140.7199999999991
    },
    {
        "text": "didn't have clog code.\" Yeah. No, it definitely shows up in the data because I have some data from Apptopia that I'm looking at right now and in June 2025, so 6 7 months ago, the average time spent on the on the mobile app of Claude was about 10 30 minutes. So time spent per user on Anthropics Claude has tripled in 6 months. And to me, what's remarkable about that is it's the mobile app, right? And you would you would say, okay, maybe it's because these developers are spending all this time in, you know, cloud code, but that's of I think often that's desktop. So, the fact that there's there's something going on. I've definitely seen, you know, I've had these moments where I've gone back and forth between chat bots. I I like Ron and I we joke that we used to be clawheads. and then we became I think we called it chat chaps but I don't know if I think [laughter] there's a nod to your to the you know the the British audience but I think we need a better yeah maybe term isn't isn't something you want to say too much. No, in fact, but but I'm saying that like I've now gone back to to to Claude for a lot of my work rellated uses and I'm seeing these numbers and I'm not surprised. Mhm. No, they they're definitely capitalizing on their moment. And also, you know, Dario Amed, the the the founder, he's very visible, right? I'm not sure if you managed to read all 20,000 words of his essay that he put out last week. I think a best good use of Claude would be to put it in there and crunch it down a little bit into the most salient bullet points. But he's also asserted himself into kind of like the cultural, the social, the legislative moment here that we have for AI. , being obviously leading research at one of the one of the top startups, but also warning about a potential economic apocalypse, you know, , and dangers from unleashing this technology, which he believes will become truly transformational in the next two years. So, they kind of have that going for them as well. , and we were both at Davos last week or the week before. , and there was a lot of sniping going backwards and forwards between these these different companies. I'm sure you picked it up. You had Damis of Google saying, \"Oh, well, you only need to look at what's coming out of these different AI labs. Look at what the ones run by scientists.\" And by this, he was actually on stage with Dario at the time. I thought Dario was the one that said that that my apologies. It was Dario that said that. , and then and then Demis kind of agreed and then they said, \"And look at what's coming out of these companies",
        "start": 575.519,
        "duration": 1408.7199999999991
    },
    {
        "text": "he was actually on stage with Dario at the time. I thought Dario was the one that said that that my apologies. It was Dario that said that. , and then and then Demis kind of agreed and then they said, \"And look at what's coming out of these companies media people like a and not too veiled shot at Meta and Open AI.\" Later in the week, Dennis couldn't resist of Google couldn't resist having a shot at Sam Alman for putting apps in GPT. He said, \"Well, if we're so close to AGI money and the stock markets were all becoming irrelevant in in in two years time, so why do we even need adverts?\" So as the competition heats up for users and funding and and kind of you space in the public consciousness, so so are the barbs flying backwards and forwards between these you know between these very very wealthy but still very competitive people, right? And so last week we talked a little bit about how OpenAI was trying to raise 50 billion and the headline there was that Sam Alman was in Saudi Arabia and some other Gulf states trying to raise that round and I was basically raising my hands and being like how how many more times can they do this? and then eventually they have to go public and then certainly the numbers are going to matter then you would imagine. Well it turns out that 50 billion wasn't the ambition. It looks like it's actually much larger. because we've gotten a bunch of news in the back half of this week that OpenAI is looking to raise much more than that. I'll start with the Wall Street Journal report, then we'll move to the FT report because this came out, you know, shortly shortly before we're speaking. so here's this here's the headline. U it it is Amazon is in talks to invest up to 50 billion in OpenAI. the chatb maker is seeking up to 100 billion in new capital from investors around that could value it as much as at as much as 830 billion. Andy Jasse, Amazon's chief executive is leading the negotiations with OpenAI CEO Sam Alman. The shape of the deal should one be reached could still change. by the way, so I comment on two things for us if you could. First of all, , like it's a jaw-dropping moment, is it not that they're actually going to potentially raise this amount of money? I think the largest VC round in history was a couple billion dollars up until a few years. Now we're looking at a hundred billion dollar round. And then talking again about the the accesses around these companies. Now, the funny thing, you know, Amazon has long been an anthropic partner. they have, you know, marched marched people around their, you know, their new facility that they've built with their tranium chips talking about how they're, you know, deep",
        "start": 715.76,
        "duration": 1690.001
    },
    {
        "text": "talking again about the the accesses around these companies. Now, the funny thing, you know, Amazon has long been an anthropic partner. they have, you know, marched marched people around their, you know, their new facility that they've built with their tranium chips talking about how they're, you know, deep what's enabled them to build this data center and now they're going to go and put you know an absurd amount of money into open AI. What are the implications? Well, as we saying the the interconnections between this the sector are becoming more and more confused, intertwined. you know, nobody is nobody is looking for exclusive agreements anymore. Microsoft has broken with open AI. Amazon is seemingly on the break seemingly about to break with, you know, its pure backing of anthropic. 50 billion is obviously an extraordinary amount of money. I don't think we can call it a venture capital round anymore when you have a company as large as Amazon committing for that. And of course, as always with these figures, you know, such as the 500 billion Stargate project which was announced this time last year by Oracle and OpenAI, the devil will be in the detail. A lot of the way these deals are structured are actually very circular. You know, they they will be in the form of compute credits. So, the money that Amazon is putting into OpenAI will come back for using their AWS data center services. , and it'll be interesting to see how when the details come out of this fundraising, which you one imagines would be very soon, exactly what the terms of these contracts are. It's not just Amazon writing a huge check. Microsoft going to put a few a few billion in, we hear, but you know, not too much more because obviously they already own 27% of the restructured company. , Nvidia are putting more money in, but also SoftBank, the big Japanese conglomerate. They're talking about writing another $30 billion check. to finance this. They sold off a lot of their holdings of Nvidia, they've pulled out of a few other deals. So, whilst OpenAI must have has lost a little bit of its momentum, it's lost a little bit of its sheen. You may be hearing a little bit more noise about Gemini or noise about Claude, this funding round really shows that they are still able to compete out compete their rivals, you know, at least their startup rivals in fundraising. And if you know this is going to be a blunt force improvement of models by using more compute, open AAI is very much still out in the lead. But it sets up a really interesting 2026 and 2027 because they're all hiring advisers. You know, one of the the the talk of Davos were bankers and lawyers buzzing around trying to win lead roles on all of these deals. not just them, but also Elon Musk companies like",
        "start": 858.56,
        "duration": 1962.2419999999997
    },
    {
        "text": "But it sets up a really interesting 2026 and 2027 because they're all hiring advisers. You know, one of the the the talk of Davos were bankers and lawyers buzzing around trying to win lead roles on all of these deals. not just them, but also Elon Musk companies like the these pots of money will be tapped out. You know, investors will hit concentration limits. sovereign wealth funds might get cold feet. There could be another deepseek moment where everyone gets slightly panicked about, you know, closed models and the rate of development, but at the moment it seems to be full steam ahead. But in 2027, I can't I I can't see these checks of these sizes being written again unless you go to the public markets and you start giving retail sh your retail shareholders and big institutional pension funds, things like that access to try and finance, you know, their colossal ambitions for like data center and inference. Yeah. So I checked the largest IPO in history raised $30 billion for Saudi Arabia. Last week I said 40 billion. it's actually 30 billion. So the check from Amazon alone, maybe it's a check, maybe it's AWS credits, we don't know, would almost double the size of that round. And so I mean, so you think 2027 is where this ends because there's not I I just don't think there's enough money in the world, is there, to continue this cycle? There's Well, there's two sides to it, right? There's there's a finite amount of private capital or institutional institutional. By institutional I mean like you know big tech money that you can attract in but there's also a finite amount of money available on public markets as you pointed out the biggest IPO in history was Saudi Aramco 29 something billion in 2019 if you have anthropic coming to market you valued at 350 privately you know maybe optimistically double that on the public markets you have SpaceX which we'll talk about later looking at a1 to$ 1.5 trillion valuation you have open AAI I looking at over a trillion as well. You can throw other companies like data brick, snowflake, stripe, all of them might choose to come to market and list a portion. Is there enough money in the public markets around the world to absorb all of this? a banker I was speaking to, you know, a few weeks ago was like, I actually don't think there is, you know, so they can't really all go at the same time because they risk kind of like hamstringing each other in their ability to fund raise. So I think there does have to be like a certain cadence to this. , and also if you talk to people inside OpenAI and Anthropic, these are still very young companies. They're still sorting out their corporate governance structures. OpenAI in particular has a number of like pretty severe looking outstanding lawsuits from from everything from Elon",
        "start": 996.56,
        "duration": 2240.6439999999984
    },
    {
        "text": "like a certain cadence to this. , and also if you talk to people inside OpenAI and Anthropic, these are still very young companies. They're still sorting out their corporate governance structures. OpenAI in particular has a number of like pretty severe looking outstanding lawsuits from from everything from Elon away from a nonprofit to the New York Times suing them for like basically copyright theft. there's a lot to be ironed out before these companies can go on a road show, show some confident financials and really persuade people that they are, you know, going to be the next, you know, Google and Meta. Yeah. And before we go, you know, I just want to talk about one application that's sort of I would say emblematic of the hype and maybe potential in this space. And it came up in our Discord this week. It's something that used to be called Claudebot. It had to change its name because Anthropic wrote them a letter. but here's the story. What is Clawbot and why is everybody so obsessed with it? It's an open-source messaging first AI assistant that connect to chat apps. Can connect to chat apps like WhatsApp, Telegram, Mess, iMessage, Slack, Discord, etc. Remember context over time, send proactive nudges and trigger automation on a machine where it runs. Think of Cloudbot as a personal AI gateway that you talk through you talk to through messaging. You text it like a colleague, it replies in the same thread. your phone and laptop and tablet all day stay in sync because the conversation lives in the messaging layer. Then the service connects with your computer and can go and use it and accomplish tasks for you. Things like fetching data, generating summaries, running routines, and automating repet repetitive work. people have gone absolutely nuts over Claudebot this past week. what is your thought on Claudbot? Is it real? And what do you think it says about the moment we're in? Well, it shows that, you know, , a developer sat over in Austria in a very short period of time, vibe coding, can come up with a really interesting app that gains traction largely through word of mouth and through GitHub, GitHub, and can like show that AI can be used. Totally. This was totally vibe coded. This is what they the person said. They didn't even check their code. They just put it out there, which is how I'm not letting it use my machine if it's just if it hasn't, the code hasn't been checked. But the fact that it was vibe coded and is taking off like this is somewhat remarkable. Yeah. I mean it just shows you that this the field is really wide open for like the next killer app or use case for this. And you know whilst I think quite rightly all the AI labs are focusing on you know consumer users who are most",
        "start": 1138.24,
        "duration": 2506.4039999999964
    },
    {
        "text": "somewhat remarkable. Yeah. I mean it just shows you that this the field is really wide open for like the next killer app or use case for this. And you know whilst I think quite rightly all the AI labs are focusing on you know consumer users who are most replacement for Google search at the moment right but also the power users who are using it to code. But the real money, like the stickiness is getting these big multi-year 10 to$100 million contracts with, you know, you you know existing public companies, you know, to go in there and like replace a lot of the that the SAS software that they already have in there from like Workday or Salesforce. That's like the biggest prize at the moment. But that doesn't really capture the imagination, right, of anyone but an investor looking for like better a if you're just an ordinary person on the street, you're probably more interested in the video generation capabilities. And then suddenly Claudebot or actually what's it called? Malt maltbot now. the the strongly worded message from from Anthropic clearly had its effect. You know that can come in and like suddenly send messages and and people are willing to take a gamble on it even though it might have slightly janky code. And I just think it's really interesting that you know these things can come out of nowhere. And hopefully hopefully for the guy it'll work out and you know he'll gain some traction rather than just kind of disappearing or be copied by the by the more major labs. But it's fun, right? It just shows you don't really understand the contours of this new technology yet. Yeah, people are definitely having a field day talking about it. And the memes are really interesting. I think they're telling this one person on X Kevin Zu said, \"Gave Cloudbot access to my portfolio.\" He said, \"Trade this trade this to 1 million. Don't make any mistakes. 25 ST strategies, 3,000 reports, 12 new algorithms. It scanned every expost, charted every technical, traded 24/7. It lost everything, but boy, it was beautiful. , [laughter] Jimat Palapatia, I spent 15 minutes on Claudebot and saved me 15% on my car insurance. There's a little Geico code joke. , this other person said, set up Claudebot to text my wife good morning and good night every day. Also casual, how are you messages during the workday 24 hours? It was having full-on conversations without me even being involved. This is absolutely insane tech. I haven't talked to my wife for at least two days, and she seems happier than ever. I mean, I think that these memes are telling and that there is a it's a very interest very interesting moment. There is a desire among people to trade to to trust these applications with sometimes even more than they even know they should. Mhm. And just play around with it and",
        "start": 1273.6,
        "duration": 2779.4439999999972
    },
    {
        "text": "I think that these memes are telling and that there is a it's a very interest very interesting moment. There is a desire among people to trade to to trust these applications with sometimes even more than they even know they should. Mhm. And just play around with it and know. I don't think the the big technology podcast is advising that anyone outsource their relationship to a chatbot quite yet, but you know, maybe it might it might help some of you. Yeah, it might help some people who have bad texting form. Yeah, but you know if it if it can automate those little annoying parts of your day, you know that you that that that just like especially for those of us with like kids and busy jobs, you know, those those those precious those minutes saved can be very precious. Exactly. [snorts] Well, another very interesting thing happened this week and I want to get into that in depth, which is that Microsoft and Meta both beat earning expectations. They beat on profit and they peed on beat on revenue. Meta's stock shot up double digits and Microsoft's dropped double digits and I think it is very telling in what it says about the state of technology today. So we will talk about that when we come back right after this. And we're back here on Big Technology Podcast with Steven Morris, the San Francisco bureau chief at the Financial Times. Stephen, you couldn't have come on on a better week to be honest because we're in the thick of big tech earnings and you know while these earnings are typically like a good opportunity to check in on profit and loss among these companies we actually have like a pretty interesting story developing. So as I mentioned before the break Meta Meta had record sales. It jumped 10%. Microsoft also beat on revenue and profitability and it dropped. The market crushed it. I think it's down 11% on Thursday. , which is when we were recording. Yes, we're recording Friday edition on Thursday today. , but I think it still works. Anyway, , the thing about the thing that caused Microsoft to drop, people are saying, is that, , Azure revenue didn't grow as fast as they expected. There was some expectation that Azure revenue would grow , something like 40%, it's only growing 37 or 38%. both MC Microsoft and Meta's capital expenditures are going to go up. Meadows went from like a predicted like 110 billion on the year to something like close to 135 at the top range. I think this is notable because it just shows that there's so little room for error in this world that if you get you know if you if you get anything wrong the market will interpret that they are going that you're going to have some serious problems when it comes to AI. What do you think?",
        "start": 1411.28,
        "duration": 3076.9639999999963
    },
    {
        "text": "just shows that there's so little room for error in this world that if you get you know if you if you get anything wrong the market will interpret that they are going that you're going to have some serious problems when it comes to AI. What do you think? earnings that come out from these big tech companies. It's sort of a lottery. Like you look at the numbers initially and you're like, \"Wow, those are big beats on revenue, big beats on profit.\" Like we're seeing a 30 a 39% growth in Azure and huge increase in in bookings. And yet the shares plunge. Mic Microsoft gets absolutely killed in the market. And there are always games played by Wall Street, right? People don't just want to see you beat the analyst estimates. They want to see you beat the beat, right? And so Microsoft has found itself in this very strange situation where [snorts] a one percentage point miss in its Azio revenue momentum causes it wipes you know hundreds of billions off its share price and then people are also there are also several other things going on at Microsoft you know there are some very interesting things disclosed about open AAI but also its capex like Microsoft is on track to spend 140 billion this fiscal year which their fiscal year is a bit weird it runs from to June instead of to December. and that's pretty much with on track with what they spent in in the last quarter of of last year which was you know 37 billion. But people are questioning this. This is 66% more than they spent in the same period the year before. These are vast jumps. And then the other thing that caught people's eye was they had to disclose their relationship with OpenAI in a slightly different way now that OpenAI is restructured as a for-profit company from a nonprofit. [snorts] and they revealed that they booked 10 billion cash gain from the amount of cash open AAI has on its balance sheet due to all these like huge fundraisings that they're doing. But they also said that 45% of their future Azio contracts were based on OpenAI. So immediately on the earnings call all the analysts are like I was about to say holy s there but I should say oh my god you know 45% of your revenue is tied to open AI. Remember this is a company as we said before it makes a lot of revenue but it doesn't make that it doesn't make any profit. That's for a company the size and age of Microsoft to be that reliant on a single customer is a big red flag. A single customer that has a lot of noise around it and increasingly has competition from Google and Elon Musk and Anthropic. So the CFO spent most of the call trying to say oh well you know",
        "start": 1561.36,
        "duration": 3339.444999999996
    },
    {
        "text": "to be that reliant on a single customer is a big red flag. A single customer that has a lot of noise around it and increasingly has competition from Google and Elon Musk and Anthropic. So the CFO spent most of the call trying to say oh well you know means that 55% isn't and that's still 350 billion in revenue. But as you can see, the shares were down 7% at that point. When I woke up this morning, they were down 11%. So, I don't think Amy Hood, the CFO of Microsoft, did a very good job persuading everybody. But it plays back into what we were saying before about this diversification. Like Microsoft has spent a long time locking OpenAI down to lots of exclusive contracts with it, both through its technology and being and to be its main compute provider. It's then spent the last 18 months trying to get out of those. And that's why it's investing in Anthropic. That's why it's investing people miss this. is investing a lot in Mistral, the French AI house, because it believes that Europe is not going to let its AI be run entirely by a bunch of West Coast tech companies and Elon Musk. So, Microsoft is now all about the diversification. Before it was taking credit for turning a 14 billion investment into OpenAI into whatever the hell that will be worth, many multiples more when the company goes public. Now, it doesn't want to talk about OpenAI. It wants to talk about anthropic. It wants to talk about Mistral. It wants to talk about its own models and its own chips. , and I think that's a new story that it's trying to tell the market, which is why we saw his shares got hit. And then, as you said, Meta is this whole other story. This is my perspective here. I think we're just so early on in the AI game that the market is looking for any signal for where this is going. And it's like, oh, like there's a little bit of a slowdown in growth. Microsoft's going to lose the AI game. Meanwhile, we're so early in the buildout. We have no idea what's going to happen. We have no idea what's going to happen with Meta Super Intelligence based off of this quarter's revenue. So, it's all extrapolation based off of limited data. Exactly. And you look at the quarterly, the short-term quarterly reaction to the quarterly earnings, right? They're down 8%. Remember two quarters ago, we were talking about how Meta had 200 plus billion wiped from its valuation in a matter of minutes. Now, we're talking about how it had 300 billion added in a matter of minutes. But if you look at the long-term trajectory of all of these tech stocks, it's like this. You know, they're, you know, Google is now worth more than four trillion. Microsoft is, you know, lost its actually Google has",
        "start": 1694.72,
        "duration": 3582.2449999999953
    },
    {
        "text": "how it had 300 billion added in a matter of minutes. But if you look at the long-term trajectory of all of these tech stocks, it's like this. You know, they're, you know, Google is now worth more than four trillion. Microsoft is, you know, lost its actually Google has market cap race. Microsoft is still 3.6 and we've got Nvidia way out ahead of everyone at 5 trillion. The general trend is still upwards, but we just have this skittishness in the market as anyone's looking for any signs of weakening demand, the bubble, you know, contracting or even popping. But if it was just about spending, meta double is going to double this year its capex. So like spending on data centers and chips and servers and everything that goes into supporting that upgrading power structure, it's going to double it to 135 billion, you know, from 72 billion the year before. And that's not all that Zuckerberg is spending on over there. He's also spending hundreds of millions on compensation packages to try and attract staff, you know, from other leading AI labs to try and rebuild their own llama model, which of course felt fallen badly behind, has been a huge embarrassment for them to this point. But Meta was crucially able to show that AI is improving their ad targeting and their ad revenue and and their counterparties love this. You know, whether it's on Instagram, WhatsApp threads, Facebook. And so the market rewarded that. They're like, \"Okay, you're going to double capex, but you're actually also showing us like some tangible impacts from AI on AI, improving your advertising revenue.\" Because that's what Meta is, just a big advertising business. Microsoft hasn't done that. You know, Microsoft has made a great early bet on OpenAI, but it hasn't proven that it's like Office suite of products. It been meaningfully improved by integrating AI and you know, by and if they can meaningfully improve it, that means that they can charge more for it and they can increase their margins. That's the big game now for Microsoft. Can because it's a it's a software business and a data center business and I think the former has quite a lot of question marks about how it's integrating the various models into it. But here's my big point. I don't think we can read anything into what's happening already. I mean, it's we're still in the buildout phase. We're still in the picks and shovel phase. We're not anywhere near the point where economic activity tied to AI is exceeding the amount of money being spent on infrastructure. Yes, Meta has done some things with like you know generative like generative AI being used for creative optimization. Yes, they've done some things on using you know standard machine learning to better optimize their platforms. But there's no way that what Meta is doing today will have any bearing on whether its AI program",
        "start": 1818.399,
        "duration": 3859.6059999999948
    },
    {
        "text": "things with like you know generative like generative AI being used for creative optimization. Yes, they've done some things on using you know standard machine learning to better optimize their platforms. But there's no way that what Meta is doing today will have any bearing on whether its AI program personal intelligence thing. And so, you know, and Microsoft too, like we'll see what happens with Microsoft, but you know, they're, you know, it seems to me like all the jockeying has been like you mentioned, so much of their revenue is going to be coming from open AI, not end users who are deploying, , you know, AI solutions. And so I think the market is like blindfolded right now swinging around trying to be like who's winning AI who's not whereas like we won't know even you know who is leading for a couple of years. Yeah. And who is leading or having a good moment is anthropic at the moment. It could be Google again next. Maybe O Open AI knocks the lights, you know, blows the lights out with like an incredible new model with, you know, something that really captures captures the public imagination or is indispensable to, you know, Fortune 500 companies. , everything is so fluid and flexible. That's why it's so much fun to cover as journalists, right? But it's also pretty exhausting as well. And we haven't even gotten to Elon Musk yet. Oh, yeah. That's coming, Ben. And I I did hear that GPT6 might be coming in the second quarter this year. So maybe as soon as you know this spring which would be interesting. All right, one more company to touch on with earnings and then we can get into oh shoot we have so much to discuss. let's talk about Apple quickly and then the Amazon layoffs if we have a moment and then we'll get into Elon. So first of all Apple my prediction has been that Apple's going to have the best year you know of its history maybe you know in the past and going forward because it's in this moment where like there's no AI device and it's selling like crazy. , I'll just give one note from your story about Apple's earnings. By the way, blowout earnings. They did it. They beat on revenue. They beat on earnings. , the iPhone revenue grew 23% to 85 80 85.3 billion compared with the prior year. , I think the the estimation was it was going to grow something like 14 no 16. No, yeah, 14%. It grew 23%. This is a company that's been struggling to post double digital iPhone growth for a long time. to me, it just seems that Apple is kind of in the driver's seat in 2026. No AI device, no killer AI consumer app yet. but the iPhone is selling like hotcakes. What do you think? Well, the next iPhone was supposed to be",
        "start": 1959.36,
        "duration": 4140.886999999996
    },
    {
        "text": "iPhone growth for a long time. to me, it just seems that Apple is kind of in the driver's seat in 2026. No AI device, no killer AI consumer app yet. but the iPhone is selling like hotcakes. What do you think? Well, the next iPhone was supposed to be was going to be overhauled. It was going to become your de facto like personal assistant, and that just didn't happen. I mean, I'm sure we've you you've spoken about this on the podcast multiple times before, but what we have seen is the iPhone 17 was a blockbuster product. You know, it drove a huge upgrade cycle. I really interestingly in China as well, which you know, shows the tightroppe that tight rope that that CEO Tim Cook has been walking between Trump and China. You know, he's he's still on it, you know, despite claims to the contrary. , conspiracy theorists say that the the new OS update, Liquid Glass, performs so badly on the 14 backwards. And I have one of those, and I can verify that, yeah, it's pretty janky. I love driving the upgrade. That's amazing. Could be. You make an operating system that's so complicated to run, the old iPhones feel slow and annoying, so you upgrade in order to, you know, , for it to look slightly nicer. But you know after all these these reports that you know Apple Apple had lost you know the the smartphone market in China. It had bungled the AI opportunity. I mean this quarter did answer a lot of those questions right. People are still buying the iPhone above almost any other device. Geopolitics haven't disrupted its supply chains. it hasn't, you know, enjoyed sort of like hasn't suffered from a deacto ban in China because of the because of the trade war that's been going on. And, you know, they're not spending the hundreds of billions that their rivals are on building data centers and investing or investing in startups or building models. They just signed a deal with Google Gemini, much like their search deal to put to make Gemini improve Siri. So they're kind of outsourcing a lot of this AI stuff and they're just focusing on being the main device through which most people will experience it. And you know maybe long long term you over the next 10 to 20 years that'll be a bad bet but certainly in the short term they're saving a lot of money and still selling a lot of phones. Yeah, they seem like they're going to be in good shape for a while. And you're right, I think it is a long-term liability, but it's going to look really nice in the short term as all this spending happens and Apple just kind of sits there, partners, sells a ton of phones, , you know, maybe ships another bad design and then makes more people upgrade. They have the fold",
        "start": 2102.24,
        "duration": 4416.886999999995
    },
    {
        "text": "a long-term liability, but it's going to look really nice in the short term as all this spending happens and Apple just kind of sits there, partners, sells a ton of phones, , you know, maybe ships another bad design and then makes more people upgrade. They have the fold that this is this could be the the the year of Apple preceding the the last decade. , that's my opinion at least. and they're going to they they bought a very secretive Israeli startup today where the technology analyzes micro changes in facial expressions which they sort of say means you can communicate without talking. but I do think it shows that Apple is as Meta and Google are as well looking very closely at like wearables but in particular like glasses. , I guess another big tail risk for Apple is this Johnny Ive design new device, screenless device that OpenAI is helping finance, which we hear is a a big part of the reason why Apple decided to go with Google Gemini instead of Open AAI and Chat GPT to power Siri because you're like, okay, your Pixel is not really a competitor to the iPhone. It's proved that over a number of years now, but whatever this new Johnny IV device is could potentially be quite threatening. So, there's a lot of moving parts. , but Apple still looks pretty healthy. I mean, I don't have an iPhone 17 myself, but I did go to a h I did go to a Halloween party down in PaloAlto. , and the h the house I went to is next door to Steve Steve Jobs's wife. and she hosts an absolutely enormous Halloween party there. We're talking animatronics, like dozens of actors. People come from miles around to see it. The queue goes around the block. So, I chose not to take my daughters into it, but I realized if you stood in that queue for an hour at the end, they were giving everyone a bright orange Halloween themed iPhone 17. So, maybe I don't think she was she was giving them away, right? So, those probably don't count towards the sales figures, but you know, people were absolutely delighted by this device. and I can testify that looks pretty cool. I All right, I got to go to her party next time. That sounds amazing. I I'm going to say first of all an interesting thing speaking of you know we talked a little bit at the beginning of Anthropic having a moment here. actually Apple wanted to go with Anthropic first and they wanted to use cloud. This is according to Mark German said it this week. turns out Anthropic you know was basically trying to charge in a lot of money. Then they eventually went with plan B which was Google. So that's an interesting wrinkle. I have to tell you I don't think the device is going to",
        "start": 2241.839,
        "duration": 4696.533999999996
    },
    {
        "text": "to Mark German said it this week. turns out Anthropic you know was basically trying to charge in a lot of money. Then they eventually went with plan B which was Google. So that's an interesting wrinkle. I have to tell you I don't think the device is going to [laughter] next couple at least for the next couple years. I I really think that these AI devices are going to be a big letdown in the near term. Another humane pin. [snorts] I I mean it, you know, it's funny. We joke about the humane pin and we think, by the way, created by I think a couple of people who worked on the iPhone. and we think that of course Apple will come up with a much better idea than the humane pin whereas maybe the interaction layer just sucked. And I think that's not taken into account as often as it should be. It didn't help that it also overheated and exploded. Well, listen, I mean, you never really want that in your device, but you know, we we've seen we've seen companies get over that in the past. Yeah. Look, it was they everything that they could have done wrong, they did wrong. The product wasn't great. there were some issues with the safety side of things and they they gave they rolled it out with this very weird like emo video. Yeah, that's right. [snorts] Not not exactly a great roll out, but also that's what I'm saying. Like, you know, maybe all those things were the problem or maybe the form factor was the problem. And I think we're going to find out pretty soon what the answer is. All right. Speaking of of companies that try lots of different versions of products, with AI inside, we have Amazon. And Amazon did not report earnings this week, but they are laying off 16,000 people this week. This is from Business Insider. Amazon started notifying impacted employees Wednesday morning as part of its plan to cut 16,000 corporate jobs. the head of HR, Beth Galleti at Amazon, wrote this. I have important but difficult news to share with you after a thorough review of our organization, our priorities, and what we need to focus on going forward. We've made the hard decision to eliminate some roles across Amazon. unfortunately your role is being eliminated as part of the changes and your employment will end after a notification period. she also wrote basically like I you know I know that there's some indication that there's a new rhythm or some of you might think there's a new rhythm where we announce broad reductions every few months because I think what is this the fourth mass layoff that they've had over two years and she said that's not our fault. Amazon is a company that's like already operating with somewhat paranoid employees. So, this isn't going to make things much better. What's your",
        "start": 2385.28,
        "duration": 4964.966999999997
    },
    {
        "text": "reductions every few months because I think what is this the fourth mass layoff that they've had over two years and she said that's not our fault. Amazon is a company that's like already operating with somewhat paranoid employees. So, this isn't going to make things much better. What's your reduction here? And do you think it's a good or a bad sign for the company? there are two things I think that's going on. One is they hired a lot of people during the pandemic, you know, when when delivery surged and they really needed they needed to surge in their own workforce to cope with this. And I think we're seeing a correction on some of that now as as you know online commerce you know normalizes somewhat. But what we're also seeing is a company which you know 50 billion going into open AI plus a lot more into anthropic. I think this is a company preparing for an era of of AI whether that's you know both in its white white collar jobs but also blue collar jobs like working in the factories. I mean it's already one of the most automated companies in the world. , and if nothing else, Amazon is relentlessly focused on the bottom line. Anywhere it can cut costs in particular permanently, it will try and do so. So, it's a very uncomfortable situation for you to be if you are an Amazon employee. Of course, it working at Amazon is uncomfortable by design, right? They want to keep you right on the edge to make sure that you're constantly as productive and aggressive as you can be. But what we're seeing here, I think, is is a company that's that's getting ready for what it believes to be a completely different era of e-commerce, but also, you know, working in factories and producing some of the, you know, running and producing some of the technology behind its its various websites. , it just doesn't think it's going to need as many people in the future. I know the HR chief is trying to calm everyone down by saying this is not the new normal, but I would be very surprised as if this this is if this is the last mass layoff as Amazon we see in the next 12 months. So one one more question about this. Do do you think this is AI related as in do you think AI is take like automating Amazon employees jobs or do you think this is a financial decision that might make room for some of the AI investment? I think it's a little bit of both. I mean, it always is. They talked about thinning out layers of bureaucracy as every company does when they make cuts. , but I also think that they're seeing some of the, you know, employees that have been able to integrate AI into their daily work life and become more",
        "start": 2520.64,
        "duration": 5226.244999999996
    },
    {
        "text": "I mean, it always is. They talked about thinning out layers of bureaucracy as every company does when they make cuts. , but I also think that they're seeing some of the, you know, employees that have been able to integrate AI into their daily work life and become more looking ahead at that. , we don't have the exact demographic data of who they've let go, but I think it'll probably be more heavily weighted into the older employees that, you know, are maybe less able or less willing to adapt to this new AI powered way of working. , and certainly if you look, we get Amazon results next week, but there's no slowdown in momentum of the company's growth. So without even though they've been taking all these employees out of the company you see a short-term hit because you have to pay all of them severance but longer term your cost base comes down dramatically. Yeah. Amazon has this has a number of leadership principles that the company runs by and one of them is called invent and simplify. And what you think that means is like you you sort of put technological solutions into place and simplify processes. And generative AI sort of puts that on overdrive where like you can just simplify, you know, invent and simplify your own job. And that is sort of been a calling card and something that Amazon employees have been proud of for a long time. As they invent, they simplify and they go and they move on to something else. And I don't I wonder if that leadership principle will maintain the prominence that it's had within that organization and the and the support it's had among the employee base. if they realize that at the end of simplify it can be leave. It has to be invent simplify and then invent again. If it's invent simplify and leave, then that spirit of invention and and efficiency within the company could really suffer. Yeah, that's true. I mean, if it's innovate yourself out of a job, it's it's a difficult thing to get your head around. Yeah. And that used to be something they used to be proud of because they would get another job. But when that doesn't when that security isn't there, that's a problem. Okay, let's talk about Well, that's sort of what Dario was Darede was talking about in his 20,000word opus the other day. You know, we're going to see he predicts at least a lot of job losses. You know, as you fewer people are able to do so much more work or even a completely automated out of the process once they really start to get agentic, you know, agentic AI powered like co-workers, you know, working to a degree that they don't constantly have to be checked. Okay, very briefly, let's talk about SpaceX. Looks like an IPO is coming pretty soon. people are thinking it's",
        "start": 2653.599,
        "duration": 5498.565999999997
    },
    {
        "text": "of the process once they really start to get agentic, you know, agentic AI powered like co-workers, you know, working to a degree that they don't constantly have to be checked. Okay, very briefly, let's talk about SpaceX. Looks like an IPO is coming pretty soon. people are thinking it's with Elon Musk's birthday and some planetary alignment where on June 8th and 9th, Jupiter and Venus, this is according again to the Financial Times. Thanks for the great reporting this week. U Jupiter and Venus will be within little more than one degree of each other in the sky about the width of a thumb held at arms length. your thoughts. I mean, it's it's just another day in the Elon Musk Inc., isn't it? You know, reporting on this man is fascinating, but also extremely difficult because you often can't tell whether he's joking or not. , but he has gone out there told investors that he wants he thinks an IPO in June would would fall on an auspicious state. as you said the the conjunction of Mercury sorry Jupiter and Venus which is then on the 8th to 9th which is then joined again by Mercury in a few days later his birthday is obviously in that month 28th of June is a Sunday though so of course you can't hold an IPO when markets are closed on a Sunday but he's thrown out this idea he likes to light a fire under people everyone's saying you can't do an IPO in particular of this scale on that time you know in that time frame but you know Musk Musk's first principles, right? You question everything. You and you force people to just work hard and get it done. there are other things you got to take it with a pinch of salt. You know, this has been a big story in Europe, at least over the last few weeks. He got into a bit of an an online spat with Ryionaire, which is like a budget European airline. over them refusing, you know, they're notoriously cheap, like you have to pay for everything if you don't want to sit on the wing. and they were refusing to put Starlink on the planes. And obviously Elon wants Starlink on the planes because it earns more money and they were arguing about drag. So he threatened to buy the company, fire the CEO, guy called Michael Oolir. He's quite a big figure in the UK and replace him with somebody called Ryan. this is how of course the Twitter acquisition started him threatening to buy it as a joke for for so you never know where it ends up. But you know the we're hearing the June timeline despite the planetary alignment angle is a real thing. But then just today you you get all these other stories coming out that he might have ambitions to merge it with one or more",
        "start": 2791.2,
        "duration": 5757.284999999996
    },
    {
        "text": "you never know where it ends up. But you know the we're hearing the June timeline despite the planetary alignment angle is a real thing. But then just today you you get all these other stories coming out that he might have ambitions to merge it with one or more that very well could be the case. I mean we haven't heard anything solid about it yet but those are the rumors out there. Yeah. I think the rule with Ryionaire is in the jurisdiction that it's in a American or a non-European cannot be the owner. So that sort of idea is out the window. But I'm sure it's not beyond Elon to set up a set up a European subsidiary, staff it with one of his people and and buy it that way. Yeah, it wasn't made to be broken for Elon. That that could happen. the the company that you you referenced that people have been talking about yeah, SpaceX merging with is is XAI, which would be really interesting. I think not a great combination if you ask me, especially, you know, SpaceX is highly regulated. it's a government contractor. XAI recently was, you know, bikinifying people on on Twitter. I don't think that's I think that's some sort of risk there. but I am I for so so actually I am curious to hear your perspective. What is the sort of most logical reason for why those two companies would combine? The most logical reason is that SpaceX, one of the reasons that have been given, you know, privately to investors for wanting to IPO SpaceX is that it needs to raise money so that it can develop and build data centers in space. They argue that it's very cold when you're facing away from the sun, so you don't need to pay for cooling. He already has a network, by he I mean Elon Musk, a network of 9,000 Starlink satellites, all linked and coordinated by lasers. So you've got kind of like the communications infrastructure out there. and you have unlimited solar energy, not not affect not affected by the atmosphere. So I know it sounds like crazy sci-fi stuff, but this is what SpaceX has constantly been based around. I don't think anyone thought the largest rocket in the world would be the booster stage would be caught by giant mechanical arms just a few years ago, but he's proven that that was a technological challenge that was surmountable. So the argue the argument is you put them together. XAI obviously you know builds the models X which of course was another Musk company which was merged I think last March with XAI. That's the distribution that Grock goes out under. [snorts] And that's how Musk is going to win in AI. Like his models might not be as good. He doesn't have the same revenue but what he can do is win the data center race. You you know",
        "start": 2923.119,
        "duration": 6031.685999999994
    },
    {
        "text": "March with XAI. That's the distribution that Grock goes out under. [snorts] And that's how Musk is going to win in AI. Like his models might not be as good. He doesn't have the same revenue but what he can do is win the data center race. You you know anybody else. And he's not the only person looking at doing this. Google's also looking at it. Jeff Bezos is looking at doing it through you through his blue blue origin rocket company. So that's kind of the bull case. That's the rational case. The conspiracy theory is that you know XAI is worth 250 billion but has you know a tiny multiple of that in terms of revenue. It hasn't gained that much traction despite relentless promotion through X and on social media and that like a lot of Elon's very wealthy friends are invested in XAI. , and the easiest way to make sure their investment is protected, just like how we made everybody who invested in his acquisition of Twitter hole is to merge it with a more successful company that's the undisputed leader in its field, which would be SpaceX. So, you put them together, everyone enjoys the upside. , nobody loses money and you , crucially invest in the next Musk fundraising knowing that he'll always have your back and make you whole. Yeah, the training in space thing is fascinating. I mean the stuff that people think of and I know Google is also thinking of doing something similar. So that to me thank you for offering that. That is the most logical explanation. All right let's end on this. This IPO SpaceX IPO when it happens it's going to be massive. I mean is this you know in some ways a test for because it will be I I imagine it will be the biggest IPO ever. Is this going to be a test case for what it will look like even though it's completely different industry for what it what it will look like when the AI companies decide to go public? Yeah, I mean we're hearing 50 potentially raising 50 billion at a 1.5 trillion valuation. It'll be a real test whether the global markets can absorb this. I mean one of the people are desperate to invest in all these hot private companies like Stripe and SpaceX and Anthropic and you can kind of get exposure to it by hook and by crook but the real game changer would be if Elon's army of online fans who have propped up the sh Tesla share price for years become SpaceX fans as well because then you just have access to you know pools of liquidity and capital so much larger than what they've ever had access to you know in the past. I think if Musk can show through the SpaceX IPO that there's huge retail demand out there through, you know, either pension funds, but also Robin",
        "start": 3062.72,
        "duration": 6302.965999999993
    },
    {
        "text": "access to you know pools of liquidity and capital so much larger than what they've ever had access to you know in the past. I think if Musk can show through the SpaceX IPO that there's huge retail demand out there through, you know, either pension funds, but also Robin can invest your personal cash. That could be a real game changer because that would give the rest of these the startups that are less mature companies the confidence that they're not going to go out there and have a real disaster because remember there's there are a few things worse than listing seeing your stock price decline have having all of your stuff demoralized because they thought they would they thought their stock was worth this and it's in fact worth that. and then be out there you know with colleague likes being shown on your balance sheet like it's a it can be a very comfortable thing to be private before you really have established net income. So we'll see. I mean, it's going to if it does go ahead in June, you know, which we're led to believe or, you know, have have reported out that it will be, it's going to be an absolutely blockbuster summer. Yeah, it'll be fascinating to watch. All right, Stephen, tell people where they can find your work and the work of your team. Well, the Financial Times is obviously, you know, one of these legacy media instruments. We do print and newspaper. It's salmon pink, very recognizable, but you should go to ft.com. We're all over Instagram, X, wherever. , we've got a great team here in San Francisco. So, , I hope you have a lot of subscribers watching this show. All right. Well, love it. I I always love reading your work and it's really great to be able to speak with you again here [music] on the show. So, Steven Morris, thank you so much for coming on. Thank you for having me. All right, everybody. Thank you for listening and watching and we will see you next time on Big Technology Podcast.",
        "start": 3199.76,
        "duration": 6465.446999999992
    }
]