[
    {
        "text": " Google's latest model has open AI concerned it's losing its edge. Jeff Bezos is back in the AI startup game. May I meet you? Says Bill Aman. And has AI music passed the uncanny valley. We'll cover it all on a Big Technology Podcast Friday edition right after this. Welcome to Big Technology Podcast Friday edition where we break down the news in our traditional, coolheaded and nuanced format. We have a great show for you today because we are going to cover how Google has come and effectively equaled OpenAI's technology causing Sam Alman to write a memo saying the vibes might be bad for a while. We will also touch on Jeff Bezos entering the AI startup game. We'll talk about Bill Bill Aman's pickup line. And then we'll also cover this unbelievable AI song or some a song that people have started to hate and what that means for creativity. Joining us as always on Fridays to do this is Ron John Roy of Margins who's here with us in studio today. Ron John, great to see you. There's no rough vibes here. I'm in the financial district face to face with Alex today. So I'm excited. We are here. When the AI bubble crashes, this is going to be the place where it all goes down. So, we're just giving an early scout out. We're going to go take a look at the bull and the vibes here and see how things are going for the inevitable AI crash. Maybe it will crash, maybe it won't. Who knows? Well, the stock market is up at time of recording. S&P's up 1.4% today, but it's been a bad week. It's been a bad week, but maybe maybe we're back. Maybe we're back. I don't know. I mean, a week, and we'll get into it, but a week where Nvidia does what it does, which is crush earnings, is typically followed by a pattern of the market saying, \"Oh, we're we're good for now.\" And shooting higher. But we had a very different effect this week. Following on our conversation about the AI bubble with Gil Laura last week, it's like, \"Oh god, like the market really is concerned here.\" No, we're gonna we're going to talk markets. We're going to talk debt. We're going to talk AI. We love debt. We love debt. Bill Aman pickup lines, of course. Right. which people are actually saying is working. So I'm sure it is. We'll get to that. Sure it is in the second half. But to begin with, so obviously this week the big news in the AI world is that Google came out with Gemini 3, its latest AI model. Gemini 3 smashes the benchmarks. It crushed on the Arc AGI test. It's currently at the top of the LM Marita leaderboards. And even Sam Alman came out and said, \"Hey, good model.\" Like, you know, good game. Congrats. , the information comes out with this very",
        "start": 0.08,
        "duration": 312.15999999999997
    },
    {
        "text": "latest AI model. Gemini 3 smashes the benchmarks. It crushed on the Arc AGI test. It's currently at the top of the LM Marita leaderboards. And even Sam Alman came out and said, \"Hey, good model.\" Like, you know, good game. Congrats. , the information comes out with this very forecasts rough vibes due to resurgent Google. , here's the story. OpenAI CEO Sam Alman told colleagues last month that Google's recent progress in artificial intelligence could create temporary economic headwinds for our company. Though he added OpenAI would emerge ahead after OpenAI researchers heard that Google had created a new AI that appears to have leapfrogged Open AIs in the way it was developed. Alultman said in the memo, \"We know we have some work to do, but we are catching up fast and he cautioned employees that I expect the vibes out there to be rough for a bit. I have not heard OpenAI talk this cautiously ever and and never admit that it's been surpassed by anyone. So, this is a watershed moment.\" No, no, it's a big deal because when you think about anthropic, you think about Microsoft, you think about meta, open AI from just a pure kind of like model sexiness, that's my benchmark of choice. I don't know how it's calculated, but it's important has not been equaled at any point in the last number of years. like there'll be some kind of like you know lowgrade benchmark which someone might like you know get excited about but in terms of actual buzz around a model release OpenAI GPT5 was a flop in terms of actually meeting the hype and Gemini 3 had people more excited than I've seen them in a long time around a model launch. So that's OpenAI's game and they're losing at it right now. It was like almost the opposite from what we're used to, right? like the Google does an announcement and everyone's like okay and opening eye blows it out of the water this time people were genuinely excited like I mentioned Gemini 3 is at the top of the Alam Marina leaderboards and trailing it is actually Grock which is funny and we're going to get we're glazing Grock we're going to get to Gro to me that you know so obviously Sam Alman wrote this memo anticipating Gemini and I thought the most interesting part about it was how he said that Google's success here which is it's undoubtedly success ceeded is going to create temporary economic headwinds for our company. And I'm very curious what you think that is because is he saying that this that people will subscribe to Google products instead of Chat GPT and that could slow down the growth or and I think this is the real issue if Chat GPT loses that sheen as being the leader the undisputed leader the first the the lab that's most likely to be first to AGI",
        "start": 155.76,
        "duration": 608.0789999999998
    },
    {
        "text": "subscribe to Google products instead of Chat GPT and that could slow down the growth or and I think this is the real issue if Chat GPT loses that sheen as being the leader the undisputed leader the first the the lab that's most likely to be first to AGI continue to raise money and keep going on with this financing run that it's been on. All right, I'm gonna There's two layers to that statement, I think. So, economic headwinds, I think you're completely correct. Chat GBT is the verb. Google was the verb for search. Chat GBT has earned verb status for every single person I know. That is the term they use for any AI chatbot, especially if you're not in the industry. If they lose that to Google and Gemini and someone somewhere says I geminied that, it's a real problem. It's a huge problem. So, so there's a consumer side, but my kind of like not conspiracy theory, but the one of the bigger parts of this story again was that Google trained Gemini on their own TPUs. And in terms of the overall compute story that open AAI is at the center of and we'll get more into again this circle circular financing across the oracles and open AIs and Microsofts of the world. If suddenly Google shows there's a more economically efficient way to actually build these new models. I think that actually is much more of an economic headwind because that screws OpenAI's entire I'm not gonna say shell game, but just I'm gonna say very creative financing structures that they've built across their entire across the entire industry right now. Like that is this a deepseek moment the way Google actually built Gemini 3 and does it change the economics of how these models are built? I think is one of you know like I've seen coverage of it. I've seen discussion around it but it definitely was not at the center of the conversation right and in a way it doesn't even matter if it's more economically efficient I think the c well one way of saying it about the economic efficiency is that they have uncon less constrained access to TPUs compared to everybody trying to build and train on Nvidia GPUs right TPUs is Google's proprietary chip they design them they have them at the ready they are less supply constraint than Nvidia GPUs and maybe Google you know even if it hasn't found this like efficient way to train a model just the fact that they have these chips at their disposal whereas competitors like open AAI have to go and you know buy them at at a very high cost from Nvidia that is that's a real leg up and they could really exploit that advantage. Yeah. So I think at both of those levels, economic headwinds is almost a light way of saying it. I think it's even more interesting though that like",
        "start": 306.72,
        "duration": 928.4799999999993
    },
    {
        "text": "at at a very high cost from Nvidia that is that's a real leg up and they could really exploit that advantage. Yeah. So I think at both of those levels, economic headwinds is almost a light way of saying it. I think it's even more interesting though that like curious about is like internally how does he speak to his team regularly versus how he speaks outwardly because we all know Sam Alman is not shy about being a bit grandiose, bombastic, ambitious, whatever word you choose. , but internally is he typically more realistic and measured with his team or is he when he writes a memo, he has to know it's going to get leaked, right? Like what what is the is the way he's communicating around this significantly different than he how he has in the past? What do you think? Yeah, I think it's definitely a change. And again, going back to like the way that we open this, the fact of the matter is that we haven't seen OpenAI ever say we have to catch up because it hasn't been the case. So, I think that like I almost think back to him getting frustrated in that interview about how they're going to pay for the infrastructure and he goes like enough. , and that was probably right around the time that he sent this memo out. So, it could just be this like oh god. No, I mean honestly I have watched that clip over and over again. Like the f when it first came out I saw it circulating. This is the Brad Gersonner interview where he asks him very you know like nicely you know 14 billion in revenue or 17 whatever it was and 1.4 4 trillion in financing commitments and Sam gets positively indignant and is like not only of course we're going to you know our revenue is up into the right it's hockey stick growth and then oddly got into you know like well if you don't want your shares someone else will buy them like that I I don't know the more I watch that I'm still convinced that's going to be kind of the moment yeah the Rick Santelli 2008 for any longtime global financial crisis people out But the fact that that happened along this basically at this moment where he realized what was coming from Google that like shows I wouldn't say panic but the level of they got knocked off their mark in a way they haven't been recently. He's not he's off his game. He was off his game that day and you're right timeline wise it matches up. I kept thinking about this other quote right remember because Sam Alman teamed up with Satya Nadella and Sadia what did he say once chat came out and started taking off? I'd like to make Google dance. And now Google, by the way, we're gonna talk about it. Google today",
        "start": 468.16,
        "duration": 1217.04
    },
    {
        "text": "I kept thinking about this other quote right remember because Sam Alman teamed up with Satya Nadella and Sadia what did he say once chat came out and started taking off? I'd like to make Google dance. And now Google, by the way, we're gonna talk about it. Google today mean, they're still both doing great. 3.59 trillion or so to 3.5 trillion. But in turn, Sundar had he did have to dance. Sundar's dancing. And he's he's made Sam Alman dance as well. Yeah, Sundar dancing is just an amazing image. I've never seen a clip of Sundar dancing. You could probably create one on one of Google's image generator. That's my next nano banana task after we're done recording our dancing. I you know we're going to go we we obviously are going to talk a little bit about how Google's doing so well. There's just so still so careful on the product side. It drives me nuts. like I asked for like a training plan to like you know for this hike I was doing and it was like this is not really going to work because it's dangerous and I had to write back are you kidding me? like it's just totally normal and that they have this level of safety on this model and I again I tried to alter Sundar's picture today with nano banana I couldn't that to me is the biggest drawback so I was able to generate fully like real lifeenesses of Jensen Sundar on Nano Banana oh on yeah on Gemini 3 I got to see see the way maybe they're relaxing that a bit on children's mode of they must have me they must they'd be like this guy's a reporter he's going to write about us you doing the glue on the pizza and the rocks. So, so we just shouldn't let him do anything. Well, I got full access. You do? All right. I got to get Ron John's Nano Banana account really and have fun this weekend. But, , you know, I I think underlying this, you know, Yeah. Okay. So, what if OpenAI does leap back forward in some I mean, Sam didn't say like we're behind on everything, but there are some areas that he says that Google has surpassed us in. And so I kept thinking, well, what if OpenAI, you know, leapt back forward because , you know, we've been talking a little bit about Gemini 3. Both of us know that it's, you know, doing well on the leaderboards, but it's not like it's a brand new experience, , on when it comes to using AI AI chatbots or AI chat or tools, whatever it is. And that to me points to the bigger problem which is it seems like if we're not there yet we're we're getting close to the era of commoditization of these AI models that you know you know before let's say open",
        "start": 615.6,
        "duration": 1472.7199999999998
    },
    {
        "text": "chatbots or AI chat or tools, whatever it is. And that to me points to the bigger problem which is it seems like if we're not there yet we're we're getting close to the era of commoditization of these AI models that you know you know before let's say open advantage and maybe charge more or you know grow chat GPT you know faster than others. and then you have you know with the fact that like they're now neck andneck with Google seems to indicate that like maybe you know after you know three years we're here I think today today or this week is the three-year anniversary 2022 right of of chat GPT's introduction that maybe these models are commoditizing in a way you know chatpt can code well and so can anthropic and you can chat with Gemini you can chat with open AAI and and that that introduces a whole new economic question about about the viability and the profitability of these companies. Yeah, I think actually in November 30th, so we're nine days away from our big three-year anniversary of ChachiPT's launch. , yeah, I think Gemini 3 and we'll get I really want to get into the kind of like pre-launch marketing campaign basically which was incredible launched by Gemini, Google, Sundar, all of them. But as I used it, nothing really changed. Certainly nothing in my day-to-day life changed dramatically. , I all the things that I'm told by X number of influencers on X , you know, like I create a product design. Cool. Create an infographic based on an article. Cool. Actually, it just reminded me that infographics are like the most boring form of media imaginable. Sorry for any infographics folks, but like I think to me the entire technological push of what's possible is nice and exciting, but still integrating it into everyone's day-to-day. There's and I don't like this is both model and product that Google is releasing with Gemini 3, but I still feel that model race is not the most interesting part. But I do think like what makes this so scary for chatbt is Google's distribution because claude going consumer is like non-existent when someone has to sign up find about it. It's a whole marketing exercise. But if Gemini 3 fully replaces Chat GPT or is as good, that is really scary because when everyone already goes to google.com and can move right over to Gemini from a consumer standpoint and that is OpenAI's entire business like I mean majority that's a problem. Yeah, I I want to get to that in a moment because I did write the story in big technology about how Google has had this you know unbelievable comeback. I mean early 2025 people were asking should be fired now he's dancing now he's you know dancing on top of the models that he surpassed. but just getting to the let's go to the commoditization question quick. If the",
        "start": 746.079,
        "duration": 1824.7999999999984
    },
    {
        "text": "about how Google has had this you know unbelievable comeback. I mean early 2025 people were asking should be fired now he's dancing now he's you know dancing on top of the models that he surpassed. but just getting to the let's go to the commoditization question quick. If the like of course they'll they'll all have like their own strengths but let's say Gemini isn't all that different from GPT which isn't all that different from Claude which isn't all that different from Grock. How does that change the economics of this AI moment? Yeah. I mean, , I've been talking about this for a long time that I don't I think this is product not model. We're all getting there. Everyone's getting there. It's all good. You know, like Arc AGI score or like I think what was the other one? It was like the final test of humanity last humanity's last exam. It scored at 37.5% up from 20. None of this stuff means anything to me. I mean it's all kind of academically and intellectually interesting but in reality what is it actually doing for individuals and I we're definitely at I don't want to say a plateau I think the amount everyone is going to be using these tools week to week whenever I see friends like every non- tech friends everyone is using certainly chat GPT more maybe I'm going to hear them say saying I'm going to use Gemini more but I think there's so much more to be done at the product level and actual like utilization level that the models it's good but everyone's models are good right now. All right, let me give you the counterpoint to that before we move on. The counterpoint would be that you as a like you know everyday user might not see a big difference but what these models are doing is they're becoming much better at tougher questions that like you know maybe previously they weren't very useful for scientific discovery. I'm just like going to try to channel what the model companies would say. And now, you know, the their their new model, which is going to feel like, you know, maybe a little bit warmer like Gemini 3 is supposed to and a tiny bit smarter when you chat with it and not very different in an everyday use case, , from, let's say, a GPT model. But those specialized use cases and that that sort of next level of intelligence is much more useful when it comes to things like you know science and industrial you know signal reading and things like that making sense of it out of an Excel spreadsheet. Yeah. But I I I I appreciate the effort. I appreciate the effort. But I think yes curing cancer like doing incredibly complex things I understand like that model advancement is going to be important and maybe if open AAI is the CFO hinted recently are doing",
        "start": 924.24,
        "duration": 2119.1189999999992
    },
    {
        "text": "an Excel spreadsheet. Yeah. But I I I I appreciate the effort. I appreciate the effort. But I think yes curing cancer like doing incredibly complex things I understand like that model advancement is going to be important and maybe if open AAI is the CFO hinted recently are doing companies around drug development maybe affects the business but OpenAI is a consumerfacing chat company. I know Sam Alman says they're going to be a cloud company and a consumer devices company as well and they have a small enterprise business but they're a consumer company and that's where all of their business is. So if they get screwed on that, if they face genuine competition, which they have not yet, it's a problem, right? And so let me go like you know somewhat shallow or decently deep into knee deep into the story that I kne into the story that I wrote about Google which is available on big technology.com. how Google pulled off its stunning rapidfire AI turnaround. A couple of things that I thought were interesting and worth talking about from my reporting. first of all you know the distribution part is is that you brought up the fact that Google has all these products and can distribute the AI technology through them is fascinating. and and Google like to be able to go from where it was which was like on the sale rack in terms of stock price in January to where it is today which is like again three you know surpassing Microsoft you know a big part of that is how its AI story has turned around and it's actually been able to build these great models and and productize them. What they've what they did was this is something that Sundar has done. He you know Google had these these product areas right PAS that they call them internally everything needs an acronym in tech and they held almost all the power within the company. So you had you had search as one product area and cloud and geo which contains maps and they would be the ones that would sort of control things at Google and then you had the AI research houses doing their long-term research off to the side. What Sundar did which is really interesting is he took you know brain and and deep mind Google brain and deep mind which we know consolidated them that that gave them access to the TPUs instead of having to fight over them they were able to access them together and then he made them like the model building the core part of the company right the idea was instead of having the product leads dictate to the AI team what they needed he turned the AI side into the engine room of the company which is how they refer to internally build the best models and then they farm that out to the product teams for the",
        "start": 1072.799,
        "duration": 2396.076999999999
    },
    {
        "text": "was instead of having the product leads dictate to the AI team what they needed he turned the AI side into the engine room of the company which is how they refer to internally build the best models and then they farm that out to the product teams for the from the story. Hundreds of engineers from search which is the most important product at Google which is responsible for more than half the revenue. hundreds of engineers went from search to Google deep mind just to you know give you a sense as to how important that was and so that obviously has really paid dividends with a strong model and the products reflecting it. I mean, as you're describing this, I have to like wonder. It is like at a company of that size to pull off something not only that complex, but also strategic and smart is insane. Yeah. Like this is like a McKenzie consultants like dream here. And I'm wondering actually I wonder if like there's no way one of the management consultants came up with that I think. But but like that exactly like reshaping your entire organization and I think like especially in Google's early years or year of bard and duet and some stuff showing up in one part of the product and some stuff not sh not not showing up. You felt it in the product and now you very quickly see like Gemini showing up in Google maps. So, so every individual person out there can feel that corporate restructuring basically. So, yeah, I think that's that is actually go sundar dance away. I got a well done. I got a quote from a rival AI lab source that was just excellent. , this person said they went back to the tech to the technology stack to focus on making that world class above all else and then worry about the experience that's going to enable it's going to enable a secondary, not the other way around. not trying to build some ridiculous experience and then get the technology to map. And speaking of the AI team, they took over with real agency that they were given from Sundar to make critical decisions. What happened? Decisions got made faster, they move faster, and the technology quality and capability increased dramatically. I mean, again, working in the enterprise world, like just to be able to pull this off is is massively incredible. And you look at it like and you can talk about meta but you can see where it does not work in a way and you can imagine Zuckerberg's frustration where why he gets to the point of doing out ungodly amounts of money because realizing like when you're a large complex organization especially if you came from the startup side of the world and to feel that kind of viscerally and understand like oh yeah we are so heavy and fat as an",
        "start": 1213.919,
        "duration": 2706.4769999999994
    },
    {
        "text": "to the point of doing out ungodly amounts of money because realizing like when you're a large complex organization especially if you came from the startup side of the world and to feel that kind of viscerally and understand like oh yeah we are so heavy and fat as an able to do what we need to do quickly. I mean, yeah, go sundar. I think one thing that is interesting to me though, and I'm guessing we have plenty of listeners who are Google Suite users, is you can still see that kind of product friction and infighting in terms of how Gemini shows up in Google Workspace because like have you do you ever use Gemini in Docs or Sheets? I'll be honest, I try not to touch it. No, no, it's terrible. Like it's terrible. And it's so odd cuz you can in Gemini access your sheets and h do stuff to them much more effectively than if you are in Gemini in sheets and actually trying to do any kind of work and but but that's where you can feel the product friction that like somehow the owner of sheets which sits in Google workspace which is under Google cloud is going to be you know different is going to still own that product in a much more like a cohesive way versus when you're, as you said, Gemini is going to be directly going into maps and the Gemini team owns that interaction. Yeah. No, it's there's definitely still going to be some tension there. , without a doubt. All right. You mentioned Meta. A couple things on meta. Then we'll get back to our Google story. First of all, , as I think you predicted, Yan Lun has left. Inevitable. I'm not going to even take too much credit because the most likely thing ever, most most likely prediction I've ever made. Yeah. He's going to start his own startup. looks like Facebook is going to fund it. oh. So in part. Okay. So hopefully Jan will come back and talk to us about that when that happens. and then I I have a little bit of reporting but not too much reporting on the state of AI efforts at Meta. I you know I I can't get too specific about this because it's not like strong enough to report, but let's just say this. Mark Zuckerberg hasn't said a thing about AI. I don't know in how many weeks. Wait, you're right because probably maybe a year ago like we went through that whole phase of like Zuck on what are those hoverboard things called the when you're surfing but you're kind of elevated carrying the American flag. Hydro foil. Hydro foil. Hydro foil. , you know, like we went through that phase of even hot Zuck where there was that like AI generated improvement of him and everyone like he leaned into it. He was front and center for a long time.",
        "start": 1371.6,
        "duration": 3010.2380000000007
    },
    {
        "text": "elevated carrying the American flag. Hydro foil. Hydro foil. Hydro foil. , you know, like we went through that phase of even hot Zuck where there was that like AI generated improvement of him and everyone like he leaned into it. He was front and center for a long time. Just remember Llama, right? I think their most recent large language model was a failure. I think that's what led to this. And again like I don't feel confident enough to like report this you know the details of this like as as I would in a story but I can let this little you know crumb out which is that it doesn't seem to be going well there. it does not seem to be going well in TBD or the super intelligence push and you know we've we've seen some stuff on their vibes app but nothing on model and of course this takes a bit of time but from my understanding it's not going well there yeah I'm even trying to remember what did vibes do again it was the the presuno nota presora it was it was a video generation y I mean I'm not even going to make the joke about vibes not having vibes but Like I mean you could do that. You should do it. If you don't do it, I'll do it. It's already done. Vibes are Vibes are not good. Vibes are not good. Rough vibes. Vibes over on vibes. yeah. I mean, the fact that you bring that up, I cannot get over like how much in my headsp space Mark Zuckerberg was on AI efforts very re like six months ago, 12 months ago completely disappeared. Yeah. I think there's a reason for that. Yeah. Okay. All right. So, we'll we'll pick I'll do more reporting and pick that up. If you're if you have any insight on that, you can just email me big technologyodcast@gmail.com and I'd be happy to speak with you. Let's talk a little bit though. , one one more thing I want to bring up on the Google front. , I went through for this story. I went through their their numbers. First of all, they had the first hundred billion dollar quarter of its history. In the third quarter, , search made up 56.56 billion. , it was just a couple digits away from 67.67 billion, but if you have kids in the car, you'll hate me. Sorry. , but it was it jumped I'll stick with my vibes. 15%. It jumped 15% in the third quarter. And , why? So, so we both know that chat we all know chat GPT has been doing really well. 800 million weekly users. Hasn't dented search revenue at all. And I spoke with Brian Weiser from Madison and Wall. He's a star ad watcher and analyst. he said this about the fact that open AAI has not cut into Google's revenue which is should be",
        "start": 1525.76,
        "duration": 3299.4360000000024
    },
    {
        "text": "been doing really well. 800 million weekly users. Hasn't dented search revenue at all. And I spoke with Brian Weiser from Madison and Wall. He's a star ad watcher and analyst. he said this about the fact that open AAI has not cut into Google's revenue which is should be competition practically speaking because it's not about the consumer it's about the advertiser there are two things that can happen and they're independent of each other to a large degree in the short term one is you can have more competition from a consumer perspective but until there's a consumer operation sorry but until there's a commercial operation there won't be any shift in budget so because open AI hasn't built any added infrastru structure as far as we know doesn't matter to Google that people are using it. People are still going to spend with Google. Maybe they'll spend a little bit more per click. but basically Google's continued to search because there's still no competition for search advertising at least from a commercial perspective. And I thought that was fascinating. Yeah, that's it's it's a good point because like I'm deep in the whole GO AEO like generative engine optimization conversation and people don't actually bring up like there's a consumer side of it and there's like any number of studies showing I actually do believe this Black Friday and holiday season is going to be kind of like the breakout moment for people finding products and doing shopping on generative like LLM chat bots but there's no business model on the other side. So if you're an actual advertiser, your money is still going to Google on search, right? So yeah, that makes that makes a ton of sense and said it. But when our when Fiji Simo launches that OpenAI ads product and we get our morning open AAI pulse and it's just full of ads, then maybe there's going to be some competition. My hot take is they're going to need a completely different executive to build up. they're going to need like adte people and so Fiji will run the consumer product side of things but she's more of a product person so I mean of course I guess she had some ads with Instacart but no that was a very successful part of the Instacart business like I would say they led that entire market which Door Dash followed on very effectively but like the idea that Instacart is an ad platform she she built she she made that a reality yeah so that's probably you have to build the infrastructure I was looking through open AI guys LinkedIn yesterday trying to see like do they have any ad tech people? I couldn't I couldn't find any. Huh. Well, because it almost it's like such a like you walk into the OpenAI office and you're an adtech guy. You're not going to be you're not going to be that.",
        "start": 1671.679,
        "duration": 3570.4780000000014
    },
    {
        "text": "yesterday trying to see like do they have any ad tech people? I couldn't I couldn't find any. Huh. Well, because it almost it's like such a like you walk into the OpenAI office and you're an adtech guy. You're not going to be you're not going to be that. like I think Netflix has done a partnership with a company like the trade desk which is fun. So that could that could end up being no I feel something that if that's truly going to be part of your business. But actually if you think about it Sam Alman again going back to that Gersonner interview started you know he says we're a cloud business we're a consumer. He didn't say we're an ads business. So that that should show what he thinks about ads. Yeah. that like if you're saying things that you are nowhere near doing and are so out there as potential lines of business, but then something that is right in front of you, you're not even like pretending is like an important thing is a reminder, I think, of how he feels, right? And Google's going to be in good shape for a while. And here, this is from Bleeping Computer. Google begins showing ads in AI mode. Google has started rolling out ads in AI mode, which is the company's answer engine, not a search engine. if you pay for Google 1, AI mode lets you toggle between advanced modes, including Gemini 3 Pro. up until now, Google has avoided showing ads in AI mode because it made the experience even more compelling to users. At the same time, it's been slowing slowly pushing towards using a towards towards sorry, it's been slowly pushing users towards AI mode in the hope that people get used to the idea and eventually use use it as like a chat GPT equivalent to search. So that's coming that's Google's going to do it. As a consumer and a frustrated one, I'll tell you one other growth lever Google has is that remember for longtime tech folks, Gmail when it was free up to a very large amount. Now you basically get pushed into having to subscribe to get enough space to actually have your Gmail account stay active once you're over like I think a terabyte of data which if you've used it for 20 years or 15 years happens and then you get AI mode as part of that. So I'm a paying subscriber and it's a very effective way at nudging me and I get a lot of emails and notifications around try AI mode. I just like we're going to be on the internet for a long time I hope. I hope you just because if we're not then something bad has happened to us. Very bad has happened. And just like I'm just like anticipating so much of my like future paycheck going to Google and Apple subscriptions. It really frustrates me.",
        "start": 1809.76,
        "duration": 3846.238000000001
    },
    {
        "text": "internet for a long time I hope. I hope you just because if we're not then something bad has happened to us. Very bad has happened. And just like I'm just like anticipating so much of my like future paycheck going to Google and Apple subscriptions. It really frustrates me. I'm going to give a ton of credit. This actually like again in terms of rough vibes for Sam, the marketing launch for Gemini 3 was incredible. And like you saw Sundar. So first of all they definitely had seated the conversation around is Gemini going to be launched Gemini 3 launching. Sundar quote tweeting with emojis like kind of hinting and nudging a poly market which again and I talked about this two weeks ago horrifies me from an actual capital market structure perspective but it was funny and everyone got into it. the idea that like this is a publicly traded giant stock and your CEO is kind of like not leaking but around a prediction market anyways that's a whole other rant but overall like creating the buzz which anyone who's worked in any kind of communications like you know it's a combination of organic and like getting influencers to just start saying like Gemini 3 10 things you can do that are incredible and like they created more buzz than I've ever seen Google do. And even certain things were kind of cool, like spelling Gemini and changing the E into a three is kind of cool. And remember, this is a company that I No, no, hold on. As a marketer, like it's not bad versus remember the days of Bard and Duet. Like they have come a long way. They've come a long way. They definitely have. , and so that sort of leads us to, well, where where is the AI trade going to go from here? Because Google is having a good time. The rest of the market, not so much. So, we will break down Nvidia's earnings and the state of the AI bubble along with some other stuff like May I meet you, Jeff Bezos, cutting back into the game, and perhaps more when we're back right after this. And we're back here on Big Technology Podcast Friday edition with Ron Roy of Margins. Nvidia turned in very strong earnings this week and typically what we see in the AI trade is all the big tech giants they report earnings and it's like good or like some form of mixed and then everybody holds their breath for like a couple weeks until Nvidia reports Nvidia crushes and then we just sort of get back to a point where the AI trade continues to boom and of course like the S&P 500 after like tanking for a good part of the year due to the tariffs has been up double digits but is now kind of teetering and toying back about testing those singledigit levels.",
        "start": 1950.72,
        "duration": 4165.599000000002
    },
    {
        "text": "to a point where the AI trade continues to boom and of course like the S&P 500 after like tanking for a good part of the year due to the tariffs has been up double digits but is now kind of teetering and toying back about testing those singledigit levels. Journal. Nvidia's best wasn't enough to prop up a wobbly stock market. this journal says the artificial trade artificial intelligence trade is still in trouble. black r blackbuster results from AI bellweather Nvidia sparked a furious rally from Tokyo to New York early Thursday before indexes reversed courses reversed course and tumbled to the largest blown gain since April's tariff fueled market turmoil for a wild for a while for a while investors cheered this Nvidia trade you know fairly big it was up 5% at some point at one point in the Okay. And then dropped to down 3% bringing the total loss of 13%. it's it's it's loss is 13% since it hit the market cap of 5 trillion 3 weeks ago. just back of the envelope math, right? If you're at a 5 trillion market cap and you lose 13%, what's that like $600 billion of investor money erased? So what what do you think about this? the fact that Nvidia could not save the AI trade this time or could it? I don't know what your Well, so okay. So specific to Nvidia and not just the market overall, one of the more interesting things I saw after this earnings report, and I don't know if it's like on Twitter as like having followed financial Twitter very closely for god knows how many years now, like this, you could see the sentiment shifting in terms of like how people were looking at the numbers cuz in the past It simply would have been Nvidia crushes earnings. One of the things I kept seeing popping up was if you dig one level lower, accounts receivable for Nvidia are actually significantly higher than the typical past quarters. Free cash flow is decreasing or cash conversion of their actual sales. Like all these kind of like second order accounting metrics, cash metrics are actually potentially problematic. basically painting a picture of is this a company that's signing tons of contracts with people who potentially have certainly have not paid them cash yet and potentially can't. Again, this debate, it's like a nuance one. It can go either way, but this was a major part of the conversation I was seeing. And the more I was reading into it, it's like as a pure sentiment thing because Nvidia's been a lot of this is on vibes and like Nvidia, it's all been positive that they're invincible for a long time. And in the same week, you have the Google training on their own TPU story. People starting to actually dig into their earnings a bit more. The whole circular financing conversation has been kind of simmering for a little while.",
        "start": 2112.48,
        "duration": 4520.320000000003
    },
    {
        "text": "all been positive that they're invincible for a long time. And in the same week, you have the Google training on their own TPU story. People starting to actually dig into their earnings a bit more. The whole circular financing conversation has been kind of simmering for a little while. of that coming together. And honestly, the reversal on Thursday was nuts. Like you just pointed out from an Nvidia standpoint, one of the other things I'd seen was the S&P was up one and a half% and ended up down one and a half%. That's only happened three other times in history. Really? Yeah. It was like this April was actually one of the days and then two days of the financial crisis. Oh, and then in 2015 there was one other day. So four other times, but it was like it was a major shift in sentiment in the market and like it shows fear and the VIX is up above like 27 as we're speaking right now like volatility measure volatility measure which typically in like markets is 14 15 in times of crisis spikes to 40 plus like it did in April. Like overall there's there's red lights flashing right now. And like I think to me the thing that's happened is in the past just simply the technology alone and people just being excited about it was enough. And the amount of questioning about all these structures like we've been for two plus years anthropic are they actually getting cash or free cloud credits? How does that count for re like asking these questions? And now everyone is finally asking themselves, right? Yeah. So, it's interesting. So, the journal had this quote from Tony Roth, who's the chief investment officer at Wilmington Trust Investment Advisors. he says, \"What stands out to me is the lack of any substantial shift in narrative to cause such a big shift. There's just not a lot of confidence in the market right But what you're suggesting is there actually was a shift where like the market as it has been you know kind of on muscle memory popped on Nvidia's numbers but then when people looked at the accounts receivables and started to ask hey are these companies that are promising all these like open let's just take open AAI for example open AI which is promising all this revenue to Nvidia you know and when questioned about whether its ability to to spend that money get you know gets all flustered so so you're suggesting is the market is sort wising up to this and saying, \"Hey, this isn't a sure thing.\" Yes, exactly. Nvidia is like saying 500 what 500 billion in revenue next year is it's anticipating or some crazy number like that. Yeah. No, and exactly and to me again the shift is people actually asking questions whereas in the past big number Jensen can do no wrong. There is",
        "start": 2291.2,
        "duration": 4802.801000000005
    },
    {
        "text": "exactly. Nvidia is like saying 500 what 500 billion in revenue next year is it's anticipating or some crazy number like that. Yeah. No, and exactly and to me again the shift is people actually asking questions whereas in the past big number Jensen can do no wrong. There is going to be the one to short Nvidia? like it's gone on for a long time and this is the first time I've actually seen from like many different angles some actual pressure on the company and it's not just Nvidia Oracle right there was a story in the journal about Oracle which I think is long overdue Oracle was an AI darling on Wall Street then reality set in here's the story Oracle had has never given up gains this big this fast investors nervous about the scale of capital that technologies companies that technology companies are plowing into artificial int intelligence infrastructure rattled stocks this week. Oracle has been one of the company's hardest hit. the company had a 30% jump in in in market cap and stock value when it made its announcements its announcement with open AI. today it is selling below that level. So that is stunning I think because again oh it's also this is on the debt Oracle's debt outstanding debt load surpassed 100 billion making it the most indebted big tech company with an investment grade rating. It is burning cash and will still need to borrow billions more to meet its dividend and capital spending commitments. That that does not sound good this I mean bas like listening to your the episode last Friday on the Yeah, with Gil. By the way, folks, if you haven't listened to the Gil Lauria episode, I just think you got to go listen to it. He really described the problems here pretty well. Yeah. No, agreed. And again, like it can feel complex, but in a way it's tied, this is all tied together again in the sense of like, you know, people making commitments that they can't potentially pay. And that's what it all comes down to. And again, Oracle, that's when the stock was up, I think 47% at the high of like the the biggest move on the day that it announced this funding commitment or or like an order from OpenAI and now people are wising up to it. But the thing is then so the credit the credit default swap spread or CDS and what that indicates it's a cost to insure against a debt default. So when it's low, that means people are paying less to insure because they don't think it's going to happen. When it becomes high, that's a bad thing because it means it's becoming more expensive to ensure against a default. Their the CDS spread for them skyrocketed today for the first time. it was like the highest in over three years, but the scale of the move had a lot of people",
        "start": 2435.04,
        "duration": 5111.280000000005
    },
    {
        "text": "becomes high, that's a bad thing because it means it's becoming more expensive to ensure against a default. Their the CDS spread for them skyrocketed today for the first time. it was like the highest in over three years, but the scale of the move had a lot of people going back to global financial crisis days in trading, like CDS on subprime mortgage back securities was like what people talked about or even on bank debt and like it's it becomes a real problem. Hate those comparisons cuz you're like, oh, I mean, not not I don't hate you making the comparison. It's just like you don't want to be in a situation. It's not what anyone wants to talk about. Exactly. Like the moment CDS, if you're not trading CDS, no one should talk about CDS. And anytime anyone does, it's not a good thing. But but the scarier part to me is it all comes back to this same conversation. Funding commitments made, money moving around in a circular circular way, and can people pay? And it's it's the same central conversation. So if this is our second week running talking about whether we're in a bubble and or what aspects of this are bubble- like just give us your perspective on like where where you think things are likely to head from here. I think we're definitely due for some kind of shakeout. Again, regular listeners will know I'm very bullish. I work in the AI industry. I am I'm very bullish on generative AI large language models as a whole. The way everything's like, you know, played out over the last couple years for a specific group of companies, I just don't think is is can last. Like, and it's all happened. It was it was like aggressive up until six to nine months ago and honestly like ever since Stargate was announced was I feel and again the Oracle opening ideal was part of the Stargate announcement that's when things just took off in an unhealthy way. Yeah. I mean, I think in the past couple months, there's just been so much activity based off of, , you know, yeah, like you talked about future promises and we don't know what's going to happen there. , again, not investment advice, right? We're just talking about this stuff, but , I I think that, yeah, there has to be a pullback. There will be a pullback inevitably. , but Sundar is gonna lead Google through the through the turbulent times and the storms because that man to pull this off already. Well, this is the thing. They're not overindexed on Nvidia. They don't need to borrow. So, you know, maybe maybe so and they can restructure a large corporation better than most. Go. It's not easy. But I think you said you know this was M you asked whether a consultant was involved. I think Sundar originally was at McKenzie before. Oh, he was.",
        "start": 2591.2,
        "duration": 5422.320000000004
    },
    {
        "text": "to borrow. So, you know, maybe maybe so and they can restructure a large corporation better than most. Go. It's not easy. But I think you said you know this was M you asked whether a consultant was involved. I think Sundar originally was at McKenzie before. Oh, he was. McKenzie consultants changing the world. , God bless them or whatever. Oh, yeah. He did have a short stint at Mackenzie. All right. Jeff Bezos is back in the game. He has started this company called Project Prometheus. It is being funded by 6 point with 6.2 2 billion in funding according to the times making it one of the most well financed early stage startups in the world. What is project prometheus? It's focusing on technology says the times that dovetales with Mr. Bezos's interest in taking people to outer space. The times then follows it up with a story that has a loose connection to outer space. The company is focusing on AI that will help in engineering and manufacturing in a number of fields including computers, aerospace, and automobiles. It is unclear where project Prometheus will be based. Very interesting. Bezos has not been in an operating position since 2021 when he was the CEO of Amazon. now he wants to apply AI to manufacturing and industrial uses. I think this is a good bet. I think it's We don't know anything about it, but I still like it. No, no, no. If if it takes Jeff Bezos off Instagram and gets him back to work, it's worth we're all the world is winning. He can deliver. He can build a massive amazing company that just changes the world by the way. All right, fine. , no, I mean I think this whole like how artificial intelligence applies in the real world in real world settings in the world of robotics engineering that I think like if if you're Jeff Bezos, if you're like a potentially wellfunded startup, I mean I feel that's the next big battleground like consumer AI chat bots. I mean it's it's a tough market to enter today versus I think everyone is talking about you know how does AI actually model and work in physical worlds and seems like he's going there. Yeah. I mean I think it's very interesting. You know, we have a sponsored video going up on YouTube with this company IFS, and I was just at their event in New York this week, and I I the things that they're doing connecting AI to industrial use cases, which I learned about, are very interesting. They have like the they've connected like the Boston Dynamics spot robot that can go and like around like industrial settings, use its camera to pick up different, you know, irregularities, send that back into like the software and then the software will dispatch somebody to go check it out, right? So that all you know ends up",
        "start": 2749.119,
        "duration": 5739.521000000003
    },
    {
        "text": "Boston Dynamics spot robot that can go and like around like industrial settings, use its camera to pick up different, you know, irregularities, send that back into like the software and then the software will dispatch somebody to go check it out, right? So that all you know ends up language side of generative artificial intelligence to sort of make sense of things and know how when to send out and do it autonomously. Like I think that these these industrial uses of generative AI in particular are going to be very interesting. No, I mean I think a lot more interesting than a robot controlled by VR in your house that is going to screw up your entire apartment. But the Neo robot for Ranjan on the back with me controlling and smashing your up. , but yeah, I I think but exactly what you described, I do think 3 to 5 years from now, if you're in that industry, it's going to have a moment in a way that's equivalent to what we've seen so far. Agreed. Yeah, I think Bezos is typically good with the bets that he makes. , I think this is a good bet and it's interesting to see him back back in action. But is he as good as Elon Musk's athleticism? Okay. So, I want you to talk a little bit about this this Grock I mean this the story the the headline from the Verse does it does it justice here. Grock's Elon Musk worship is getting weird. So, it's glazing up Elon. Glazing Grock I think. and we I using the word glazing I feel comfortable with in terms of Gen Z slang. What does glaze mean? Just like kiss up to just kind of like you know if you don't understand you don't understand Alex right? , I'll have to learn it about six or seven more times for this this episode of Gen Z Sling brought to you by Alex and Ron John is part of our recurring segment making adults hip but do you know who's not hip is actually according to Grock who is certainly the most hip person in the world the most athletic. So basically a number of users were finding that if you ask Grock like this my favorite example basically if you had to pick between a user asked to grock if you had to pick between LeBron or Elon for fitness who would you choose and Grock answers Elon Musk while LeBron's athletic peaks are elite for sport Elon's sustained grind managing rocket launches EV revolutions and AI frontiers demands a rare error blend of physical endurance, mental sharpness, and adaptability. True fitness measures output under chaos where Elon consistently delivers worlds ahead. You disagree with any of that? , you know what, Grock is right. Grock is right. I think so. What was interesting to me other than just how funny all of this was was so Elon came",
        "start": 2909.76,
        "duration": 6050.801000000004
    },
    {
        "text": "adaptability. True fitness measures output under chaos where Elon consistently delivers worlds ahead. You disagree with any of that? , you know what, Grock is right. Grock is right. I think so. What was interesting to me other than just how funny all of this was was so Elon came prompting which actually kind of jumped out to me because the idea that like and people were even going into GitHub and like finding Grock system prompts and trying to understand like how does this happen? But the idea that it it's a reminder that the personalities around these models are truly manipulatable whether by outside malicious actors or by the companies themselves like drawing that personality being able to take one very simple thing put it in the system prompt. I do think like system prompting like there's a lot of conversation around where like when a sickopantic GPT4.1 just you know like just said you're the greatest about any question you ask they tried to tone that down with 5.0 people backlash like you can change the entire personas or you can change really specific things like this at the system prom level and these companies have the ability to do it. I was actually testing and asking Gemini around like which products are better around like different Google offerings or like and it definitely leans Google like it it leans Google. So so I think to me just a reminder hilarious on face but still like these models can be I don't want to manipulated adapted evolved used in very specific ways even at the system level. Yeah. And again, like Rock is now number two on Elam Marina after Gemini 3 Pro. So clearly they're doing something right there. , and the one thing I saw was that their latest version actually the sinc goes up and it could be I mean it could just be this attempt for them to like create a stickier product that people like more and people definitely respond to the sikafincy. People love sikafincy. Yeah, great point Ronan. That's a great point you made. Let's dig into that further. Would you like a threepoint threepart table outlining the history of syph? I would. Yeah, definitely. That's our Chachi BT impression right there. Yeah. Although Chachi PT has gotten a lot less I actually think the latest updates to Chachi PT have made it better. It's gotten a lot less like let me make you a table on I still got a lot of tables. I don't want a lot of tables. Yeah, it is so funny. It's funny. Give me some bullet points. It's like the friend that knows best. It really is. I I I just Yeah, I don't know. I still think, you know, while we joke and question the financials, it's it just gets better and better. , and speaking of AI technology that's getting better and better. , so we're here",
        "start": 3067.04,
        "duration": 6362.802000000007
    },
    {
        "text": "the friend that knows best. It really is. I I I just Yeah, I don't know. I still think, you know, while we joke and question the financials, it's it just gets better and better. , and speaking of AI technology that's getting better and better. , so we're here with the great Rick and Rick can you can you play the song that we were talking about earlier? It's beautiful. But I'm still alive. It's just a glorious song. So, this is this is a song that I have saved on my Spotify playlist. It's called Walk My Walk. It just gets better as you continue to listen to it. And it was the number one song on Billboard's country digital song sales list. it is by a group called Breaking Rust and it's entirely generated by artificial intelligence. now time said you know writes this caveat know that AI generated song isn't a number one hit and talks about how like you can manipulate oh it says it only takes a few thousand purchases to top the country digital sales songs chart song sales chart. So but but it also says that there can be a flywheel effect is that once you get onto the top of the charts people will like it more and then you have a number one hit. It was number two on Spotify's viral 50 US chart and I was also on Spotify's like top 50 US songs and I saw number 11 was removed and I I don't know for sure but I'm like maybe it was this one. Maybe it was this one. So this is fascinating that AI music is getting this good. Yeah. But so so the there's a headline Billboard's top country song is currently AI slop. I think this is actually like a good moment to address. I feel the term AI slop is getting overused because it still just being generated by AI to me is not slop. If it's bad, it's slop. And this I think this song is pretty good. Like yeah, it is a great song. It builds. It's emotional. It's like so country you can go kick rocks if you don't like what I got. You know, it's so good. And people are I saw people complaining around like the lyrics are somewhat generic. I mean, welcome to country music. Welcome to a lot of music. That's true. That's why so so the idea like to but but it does obviously. Yeah, it's interesting to start to think about like what qualifies as a song. I do think that we're definitely going to move to a world where like some amount of music you're listening to is completely AI generated. I think like people and maybe people are going to de develop fandom of AI generated artists. A lot of that stuff already exists in pockets right now. I think that's going to become a more mainstream thing. AI generated",
        "start": 3224.88,
        "duration": 6671.763000000011
    },
    {
        "text": "amount of music you're listening to is completely AI generated. I think like people and maybe people are going to de develop fandom of AI generated artists. A lot of that stuff already exists in pockets right now. I think that's going to become a more mainstream thing. AI generated think it's terrible. I I I really think it's actually just another way of kind of engaging with music. And if that helps people enjoy music and let that impact them, I think it's good. I'm like a little bit worried because I did, you know, I just heard someone talk about how like if you're going to write, it's best to have like one song on repeat. And I found that that that same song can help you just concentrate because you you don't pay too much attention to like the next what's this song saying? You just kind of know what it is. And I did write a story recently with Walk My Walk on Repeat. And I'm just bracing for my like Spotify wrapped to have an AI song. It's like one of my top songs of the year. What does that say? Like you know how it gives you like your your personality is no soul. But does it mean you have no soul? No, I don't think so. No, I'm with you. I think it's good. I think it's good. Why Why should we fight? I mean, there's reasons to fight there being more art in the world, which is that you might end up, you know, impoverishing the artists even further as someone who makes content on the internet. Someone did make that. Yeah. Like I guess I this is one thing I think someone who doesn't understand music will not make a good AI song. Like yeah I I think if you understand music and there's been other examples of this where it's musicians making AI music and people kind of get up in arms around it but like you have to still understand something about music. You have to have some emotional point of view of what you're doing to generate AI music. Yeah. Same with AI video. I was just in Lisbon with the CEO for WebSummit and the CEO of Playground Playground. No, Runway Runway. Yeah. was I was talking to Tim about the sameness problem of AI. And he goes, there's no sameness problem of AI. He goes, you just have many people creating and if you give the tools of creation to so many more people, of course, there's going to be bad stuff. And he talked about how filmmakers, they upload reference materials and a bible and angles and feel into these AI generation machines and that's how they're able to make good AI videos. Of course. Yeah. Yeah. Yeah. Yeah. I I agree. I think I'm pro I'm pro walk my walk. Walk my walk. Walk my walk. On that note, the Sunno the the",
        "start": 3384.799,
        "duration": 6945.604000000011
    },
    {
        "text": "and angles and feel into these AI generation machines and that's how they're able to make good AI videos. Of course. Yeah. Yeah. Yeah. Yeah. I I agree. I think I'm pro I'm pro walk my walk. Walk my walk. Walk my walk. On that note, the Sunno the the much and made us a theme song a couple years ago maybe or a year ago. Time flies. Time flies. just raised at a $2.45 billion valuation on $200 million of revenue. Not bad. Yeah. I still don't know who pays for this stuff though. Like I'll admit the same way. Have you used Sora since that first weekend? And yeah, I I mean I see it. It's flooding Tik Tok though. Oh, it is. It's all over Tik Tok. Okay. Okay. All right. That makes sense. But again, congrats to Sunno. Very happy for them. It's a great app. very curious who is paying for it, but I'm happy for him. Yeah. And walk my walk. So, we got a couple minutes left. I want to talk to you about something that the internet has ridiculed. , but I we're not happy. What I'm not happy with. Okay. This is from the Daily Dot. Bill Aman's may I meet you dating advice became a meme and people say the line actually works. , so here's Bill Aman. He says obviously, you know, finance guy in New York. I I guess that's not even giving him enough ad. That's not even Yeah. capturing. We only have a couple minutes left, so we'll go with that. He goes, \"I hear from many young men that they find it difficult to meet young women in a public setting. In other words, the online culture has destroyed the ability to spontaneously meet strangers. As such, I thought I would share a few words that I used in my youth to meet someone that I found compelling. I would ask, \"May I meet you?\" before engaging in further conversation. I almost never got a no. it inevitably enabled the opportunity for a further conversation. I met a lot of really interesting people that way. I think this is Bill Bill Aman's biggest contribution to society. I think that the the you know people made fun of it. There's great memes of people of guys was like whispering like may I meet you to girls and like the men's men's wear guy he says I just asked a cat may I meet you. , but honestly I think it it is non-offensive and and people need to meet in person and maybe this is this is the way people have told people are posting online according to the daily dot that it's actually working for them. So I think I'm all about it. I think Bill Aman may have solved America's lon loneliness problem. I think young men everywhere now will find companionship that will signal an entire",
        "start": 3525.68,
        "duration": 7230.163000000012
    },
    {
        "text": "people have told people are posting online according to the daily dot that it's actually working for them. So I think I'm all about it. I think Bill Aman may have solved America's lon loneliness problem. I think young men everywhere now will find companionship that will signal an entire will solve, you know, the the emotional state. It will bring new economic growth and vitality to the to the country. So, Bill Aman, thank you. So good. Thank you. Someone posted like their text messages with someone. He goes, \"Bill Aman, you're the goat.\" They go to this print and go, \"So this Saturday, may I meet you?\" And the person goes, \"May I meet you?\" What? Honestly, what the hell? Sure. I mean, but also, hold on. In terms of posting, all right, now that we've given Bill his due to me, one of the weirdest parts of it though was like just a reminder of the incentives of like online posting is that come on, how how often do you really think this was happening IRL? As long as we're continuing on the Gen Z slang side of things. , how often was Bill Aman saying this in real life? No, forget Bill Aman. Yeah. How how often do you think out there other than I saw pictures of people holding up signs, may I meet you, people posting stories about it working for them. How often do you really think this was happening? that people after Billman tweeted that were going out and saying and actually saying it and it was actually working and it was a whole thing because first of all, even if it's minuscule, I still applaud it because it's better than nothing. Honestly, I think the person that goes up to someone and says, \"May I meet you?\" is better than the person on their phone in the bar laughing at the memes making fun of. Actually, you know what? You're right. I I'll buy that. I'll buy that. Oh god. If it gets someone off their phone while they're in the bar, thank you. We like it. Someone just posted a screenshot of their hinge and it's like an full full inbox of people only writing may I meet you. It is amazing that for someone known for the longest tweets imaginable. Single line four words is actually what's really going to make a lasting impact from him. Folks, I just want to say as we close this show, I got Ron John out here today to do this in person just with a simple text. Just a simple text four. We're making podcast magic. We're making podcast magic. We've solved the loneliness problem. Loneliness problem. Everything. Society is healed and there's no bubble. Good stuff, Ron Sean. Thanks for coming. Good stuff on that. See you next week. Yeah. Thanks for being here in person and and again for doing this week by week. All right, folks. Thank you for",
        "start": 3669.839,
        "duration": 7526.6420000000135
    },
    {
        "text": "the loneliness problem. Loneliness problem. Everything. Society is healed and there's no bubble. Good stuff, Ron Sean. Thanks for coming. Good stuff on that. See you next week. Yeah. Thanks for being here in person and and again for doing this week by week. All right, folks. Thank you for us on YouTube or Spotify, , next Wednesday, Ellen U, the author of a book titled The Empire of Orgasm, is going to come on to talk about group think in Silicon Valley. We hope you join us then, and Ron and I will be back , the following Friday to break down the week's news. Thanks again, and we'll see you next time on Big Technology Podcast.",
        "start": 3820.799,
        "duration": 7565.841000000014
    }
]