[
    {
        "text": " As Google partners with Apple and unveils deeper personalization, is Gemini winning? Thinking Machine Labs, meanwhile, is falling apart. And Anthropic did it, releasing Claude code for non-coders. All that and more is coming up right after this. Welcome to Big Technology Podcast Friday edition, where we break down the news [music] in our traditional, coolheaded, and nuanced format. We have a great show for you today because Google and Apple finally came to a deal. They're going to fix Siri and has that catapulted Google to the lead position [music] in the AI race. We're going to talk about that. We're going to talk about Thinking Machine Labs falling apart. We're also going [music] to talk about anthropic on the heels of our conversation about Claude Code last week coming out with Claude Co-work, the Claude Code version for non-coders. It's a mouthful, but it's meaningful. And joining us as always on Friday to do it is Ranjan Roy of Margins. Ranjan, great to see you. Claude code. Claude co-work. The claude code for nonclaude coders. Was that it? I think put it all in aentic harness. Put it in a harness. By the way, our conversation about harnesses last week generated a lot of intense feedback from our audience. People are really on team harness. So, I'll take the opportunity today to stand here and tell all the haters. I still don't like the word, but I respect you for enjoying it. I'm glad harness is gonna imagine when harness is the word of 2026. But but I'm [clears throat] just excited that to talk about our first story because Siri has a shot. Siri has a shot and Siri's talking in the background because I just said that on my HomePod. But there's only one way to introduce this story and that is that Apple has harnessed the power of Gemini and put it into action in Siri. There's a new deal that has happened between Google and Apple that may lead may lead to the inevitable improvement of Siri. And I say inevitable because goodness gracious, it can't get much worse. , but I think to really think about what's happening in the AI world and what this story means. We'll of course get to what Google and Apple's deal is going to look like, we have to look at it in terms of the context of the bigger AI race and just how meaningful it is that Apple has selected Google and put it Google's LLM into Siri and what that means for Google itself and what it will what it will do. So, David Pierce from The Verge has a great article about this. And the headline is simple. Gemini is winning. And I basically decided to take that headline and make it the first segment of our story because of our show today because the story really is I think the probably the best articulated version of the fact that Google has",
        "start": 0.08,
        "duration": 349.99899999999997
    },
    {
        "text": "this. And the headline is simple. Gemini is winning. And I basically decided to take that headline and make it the first segment of our story because of our show today because the story really is I think the probably the best articulated version of the fact that Google has AI race. So, here's what PICE writes and we're going to get to Siri in a minute because it builds on this. If you want to win an in AI, you have to do a bunch of hard things simultaneously. He says you need to have a model that is unquestionably one of the best on the market. You need the nearly infinite resources required to continue to improve that model and deploy it at massive scale. You need at least one AI based product that lots of people use and ideally more than one. And you need access to as much of your users data as you can possibly get. Pierce argues Google is the one company that appears to have all the pieces already in order. Over the last year and even in the last few days, the company has made moves that suggest it is ready to be the biggest and most impactful force in AI. All right, before we jump into the Apple stuff, talk a little bit about what you think in terms of these factors, right? because it does look like Google has all these factors and of course the fact that it's not reliant on Nvidia and has its own chips along with the monopoly of search money has really enabled the company to to do to seemingly take this lead as PICE argues. What do you think? I think especially relative to the other hyperscalers Google what they've done over the last year is incredible. I actually was had to look up and I think we probably had entire segments on should Google fire sundar a year ago. I saw there was like Jan 2024 Ed Zitron Google should fire Sundar Pichai like when all that conversation was happening and now I I like this framework you have the model you have resources you have a product that can be kind of just like ready to use AI at scale which is we're going to talk about personal intelligence so I think all the pieces are there to try to you know like see the other side of what you said is their benefit to like having infinite capital because of their search monopoly can still also be the one weak link in this is that I I actually give full credit to how Sundar and the team have managed this transition to actually go after their golden goose and actually try you know AI search overviews completely destroy their existing business model. Yet, they're pushing it and they they know it's the future, but that's that's the one part that they are fundamentally having to threaten their",
        "start": 174.879,
        "duration": 662.6400000000002
    },
    {
        "text": "have managed this transition to actually go after their golden goose and actually try you know AI search overviews completely destroy their existing business model. Yet, they're pushing it and they they know it's the future, but that's that's the one part that they are fundamentally having to threaten their great, right? But let me put it in context. So, to put Google search on Apple phones, Google has to pay Apple something like $20 billion a year. Now, Google Oh, yeah. get into the Gemini into Siri and it's getting paid and this is really building up to like okay so so Google has all these elements and now the question is what do you do with it here's what PICE writes what do you do when you have all this tech in place you put it in front of people and put it to work on Monday Google and Apple announced that Gemini will power the next generation Siri that's coming this year Pierce writes Apple saying this is the best technology available able is obviously a powerful signal to the market. But even more than that, Siri immediately becomes one of the most popular ways people interact with Gemini and the deal the deal matters even more because every user matters. The more user activity and data these companies can collect, the better their models and products can be. And it creates a flywheel, a flywheel with search. And the same will hold true with AI. I think these are very big points. Hold on, explain to me the flywheel with search. Like we have personal context, we have personal intelligence, but charging advertisers to show up in your search results which are presented in some kind of order as blue links and to be higher on that page. That is the search business model. It's not actually just searching for stuff. That's the business model. So, how is it a flywheel for that? Well, I think the okay, the the there's the business and then there's the product. And so, this I think Pierce is talking specifically about product. Now, one interesting thing about generative AI is that the queries are much more varied than search. And I think something like one-third of searches are brand new to Google every day. I would argue that many more of these questions to generative AI models are novel. And so I think to become good at doing what you do, you have to be able to really appreciate the broad range of queries and figure out where you're doing well and figure out where you could get better. And so now Google is going to put its its its product in front of the billions of Apple users who are now going to be giving it data back. Now, maybe Apple's going to build some sort of fly some sort of firewall, but the fact is that this partnership is going to make the Gemini product better",
        "start": 332.96,
        "duration": 979.4410000000003
    },
    {
        "text": "its its product in front of the billions of Apple users who are now going to be giving it data back. Now, maybe Apple's going to build some sort of fly some sort of firewall, but the fact is that this partnership is going to make the Gemini product better a much broader range of user behavior and optimize based off it. Whereas again with Chad GPT, they got to fight for every single user. They don't have the distribution of their own products like Google does and they certainly don't have this Apple deal anymore. In fact, Google is supplanting chat GPT in Siri. Did you did did you ever use chat GPT in the kind of like embedded Apple context, the iOS? I think I used it when it came out a couple of times where you had to like click tap twice extra to get a halfbaked ch. Did you ever use it or Yeah. Yes. I think I used it once just to feel how painful it was to go through. [laughter] Well, actually, no, that wasn't that's not really true. that's when I look back I actually was eager to use chat PT within Siri. I think the pain came from actually realizing how many steps away it was and and that so I think this if you're if you're signaling that we don't really know what the extent of this is going to be. Maybe we can't trust Apple to get this right. Then I I might be buying that. Yeah. Okay. So, a couple of things on that that it is amazing that cuz I I had I think I've said before I have like a Pixel 9, I think it is just sitting there. So, sometime I like loaded it up again and started just testing what Gemini natively feels like. And my god, it's so much better. And if if Apple screws that up with Siri, I I just don't know where this company's going to go in the whole world of AI. It's kind of just terrifying. But but what you were saying earlier is interesting to me cuz cuz I agree from a product perspective, the amount of data and access and context this gives Google is just like exponential in an already exponential company in terms of data. But still, how do they I mean Apple's going to be paying them. That's one business line. But like that they no one has figured out AI search, LLM search based advertising actually. Who do you think's gonna who would you bet does it first? VGMO over at OpenAI or the masters the old-timers Google and they figure out how to actually charge people to show up in LLM search. If you had to take take a bet. Oh, it's not even a question. I mean, it is the one company that's built a multi-t trillion dollar business out of search advertising, right? I I think",
        "start": 493.68,
        "duration": 1287.6799999999996
    },
    {
        "text": "they figure out how to actually charge people to show up in LLM search. If you had to take take a bet. Oh, it's not even a question. I mean, it is the one company that's built a multi-t trillion dollar business out of search advertising, right? I I think even with the Code Red that they had recently trying to fight against the product, the business model was put on hold. They put on the the ad rollout on hold, even though we're seeing some of it. I I think there's there's no doubt, you know, and we're going to talk a little bit about the fact that Google's going to be able to share data across different products. but I think there's no doubt that Google will take some of its targeting, some of its expertise from the other sides of it its business. So it's not just starting at zero with this LLM. But actually now I'm curious to hear your perspective, Ranjan. Why? So we're talking obviously about the product side of things. why have you zeroed in on the business side of it? Oh, there's something about the business side and this this deal that's making you, you know, making something light up in your head. Well, I I think and now we we always debated is it the model or the product? Now we have is it the product or the business model, not actually the foundation model. , I think it's cuz like I I agree with this article. Everything appears to be going right for Google and maybe it's just trying to kind of bring some nuance to it, but but to me it was more when you said that infinite capital that like that search monopoly, it just reminded me that that is going away. They recognize it's going away. I give them full credit for actually trying to fight for whatever is next. But still the one of the greatest business models in the history of mankind is going away and that's the like you can execute on everything else and you can still not survive that. That is a very interesting perspective. So I think we've almost come full circle here with Google, right? It was like Google at the beginning, oh Google is slow playing generative AI. I remember they invented it effectively with the transformer. They had the living breathing lambda inside Google, never released it. , and everyone said Google is too worried about its business model to release this to the public. Then OpenAI of course jumps the gun. They have no choice now. Oh, they're like, \"All right, we'll play that game.\" They're playing it. They're leading it. And they might be accelerating their own cannibalization. Yeah. I think I mean I think I'm being just trying to see both sides of the argument here. They're in a very good position right now. I recognize, but actually I am going to take the other",
        "start": 650.64,
        "duration": 1587.6810000000007
    },
    {
        "text": "it. They're leading it. And they might be accelerating their own cannibalization. Yeah. I think I mean I think I'm being just trying to see both sides of the argument here. They're in a very good position right now. I recognize, but actually I am going to take the other based advertising ahead of Google. Really hear me out here. I think when I think about like search-based advertising in Google has been on a steady state of degradation over the last 10 years and gotten worse and worse and worse and worse. Meanwhile, Facebook and Meta, God bless them, their advertising has gotten better and better and better and better. So like the actual at the core of taking what are new technologies and actually turning that into a compelling advertising offer, Google's still working off of something that they built a monopoly off 15 years ago, but has been degrading whereas Facebook to their credit has been I mean they've been Apple tried to kneecap them like and they actually just made better and better ads. So I'm taking Fiji and the Open AI folks on this one. I mean, Google only grew its ad business by like 15% off a base of 60 billion in the last quarter. So, you'll forgive me by being a little skeptical of this idea that their advertising has gotten worse and they can't figure this out. Dude, one thing I had to bring up. I was thinking about this. This came up a couple of weeks ago. Like, wait, is it Sergey or Larry who's back? Sergey. Yeah. Like, I've been seeing so many credits that like co-founder comes back. that's what's lit the spark and that's what's causing this like and like you know like kind of the hero returning. I still like the idea that it's Sundar's McKenzie days that taught him the key to organizational like transformation and reorgs and the move to bring in deep mind and like you know like actually centralize like the AI development across the entire it was the most boring MBA Mckenzie style reorg that was right that has been the key to the success. I'm that's my take. I think we can try to get to the bottom of this. So, , you know, it's we have a long 2026 ahead. Maybe maybe we'll get a chance to sit down with Sundar and talk about this. I know at Davos next week, , and folks, by the way, if you're watching on video, I'm at a different location. I'm in Germany and route to Davos. , I'm going to have a series of conversations there and two of them are going to be with Google , AI leadership. So, Dennis Sabis is going to be back on the podcast next week. We're going to do a live conversation from Davos that should air on Wednesday. And then I'm also going to do a conversation with the COO of Deep",
        "start": 801.68,
        "duration": 1904.8820000000003
    },
    {
        "text": "are going to be with Google , AI leadership. So, Dennis Sabis is going to be back on the podcast next week. We're going to do a live conversation from Davos that should air on Wednesday. And then I'm also going to do a conversation with the COO of Deep couple weeks later. So maybe I can ask about this McKenzie thing. Maybe I can also ask about the advertising thing because Ranjon, another thing happened this week that we should discuss which may actually set up Google for the perfect generative AI advertising play. Here's I'm going to keep reading. Pierce, this is good. Let's keep going with it. Google's other announcement this week is an even bigger flex. It announced an opt-in feature called personal intelligence, which connects Gemini to a vast ocean of information Google has about you in order to give you better responses. Every time you ask it a question, Gemini can now answer it by looking at your recent searches, the videos you watch on YouTube, your emails, your photos, your files, and more. You really can't overstate how big of a deal this is. Google no longer has to ask you to give it lots of context. hope you provide excellent and detailed prompts every time or build out complicated custom instruction systems. Google already knows a scary amount about you and now Gemini does too. And you know I initially looked at this from a product standpoint about how oh this would be actually a great product to use and I think it will but given the direction that our discussion has gone today you know who would also like to know a scary amount about you advertisers. I think okay so personal intelligence I saw some like very nice flashy looking demos and and we've talked about this for a long time that Google does Google should own this Google should just like destroy in this part of it in terms of knowing the most about you and but you know as we're speaking I just I I've been running this test I ran this test the moment Gemini showed up in Gmail I always ask what was my first email with my wife. I just asked it right now again and for reference it was 2011 January. It says, \"Based on my search over your Gmail, the earliest email thread with my wife was on Thursday, November 13th, 2025, and it's about one of my kids school events.\" And then I said, \"I mean, my first email ever.\" And then it says, \"Based on a search, the earliest email thread I can find is Wednesday, October 2021.\" Like how do they not get that right? This is what this is this is like the missing link in all of this that again I'm Gemini has gotten amazing. I think Gemini is going to supplant like standalone Gemini a lot of chat GBT users and prevent them from ever going",
        "start": 964.72,
        "duration": 2211.2819999999992
    },
    {
        "text": "do they not get that right? This is what this is this is like the missing link in all of this that again I'm Gemini has gotten amazing. I think Gemini is going to supplant like standalone Gemini a lot of chat GBT users and prevent them from ever going product standpoint. That is the most straightforward question to answer. It's like a combination of some search and some LLM and it can't get it right. Why do you think that is? Well, I just I was just about to ask Gemini what my first email was with my Wi-Fi. and then I realized my muscle memory is probably unfortunately geared to typing Wi-Fi versus wife. I need to go to therapy for [laughter] this. But my hands I The true the true companion was never chat GBT. It was the internet connection. It was Time Warner Inspector. I am a simple man. That's all I need. live by Did it get it right? I No. It said I It got my wife's name right, but it says I can't definitively confirm the single first email in your entire history. And then it gave me a query to run, which is interesting. Yeah. Which is boolean search. Like Yeah. I I'm just going to answer. I listen I I think this is one of the main limitations of AI and we spoke about it a little bit last week is that the context window runs out and it can run out fairly quickly. I mean think about how many characters you have in your Gmail. It the technology today cannot put all that in the context window. [snorts] So what what we see is that like there's now some shortcuts. but then again if if we're talking I have to say I I you know this should not be that hard because even now I'm and you know this too I'm thinking through the steps right okay find you know first do a query find out who the who the person's wife or Wi-Fi is depending on their persuasion then you know nothing wrong with whatever whatever you want if you if you are in love with Wi-Fi clearly I respect you but then you can actually go ahead and do do the search. So obviously from the product standpoint here, something is off. You're right. There's a problem and and it's one of the most inexplicable things about Gemini to be honest. But so so and this is going to be a good setup to our later conversation on claude co-work. I think like this is a good example of agentic versus just some kind of like lowgrade LLM search. Agreed. All of your email of all time needing to be in the context window is not going to get you the right answer here. Coming up with a system that create the boolean search query, go do it, return the result should how is",
        "start": 1119.44,
        "duration": 2504.1610000000005
    },
    {
        "text": "of like lowgrade LLM search. Agreed. All of your email of all time needing to be in the context window is not going to get you the right answer here. Coming up with a system that create the boolean search query, go do it, return the result should how is not. So this is more like there's still a bit of this. Sundar's still got some reorgen style work to do here. I'm just telling you. But if if if he's listening but overall very good position. Do you think it's a safety thing? Do you think that like they're it might be right? They might be concerned that if they allow it to do too much in email, you'll get creeped out. I mean that to me is the best explanation. I'm I'm striking the technology limitation thing. It's it has to be either competence or safety. No, no. I It's my call. It is actually organizational dysfunction. It's like the Gemini in Gmail. There's some back and forth between the team that owns Gmail, product manager saying, \"I don't want to give you access to this.\" And like because again, actually standalone Gemini as a connector to Gmail probably would get that right. All right. A couple quick things before we end. I just want to talk quickly about what Siri and the iPhone's going to look like. This is from the information. Siri will have the ability to answer factual questions, tell stories, provide emotional support, or wow or help people accomplish tasks such as booking travel. Some of the features will launch this spring. Other including Siri's ability to remember past conversation it had with a customer or proactive features that could suggest they leave home to avoid traffic ahead of an airport drop off that's listed on the Apple calendar are expected to be announced at the company's annual developer conference in June. , I just wanted to circle back on this because we had already started the discussion. I don't know if I I just don't trust Apple on this one. It it we're going back to the same like demo and release schedule. I mean, of course, like it's just the deal was just signed, but I don't know if they're going to be able to. They're still trying to do Apple intelligence. I just don't know if they're going to be able to do it. Yeah. I it was so baffling to me that like it's still what is it with booking travel and AI that everyone is so obsessed with like there's so much other stuff researching travel you don't no one is going to book a ticket let AI book the ticket for them for a long time and also the universal search thing it's already again it's already been solved like it's you can do that with any chatbot you should be able to do that you shouldn't advertise that as this amazing capability. So I I honestly",
        "start": 1270.559,
        "duration": 2809.6020000000003
    },
    {
        "text": "book the ticket for them for a long time and also the universal search thing it's already again it's already been solved like it's you can do that with any chatbot you should be able to do that you shouldn't advertise that as this amazing capability. So I I honestly campaign on this was it will be baseline good as everything else and we will deliver that to you and that's it. And I would be I would be ecstatic like I can't wait for this the Super Bowl ad. Siri, we're gonna be sufficient eventually. Yeah. We're we we'll be as good we'll as good as the rest. There's your tagline. [laughter] Think the same. I think that's the new Apple, not think different, think as good hopefully. , yeah, that's literally if they did that, that transforms the entire business. It should not be that difficult. That's all I'm asking. I still have my iPhone. I I might get that iPhone fold for like $7,000 or whatever it'll be, but they got a fix here. Yeah, you'll be folding. All right, let's end this segment. Credit where it's due. This is back back to this Verge article. Credit where it's due for a company not exactly known for its ability to focus on coherent product strategy. Google managed to marshall its considerable resources in a single direction. Now, if chatbots are in fact the future, and most of the AI industry continues to bet they are, there's simply no other company currently set up to truly compete with Google. Google has the models. It has the resources to improve them. It now has the distribution necessary to get people to use its bots and the data required to make them uniquely personal and useful, at least for now. Chat GPT has the brand power and the daily active users, but Google has almost everything else, even the iPhone. Are you buying this? I kind of am again like this is where yeah from a device perspective I Apple is vulnerable we know that and Google I actually I want one thing I'm curious do you think does Google they must have some kind of pin or AI first Johnny I style device under the works as well right they have to I'm definitely going to talk with Demis about this next week because I think we talked about this thinking game docu documentary or I might have talked about it earlier this week that Google has up on YouTube. I so I spoke with that about it with MG Seagler. It's a great great documentary kind of a look into Deep Mind and for like half the documentary it seems like they're like pointing a phone at things and asking questions about it. it is it's never been clearer that there's going to be a big wearable push within that company without a doubt. Yeah. And and actually I mean Meta do they have any",
        "start": 1426.08,
        "duration": 3119.9210000000003
    },
    {
        "text": "half the documentary it seems like they're like pointing a phone at things and asking questions about it. it is it's never been clearer that there's going to be a big wearable push within that company without a doubt. Yeah. And and actually I mean Meta do they have any know Samsung watches are pretty good are and are Google is there a Pixel watch yes is it I don't think it's I have well if we're asking that question yeah probably I think basically having just I just bought the Garmin having just done a lot of research in the smartphone market it's basically either I'm going to get some angry emails for this. I could be wrong here. This is all right. Don't hold me to this, folks. I'm just going to talk about my cursor experience testing this stuff out. It seemed to me like the market is basically on smart watches. the Apple Watch or Garmin. Yeah, that's what that's the sense I've gotten as well. But the Pixel Fold I I look at a lot. I've been researching and now Google based on old school machine learning serves me a lot of pixel content in the Google app in terms of news stories and stuff like that and push notifications. So So maybe I'll get maybe I will fold and get it if Siri doesn't work with Gemini. You're fold and get the fold. All right. I I I want to and then we'll stop with [laughter] those the I'm in rare form today. I apologize. , before you get before you get serious at Davos, let it all out right now. [laughter] We will not have seriousness there for sure. We will we will make we will make bad jokes in every country and continent possible. , all right. I just want to end this segment. , I already said that, but this is just my perspective. , I I I feel like all these arguments make sense on paper. , but then you use Open AI and you use Anthropics models and their pro their products and they're damn good. They really are. And I I I I don't know. I I would I don't think m maybe Gemini is on par in some ways, but I would not write those companies off at all. No, I'm not writing them off. I think the story to as of today is that Google is now one of the leaders. I think and and well positioned for all these other external factors. From a pure Gemini product standpoint, I think it they're on par. I mean, they're certainly on par, but I don't think I don't think anyone's like counting out through others, right? Yeah. But I thought with with the the end of this Verge article was so definitive just that like let's see there is simply no other company set up to truly compete with Google. I disagree with",
        "start": 1584.159,
        "duration": 3430.5620000000004
    },
    {
        "text": "I don't think I don't think anyone's like counting out through others, right? Yeah. But I thought with with the the end of this Verge article was so definitive just that like let's see there is simply no other company set up to truly compete with Google. I disagree with correct in my opinion. Agreed. Agreed. Okay, let's talk mirror. Yes. So, we're going to talk about Thinking Machines Lab and the fact that there's been the drama continues. It seems like that Thinking Machine Labs, by the way, is an offshoot an offshoot. It's a company that works in AI that is founded by that was founded by former OpenAI executives and leaders. And there is a crisis right now going on within that company as many people head for the doors. We'll talk about that and what it means along with Claude Co right after this. And we're back here on Big Technology Podcast Friday edition. we are having a good time today, but thinking machines labs lab is not. Here's the story from Wired. On Wednesday, OpenAI's CEO of applications, Fiji Simo, announced the company had rehired Barrett Zof and Luke Mets, co-founders of Mura Morati's AI lab, Thinking Machines Lab. Zof and Mets left OpenAI in late 2024. This is where it gets pretty intense. A source with direct knowledge says that Thinking Machines leadership believed Zof engaged in an incident of serious misconduct while at the company last year. That incident broke Miat's trust, the source says, and disrupted the pair's working relationship. Here's an aside from me. it's it sounds a lot like that source is a somebody on the PR side. That's just like straight PR speak. Okay. The source also alleged Marotti fired Zof on Wednesday before knowing he was going to Open AAI due to what the company claimed were issues that arose after the alleged misconduct. All right, I'm going to speak as a reporter now. The to me, look, I I I I don't love to guess at sources, but it is fun. , and it seems, and I could be wrong here, but it seems like the source on this one was either one of two people, , or one of three people. either Mera Moratti, John Schulman, her co-founder, or PR. That's it. This is this is clear like it seems like clear, you know, spin to me. So that's the story. If it's spin, like what is this serious misconduct or breach of trust? I mean, I guess I know they can't say it, but like that's why I think it's spin because if it was a like somebody else that wasn't like giving the official thinking machines message, we might know. Wait, sorry. Walk me through that. Walk me through that. All right. You get you're you get you're going to get this is how it usually works. You get a call from typically it's a PR person. You know, you've",
        "start": 1743.44,
        "duration": 3746.6419999999994
    },
    {
        "text": "like giving the official thinking machines message, we might know. Wait, sorry. Walk me through that. Walk me through that. All right. You get you're you get you're going to get this is how it usually works. You get a call from typically it's a PR person. You know, you've heard that these people leave. Then they're going to give you their perspective, right? And if it was like somebody within the company or or a couple people that really knew what happened with this alleged misconduct, they will tell you. I mean maybe so they Zof didn't respond to several requests from Wired. so maybe they just didn't have it concrete enough and sort of might have been exposed to legal liability. but typically when it's not specified like that and it's a report over what happened then you know it's typically coming from the company itself. You would imagine otherwise you would actually know what happened. It's a ve it's a very that's why there's so much drama here. It's a very weird situation. Okay. Which raising $2 billion at a $12 billion valuation with no product or even business plan or any mention of what your business does was always kind of a weird situation if we think about it. So maybe this is just kind of the logical conclusion of that. Like do do you think do you think thinking machines is done? Do you think this is just a a hiccup in the road and Meera and team come back stronger than ever? I think they're done. I do. the other the the one argument I'll make against me is that they have billions of dollars. They raised $2 billion or something like that. Yeah. Yeah. That's a lot of money. Preed preede or seed, whatever we called that. Yeah. You skip a few rounds, right? It's like seed seed used to be $500,000. So clearly they're beyond that. But I think they're I just want to say why I think they're done. So you have these two that have left and you have more. There's another one Sam Shon Holtz who's going back to OpenAI. And this is from the Wired story which is very well reported. At least two more Thinking Machine employees are expected to join OpenAI in coming weeks. Like not only are they leaving, they're going back to the place they broke off from. Yeah, that part is the oddest part to me. I not odd, but and and PG Simo kind of like just pouring salt into the wound by saying like tweeting about reporting structure and welcoming these folks back as well was just it's all just drama. I think to me the bigger question is is this the end of this absurd $2 billion seed round safe super intelligence thinking machines? If you were an ex openai person, you will get billions of dollars without even saying a pitch deck. Is this the end of all that?",
        "start": 1904.96,
        "duration": 4063.5229999999974
    },
    {
        "text": "I think to me the bigger question is is this the end of this absurd $2 billion seed round safe super intelligence thinking machines? If you were an ex openai person, you will get billions of dollars without even saying a pitch deck. Is this the end of all that? about just think about where AI is today compared to where it was then. I think we could both we could both agree that the AI the promise of AI is more real now than it was fair. When we get to our final when we get to our final segment, you're right. I mean, it is. It is. It's gonna h So basically if someone has an idea then they're going to get funded. Yeah. But the promise of like real AI doing real things is greater than ever. the promise of vague notions about like end of society and humanity and safety and thinking whatever like I feel maybe in a way maybe this is the like nail in the coffin of that era of like and which I would love and this is the best thing ever where we stop talking about just really vague things and more theoretical things and actually are able to just focus on work. Don't you think that as it gets as the valuations and the economic promise gets more concrete that some of the silliness on the margins is just going to get even worse? No, because then you actually it's like the famous Silicon Valley HBO episode where it's like you never want to have revenue because then people will actually value on that revenue. Then when you actually are selling a product, then you are measured on the actual money you're making and the multiples of your revenue as opposed to when you got no product. When you first of all, when you have no revenue, they can't do that. And when you don't have a product, it's even better. Yeah. I mean, maybe now we have more realistic views about what AGI is and what the path there is. But anyway, it's going to be it looks like bad news for for thinking machines. Go ahead. I want I wanted to end this one with my favorite thing I saw on this was that this it introduced is this vibe founding just kind of getting out there. You don't really do anything. You just raise a bunch of money and you that's it vibe founding. But I think what these VCs were probably betting on was that they were going to get the next Open AI. But doesn't seem like anyone outside of Open AI is going to be the next Open AI. This is from Alex Heath as I he says the more okay more thinking machines employees are in talks to join the three founding members who just rejoined open AI. Okay. Wired had that but this is the new detail. Sources say thinking machine",
        "start": 2064.56,
        "duration": 4366.7239999999965
    },
    {
        "text": "to be the next Open AI. This is from Alex Heath as I he says the more okay more thinking machines employees are in talks to join the three founding members who just rejoined open AI. Okay. Wired had that but this is the new detail. Sources say thinking machine strategy and has been struggling to raise a new round of financing. All right. Maybe that last detail is some evidence that you're right that we might be past the sillier era. But do do you know what is interesting is what if let's say the the guy who left was leaking information that was confidential to open AAI. I just want to know what that information was. If is there a product and [laughter] the horizon that they're like going to let them steal or I would like I would love to know. Well, I mean, Fiji apparently in her post said she doesn't have concerns about the ethics. Meanwhile, we know nothing about thinking machines, right? We we still don't really know what they're doing. They don't either. [laughter] Okay. I think we should talk about speaking of getting real work done. Yeah. Yeah. Let's talk about Claude co-work. Last week you and I had a discussion Ranjan about clawed code about how this was the type of technology that could get work done for knowledge workers whether they know code or not. this week basically you know almost immediately after we had that conversation this dropped. This is from from Wired. they they released something called Claude Co-work which is an AI agent that's not for technical people and or that you don't need to be technical to use it and Wired says it actually works. they say co-work takes the abilities available in the company's coding focus tool and makes the user experience more approachable. The tool is designed for the wider group of nontechnical users who may want to experiment with a new way of controlling their computers but get freaked out by a command line. It can do things like organize files into folders, generate reports, and even take over the browser to search the web or tidy up a Gmail inbox. When it comes to file management and computer interfaces, this tool feels like the start of a pleasant user experience evolution. What do you think about this? I mean, this is basically the thing that we discussed on Friday and now it's come to life. What we've discussed and and for for newer listeners, just for context, I work at Writer Writer.com and I've been speaking for months now about one of our products, writer agent. We're only enterprise focused, but basically it is this. It's using natural language to take multi to launch multi-step workflows. You give it the harness, which is the word had we had not used prior to last week, but I had said you give it the tools and the data sets and",
        "start": 2218.48,
        "duration": 4678.436999999994
    },
    {
        "text": "enterprise focused, but basically it is this. It's using natural language to take multi to launch multi-step workflows. You give it the harness, which is the word had we had not used prior to last week, but I had said you give it the tools and the data sets and the work. And to me, I actually was trying to find I think it was like 4 months ago. I said it was the first time I felt AGI, what I think could be AGI, that it actually is going out and doing stuff. I'm turning off my computer and in the background it's working for me and doing stuff. And dude, I've been trying to tell you this is for for weeks now or months. Like I have felt this. So it it was actually kind of exciting for me to see Claude get into this space because Claude code has done this for software development. And I'm not saying just only for software developers because plenty of non-developers have been building on it. But that feeling of actual autonomous work being done has been kind of checked off for code build coding. But I've already seen that with knowledge work and and now what is actually I've already seen the last week it's so much easier to explain what I'm trying to cuz co-work is kind of defining this category. So so again the idea of taking documents and words and web search and spreadsheets and Python scripts and putting it all together to actually get to do something for you for work. I think like this was my prediction end of December. I think this is going to be one of the biggest trends of the year. It's self- serving for my own work, but I really think it's we're going to see this inflection point and and I love that cla literally after we talked about it, Alex texted me. He's like, \"Do you see this that they did it? They listened to us. They said it was only built in a week and a half. They listened to us.\" Right. Well, you initially I said this was this was inspired by us and you initially mocked me by saying it was done in a day and a half, but then I found that detail in a week and a half. Yeah. Which, okay, it wasn't from last week's show, but still but I want to ask you about this. Okay, so cloud code, we know what cloud code does, right? It's like vibe coding. You tell it to do things, it will go build it for you, etc., etc. Co-work. , all right. Here was the demo of the debut. The AI put a meeting meeting transcripts took meeting transcripts in and it gave advice about how to be more effective in meetings. it had a tool that searched calendars. It prepared custom slide decks. some of the reviewers that I read also said it",
        "start": 2378.24,
        "duration": 4959.877999999995
    },
    {
        "text": "the demo of the debut. The AI put a meeting meeting transcripts took meeting transcripts in and it gave advice about how to be more effective in meetings. it had a tool that searched calendars. It prepared custom slide decks. some of the reviewers that I read also said it do you need a separate app for this? So why why can't you just do it all in a cloud window? I got bashed by the way not bashed. We got some polite criticism of of my I I was just trying to tease out last week why you would want to do something with claude code versus in the chatbot window, but for this one, I legitimately don't understand why you wouldn't just do it in the chatbot window. I mean, I I can tell you like from a competitive standpoint for writer agent, the product of my company, like we've been testing it, looking at it. I am genuinely like the file local file access and management side of it is a bit interesting and confusing to me because like who uses files? I don't know like I software developers do. , which is why I think it was kind of built like that because otherwise like I don't know dude I don't know anyone who organizes local files in folders and everyone just has a downloads folder and a documents folder that are unwieldy and maybe if cla co-work helps them with that. I do think if it's like kind of their MVP maybe it was just something differentiated and interesting to start with. But but again, I think the idea of non-technical people being able to use natural language to build stuff that does stuff for them, that's 2026 and and that that people are going to start seeing the promise of that this year and and co-work is definitely going to be a starting point for it. But if it was built in a week and a half, you know, I mean, how good is it really going to be at launch? Yes. So, I'll say I'm not fully bought in on the cowork use case, but I could be wrong. I mean, this it starts most of these things start as seeming trivial and then right like even if you think about text, it starts as autocomplete and then it just starts to do it on its own. So, maybe we see a similar evolution. But, you know, before we go, I want to talk with you about this idea. I just wrote about it in big technology u about the way that this technology adoption is going and it seems to me like there's two different sort of diverging trajectories of AI adoption and the first is at the organization level. So even if companies are eager to implement AI they've run into all these problems. they have entrenched organizational habits like we talked about security considerations and",
        "start": 2520.48,
        "duration": 5261.956999999994
    },
    {
        "text": "it seems to me like there's two different sort of diverging trajectories of AI adoption and the first is at the organization level. So even if companies are eager to implement AI they've run into all these problems. they have entrenched organizational habits like we talked about security considerations and applied at a wide scale. So that's one direction this is going and because of that we've seen slow adoption among enterprises from a top-down perspective. Then on the other side you have individuals. Now individuals they aren't encumbered by many of these same issues that the enterprises are. they have a unique set of data permissions. They can change their own habits and they don't really need to ask permission to do so. , and they also like when they come up against the technologies limitations, they're able to adapt. And so we have instead of like this technology be being adopted by enterprises and pushed down, it's being adopted by individuals in some way and pushed up. , and I I calling I called in my post the we're in this age of individual empowerment where, you know, you're going to start to see a real divergence in terms of individual performance, probably more than we've ever seen it happen before and organizations begun to be pressed by the people that are using these tools. and and it's going to be maybe it'll be a little bit weird or uneasy, you know, in organizations that have basically failed to roll out their pilots, but they have people coming from the bottom up who have used this technology very effectively and are sort of changing the game. What is your perspective on that thesis? I and I I've this is like my life on a day-to-day basis. So I think you are correct in that it's going to be people who understand the it's people who are going to be playing with claude coowork will make my life even easier cuz when they open writer agent and we're talking about their company adopting it they already know what to do in fact like claude code already kind of taught that way of working I think like we've already seen it for a long time I the everyone is using chat GPT now or Gemini that I know that was actually another maybe 2025 the two big trends were coding autonomously got solved and everyone using LLM chat got solved again this year people like everyone curious and forward-looking is going to start doing this kind of autonomous workflow building what I always think about is like I think a year and a half ago two years ago you know the saying it's not AI AI that will take your job. It's someone who uses AI will take your job. And people say that and try to make it sound like it's original and insightful, but I think this year we're going to start to really really see divergence in",
        "start": 2675.44,
        "duration": 5580.997999999991
    },
    {
        "text": "the saying it's not AI AI that will take your job. It's someone who uses AI will take your job. And people say that and try to make it sound like it's original and insightful, but I think this year we're going to start to really really see divergence in powerful if you figure out how to get AI to do work for you that you will just be leaps and bounds ahead of your co-workers. It's like I see it firsthand. I feel it firsthand. So like I think this year is gonna I don't know problems what what is gonna happen exactly in that but it's gonna happen this year. Let me ask you this. So in the beginning of this like workplace rollout you had a lot of companies who like saw chat GPT and they said we need chat GPT for what we do and they threw it at a lot of different problems. they threw it at you know adding efficiency in processes, drawing insights from data, automating some tests and they thought they could do that company top down. So basically I'm curious is that going to just disappear and is it just going to dissolve into like individuals using these these tools or is what you're saying that basically when when you become a personal user you could sort of become a champion within the organization and encourage other people to use the enterprise tool. Yeah. Even we see it like I mean that's like our tool is built around collaboration on this. It's like but it's still individuals building things that then get shared out and are used by others. So it's still kind of like those champions or leaders within a group. And it's always like an interesting who you see kind of rise up and do that. And and it's typically not pure tech people pure business. It's some hybrid of the two. it's just kind of curious people I guess. Like I I mean I even saw like like the it's funny like who I've seen vibe coding Claude code apps even like Joe Wezzenthal and Kevin like you see like people who just you have seen are curious and that's the kind of person I think that is going to get it this year and and start kind of and and it'll force people because also people if you're at an organization that doesn't adopt it you don't want to work there and it's going to be the most talented people. So, I think that all that kind of culture clashing will really come to a head this year. You know, I'm calling these these early adopters. I'm calling them the harness hive. Harness harness. Harness. Let's work on that one. Let's can't improve on that. It's going to happen. Harness is they build the harnesses for the teams and the organizations. They they sew together them. They craft them in with care. They're the harness",
        "start": 2836.64,
        "duration": 5875.077999999991
    },
    {
        "text": "adopters. I'm calling them the harness hive. Harness harness. Harness. Let's work on that one. Let's can't improve on that. It's going to happen. Harness is they build the harnesses for the teams and the organizations. They they sew together them. They craft them in with care. They're the harness No, it has to have alliteration. Harness hive. All right, that's what I'm going to call our listeners from now on given the dramatic and effusive pro harness feedback I got after last week. It was we're I'm Thank you to our listeners for for being team harness over here cuz God knows Alex isn't. But but you can't even bring yourself to say I can say harnessive. You can't even say it. I can't say harness hive though. That's too far. That's [laughter] too far. I'll make a folding phone joke before pun before I I say harnessive here. This might be the universe encouraging me to log off for the weekend. So, Raj, great to have you on as always. Really appreciate it. Bring bring all of this to Davos. That's all I ask is say how many times can you say harness with Demis next week? I'm not [music] saying it, but I'll say it one more time as we sign off. All right, Harness Hive. Thanks for joining us as always. Great having you. We appreciate your time and companionship with us every week. So, thank you for being here. next week, very intense week of big technology podcast shows. If you're at Davos, please do come say hi at the Qualcomm house and [music] at the Google House on Tuesday night with with Deis. but here's here's the rundown. We're going to have Cristiano Aman on Monday, the CEO of Qualcomm. That will run probably on Tuesday. Then I'll be interviewing Brett Taylor, [music] CEO of Sierra, Deisabis, CEO of Google DeepMind, Joel Pña, the chief AI officer of Coher and then again the COO of Google DeepMind on Thursday, Llaya Ibraim. [music] We're going to put at least two of those on the feed on next week and then Raj and I will be back on Friday and then [music] the rest will come out in the weeks following. Thank you, Rajan. Thank you everybody for listening and watching and we'll see you next [music] time on Big Technology Podcast.",
        "start": 2988.0,
        "duration": 6107.477999999992
    }
]