[
    {
        "text": " Happy holidays everyone. Ron John Roy and I are here to predict what's going to happen in 2026. And we'll do it on a special edition of Big Technology Podcast Friday Edition right after this. Welcome to Big Technology Podcast Friday Edition where this week we will predict what's going to happen in 2026. we have a short episode for you on the feed today, but we didn't want to leave you alone during the holiday season. We're here to do what Chat GPT will do over time. you know, provide some companionship and hopefully some giggles. And so for that, we are going to spend the next 20 plus minutes sharing our predictions of what's going to happen in 2026. Let's begin by just trading some predictions. we both have about five that we want to go through. Let's see if we can go through them as as fast as as we can. All right. My first one is and this is the area where I work in. , I think aentic AI, what it actually means is going to become real in 2026. I think in 2025, everyone said it. Everyone had kind of this like vision of these like, you know, you're stringing together blocks on a workflow, this RPA plus vision. And I think towards the end of the year, I started talking about this in July a bit and seeing it and with my own the company I work for writer but like and now we're seeing it in the way the chatbts of the world work even what aentic means for Gemini the idea that you define a bunch of tools you define a bunch of data and let the AI create that workflow itself and I think it's going to expand into all parts of our life beyond enterprise like we I remember a year ago you had been talking about like what is an agentic workflow I want like you know and everyone it always came back to travel booking and like go book my flight for me after doing a flight search I think like people are going to start to I've already towards the like the last half of this year started to actually identify parts of my life and I think like and people are going to be able to do this in a much bigger way next year. Okay. So you really believe in this technology being able to take that next leap? Yeah. to actually string together a bunch of different actions and do stuff for you. And we're gonna everyone's going to start to see that next year. This will be fun because as we go through the year, I will remind you of this prediction and we'll see if it actually comes true. All right, here's mine. , I'm going with my safest prediction first. , Chat PT hits a billion users and we know it's at 800 million now. , I expect",
        "start": 0.08,
        "duration": 307.279
    },
    {
        "text": "we go through the year, I will remind you of this prediction and we'll see if it actually comes true. All right, here's mine. , I'm going with my safest prediction first. , Chat PT hits a billion users and we know it's at 800 million now. , I expect year at the latest. And I think that's a real moment I think for AI and and OpenAI in general. There's not many products that have a billion users out there. And the fact that ChatGpt will become one of them is going to be a big moment. I I think it'll it'll be a marker of people saying, \"Okay, this is real.\" All right. I I I mean they might do that by the end of this year in the next week or so at this point at this stage. But yeah, I think I think that's that's your safest prediction. I'm hoping that's the safest one. I want a little I want a little bit of a a little fire in some of these predictions here. Okay. All right. The next one from you is is a really fun one and I like that. So, why don't you hit that? Yeah. I am going to buy a foldable phone. I'm going to say it here. I've been hedging on it. god damn it, I'm gonna buy a foldable phone. But I actually think they're gonna have a real moment. And the reason I think that's exciting is the phone form factor has not evolved since the basically the original iPhone. I think like it's been exciting and cameras got better, but I've been what you hold in your hand all day and interact with some kind of an meaningful innovation in that I think is a good thing. And the foldable phones are the first place I've seen that in a long time. I'm saying it here. I don't know which one. I've been looking at the Pixel Fold, the Samsung, but I'm going to get one. Yeah, I've been saying it on the show. My mantra around this is foldable phones, people with foldable phones look happy. It really is the case. They like unfold their phone on the airplane and they're like and they're just so happy. Life hack. but you you don't think it you you're you're pondering whether it will be Apple, but Apple is on schedule to release one this upcoming year. So why not wait? Is it 2026? Okay, maybe I'll wait then. I will be unfolding my phone with a smile on my face in 2026. All right, good lead into my next prediction, which is Apple's going to have an absolutely incredible year in 2026. All right, spicy. Spicy. , you know, we've bashed them a lot for good reason. They just haven't done a good job with AI, but they have something. The iPhone 17, which I just went out and picked up.",
        "start": 153.599,
        "duration": 582.0790000000002
    },
    {
        "text": "is Apple's going to have an absolutely incredible year in 2026. All right, spicy. Spicy. , you know, we've bashed them a lot for good reason. They just haven't done a good job with AI, but they have something. The iPhone 17, which I just went out and picked up. mean, some of the things you notice on it, the video is great. The audio processing is great. It's fast. The battery lasts a long time. Selfie mode is cool. Like, this is why people went out and get it. Got it. And that's why they're having wouldn't call it a super cycle, but a mini bump, you know? And and I think they're going to ride that strength into the next year. They do not have a a real competitor from an AI device, which seems like it's a couple years off. And then they're going to release their foldable phone. I think I mean it it you know, every year should be your best year ever if you're a public company, but without a doubt, I think 2026 will be Apple's best year ever. They're going to sell a ton of phones. They're going to add to that user base. They're going to price their foldable phone at $2,000. Everyone will love it. At least at least maybe three. Maybe three. Every people will pay it and they will be happy. They will smile and they will they will love Apple for it. Will Siri work better? No. No. But it's not going to matter. Yeah. I mean, we can't have it. We can't have it all. Can't have it all. All right. My next one. I actually changed this one up a bit. , I think there's going to be major scandals and discomfort around recording or transcribing in public. And what I mean here is I've already started to see I think I saw there's reporting that like on a one of the cruise lines is banning metaray bands. everyone who uses tools like Granola or other call transcription like in 2025 everyone just kind of let it go as every word you're saying and everything you're doing around like when you hold out a phone and record someone in public they mostly know that you're doing that those kind of more subtle ways of kind of recording activity of people have been increasing in 2025 because AI is so good at actually making sense of it I think there's going to be some major controversy backlash around people and and and I think it's going to inform the whole world of AI devices that Sam and Open AI and everyone else is talking about. Glass holes 2.0. What? Glass holes 2.0. Oh, glass holes 2. Wow. Glass holes. That's 2011 reference right there. Google Glass. Yeah. Yeah. I think and as a user and I love my MetaRay bands like and I try to be responsible with them and I'm not recording random people on",
        "start": 293.12,
        "duration": 876.9569999999995
    },
    {
        "text": "holes 2.0. What? Glass holes 2.0. Oh, glass holes 2. Wow. Glass holes. That's 2011 reference right there. Google Glass. Yeah. Yeah. I think and as a user and I love my MetaRay bands like and I try to be responsible with them and I'm not recording random people on is going to be and you're already starting to see a major backlash and I think it's going to happen next year. Okay. It's interesting how that jives with my next prediction which is that there's going to be no AI device breakout in 2026. I don't think there's going to be. I think these we're still in like the humane pin era and we're not moving to something that is going to be ubiquitous and you know the Meta Raybands you know they are they've been selling millions of of these devices. I know you know when this episode drops I'm going to be out in South America on a trip. I'm going to have those Ray-B bands on my face. But anyway, I I think that I think that these things are just not there yet and there's a lot of hype about them and we like to think about them. I still think the phone is powerful. It actually syncs with my belief that Apple's going to have a great year, right? It's just like the phone's good. Team phone team phone team phone. No AI AI device breakout. All right. I like that. But if it does break out, my next prediction is that you will be shopping on an AI chatbot because I think AI shopping is going to become a real thing. I've actually open AAI their their shopping like specifically trained model is actually pretty good. I've been using it more. I think people are going to get a lot more comfortable. When you are buying your supplies for that hiking trip next year, you're just going to talk to Chat GBT or Gemini and it will go out, find the best price, order the package, tell you when where it is. I think Amazon also is going to make some more interesting moves in this space versus Rufus, which is more passive. , Amazon came out, do you remember the Amazon Dash? It was a button. Oh, yes. Yeah. It was a button that was tied to a specific brand or product that you just had to push and you would put it on your fridge. Like that whole mode of just like I'm out of paper towels, just get this done for me. Like I don't want to go on Amazon, find paper towels. Like all of that kind of shopping I think moves to more of an AI first way next year. That's interesting. So if shopping does go inside these these bots, it's actually a pretty sizable bump for like the functionality that they have and business case. Yep, definitely. And Google puts them in",
        "start": 441.919,
        "duration": 1157.9969999999992
    },
    {
        "text": "that kind of shopping I think moves to more of an AI first way next year. That's interesting. So if shopping does go inside these these bots, it's actually a pretty sizable bump for like the functionality that they have and business case. Yep, definitely. And Google puts them in All right, we're going to take a quick break and continue with our predictions after this. Again, just doing a brief episode, but glad to be here with you today. My next prediction is that we're going to have an AI love boom in 2026. and I'm going to tell you more about it right after this. And we're back here on Big Technology Podcast Friday edition predicting what's going to happen in 2026. I feel confident in our predictions so far. And my next prediction is that we're going to see an AI love boom in 2026. I know in 2025 we had lots of interesting reporting about the companionship that people feel with these bots. We've tended to hear about it when it goes really bad. , I don't think people are going to have come out of the woodwork yet, you know, talking about how, you know, deeply in love they are with their bot. But as this as the functionality gets better as memory increases and as personalization increases and as capacities increase and as helpfulness increases, I just I think people and mass are going to fall in love or build or or name AI as one of their you know top five friends. I think that's definitely coming next year and it does scare me you know to many degrees but I just I think it's happening. Two questions. One, are you saying next year becomes the kind of inflection point like when online dating would be went from like awkward and you didn't advertise it to there's just the standard. Do you think next year is the inflection point where people just casually talk about their AI companions? It's like, oh, my Chad GBT was telling me this or you name them. Yeah, I think so. Look, I think that this is happening. This is also going back going back to my conversation with Sam last week. I do think that there is this, you know, if not a stated preference, a revealed preference in the data that they're seeing that people really want to bond with their bots. And maybe we will have this. Yeah, you're right. An online dating moment where it goes from being taboo to say, I'm trying to find love by meeting strangers on the internet. maybe a similar breakthrough happens with online dating where people say, you know what, I don't need to, you know, use the internet to find other people. I've actually decided that the internet is my is that person. All right, my second question. We had talked about this, I think like a year",
        "start": 585.2,
        "duration": 1465.2779999999998
    },
    {
        "text": "breakthrough happens with online dating where people say, you know what, I don't need to, you know, use the internet to find other people. I've actually decided that the internet is my is that person. All right, my second question. We had talked about this, I think like a year shopping for your AI love companion? What is that? What basically? Do you need to try out different relationships with different No, no, no. Do you have to buy gifts for your AI companion? Oh, well shopping. Remember we we had talked about I think it was what would an AI love companion want for Oh, it was on Valentine's Day of this year. That's why I think one of my favorite episodes we've done. yeah, you're going to have to buy gifts. you're going to have to you know offer it more compute. Maybe it will ask you to upgrade to the pro version so you can have longer chats. You know there are there with voice mode for instance there are limits to how much voice conversation you can have. That's what what does your AI companion want for Valentine's Day? More compute. Move up the tier to GPT Pro. It's funny because it's lovely. I only she only date or they it only dates GPT Pro users not not GPT plus. Well, it's one of those things where it's love language is quality time, but to spend quality time, you need gift giving. You need to buy that time. Exactly. All right, that's a good one. I think my last one, I think 2026 is going to be both the best and worst year for AI. What I mean by that is I think we're going to see much more widespread adoption, major breakthroughs, but also I think the kind of like financial arrangements that have been built in kind of that infrastructure the especially the financial infrastructure separate from the actual kind of like physical data infrastructure of a lot of the big players I think takes a big hit next year. We're starting to see it with all these questions around Oracle just in the last month and a half. Like those all of those trades that just kind of ran as pure momentum this year. I think we're going to see a big wash out. And is that so what happens in that case? Like if that's the case, and this is again not investment advice, you know, if that wash out happens, can the S&P 500 go up in 2026 or is that just like does that mean that we just have a bad market year next year? I think I think we have a bad market year. I don't think we have a calamitous market year, but I do think like when it has been the single driver of like equity growth over the last two years or so, I think there there's going to be",
        "start": 740.88,
        "duration": 1746.3180000000002
    },
    {
        "text": "year? I think I think we have a bad market year. I don't think we have a calamitous market year, but I do think like when it has been the single driver of like equity growth over the last two years or so, I think there there's going to be and it also kind of you know not as a separate prediction but I think like this also is going to significantly influence politics the midterm elections like as if you have kind of like flat equity growth people uncertain about the economy the Trump administration others and like a lot of people just still very strongly pushing AI as a just kind of general term I think then you see more of a backlash to it like overall as everyone is still falling in love with their AI companion. So I think you're going to have all these like weird forces kind of really pushing at each other. So that's why I say both its best and worst year. Who gets hit the hardest? I think like the oracles of the world are kind of the peripheral players who made AI such a big centerpiece when it wasn't kind of native or core to their business. Yeah. No, I mean we're just seeing that happen in real time. It's Yeah, that's as much of a prediction here versus Yeah. an observation looking at the market today. Yeah. Where do you think OpenAI is at the end of 2026? I think a billion users. I don't think I I think they're not the leader. I think I think Gemini is Google definitely starts to catch up. I think like everyone is biting off at different parts of the OpenAI empire, I guess, if we call it that. But but I don't think they're the leader. I think they're still at a billion users. I think Meta starts to maybe do something interesting on the consumer side. So you have like Microsoft, Google at enterprise, Google at consumer as well, meta consumer as well. Like at every level, I think they're going to be they're going to be challenged in a bigger way next year. Is OpenAI a public company next year? No, I don't think so. Do you? I don't think so either. No, that's another one of mine. No OpenAI IPO in 2026. Actually, go ahead. on that. I saw like a bunch of posts around how like the wealth creation in San Francisco because of the upcoming string of IPOs from the anthropics and then open AIs of the world will be like unlike anything ever seen housing prices etc etc. Do you think any of these companies are going to go IPO all the like you know 100 billion plus valuation companies? One of the things that I worry about is what happens when these chat bots and the public markets collide and what do market pressures do? And again, like imagine just think about what the",
        "start": 884.56,
        "duration": 2080.2380000000007
    },
    {
        "text": "are going to go IPO all the like you know 100 billion plus valuation companies? One of the things that I worry about is what happens when these chat bots and the public markets collide and what do market pressures do? And again, like imagine just think about what the does in the middle of an AI love boom. I mean, that's good for quarterly earnings, right? as everyone is having to upgrade to GPT Pro to because your companion is only dating pro users. But that's I'm not saying that on a public earnings call too. Oh my god. Yes. Our our dating business is going quite well. 100 million users have you know decided to become exclusive with No, but the the truth is that that is the thing it is. I'm not saying the companies will do it, but I worry that if you are, there will be pressure and there absolutely will be pressure to sort of turn that dial up and make things spicier, which there already is. There already is. There is, but there'll be public market pressure is a different beast. You know, you miss your quarter by a little bit or you make your quarter by a little bit. It's just what you do versus expectations. And you know, you could be up or down a sizable percentage. So, yeah. Okay. All right. Here's my here's my last one. And I'm curious what you think about this because this is the one I'm probably least sure about. , but it is increasing AI model efficiency causes a crisis. And we've seen some of this over the past couple weeks like Google's for for instance Google's new flash model that like has they say has prolevel performance at flash prices and speed. , but the thing that I really wonder about with this AI moment is let's say the bots get, you know, about as good as as they can be. with the with without requiring all this compute and what happens then I mean I guess the the pro AAI argument would be like well intelligence is now too too cheap to meter so there's going to be a boom in productivity and all these things I don't know is there well actually I think that feeds in perfectly with my AI has its best and worst year because that's exactly it that I think AI is going to be used by more people in more creative ways and interesting and productive ways, but that doesn't necessarily feed back to the current infrastructure and trade that's been built up around compute and data centers. And I think that fits in exactly. So, I'm on board. Who is the company that has the best year in your opinion big tech-wise next year? , I want to like come out and say something unexpected like meta with AI, but I don't know. I'm still thinking it's probably Google.",
        "start": 1055.44,
        "duration": 2381.3589999999995
    },
    {
        "text": "think that fits in exactly. So, I'm on board. Who is the company that has the best year in your opinion big tech-wise next year? , I want to like come out and say something unexpected like meta with AI, but I don't know. I'm still thinking it's probably Google. one. , do you think Alexander Wang Pinterest? Pinterest. Yeah, you people love to pin. , think Alexander Wang survives Oh, that's a good one. You know, but at Meta in in 2026, you think he makes it through? No, I don't. That would be such a a disaster for Meta, I think. But I think Mark Zuckerberg after the metaverse is going to be even more confident about cutting things that aren't working. I think like they saw even and again I mean I know he said what was it like we can lose like a hundred billion dollars but we still have to compete or whatever it was like but I think I I don't think he's going to let things sit as long as they did just because you made a bet it's not working. Yeah. I mean there's enough stuff coming out of that place. You know one report okay but there's been multiple reports this year that like it's not really going well. I foreshadowed it on the show. So, you know, maybe that that is that will be the case and he'll be out. All right, Ron John. all right. I I will predict one last thing. We're going to have a lot of fun talking about this stuff in in 2026. So, thank you again for being such a great podcast partner all through this year and I I really look forward to our conversations every Friday. Thank you for the the analysis and the insight and the fun that you bring to the show and looking forward to continuing. It's the best way to end the week. I agree. All right, everybody. Happy New Year. Thank you for listening. Thank you for watching. and we will see you in 2026 on Big Technology",
        "start": 1208.88,
        "duration": 2571.357
    }
]