[
    {
        "text": " Cloud code is on a legendary run and becoming useful beyond programming. OpenAI rolls out chat GPT for healthcare. Prediction markets [music] have an insider trading problem or do they? And is the end of busy work a bad thing? That's coming up on a Big Technology Podcast Friday edition right after this. Welcome to Big Technology Podcast Friday edition where we break down the news in our traditional, coolheaded, and nuanced format. We have a great show for you today. We have filled our document with a ton of stories to go through, including what's happening with cloud code and why it might be applicable for folks beyond programming. Maybe it will end up impacting [music] much of knowledge work. That's at least what Ethan Malik has to say. We'll go through his post on the matter. We're also going to talk about OpenAI's foray into healthcare. It's it's actually it's an official foray into healthcare because millions of people have been using chatbt for healthcare already. we're also going to talk a little bit about prediction markets [music] and the end of busy work. Joining us as always on Fridays to do it is Ranjan Roy of Margins. Ranjan, great to see you. Welcome back. Good to see you, Alex. excited to be here. Let's begin just talking about cloud code. I don't know if you've seen this, but for me recently on X, cloud code has been a meme. It's almost like those Chuck Norris memes where people have been talking about how Cloud Code could basically do anything and it's got these superhuman capabilities. And I was waiting for a post to kind of illustrate what was going on with Cloud Code that had made people so excited about it. And I think we got one from Ethan Malik, the Wharton professor, friend of the show, and he writes the one useful thing Substack. And his post is called Claude Code and what comes next. and and I think he really illustrates just the amount of autonomous work that Claude Code has been able to do and the fact that it's not simply a code autocomplete anymore. So, let me just begin with the story that he starts with. He says, \"I open Cloud Code and gave it a command. Develop a startup idea that will make me $1,000 a month where you do all the work by generating the idea and implementing it. I shouldn't have to do anything except run some program you give me once. It shouldn't require any coding knowledge on my part and so you make sure everything works well. Malik writes, \"The AI asked me three multiple choice questions and decided I should be selling sets of 500 prompts for professional users for $39 without any further input. It then worked independently for an hour and 14 minutes creating hundreds of code files and prompts. And then it gave me a single file to run that created and deployed a",
        "start": 0.24,
        "duration": 326.72100000000006
    },
    {
        "text": "decided I should be selling sets of 500 prompts for professional users for $39 without any further input. It then worked independently for an hour and 14 minutes creating hundreds of code files and prompts. And then it gave me a single file to run that created and deployed a about you know we're going to go through what the ideas that Malik brings down in terms of why this is an improvement over previous generations and what the implications are here why people are excited about cloud code but but just to start are you impressed with the output that cloud spit out here I am this specific output I'm actually not that impressed I'm interested but I still think and and I'll definitely get into this in terms of like overall what I'm seeing with this kind of world of autonomous agentic. But I think again like writing 500 prompts that you can package up, maybe even creating a website, taking all these steps is actually incredible, but it should be table stakes. And more and more people are realizing every day that it is table stakes that the technology is already there to do this level of work. And I think remember what was one of my predictions from 2026, agentic AI is going to be real. And and I think claude code is a lot of people's first like entry into this world of truly agentic AI. And even Mollik goes on to write he was like the latest AI are capable of doing work more autonomously while self-correcting many of their errors. But then the AIs are being given an agentic harness of tools and approaches they can use to solve problems in many ways. That second part I loved because this is what I've been talking about for six months now. Agentic AI is not like a process flow diagram. It's giving it a set of tools and letting it go figure out what to do and actually go do it. And I think cloud code that the excitement around it is everyone's finally getting a taste of that. That's right. And so so the way that Malik frames it is the combination of these two things that the AI can do autonomous work and self-correct and then have this agentic harness which is jargoning to me but basically be able to call tools. I like it aentic. Oh come on it is a terrible no bad very bad. What do you like about this? Okay go ahead. No no no hold on I like Okay. I have been saying like def a predefined set of tools and data connectors. That doesn't sound exciting. And Gentic harness, it's like kind of just, you know, holding it generally in place, but still letting it go. I don't really know much about horse riding or how harnesses work in any kind of situation like that. But at least in my mind, that's what I'm thinking. I",
        "start": 163.44,
        "duration": 622.159
    },
    {
        "text": "And Gentic harness, it's like kind of just, you know, holding it generally in place, but still letting it go. I don't really know much about horse riding or how harnesses work in any kind of situation like that. But at least in my mind, that's what I'm thinking. I , no, it's not. It's per terrible riding. I mean, I really like the concepts here. And it's bad. It's jargony. You're too close to it. Ranjan, here's all you have to say. It can do autonomous work and selfcorrect, and it can use tools. That's it. See harness. Why do you have to make it more complicated? Harness is shorter. A gentic harness. He writes aentic. Okay, we're going to move on after this. But we are not accepting the term agentic harness in the show. It's just does not work. Not going to work. Agentic harness of tools and approaches they can use to solve problems in new ways. Why do you have to use the phrase agentic harness? Why can't you just write? They can they are the AIS are are being given tools and approaches they can use to solve the problem. So, so it's unnecessary jargon. This is where I think like and I I brought this up on on this podcast like six months ago at Writer where I work like and we're enterprise AI focused. We launched a tool and id started testing it in June. It was and we joked like you were like, you know, now you're at an AI company, you're feeling AGI, but it was the first moment I actually felt like, holy I gave it some direction and now it's going out and doing all this other stuff because it had a predefined set of tools and data connectors, one might call a harness, but anyways, they like feeling that autonomous AGIish type action. I think like the what Claude code has been the breakthrough. I've been seeing this for like six months now. Like this is happening. This is no longer us talking about can I book a flight and have it, you know, search and go do it for me. Like this is going and doing tasks for people. People are doing already. And Claude code is the first time a lot of people are experiencing with that. And that's why I honestly think this year this is going to break through in a big way. The way coding assistants were 20 the story 2025, right? And that's so getting past our our differences on languages. I think that's why I thought this was important and that's why I think this was worth bringing up here is that I think that the common conception is that you know AI for coding is just that like it's code autocomplete or in some cases you know you put a vibe code prompt in replet or something and then you get a website. I think what's interesting here",
        "start": 314.639,
        "duration": 898.7190000000004
    },
    {
        "text": "here is that I think that the common conception is that you know AI for coding is just that like it's code autocomplete or in some cases you know you put a vibe code prompt in replet or something and then you get a website. I think what's interesting here it will end up you know in in a way that that Malik has specified without him having to touch the code. it can end up building a website for him incl which includes a salesunnel by the way and and you know basically all he has to do is put put it live and the the way that it's doing this is the long autonomous tasks of of coding and then also being able to use the tools. We won't argue anymore about the the language. He says, \"The result of these two factors has led to big leaps in the latest AI tools made by the big AI companies.\" Now, listen, if you're at this point in this discussion and you're not a coder or you're not building a website, you might you might be asking yourself, well, okay, this is very specified and and what is in it for me? And and this is again like just just to go why we're leading the show with this. it starts to broaden out and if anything this might be just the beginning of what's coming for the rest of knowledge work and and and I'll just you know continue to read Malik because he's very good on this. He says, \"Unfortunately for the most of us, Unfortunately for most of us who want to experiment with AI, these new tools are built for programmers. In a lot of ways, this is a shame because these systems are actually broadly useful to knowledge workers of all types. And by seeing what you can do and experimenting with them yourself, I think you can learn a lot about the future of AI.\" He goes, \"To return to the example of the startup company launched by Cloud Code, it was only touching a small part of the capabilities of what the tool is capable of. If I ask it to do user testing of the live site from different personas and give me a report give me a report it it connects it deploys another tool connecting to a web browser on my computer. It takes control of the browser goes to the site it created and scrolling through as a human would. He said he asked the cloud code tool for a critical report of the UI and he said it did a better job of nailing potential issues and spotting some sketchy fake reviews on the site. and he says as a next step I could easily ask it to implement its suggestions continuing the process with minimal input from me. I this to me is really the the interesting",
        "start": 453.28,
        "duration": 1172.9590000000005
    },
    {
        "text": "did a better job of nailing potential issues and spotting some sketchy fake reviews on the site. and he says as a next step I could easily ask it to implement its suggestions continuing the process with minimal input from me. I this to me is really the the interesting go create things, you can have it test things and with natural language then go and optimize. And you know, if you think about you know, maybe maybe it's a website, but maybe it's also, and we're going to get into this, a folder of documents on your computer and you have it go in and start to, you know, give you feedback on it, make data visualizations from it. One example that he gave is is credit card statements. So you could just kind of download them onto your desktop browser and obviously do this with caution and then set cloud code loose on it and maybe makes visualizations, spots anomalies, gives you a report on your finances and you need that that more advanced capabilities. You need the ability to code and to call tools to be able to go and do this type of work. it's pretty pretty crazy to me. I mean it's real. It's happening. I I I'm living in the future, Alex. I'm I'm already there. And and but but I can tell you like this is where I think the big shift I saw is early 2025 when people talked about agentic AI again these thinking of like these big heavy processes and how do we automate them in some way and bring an LLM's intelligence to make a decision in one part or maybe create some copy at another part. The big shift was completely rethinking like what Agentic AI is and again won't say the word harness but allowing it to start to take these tools and I think what he showed there like around this like creating an entire business launching it 500 prompts at 39 bucks a month are you really going to do that maybe but probably not something it's these kind of like smaller multi-step processes where I I am calling by the end of the year. All of us are going to start incorporating in our life in a lot of different ways. Go check my credit card statement, find any charge above like $25, come up with a summary like email me. Stuff like that is going to become routine for especially at least any early adopter I think by the end of the year. And it is interesting. So we've talked remember like last year we were talking about like is AI going to hit a wall? And there were all these different things about like well is pre-training still continuing to work? And and I think you know there's another bad jargon word which is like the scaffolding right which is something we've used like what do you build around",
        "start": 592.959,
        "duration": 1460.560000000001
    },
    {
        "text": "AI going to hit a wall? And there were all these different things about like well is pre-training still continuing to work? And and I think you know there's another bad jargon word which is like the scaffolding right which is something we've used like what do you build around sort of cheat their way through the limitations of the you know the models topping out or for instance the context window. The context window of course is the amount of text that this model the model can work on before it sort of runs out of its ability to like keep it in the like sort of memory window so to speak. , and and it's just interesting to hear how this stuff works because because Malik even talks about how like the sort of claude code cheats its way through like the limits of the context window. He says when claude code runs out of context, it stops and compacts the conversation so far, taking notes about exactly where it was when it stopped. Then it clears its context window and the fresh version of Claude code reads the notes and reviews the progress to dates. and then it gives it those notes give Claude everything it needs to keep moving. This is why Claude can run for hours at a time. It carefully notes what it's doing along the way, produces intram work and you know like pieces of software and reports that it can refer to. I mean this is this is very interesting the way that these companies are architecting stuff. Yeah. I mean, this is where anyone who was using Claude two years ago, year and a half ago, and would hit that dreaded like you've run out of credit even as a paying Claude Pro subscriber and have to either wait 12 hours to run a prompt on the leading model. Again, like the architecture side of how people are approaching these kind of agentic workflows is getting solved. I think that's the big thing. And it's not at the model level that models are helping but and it's yeah it's the it's not the product actually you know what instead of product versus model architecture let's throw that in there as well as another layer that can be optimized or innovated on to actually to really move this stuff forward. So are you team architecture? I think I am team architecture. I mean this is something was it Larry or Sergey that you talked about architecture. Well Sergey talked about algorithmic improvements. Okay. And so I think put that under architecture. Yeah. Yeah. I would call it architecture and and and and it's starting to show up in other places too. Here's cloud cloud desktop. So this is a relatively new thing that that Anthropic has released. You can put cloud on your desktop if you're in the $20 a month bracket of the paying users. And Malik says just",
        "start": 738.72,
        "duration": 1751.0390000000014
    },
    {
        "text": "and and it's starting to show up in other places too. Here's cloud cloud desktop. So this is a relatively new thing that that Anthropic has released. You can put cloud on your desktop if you're in the $20 a month bracket of the paying users. And Malik says just to a folder. Remember that claude can do anything to the files in that folder. So be careful and make a back if it's if it's sensitive and make a backup and you can start working with AI. Have it research and write reports. Give it access to your credit card records so it can put them into a spreadsheet and tell you about anomalies. Ask it to do a data visualization. Whatever else you like. All right, Ranjan. So, as our as our resident AI agent expert, I'm going to ask you a question about this. , do we do we really need to like be running this stuff through co cloud code or can you just like upload it into the into the context window of like the cloud chatbot itself? Like what does going through cloud code give you? Is it just more power because it can build things on the fly for you? Te tell me a little bit more about why this is important. Yeah, the it's the ability to again it's multi-step. It's not one action. So it's a set of like especially giving that general guidance and action thinking it from thinking of it from an outcome perspective. It's no longer telling Claude here's what you should go do. It's saying here's what I want and to get there like that's not how a typical chat back and forth works. The chat back and forth is let's iterate together. Let's explore. let's try to understand versus I know what I want. Go get there for me. So I think and that ability to combine whatever the actual kind of like reasoning side if it needs to to to actually create like hardcoded Python scripts that are deterministic and are going to be used it can do that. Like not limiting it to that chat window is the biggest difference here. And again increasingly and again talking about my own company here like we see at Writer people the biggest change is the routine side of it. It's these things are no longer going to be oneoff things you do for fun and kind of try as an experiment. You start to set routines. So this kind of work is being done on an ongoing basis. So it's not I'm going to go in and upload a document. It's actually happening in the background and like the the clawed UI gets abstracted away. like maybe you just get an email or a notification with whatever results. So, so I think a big difference. Give some concrete examples. Give some concrete examples of of like the type of routines that",
        "start": 886.56,
        "duration": 2031.1210000000012
    },
    {
        "text": "actually happening in the background and like the the clawed UI gets abstracted away. like maybe you just get an email or a notification with whatever results. So, so I think a big difference. Give some concrete examples. Give some concrete examples of of like the type of routines that enterprise sales role but like right now at work we have like Salesforce, we have Gong which is like a call recording and data type thing. We have something called Z. We have all these different systems. I literally have a list of accounts. In the past I would go through every morning. I would either have like a report in each of one or a dashboard. I literally was able to create something where it's like go in, here's a list of accounts. Did anything happen in the last 24 hours? What happened? Summarize it. Email me. And like I built that. That's a whole app. There's tons of code in there and API calls and MCP connectors and I can do that stuff now. that like said this is where and I think I'm a reasonably technical person but like I mean anyone especially simple simpler levels of this will be able to start doing okay and this is that's a good good segue to the end of the post here from Malik he says today's AIs are capable of real sustained work that actually matters and in turn is starting to change how we approach tasks he says it is starting unsurprisingly with programming one of the more Famous coders in the AI world, Andre Kopathy, recently posted, \"I've never felt this much behind as a programmer. The profession is being dramatically refactored as the bits contributed by the programmer are incre increasingly spare and between. I have a sense that I could be 10x more powerful if I just properly string together what has become available over the last year or so.\" And a failure to claim the boost feels decidedly like a skill issue. Malik concludes, \"Don't let the awkwardness of the current claude code or specialization for coding fool you. New Oh god. New harnesses that make AI work for other knowledge work tasks are coming in the near future and so are the changes they will bring.\" Oh my god. Sorry. Okay, hold on. One, I love this quote from Carpathy. So, I'm trying to contain myself or regain my composure after seeing harnesses again, but okay. Carbathy. I loved this quote. I think it came out over the holidays when I was at home. Caught it on Twitter. Like started seeing it more and more because like this is how I feel as a fairly technical but still knowledge worker at heart. Like I feel when I'm seeing what I'm able to do, I feel like, \"Holy I I I think I'm falling behind or like I don't even know if other people are getting this faster than me that they're",
        "start": 1029.28,
        "duration": 2329.0420000000017
    },
    {
        "text": "feel as a fairly technical but still knowledge worker at heart. Like I feel when I'm seeing what I'm able to do, I feel like, \"Holy I I I think I'm falling behind or like I don't even know if other people are getting this faster than me that they're feeling was kind of like lingering in me the moment you start to see what's possible. And I think like when I saw him say that, especially about programming from one of the leading world's leading programmers, like it starts to make us feel like this stuff is so interesting right now that even someone like him can actually feel like I better get a handle on this right now. Right. And look, I I'll just say this. I'm not completely sold that this is where we're going. I know you feel firmly. You're also like, you know, you're you have a built-in bias. You're because it's where you've seen enough energy around the increases in capabilities, the type that we spoke about at the beginning of this conversation, the type that Malik listed as he explained what's going on. and I think that that has been clearly drawn out by Malik in this post that I think it would be foolish to ignore it. The same way that Malik is basically saying like don't be fooled by this being just a coding specific thing. soon we'll probably have the interfaces that will make this type of work autonomous work things that selforrect things that call tools available for for many many more different types of knowledge work professions. And that's why I think that this is important to highlight. I mean we are getting obviously we're getting you know a year is just a delineation in time but we are getting started here in 2026 after what I think was a lot of movement in the space. Obviously that a lot of money went into it. We've been very critical about the financial picture of some of these companies. but I I think that shouldn't blind us to the fact and again we're here for like nuance about this. that shouldn't blind us to the fact that this technology is progressing in some very interesting ways and our mission on the show is also to be able to be like hey pay attention to this because it's something that we think has the potential to be big and I think that's the case here. I think so too and I'm going to make the bet here right now every week Alex and I have a collaborative Google doc that we paste links in and kind of copy and paste text into. I think we are going to not be working in that way and have something more interesting as a process in a few months time. I'm making that call. I will I will take the listen I may I may have just talked about how I believe",
        "start": 1180.0,
        "duration": 2609.9220000000014
    },
    {
        "text": "paste text into. I think we are going to not be working in that way and have something more interesting as a process in a few months time. I'm making that call. I will I will take the listen I may I may have just talked about how I believe will not bet against Google Docs. I won't do it. We're going to be doing the same thing and and I will not change my process. That's my That's my bet. [laughter] Love to paste a link. It's it's actually the act of pasting the link is is the most human thing one can do. I'll agree. Well, also I mean I think it sort of just to not to overindex on this Google doc discussion, but why not? I mean this is the problem too. People have processes. They like their processes and it takes an unbelievably better process and system to be able to get them to switch off. And that's probably the biggest thing that will hold this technology back over time is just the fact that like people like their processes and if you say here's this brand new agentic way to do your you know show planning or a take a b or c their their immediate reaction isn't going to be like oh hooray let's let's switch over their original initial reaction is going to be like over my dead body you you got I mean honestly this is the biggest thing the technology is there like I I will I've been saying it for a while the technology is there it's a change management person human UI whatever problem but like exactly as you're saying we have we have a process it's a beautiful one it brings us to this show every week and and it gets it done but yeah people are tied to process so yeah I think that's going to be the most interesting part of this year but like the way I see it already kind of going is the more people hear about there are better ways to do things. The more you especially early adopters, you're like, I got to at least try. And maybe technology will reinvent the world or maybe AI will reinvent the world's oldest technology and that is of course email and maybe it will change processes there. This is from Techrunch. Gmail debuts a personalized AI inbox, AI overviews and search and more. Google has unveiled a new AI inbox for Gmail that's designed to provide a personalized overview of your tasks and keep you informed about important updates. Google is also launching AI overviews in search and a Grammarly like proofread feature. Additionally, Gmail is bringing to all users several AI features that were previously available only to paid users. The new AI inbox and this is I think where most interesting news is coming. the new AI inbox tab features two sections, suggested to-dos",
        "start": 1323.44,
        "duration": 2899.8410000000017
    },
    {
        "text": "search and a Grammarly like proofread feature. Additionally, Gmail is bringing to all users several AI features that were previously available only to paid users. The new AI inbox and this is I think where most interesting news is coming. the new AI inbox tab features two sections, suggested to-dos section displays summaries of top priority emails that require an action, such as a reminder that you have a bill due tomorrow or that you need to call your dermatologist to confirm your mailing address so they can ship you your prescription refill. Under the topics to catch up on, you'll see updates such as your Lululemon return has been processed or the end of the year statement now available from Wealthfront. What do you think about this? Is this is this basically the same the same personalized inbox that we have from Gmail? I mean, Gmail has pri primary and updates. Is this the same thing or do you think the AI layer on top of it is going to actually change the way we email? So, I love this article and I'm glad we just got to it right now because I created a system taught to me actually by my coworker at the time of the Financial Times, Stacy Marie Ishmail. With Gmail flags, you can create like customized instead of just the star or not star, you can have there's like five different options and like creating a tiered ranking system and I have my system. It's from 2011. I'm still using it in Gmail today. I turned off primary inbox and all of that. So, I am curious to see whether I start to use this. But on the other hand, like like email has to change. We all know that email like what's the value of the actual email? Is there a better way to do it? So, I'm glad they're at least trying something here. Well, isn't this kind of exactly the version of what you were talking about before that has been so useful is that it sort of sorts through I guess the action in your inbox and prioritizes it for you and summarizes it so you don't have to like similarly you don't have to go through every system. This one maybe you just don't have to go through every single email. Yeah. No, no. So, so that's why I was laughing cuz like the fact that I probably will stick to my 14-year-old system even though this has just been offered to me to to to give you a little bit of credit from your earlier point there. but yeah, I I think like the other interesting part of this to me is it's such a rich opportunity for Google for anyone who has not been using Gemini to kind of introduce AI to them or introduce this kind of more agentic AI because like this is in their inbox. Email should be a very straightfor it's",
        "start": 1471.039,
        "duration": 3178.7210000000005
    },
    {
        "text": "part of this to me is it's such a rich opportunity for Google for anyone who has not been using Gemini to kind of introduce AI to them or introduce this kind of more agentic AI because like this is in their inbox. Email should be a very straightfor it's structured. their subject lines and like it's something LLMs should be able to do a very good job of handling. There's a lot of context. , and you imagine if this starts to be the way you get the next I don't even know how many hundreds of millions of users Gmail has. Is it billions? , billion plus billion plus. Suddenly, I think it's probably two billion. I mean, it's a it's absurd. So suddenly all of these people will start to over two billion users active worldwide. Suddenly all of them like as an entry point to bring Gemini to all these people and start to make them think here is how to use like slightly more agentic AI adding more like now that we've summarized this for you do you want to go do something actually given our earlier conversation about Manis and Meta last week as Manis is their kind of like Trojan horse into consumer maybe this is Google's entry point into consumer like true consumer agentic. Okay, I actually got an interesting email from a reader just to like put a bow on this Manis conversation that I think is just worth reading. The reader says, \"Keep in mind that this is we were talking again last week about how Meta acquired Manis, the AI agent company.\" And I was like, \"Oh, maybe that's actually going to be the thing that they start to bake into their consumer chatbot.\" I got a lot of like not a lot, but some reader feedback being like, \"No, this is an enterprise thing.\" So let me just read that then we can take our break. there's a great message here. The reader says keep in mind or listener actually listener mail when you do a podcast keep in mind that Meta's customers are in the business of advertising on its platform not the users. At the end of the day it matches businesses with customers and the more businesses it can pull into the platform by making business operations reaching customers easier is the better. , Zuck has previously said, \"Our goal is to make it so that any business can basically tell us what objective they're trying to achieve, like selling something or getting a new customer and how much they're willing to pay for each result, and then we do the rest. I imagine aentic workflows will be super important in achieving that vision. Meta is attempting to capture and automate the entire funnel from the product ideation to sale.\" Okay, that's an interesting alternative perspective that we didn't cover last week that I think makes a lot of sense. Yeah, I",
        "start": 1612.559,
        "duration": 3470.3209999999995
    },
    {
        "text": "I imagine aentic workflows will be super important in achieving that vision. Meta is attempting to capture and automate the entire funnel from the product ideation to sale.\" Okay, that's an interesting alternative perspective that we didn't cover last week that I think makes a lot of sense. Yeah, I like in any of these areas, yeah, business model that drives the entire company is going to kind of influence things. I guess if you think about it, like Facebook workplace, remember that or does it still exist? Yes, I think they shut it down. Okay. like it that that actually is a perfect example of there is no reason Facebook and then Meta should not have been able to do something really interesting in that space. It's a very lucrative space. There's no reason like they should not have been able to do that but they didn't. And I think like the business model and just how that drives the entire organization is kind of at the core of that. But saying that Google did manage to do that even with an advertising business and then building the behemoth of Google Google cloud and Google workspace. But you can see how yeah like what's the core business model actually influencing the entire like effort right all right well chat GPT openai is getting into healthcare with chat health and chat for healthcare we'll cover what's happening and what the stakes are along with a fun little discussion about the end of busy work right after this and we're back here on big technology podcast Friday edition breaking down the week's news big story this week chat GPT or OpenAI released chat GPT health and chat GPT for for healthcare. So there's both going to be a consumer side of things where you can speak to the bot for specialized healthcare services and then more of a healthcare version of it that is tailored for business healthcare businesses on on the API side. So let's let's go one by one. First of all, this is chat PT health. , amazing stat here. Over 230 million people globally ask health and wellness related questions to chat GPT every week. Chat PT Health is a new product that builds on this so responses are informed by your health information and context. You can now securely connect medical records and wellness apps like Apple Health, Function, and My Fitness Pal. So, Chachi PT can help you understand recent test results, prepare for appointments with your doctor, get advice on how to approach your diet and workout routine, or understand the trade-offs of different insurance options based on your healthcare patterns. , it operates health operates as a separate space with enhanced privacy to protect sensitive data. Conversations in health are not used to train our foundation models. If you start a health related conversation in ChachiPT, we suggest will suggest moving to health for these additional protections. I don't know",
        "start": 1759.84,
        "duration": 3788.8799999999997
    },
    {
        "text": ", it operates health operates as a separate space with enhanced privacy to protect sensitive data. Conversations in health are not used to train our foundation models. If you start a health related conversation in ChachiPT, we suggest will suggest moving to health for these additional protections. I don't know ChachiPT already as a health sort of consultant so to speak. I think these are these are great. I'd love I have the Garmin watch. I'd love to be able to connect connect it. I basically just been taking screenshots of the watch and the app and just dropping it into chatt and speaking about it. I I think this is a huge potential area for growth of growth for OpenAI. kind of kind of welcoming this what do you think about this this new offering? No, no, I I so at a consumer level or customer level, I love it. I It's funny. I actually use Claude for all my health related questions. I don't know why. I just kind of feel more comfortable with Claude than ChatgPT on that. But like I it's the interesting part to me is again everyone is doing this. I like that they're actually kind of trying to make it more productized and make it like simpler to understand kind of presenting it as this separate offering. I was already when I saw this thinking more like what does this do to an aura ring which I'm paying seven bucks a $6 a month for a subscription and they're supposed to be analyzing my data for me. Whereas in realize I do reality I do kind of the same thing where I just screenshot stuff from Aura into chat or into Claude and ask questions. like all these kind like Apple Health yes track it for me but that app has never been that good. My fitness pal all these start to get in a little bit of trouble with this. I think chat has 800 million users weekly users fully 1/4 of them are using chat GPT for for health questions already. Yeah. Which that's a big number. But what do you think this does like at the doctor visit level? Because like same thing, went to the doctor, they for yearly physical, they like tell me some stuff, but then I just took all the results and just went straight to Claude and uploaded and had a much much mention doctor's name here. They're fine. Like they're they're fine, but I got a much much deeper better in learning and felt more comfortable and just everything with AI chat. Yeah. I mean, I think this kind of shows how trusting we've become of these bots. Like I dropped my blood labs right into Aura Blood Labs and first place. Yeah, it was amazing. it it you know the doctor gives you like an email and through like the portal it says everything looks good. Watch your cholesterol or something like that.",
        "start": 1922.399,
        "duration": 4106.321000000001
    },
    {
        "text": "become of these bots. Like I dropped my blood labs right into Aura Blood Labs and first place. Yeah, it was amazing. it it you know the doctor gives you like an email and through like the portal it says everything looks good. Watch your cholesterol or something like that. point explaining what each one of them are. and sort of you know taking into account your age, your health status. it already knows when you work out if you talk to it about that and gives you like this full picture of your health. Maybe it will suggest other tests to order. So, here's kind of how I think this goes. It's just like we had this like episode about AI and law a little while ago that like AI can can if you're a lawyer, AI can, you know, take in all your documents and sometimes get you to an answer. Sometimes it's right and sometimes it's wrong. but it definitely enables you to do more than if you were to comb by this stuff you know minute by minute as a as a human user right or a human person trying to get through these this data. I think the same thing is going to happen in health that like chatbt will often like diagnose you or give you things to to consider and and it does a much better job than WebMD. I mean my favorite example about WebMD is like I once had a scratchy throat and WebMD is like all right lot some possibilities here maybe Ebola and I was like god damn I I don't think chat chipt does that so I think what what it's going to do is it will give you some better medical advice sometimes it will diagnose you I think the key then is to bring that information to a human doctor right and I think that's what's going to happen is that like doctors will see people coming in with their chat chipt logs and they'll sort of start to consult with the human and the bot about what's happened. And obviously that human expertise is pretty invaluable. but I I am certain we're going to see much more people in the clinic coming in and being like, \"Hey, you know, please tell me a little bit more about this possibility that CHPT suggested.\" Does that sound right? Actually, hold on. I like that. I think I agree. I think the big behavioral change in 2026 is going to be people going into the doctor and pulling out Chad GPT. Whereas like certainly a year ago, I can't picture people actually doing that with confidence. Maybe they were, but like I I mean I was to the side talking to Claude while leaving the doctor going in, but I wasn't looking him in the eye and being like, \"Well, Claude told me this.\" , right. But I think you're right. People, it'll and",
        "start": 2083.359,
        "duration": 4376.241000000002
    },
    {
        "text": "with confidence. Maybe they were, but like I I mean I was to the side talking to Claude while leaving the doctor going in, but I wasn't looking him in the eye and being like, \"Well, Claude told me this.\" , right. But I think you're right. People, it'll and listeners can like send us any negative feedback on this, but I would think it would make their life a little easier too because it would start to at least kind of rather than very very loose personal ways of trying to explain symptoms and other things. there's already at least one layer of work that's been done that the doctor would have had to do anyways. So for them to actually try to like think of through things in a more reasonable manner. So it seems good. Well, you know how there's these memes that like the students are writing their homework with chat GPT and then teachers are grading the homework with GPT. Yeah. Maybe that's going to happen with Medicare with not Medicare with with healthcare because you're going to have patients that are going to be doing this on their end and then they're going to bring it to the doctor and now OpenAI is also releasing OpenAI for healthcare. So they are going to have both you know a chat side of things and API side of things and they are going to have like specific models built for healthcare workflows that will diagnose here's this is from their blog post. They'll have high quality responses for clinical research and operational work powered by GPT5. they'll have instit institutional policy and care pathway alignment. So they'll integrate with enterprise tools like SharePoint and other systems so responses can incorporate an institution's approved policies, pathway documents, and operational guidance to support consistent execution across teams and reusable templates to automate workflows such as share templates for discharge summaries, patient instructions, clinical headers, and prior authorization support. So they're really going to end up being deep in the clinic. I don't know. I I I mean obviously like the hallucinations can be a problem and there's a lot of you know there is a lot of room to go here to make it make it as good as it can get. But I personally think that medical field is something that needed this technology deeply. I've said on the show before, I'll say it again. my father's a doctor and he he's spent like half his life just doing paperwork. And if you could get a tool that like records, take notes, takes those notes, and allows people to like either focus on the patient or or even see more patients or or give them the bright prompts to negotiate their health records when they're using chat GPT. It can't be much worse than the situation is today. And I I I'm very very optimistic about this. And from a business standpoint, it could be a very",
        "start": 2219.52,
        "duration": 4672.000000000003
    },
    {
        "text": "even see more patients or or give them the bright prompts to negotiate their health records when they're using chat GPT. It can't be much worse than the situation is today. And I I I'm very very optimistic about this. And from a business standpoint, it could be a very I I definitely agree. consumer level overall for healthcare. One thing I will say though is on the topic that's recurring about open AI and focus still don't quite understand because remember we had enterprise is the focus of 2026 scientific discovery chatbt subscription growth now chatbt health which I guess kind of ladders up into subscription growth but like it's still a reminder to me that they're trying to do absolutely everything maybe they will they have some good products, but it's still that more clear focus still isn't there for me. Yeah. But I I don't know. I think that this I mean obviously you could you actually like when you read this you see how much work they actually did on it. That's what I mean though. No, no, that's that's what I mean. This isn't just let's create another tab and call it health like they're having different connectors and Yamrars and like that. There's definite work that went into it which is work that did not go into other parts of the business that they're talking about and AI cloud and personal devices and all the above. Yeah, that's true. I mean I just think that like again if you're like it's a general purpose technology if you're selling investors on a TAM you need you need medicine. No, I get it. I get it. I'm just saying. All right. , yeah, I hear if you were to create a poly market contract on whether actually I'm sure there is one whether OpenAI is IPOing this year. Which side are you taking? I'm taking no. Definitely not. No. What about if it's 2% chance to pay out 50 times to one that they are? Do you like those odds? That's a good I mean that's good odds but doesn't change my my overall feeling on the matter which is that no. Okay. But but speaking of prediction markets Oh, wait. Sorry. What are you What that was that was my segue. That was my segue. Okay. Speaking of prediction markets, we talked about prediction markets last week. some crazy has happened with prediction markets this week that we cannot overlook. So, first of all, the Maduro capture was on was on these prediction markets and somebody who it seems like they had under knowledge. They invested $30,000 on Friday in Maduro's exit after Maduro went into custody Saturday morning. The same investor made $436,000 and you know some change after that. U obviously this person probably had knowledge of Maduro of the Maduro operation. Here's my question. So, so here's my question to you. So clearly insider trading is going to be a thing",
        "start": 2371.839,
        "duration": 4996.000000000004
    },
    {
        "text": "went into custody Saturday morning. The same investor made $436,000 and you know some change after that. U obviously this person probably had knowledge of Maduro of the Maduro operation. Here's my question. So, so here's my question to you. So clearly insider trading is going to be a thing Because the argument here has been like yes there's going to be insider trading but ultimately one of the functions of prediction markets is you want them to be able to accurately predict something. And if somebody does have insider knowledge of what's going to happen then prediction markets become like an unbelievable tool to see the future. I saw that thesis I forget from who. This is killing me. I mean a couple of weeks ago I talked about how I actually do love the concept of prediction markets. I don't love how poly market and calcian stuff are really rolling it out but this week was kind of my just hanging my head and can't just being in disbelief about the kind of stuff that's happening. The thing about that idea is like the whole point of financial markets or any kind of market is giving everyone the kind of at least belief some belief that there is a fair opportunity to try to make money in it like and if you're if you're and yes I understand like there's a lot of people especially outside of traditional financial markets that are like everything's rigged anyways and there's lots of problems in market structure kind of biasing towards bigger players. Yes, all of the above. But like I mean the idea that someone in this situation knows that this is going to happen in Maduro can make that kind of money I don't think is good for anyone but I also don't think it's good for prediction markets because if you're always like I am playing at a disadvantage and insiders will be able to you know get ahead of this it kind of kills the whole point of the market. So I think like on one hand Yeah. or I'm curious. I don't know how how are you feeling about that? I mean, as someone who's interested in whether prediction markets can predict things, yes, that's good. But also going back to our discussion last week of the reason why these things have become so big is because the only place that people are f, you know, feel like they have any agency is the casino. they don't and they will they will end up they are playing against there's no way you can have a prediction market without insider information. It's even harder to keep that free of insider trading than it is the stock market. And there are fewer regulations by the way. Similar Yeah, exactly. So, but there's one thing that's really annoyed me this week, which has been this story about Caroline Levit, the White House press secretary. you",
        "start": 2536.16,
        "duration": 5281.119000000004
    },
    {
        "text": "harder to keep that free of insider trading than it is the stock market. And there are fewer regulations by the way. Similar Yeah, exactly. So, but there's one thing that's really annoyed me this week, which has been this story about Caroline Levit, the White House press secretary. you mark of her. Wait, explain explain the actual or there there was a some sort of like on the prediction markets, you know, a prediction of how long her press briefing would last and the overunder was 65 minutes and she like, you know, wrapped up there. So, so there was a 98% chance that it was going to run past 65 minutes and then she left with 30 seconds to spare. So 30 seconds before that 65 minute mark and everyone's like, \"Oh, Levit's got money on the prediction market knowing that she would go 6430.\" I mean, obviously there's a chance, but these these press conferences, they wrap abruptly anyway. I don't think she was running away to make it before. See, the the the buzzer it just doesn't I'm going to say like on one at first I'm like this is ridiculous. But I watched the clip a few times and there's a bit of a smile and there's a bit of like just like very quickly running off stage and again remember like I mean the Trumps are on the polyark and Kelshi like their advisor like the and not even saying there's any kind of like connection there. It's more prediction markets are the same way in the situation room or whatever at Mara Lago when they're invading Venezuela or getting Maduro, they have X up on the screens and searching for like prediction markets have to be part of the conversation whether it's like the PE staffers at the White House and whether it's just for fun and it could be just kind of stupid fun in this case. But to me the more interesting part of this is going back to our earlier the question around this what happens when people can actually drive outcomes based on bets. It's one thing to say I have insider information and I'm going to use that to make a bet. It's another to I'm actually going to change the end outcome because I have money on it. same as like throwing throwing a game, throwing a match or in sports like actually creating a specific outcome. And to me like the crazy thing to start thinking about is I mean this is where it just got so dystopian like something like this. Let's say you're it's funny you're doing the prediction mark cutting the press conference short and again it's just so ridiculous that we have contracts on this but I guess that's fine. Like the more imagine if we start making big decisions people do to make money on prediction markets and letting that actually drive the decision itself. That's terrifying. Like",
        "start": 2681.359,
        "duration": 5599.439000000006
    },
    {
        "text": "the press conference short and again it's just so ridiculous that we have contracts on this but I guess that's fine. Like the more imagine if we start making big decisions people do to make money on prediction markets and letting that actually drive the decision itself. That's terrifying. Like still not fully fully bought in into I mean yes you have to consider the possibility but I'm not b I mean these press conferences they happen all the time and it's such speculation I'm surprised it got that much you know pickup but you're but the the broader point that you're making I'm on board with the principles can drive the outcomes and if you're doing and as these prediction markets rise you're going to see that happen. I mean, imagine the world where we capture Maduro because there's so much money on the prediction market or like like if these are actually maturing and growing and becoming more integrated and more people have money in them, we're going to start to see some really weird troubling outcomes. I think I still love prediction markets in theory. Still love them in theory. I don't know if they're really working in practice. Okay, before we leave, I want to talk about the end of busy work. here's this Wall Street Journal article. The downside to using AI for all those boring tasks at work. Work days without busy work are closer to reality than ever thanks to artificial intelligence. AI tools that can sort and summarize emails, take meeting notes, and file expense reports promise to free us to concentrate on the important stuff. That sounds great. The catch is our brains are incapable of thinking big thoughts non-stop, and we risk forfeiting the epiphies that sometimes spring to mind while doing easy, repetitive job functions. AFLAC chief executive Dan Amos dots his calendar with low inensity tasks that could be delegated to an assistant or a bot. these practices are partly about old-fashioned habits and personal touches. They're also about taking mental breaks or leaving space for creative sparks to fly. It's the same principle as thinking in the shower, putting your brain on autopilot until it goes aha. There's also a CEO called from a company called Conventional. His name is Roger Kirknness. he's become to the value of slack time around the middle of the year. That's when he noticed meaningful productive gains from AI about 20%. Then he noticed meaningful productive gains from AI about 20% overall. But he observed that he observed that teammates were often mentally exhausted and unproductive by Friday. Ranjan, are you going to stand up together with these CEOs in defense of of busy work or or is this just like the the last bastion of stupidity in the office where people say you actually need to do you know things like file expense reports to think creatively? I am not going to defend this. I think",
        "start": 2842.8,
        "duration": 5896.800000000003
    },
    {
        "text": "these CEOs in defense of of busy work or or is this just like the the last bastion of stupidity in the office where people say you actually need to do you know things like file expense reports to think creatively? I am not going to defend this. I think episode, maybe there is something beautiful about taking a link and pasting it into a Google doc. And maybe we're never going to give that one up. And there's just something cathartic and like just reminds you of what's important in this world, but expense reports. Come on. Like there what are the most kind of like mentally drudgery mental drudgery type of work you have to do? And yeah, that that I don't think so. I do think the handwritten notes to employees who receive bonuses or retire, it's interesting. Like I there's something about handwriting that's still meaningful to me. But I think this idea of busy work is just kind of like I just want to be an exe old executive guy and just say ridiculous things and have them kind of like land as as wisdom one day. That's my goal in life. I mean the call right like you get it. hey it's it's Callum Borchers from the Wall Street Journal. Oh hey Callum. How are you? This is Mr. Amos. I'm the CEO of Affleac. Yeah. , what do you think about busy work? Oh, I love it. Love doing expense reports. It's like thinking in the shower. [snorts] And well, and then hold on. And then he went on to incubator. His favorite idea incubator is the steam room after a workout. Often steps out of the fog with a clear thought and dashes off an email about it. Actually, steam room. I'm with that. That's not bad. But he's not doing busy work. That's not busy work. Am I [clears throat] Am I being too optimistic and thinking we can end busy work and make room for this steam room? That's what get rid of the busy work so you can be in the steam room and you can think this is this is a travesty of journalism. For this I I there's only one thing that can save us for this. and you know where I'm going. We need the agent harness. We need it. Yeah. just to get that agentic harness in place. More time in the steam room. Get in. Get yourself into that agentic harness and away you go. Steam away. Think big. Believe in your company. Once again, wait, hold on. Hold on. Just to end, the piece did go on to say like he makes 20 million a year, but he declined [music] to pay a few extra bucks for an ad-ree version of a streaming service because commercials offer a moment to think about what he just watched. I I think that's a fireball offense. I mean, that's that's just shows some very",
        "start": 2995.76,
        "duration": 6213.600000000006
    },
    {
        "text": "makes 20 million a year, but he declined [music] to pay a few extra bucks for an ad-ree version of a streaming service because commercials offer a moment to think about what he just watched. I I think that's a fireball offense. I mean, that's that's just shows some very I love this guy. Actually, you know, do you think he [music] was just trolling here? He was like, I'm just gonna say some ridiculous stuff and let's see if they go with it because come on, he's not watching commercials. I'm sorry. You're making 20 million a year. You are not w you you can hit pause. You know how to hit the pause [music] button. They printed it. So, I'd love to have him on. If you're if you're AFL CEO Dan Amos and you listen to the podcast, come on and speak with us about busy work. I'd love to have this conversation and take the other side of it. [music] and and no, for God's sakes, man, just skip the commercials. Just not ours. Not ours. Not ours. [laughter] Not not ours, but others do. Okay. All right. Let's Let's call it here, Ranjan. It's It's been good. We've done it. We've done our We've done our work this week for sure. Going to go file some expenses right now. [music] Just to think just to think clearly. [laughter] All right, everybody. Thank you, Ranjan. Thanks everybody for listening. We'll have Mr. CEO Arthur Mench on the show to talk about whether AI is a managed service at the end of the day. That's going to come up on Wednesday. And [music] then Ronjan and I will be back next week. Thanks again for listening and we'll see you next time on Big Technology Podcast.",
        "start": 3156.079,
        "duration": 6358.720000000007
    }
]