[
    {
        "text": " The AI device wars are officially on as Meta Poach's top Apple talent. Is the metaverse dead? It's code red for Chad Shept and Netflix agrees to buy Warner Brothers Discovery. That's coming up on a Big Technology Podcast Friday edition right after this. Welcome to Big Technology Podcast Friday edition where we break down the news in our traditional, coolheaded, and nuanced [music] format. We have a great show for you today. We're going to talk all about the AI device wars now that Meta [music] has poached Apple's top design talent. we're also going to touch on the end of [music] the metaverse or that's what it looks like. Code Red for Chad GPT. And then we're going to break down this Netflix deal for Warner Brothers Discovery. We are here fittingly in studio [music] at Spotify and we're joined as always by Ron John Roy of Margins. Ran John, welcome. I'm excited to be here in this studio at Spotify and and talking hardware in just a moment. That's right. Not just Chat GPT again, but hardware. That's right. And I say fittingly because it's Spotify rap week and I can say it's been amazing to get so many notifications from people who listen to and watch this show saying that Big Technology Podcast has been among their top or has been their top show this year. I know I've received many of those. I think you I've received it from some friends. I loved I loved hearing it and it makes me feel good because my own Spotify rap is always kind of painful. I have a six-year-old son and K-pop Demon Hunters was my number one song. They have great songs. They do have great songs. It is actually and when we get into the Netflix thing, I've actually dug into that whole story as well from a business standpoint. So, we'll get into that. But what was your listening age, Alex? I was 31, which made me feel good because I'm in the band but maybe a little younger. I mine was 57 which was even more problematic that between the six-year-old songs I listen to a lot of 60s7s music. So Okay. So they're just averaging it out. We averaged out to 57. So without the kids you'd be like 110. Yeah. [laughter] It literally said you are an old soul. So I am I am but not when it comes to technology. No technology. We are youthful and spry and ready [laughter] to analyze all the stuff that's going on. But yeah, one more note on this. If you do see us in your wrapped, whether it's on Spotify, YouTube, wherever, share it. We'll we'll like it. We'll try to distribute as many of these as we can. So, thank you for that. Okay. this week, very interesting week. So much tech news as always, but the big story for me was the fact that a seemingly ho move",
        "start": 0.08,
        "duration": 311.59999999999997
    },
    {
        "text": "YouTube, wherever, share it. We'll we'll like it. We'll try to distribute as many of these as we can. So, thank you for that. Okay. this week, very interesting week. So much tech news as always, but the big story for me was the fact that a seemingly ho move me. and that was that Apple's head of unit user interface design Allan Dy along with a deputy and maybe some other team members went over to Meta Meta poached them. they're going to put them on their AI enabled glasses the ray the Meta Ray-B bands and the Meta Ray-B bands display which of course has a screen in it. They're going to bring some Apple sensibilities over into these Meta glasses. It's complicated because according to reports, it's not exactly the best talent that Apple's had, and we'll get into that. , but I do think that this really does kick off the AI device wars. Now, you have Meta, you have Amazon, you have Apple, you have OpenAI, and and Google all in the mix and this is going to be a very very big deal moving forward. So, , your reaction just briefly on the the decision of these Apple executives to move to Meta and the significance of it. Yeah, we h I I also like that you added OpenAI to that actual roster even though they have not actually announced their physical device yet, but they're teasing. We're going to get So, we're going to go company by company. Yeah, we're going to go company. Yeah. So, so I thought it was incredibly interesting again. Yeah. Apple executives going over to Meta and we're going to get into who these Apple executives are and and and incredible Gruber piece on that one. But we've been saying this for a while like Meta is the coolest company right now in physical devices. I never would have thought I would have said that Meta Raybands are probably from like a hardware standpoint the most interesting and useful hardware and physical device I have tried or I I own a pair now in the last couple of years. So I think they are incredibly interesting and also the fact that it's it's no longer the metaverse VR like it's this whole new form factor and surface area. So it has to be interesting if that's what your specialty is. Yeah, I thought that this poaching and again, we're going to get into the talent side of it, but it it definitely took on this feeling of maturity of the space beyond just like this is a nent thing with a bunch of kooky startups like and the rabbit ar and the friend pendant. Like when you start seeing the poaching of top talent from one company to another, you know you're you're in a war and you know it's sort of like the starting bell of something very big that's about to come.",
        "start": 156.08,
        "duration": 602.7999999999998
    },
    {
        "text": "startups like and the rabbit ar and the friend pendant. Like when you start seeing the poaching of top talent from one company to another, you know you're you're in a war and you know it's sort of like the starting bell of something very big that's about to come. be like we we said it a maybe a couple of months ago. I remember you said it and it had not occurred to me but that Meta is now going to be Apple's biggest competitor in the hardware space. And I never thought that that could be the possible or the case, but I really think that will be the case. And I think Mark Zuckerberg, ever since iOS 14.5 and Apple trying to kneecap meta and them actually coming out of it stronger than ever, has probably just been waiting for this moment for a long time. That's right. Well, go right at Tim and Apple. They so hated the fact that they have to go through the iOS system to reach their users that they have been dead set on building the next operating system whether it was in virtual or mixed reality with their meta with the Oculus purchase and the Quest and all that or now getting into AI. Let let's get into the talent a little bit. Let's get into the talent. This was amazing. So obviously you see the head of us user interface design leave Apple and you're like oh like major coup for Meta. and to me I think it's a little mean but the best oneliner that I've seen about this move is that the IQ of both Meta and Apple have gone up because of this exit. , John Gruber, obviously a friend of the show, somebody who is a a a very close Apple watcher, has been for years, has been largely praised praise praised Apple frequently up until recently. did not have nice things to say about Allan Dy. he wrote Allan Dy is not untalented, but his talent, this guy who led user interface design at Apple, but his talents at Apple were in politics. His political skill was so profound that it was his decision to leave despite the fact that his tenure is considered a disaster by actual designers inside and outside the company. And he says also it's rather I mean this is no punches pulled here. It's rather extraordinary in today's hyperartisan world that there's nearly universal agreement among actual practitioners of user interface design that Allan Dy is a fraud who led the company deeply astray. It was a big problem inside the company, too. I'm aware of dozens of designers who left Apple out of frustration over the company's direction. I'm not sure there are any interaction designers at OpenAI working on this joint venture IO who weren't axe Apple and if there are it is it's only a handful from the stories I'm aware of. The theme is identical.",
        "start": 303.84,
        "duration": 899.04
    },
    {
        "text": "who left Apple out of frustration over the company's direction. I'm not sure there are any interaction designers at OpenAI working on this joint venture IO who weren't axe Apple and if there are it is it's only a handful from the stories I'm aware of. The theme is identical. designers driven to do great work and under Allen die doing great work was no longer the guiding principle at Apple. is it I mean is it possible that both companies win here because Meta does get someone who may not be an A player at Apple may have been great at Apple politics but still has Apple design sensibilities and Apple gets some fresh blood at the top of their user interface design. But the thing is like I I'm having trouble with it because meta the Ray-B bands as I said actually have been done in a really interesting way. like the simplicity of it is what you want in a UI in any kind of new device that's trying to incorporate a bit of AI into it and just just like making it simple useful which were the core Apple design principles for so long but we've seen the last three to five maybe seven years I mean everything about Apple UI has gotten more complex messy difficult like even like you know vision pro aside just the core IO OS has just it used to be this like simple thing that was a pleasure to use. Now anytime I remember like using a friend's Windows computer and I had not touched Windows in a long time and I was like oh wait this is actually just as good if not better. So so I think like is it going to actually be net beneficial for Meta or will it actually bring potentially like problems to Meta when they have momentum? What do you think? See, I I I guess I I don't know exactly like what was he responsible for at what time within Apple. He I mean he basically all these big initiatives within Apple the design of the operating system of the vision pro vision OS that was him liquid glass that was him. See that doesn't that doesn't bode well. I'm saying like if it was yeah the the Johnny IV era or like the like the it's been a long time since Apple truly from a design perspective has had like this like beauty and competitive edge and was just something just so different from the rest of the industry and that's what Meta probably I know that's what they want but I don't think this is going to bring that to them. Well, I I still think it's a win for Meta because I think that somebody who is steeped in the Apple design process. Bringing at a sprinkle of that into the meta design process will be good. I will say liquid glass is terrible. I've had to",
        "start": 454.88,
        "duration": 1200.5599999999995
    },
    {
        "text": "that to them. Well, I I still think it's a win for Meta because I think that somebody who is steeped in the Apple design process. Bringing at a sprinkle of that into the meta design process will be good. I will say liquid glass is terrible. I've had to week after speaking with MG Seagler on Monday. Great phone. Liquid glass sucks. I've had to turn off like as many of the liquid glass features as I can. , what exactly is it? Because I have not enabled it. I have I'm still 15 Pro Max and actually not looking to upgrade. So, , it is it it basically makes a lot of things look translucent and I I couldn't look at it anymore. I got I got sick of looking at the time on my lock screen, which was like it looked like it was etched in there and like a like a fifth grader did it. I just hated it so much I turned it off. This is the thing that like so many of these little efforts that are so designy like even Siri right now like when you press it on your phone and you get the like the the border of your phone kind of like lighting up in this it looks kind of cool yet Siri is more terrible than ever and we're far far away from improving. So like it feels like yeah that a lot of the energy really went to not functional like use case utilization and making people's lives easier but just things that like just were so designery that that's and that's not going to help Meta the Raybands work cuz it really is clear that no one was overly precious about like trying to be too designy and they're like let's just make this brutally functional which I think is a different philosophy Okay. Well, you know what's interesting about this? , we're talking about user interface design and of course the Rayban Meta displays, right, are the this new pair of glasses that have a screen on them and Meta has obviously been working on the screen. , but ultimately an AI what is an AI device? We we don't fully know what it's going to look like. Is it going to be a hockey puck? Is it going to be a pendant? Is it going to be a pair of a pin? Okay. Is it going to be a pair of glasses? Is it going to be the AirPods with their translation and Siri inside? It can be a variety of these things. But notice what comes to mind as I start speaking about all these various devices. It's not a screen. It's an assistant inside. Whoever has the best AI is going to have a real chance of winning here as long as they package it correctly. Now, user interface design can also be design of a voice user interface, I imagine. But I",
        "start": 608.16,
        "duration": 1470.4799999999996
    },
    {
        "text": "these various devices. It's not a screen. It's an assistant inside. Whoever has the best AI is going to have a real chance of winning here as long as they package it correctly. Now, user interface design can also be design of a voice user interface, I imagine. But I go one by one with all the companies that have big push in the space and talk a little bit about whether they can win or not. And let's start with Apple. If Apple puts the same Siri in there, they're not going to win. Doesn't matter who's running design. No, I think Apple is the by far the worst position for this. Not only is Siri still just unbelievably terrible, this has been years now I've been saying this, but I've seen no improvement, but they are a screen first company. They they invented the mobile screen at le or at least you know like the mobile broad it looks better than the Blackberry. Yes. Exactly. I mean the the the like touchscreen bringing it to the world making it a beautiful experience that is the single core like you know selling point of Apple. That's what they own. They have not shown the ability to actually come up with any kind of innovation on any other kind of true UI. So I I don't think they're well positioned. What about Okay. I don't think so either. I mean what are they going to They're going to run, right? They just, by the way, so speaking of Apple, , Alice Intrigue, the head of of Apple AI, John G. Andrea, he's gone. And now they brought in a new executive who had come from Apple but had also spent 16 years at Google. And I my hot take on that is he's there to do the Gemini integration. So, are your smart glasses going to be Gemini glasses? If you're Apple, can you win that way? I don't think so. No. like Google will always have an edge over you unless I mean okay that's the argument to build your own model. Yeah. Yeah. Yeah. But also but I guess maybe there's a world where Google from a hardware perspective has always been a follower like they take Google or Apple Google and they actually I kind of really want the new Pixel Fold phone. I saw someone had it and I'm like obsessed with it now. It's like $1,800 though. not diving in right away, but still that's following on Samsung and others like Google has never shown true leadership in the hardware space. Google Glass, I mean [laughter] I mean kind of I guess just 10 years too early, 15 years too early. , but , yeah, I think Google, like Apple, maybe that's their opportunity if they can really start to figure out the actual AI side and still they just know hardware. Maybe they're screen first, but maybe that that's the only shot they possibly",
        "start": 745.44,
        "duration": 1767.9189999999992
    },
    {
        "text": "too early, 15 years too early. , but , yeah, I think Google, like Apple, maybe that's their opportunity if they can really start to figure out the actual AI side and still they just know hardware. Maybe they're screen first, but maybe that that's the only shot they possibly Yeah. Now, it could be that maybe the AI device that syncs so well with your phone that it's natural and , you have to have it. That could potentially be like the way that AirPods syncs so well with the iPhone. That's a benefit. Maybe even if Apple doesn't have the best model, it's because it syncs so well with the phone. But again, like they try to do that with Apple intelligence. I I don't know if it's Wait, wait, hold on. Let's Let's work through this one. I I genuinely believe like one of the most important innovations of the AirPods were the W3 chip and how easily they sync. Bluetooth has gotten a lot better. So now com like external earphones actually can sync very well. But I mean what was it 7 8 years ago like AirPods the magic of them was you just put them on and they connected to your phone, MacBook, iPad very easily. So So you're right. Maybe the connectivity can be something. I'm I'm trying here. I'm trying for Apple. All right. Let's not write them off completely, but it's going to be an uphill battle. Meta out ahead. We both have the Meta Rayban glasses. We like them a lot. , I would say my primary use for them is camera photos and videos. , but there are times where I don't know. I feel like it's kind of like old school Alexa. I'll ask it for the time. , maybe the weather. , I rarely do I ever say, \"Hey, what am I looking at?\" and get anything interesting from it. , but they are out ahead. They have a couple million in market. The smart glasses market according to Reuters this year tripled. , so I would say that, you know, they have they have as good a chance as any, but they've also struggled on the model building front. If you're going to put the latest version of Llama in there, , you're going to be behind Open AI whenever Open AAI releases whatever it releases. Now, again, same with Ray-B bands, like the AI functionality, don't use it. Actually, asking it questions is not great. I do use the what am I looking at like with birds and stuff or like especially like plants what you know I'll check them out I'll try to see what I'm looking at [laughter] I'll admit it I'll admit it yeah that's going to live on the internet for some kind of nature I like it but so so they have a shot but I also think that like yeah the whoever owns the like",
        "start": 895.279,
        "duration": 2041.8389999999997
    },
    {
        "text": "I'll try to see what I'm looking at [laughter] I'll admit it I'll admit it yeah that's going to live on the internet for some kind of nature I like it but so so they have a shot but I also think that like yeah the whoever owns the like head whether it's going to be audio in your here whether it's going to be audio or visual through the glasses like that is where the battle takes place as the starting point but then you have to deliver the actual intelligence side of it and agreed meta the AI side has work is has work to do but still far ahead I have not have you tried the new display I haven't tried those I tried the Orion with the full display which are pretty amazing but I haven't been able to try these new ones but people say good things about them yeah and I had tried the snap augmented reality like in developer the developer environment there augmented reality glasses. So I am relatively bullish on the idea of kind of like a a display little screen sitting there on your glasses. If they can win that and nail that I think that's good. I think that they're well positioned. This is in a way that they would not have been just a few years ago. Here's my hot take on Meta. Over the next year, you will see Meta bring in other AI models. You will see them partner with Google. You might see them partner with Open AI. Did they just spend God knows how much money on I super intelligence lab? I think they did. They spent a lot of money on talent, but for them winning the operating system is more important than having the model. They're calling the operating system the the OS on your smart glasses. Yeah. Yeah. Yeah. Okay. Okay. So I think as long as they're they have control over I mean yes if you bring in Gemini you would basically license Gemini and bring it in the same way that Apple's going to do it with Siri. As long as you have the delivery mechanism that means you own the device for doing that though. I think like they're too bought in and here's why I think he's going to do it. Yeah. Apple is going to release its smart glasses targeted end of next year. Okay. You have to have a better better offering than Apple. Period. Yeah. And so even if you have to give up a little control on the agent side, you do it. Okay. Okay. Either way, well positioned. Well positioned. Let's go to OpenAI. recently as last month, Sam Alman and Johnny IV, who've of course came to the $6.5 billion agreement to work together. Oh my god, I forgot the amount. It's a lot of money. A lot of money. they are building something that looks",
        "start": 1034.079,
        "duration": 2315.5980000000013
    },
    {
        "text": "positioned. Well positioned. Let's go to OpenAI. recently as last month, Sam Alman and Johnny IV, who've of course came to the $6.5 billion agreement to work together. Oh my god, I forgot the amount. It's a lot of money. A lot of money. they are building something that looks They say they've settled on a a form factor and the rumors say that's what it is. obviously OpenAI comes to it with one of the best models. So what do you think? No, I think I'm going to say relatively well positioned from the model and the reason I say that is voice mode works already very well. And actually like voice has become almost my primary way of interacting with AI. I use something called whisper flow. I love it's like you can kind of define your own dictionary so it starts actually getting your dictation right. You can ramble and it'll condense it and clean it up. So like I believe voice is going to be the primary way people do interact with AI and Open AI has already shown that yeah from a model perspective from like South Park you know kind of like making fun of it but it's because it's so good. , that being said, my concern with OpenAI is just focus and like I mean more came out this week around them like and their code red and what projects they're going to focus on and what they're going to delay like they're they have too much going on. So like hardware my my prediction is it's going to be this kind of like side project that is going to cause internal political turmoil and like you know it'll just not there's a lot of ego there's a lot of the Johnny Ives of the world are involved and like it's just it can't be front and center when they have revenue and profitability challenges and cap like all the core challenges it's not going to make or break their business anytime soon. So, it will get deprioritized and that's going to cause issues. Yeah, I think there's going to be a couple of false starts there before they get it right. , some of this like high mind maybe I don't know some of this high-minded design talk that you hear from Sam and Johnny just like the more I hear of it, the more I'm like, you're going to have some trouble. , when you release they I watched an interview of the two of them where Sam said, well, Johnny told me that we know the device will be ready when you're going to want to take a bite out of it. And the first time we liked a prototype, but we didn't really want to eat it. And now we have one that you want to take a bite out of. That is actually how I evaluate all my technology. When I go to the Apple",
        "start": 1173.919,
        "duration": 2589.597000000003
    },
    {
        "text": "a bite out of it. And the first time we liked a prototype, but we didn't really want to eat it. And now we have one that you want to take a bite out of. That is actually how I evaluate all my technology. When I go to the Apple when I was buying my Meta Ray-B bands, the poor store associate just me gnawing on the thing to [laughter] I have to do this. Yeah. Just I've said it. but but in a way though let's say let's their advantage in this is I do think starting from scratch when you think about what is the hardware for the AI era going to look like is an advantage. Not having any legacy it's got to be glasses. It's got to be a screen. just really starting from like I hate saying first principles, but I'm gonna say like I mean and just really being able to reimag what that is and what's the purpose of it is is a cool moment to really rethink design and and I do think it it's a it gives them at least a little bit of an advantage, I guess, right? But let me ask you this. If it the device is smartphone style, has no screen, why isn't it just an app? because it's got a the I mean I I don't know but actually hold on I saw so plaud pl a u d they have they have basically a pin and like a notebook a business card size thing that's basically just a a recorder an AI recorder I just saw that they're at like 250 million in revenue I've been looking at them like so already that form factor of having a separate device that's just a recorder and can maybe do some other things and like just gets your context, processes it, maybe is able to do it on device. I think there's something there. There's something there. I'm just smiling because I I'm just waiting for Sam and Johnny to come out with the device and it just looks like a donut. [laughter] It's a chocolate donut with sprinkles on top and you're going to love it and it will record everything you do. I only I always bite my devices. That's Yeah. Well, then you're you are the world's top you're on par with the world's top design talent. So, you know, one company that gets overlooked here is Amazon. Remember, Amazon has hundreds of millions of Echo devices. it has it actually has smart glasses, which might surprise many of you. They're called the Echo Frames. I There was a while they were throwing Echo into everything. Echo microwave, Echo, Echo Wall Clock. Yeah. But they do have smart glasses. And I will say couple of months ago, Panos Pane from Amazon, head of devices and services, sat in the seat you're sitting in, told me that Alexa Plus is",
        "start": 1313.919,
        "duration": 2896.0770000000034
    },
    {
        "text": "while they were throwing Echo into everything. Echo microwave, Echo, Echo Wall Clock. Yeah. But they do have smart glasses. And I will say couple of months ago, Panos Pane from Amazon, head of devices and services, sat in the seat you're sitting in, told me that Alexa Plus is don't know if it's fully rolled out yet, but I have it. I have been surprised. I think it's better than a lot of the reviewers have given it credit for. So I So okay, Amazon, it's an interesting one. First of all, I I went back to Alexa and the Amazon Echo. I still have my lights hooked up to Siri, but like I had gone full HomePod for a while and my god problem. Bless your heart. Yeah, I know. , but so now I have the Echo Show. I have like a small Echo with a display. , Alexa Plus using it a lot in my kitchen that's become my like cooking companion. It's good. It's not great. It's not. It is. I do not think it's on par with a Gemini voice mode, a OpenAI, chat GBT voice mode, but like and it gets a lot of stuff wrong. Like weirdly, I I posted about this on Twitter the other day, like it gets NFL scores wrong. It's like, come on, you got to get like these these just basic deterministic questions, right? But the followon conversation mode is pretty good. So just from a device ingrained in people's houses standpoint, they're positioned. Yeah, I think the personality in it is great. I mean, I just am always attempting to do crazy things with these bots. And u I was like, , you know, Alexa, I want to have an insult competition with you. And it's like, I don't really want to say anything bad with you. I was like, just do it for fun. Come on, let's trash each other. This is what you do. This is sort of what what I do for fun at home. And we went back and forth and it was actually quite good. And then we got into like a little rap battle and it owned me. Completely owned me. I mean, I'm just asking like what's the optimal temperature for dark meat in Turkey and stuff like that. I mean, I don't know if I would trust it with that, but but having having a little fun with it, like my wife was like, you know, Alexa, like why does my husband have a shopping addiction? And it's like, you guys are Alexa, we're all the way in. We're all in. We're all in. And it gave good answ. Yeah. Alexa was like Alexa is your companion. It's my companion. Yep. It's our third. [laughter] it said it said something like maybe he thinks like hitting the free shipping button means that it will will the whole package will be free and it's just not it's not free",
        "start": 1469.2,
        "duration": 3175.9980000000032
    },
    {
        "text": "answ. Yeah. Alexa was like Alexa is your companion. It's my companion. Yep. It's our third. [laughter] it said it said something like maybe he thinks like hitting the free shipping button means that it will will the whole package will be free and it's just not it's not free think it's very good. I think they have I think they have a better chance than a lot of people are going. I I I agree just from a standpoint of it's already there and actually again actually going back to the voice interaction that is the single device in company that people already have a comfortable voice relationship with like voice mode on chat GPT is like kind of like some people use it some people don't even know about it Alexa has been voice first for a decade plus now people are used to it so if they get that right They're okay. Yeah. And they could again package it in all these different form factors. Okay. Lastly, Google, like we talked about, the the originator of the Google Glass. they are doing partnerships with Samsung and Warby Parker for a mixed reality version of Gemini. Could Could they come out on top? I mean, everybody wrote them off in the beginning of the AI race and look at where they are now. So, maybe they get the glasses right as well. Yeah. No, I think so. I had like a Pixel 9 that I had not used in a long time. It was just gifted it a while back and like I plugged it in cuz I was like I want to just start seeing what it's like to have Gemini around all day and it I actually think glasses aside just what Siri supposed to do on the iPhone like every Android device out there having Gemini as your voice interaction layer is is a huge advantage. The same way Echo's in everyone's house gives them a natural starting point. It gives Amazon a natural starting point. I think Google that I think that's where they're going to like make a dent and that's why if they really push people to talk to Gemini through your phone at the at the like system level and not opening the app that really opens up a lot of opportunity for them. Okay. lastly as we think about this category there have been a many failures so far. , the Humane Pen, the Rabbit R1. RIP Humane. RIP. Now you're at you're at HP. [laughter] I can't believe they went to HP. Speaking of like these lofty introduction videos, reminds me of the Salmon Johnny IV introduction video. I like Should we count HP and all this? No. No. No. We can't. I swear. I'm telling you, I want to throw that printer that I have out the We got We picked up the printer on the sidewalk for free. It worked for",
        "start": 1611.12,
        "duration": 3458.0780000000027
    },
    {
        "text": "Salmon Johnny IV introduction video. I like Should we count HP and all this? No. No. No. We can't. I swear. I'm telling you, I want to throw that printer that I have out the We got We picked up the printer on the sidewalk for free. It worked for throw it out the window. So, I'm not putting HP in there. But, , we have seen these failed devices. I don't know if that's going to work. Doesn't seem like it. Oh, yeah. Yeah. Does is that is that just like the the early startup energy finding a category that's going to work, failing, and sort of waiting for big tech to come in and pick it up? Or is that a sign of of something much worse? Maybe the the fact that yeah, all these companies have an AI device initiative, but maybe it won't work. Maybe that this is just a bunch of wheel spinning and and we're sort of talking our way through something that's not really going to work. No, I see. I think the humans of the world, the rabbits of the world were actually victims of hype and of the cycle that like a proper startup having time to kind of like work through, get it into the hands of early adopters, have people test buggy devices, be happy about it. They never had that because they got so hyped up so fast. They raised so much money. They came out big with lofty videos and these devices did not work well to start. So, so I don't think again I'm not I really think the AI first device battle is going to be one of the most interesting stories of the next few years. And speaking of hype that hasn't panned out, the metaverse this is from Bloomberg. Mark Zuckerberg plans deep cuts for metaverse efforts. Meta's Mark Zuckerberg is expected to meaningfully cut resources for building the so-called metaverse an effort he once framed as the future of the company. and the reason for changing its name from Facebook Inc. executives are considering potential budget cuts as high as 30% 30% for the metaverse group this year which includes the virtual world worlds product Meta Horizon Worlds and its Quest virtual reality units cuts that high would most likely include layoffs as early as January. I it's amazing seeing the names of these products Horizon Worlds. you know forget it. What the hell do those products look like today? Like are there anybody is there anybody roaming around the actual metaverse anymore? I would say except for Meta employees, but Meta employees didn't even use it. Actually, hold on now. Like that makes me wish I don't own any Meta VR products. I've tried all of them. , I want to like put it on and just go into Horizon World and see who's there. Like you're just going to find some random guy just holding on. Bos is in there",
        "start": 1753.76,
        "duration": 3766.316000000005
    },
    {
        "text": "that makes me wish I don't own any Meta VR products. I've tried all of them. , I want to like put it on and just go into Horizon World and see who's there. Like you're just going to find some random guy just holding on. Bos is in there Yeah. Just I hate to say it. I mean, I shouldn't even say it, but you could imagine there are some unscrupulous times. Yeah. Yeah. Making their way around Horizon World. Actually, maybe it is kind of like an amazing Bladeunner style dystopian right now. End of society, the Wild West Coast. Mad Max Bladeunner. This is like now I'm kind of interested. Yeah. But do you think this is Okay, so they're going to cut 30% potentially. Is this the end of the metaverse? Seems like it seems like that's over. And it's good cuz like again an augmented reality layer in their GL like whatever was supposed to happen before did not. It didn't work. I think moving to all these other new form factors and opportunities. The fact that they're going all in, hiring the Apple execs, it's good. It's good. I think it's it's over. I think virtual reality should go back to niche use cases, gaming, hopefully keep improving, be this kind of like product that's maybe a reasonably big market, but not the way everyone interacts with life, right? We just had Nick Kle back on, the VP of the former head of global affairs at Meta. And to prepare for that interview, I listened to the time that I interviewed him at Davos and like four years ago. And back then, he was telling me about how how great it was that he was able to have a meeting with his direct reports in a virtual conference room and feel presence and the fact that like they might be in separate cities or countries and they could all feel together. I think in theory that might have sound like a good idea. Did you really do that? Like I think Meta might have done it a little bit, but did you guys really do that? Come on. I just just [laughter] like like did these meetings ever take place in reality? Like Yeah. I so wonder whether because Yeah. No, it's funny you bring that up. Like that actually would be kind of a fun I'm going to go on YouTube and start looking up those old interviews cuz like it's going to sound It sounds preposterous. preposterous right now. Again, we could sound preposterous five years from now when you're all listening to me and the replays of talking about pins and [laughter] whatever else, big blocks that just record your voice all the time could sound ridiculous, but yeah. All right. So, overall metaverse dead. , but good pivot for Meta because they were able to put a lot of that technology into this AI glass classes which is actually showing",
        "start": 1910.799,
        "duration": 4065.0370000000044
    },
    {
        "text": "[laughter] whatever else, big blocks that just record your voice all the time could sound ridiculous, but yeah. All right. So, overall metaverse dead. , but good pivot for Meta because they were able to put a lot of that technology into this AI glass classes which is actually showing should more directly say it was a mistake? Yeah, I think he should. I think he should. He should say it was a mistake. We're Facebook. We're back. We're back to Facebook. We're back in a big way. We We actually figured out and are leading this next revolution in hardware. And you know what? We tried. We We took a bet. It failed. But look at us. were like agile and enough to actually keep going versus the well there was so long where they were like trying to like conflate the AI development with the metaverse de just like refusing to acknowledge it was over right if I I'm thinking about the name maybe keep meta actually because the Rayban meta is a good name the Rayban Facebooks would be weird I don't know you're right has maybe grown on me even though it's embarrassing no you're right like and meta it doesn't necessarily really mean the metaverse. It's just kind of it's meta, you know. Yeah. Yeah. I mean, but no, no, you're right. Ray-B band Facebooks would have been terrible. Rayban meta. I say it all the time. Totally naturally. Yeah. Yeah. Okay. So, metaverse dead, but meta is alive. Meta is alive. All right. We're going to take a quick break and when we come back, we're going to talk about the code red inside OpenAI regarding Chad GPT. what the implications are there, whether CHP is actually losing users, whether Anthropic might be gaining in the enterprise world, and then we are also going to break down this big deal that was just announced this morning. Netflix is planning to acquire Warner Brothers Discovery for 72 billion. And the deal may or may not go through. I I think it won't. All right, we'll be back right after this. Finding the right tech talent isn't just hard. It's missionritical. Hiring great engineers isn't just filling roles. It's how you outpace competitors. And that's where Indeed comes in. Tech hiring tip of the week brought to you by Indeed. 83% of tech professionals say career development is a must-have in a job offer. Outranking stock options, sign bonuses, and unlimited PTO. If you want to win talent, lead with growth paths, not just perks. Indeed is the number one site where tech talent applies to jobs. With over three million US tech professionals on the platform, it's more than a job board. It's a tech hiring partner that uses data and AI to help you reach candidates with the right skills at the right time. If I needed to hire top tier techtalent, I'd go with Indeed. Post your first job and get $75",
        "start": 2060.8,
        "duration": 4361.838000000002
    },
    {
        "text": "the platform, it's more than a job board. It's a tech hiring partner that uses data and AI to help you reach candidates with the right skills at the right time. If I needed to hire top tier techtalent, I'd go with Indeed. Post your first job and get $75 That's indeed.com/tealent. Indeed, built for what's now and what's next in tech hiring. And we're back here on Big Technology Podcast Friday edition breaking down the week's news. Earlier in the week, I thought this was going to be our lead story, but so much has happened since that you know, we pushed it to the second half, but it's still important. OpenAI declared a code red within the company as Gemini threatens Chat GPT's lead. here's from the information. And OpenAI CEO Sam Olman on Monday told employees he was declaring a code red to marshall more resources to improve chat GPT as threats rise from Google and other artificial intelligence competitors. as a result, OpenAI plans to delay to delay other initiatives such as advertising. Altman said it's a we are at a critical time for chat GPT. Altman said the code red surge to improve chatbt meant OpenAI would also delay progress with other with with other products such as AI agents and pulse which generates personalized reports for chatbt users to read each morning. how how dire is it for chat? I mean there are some reports that they lost like 6% of users to Gemini. I don't know if I fully buy that. I don't think everybody just ran away to Gemini right away. Maybe they were trying it. but but how dire do you think the situation is for CHPC right now? So the numbers around 6% was sourced from similar web. So like I take that with a grain of salt because that's not going to capture actual app utilization and that's just like web traffic which I mean I have to imagine at least my own personal life and I'm guessing most the app is like the core entry point for their chat GBT usage. But I mean certainly Gemini 3 has come on strong and we talked about this last week that just being as good poses not an existential threat but a significant one for open AI because Gemini is going to be everywhere. All the people who have never used chatbt 800 million is a lot. It's not what is the world at now 7 billion people whatever it is. , so I think that is important, but also what was really interesting to me was what you just read there, like it's gonna, you know, is it going to pause its ad product? Is it going to even the fact that they said like pausing agents like which because to me still agentic is even catchy bt happening underneath is agenting in its nature. whatever they were advertising before about kind of building these more",
        "start": 2211.04,
        "duration": 4674.319000000005
    },
    {
        "text": "is it going to pause its ad product? Is it going to even the fact that they said like pausing agents like which because to me still agentic is even catchy bt happening underneath is agenting in its nature. whatever they were advertising before about kind of building these more which they launched and you never heard about again and then pulse which we talked about a little bit but it's an ad product that that's that was supposed to be their ad product. Yeah. All of this and what we were saying about their consumer devices they have been launching everything like nonstop over like I mean and everything always kind of looks pretty good. their browser Atlas. I've tried it, used it. It's as good as Comet from Perplexity. , they've launched all these things, but is that the right approach like to, you know, the spray and prey and hope you find like the winning product or you just focus on Chat GBT and the core product and just distribution, getting people using it. Maybe there's like a marketing campaign, something like that. What do you think? Well, they're going to have to spend they're planning to spend 1.4 trillion on developing infrastructure for future model building. And the reason why they've have the money to be able to do that is because the world by and large thinks that they're the best at building AI at building AI products. The second that cheen goes away, all of a sudden your ability to raise this ungodly amount of money goes away. It go completely right. Like Mark Benoff had an interesting quote this week where he was just like, , AI models are a commodity. I just find the cheapest one and plug it in. Who has said that, Mark? Who's been saying that for years? He's been on the show and and he he maybe he's listening. But I I do think that if the world starts to pick and obviously Ben off praised Gemini. If the world starts to pick up on this signal and all of a sudden Chhat GPT is one of many or OpenAI and CHP and the GPT models are one of many as opposed to the leader then the OpenAI story gets much much harder to put together. Yeah. And then I had actually seen this thread and it was really interesting to me was that like open AAI and I' I've said this for a long time too from a product and actually we've spoken we were speaking about like hardware UI for all the early part of the episode from a software UI standpoint they have built beautiful products they built usable products they created the whole chat UI was not really a true thing and now like they led the And all Google has to do is just copy everything they do. Wait for them to innovate, release, just copy because UI",
        "start": 2370.64,
        "duration": 4973.118000000005
    },
    {
        "text": "standpoint they have built beautiful products they built usable products they created the whole chat UI was not really a true thing and now like they led the And all Google has to do is just copy everything they do. Wait for them to innovate, release, just copy because UI like and like whatever new features they're releasing in that interface, Google just replicates it. It's not overly complicated stuff. And then Google that just keeps them on par. And I think like that actually thinking about it that way was even more terrifying for me in regards to OpenAI. Yeah, I'm looking at some data from the FT here. It looks like Gemini is getting very close to the number of monthly downloads that chat GPT has. It surpassed it in average time spent, which of course is a a tricky metric. but that's pretty worrying I think if you're if you're open AI what are you going to because again and we're going to talk about this in a moment you've effectively I wouldn't say you've seated enterprise AI but you're losing enterprise [clears throat] AI to anthropic somewhat seated it yeah so you have to you have to you cannot allow Gemini to surpass you here otherwise the the company is built on a story if the story falls apart the company falls apart no you're right like and that story is we are just we're the test super intelligence. Yeah, you you see and you're right like for what is it now? three years just a week out from the third anniversary for call it two and a half there was no one even close like even the clouds of the world like among more tech forward people they would find things and I mean we all found like certain things Claude would do better but yeah no they they can't lose that reputation and feel in the market that especially in the consumer space like they they own it. Okay, we talked about this last week. What do you think they do in this code red? Like what do you think they do to make chat GPT better? And does it potentially involve pulling some levers that they were reticent to pull or hesitant to pull previously? in terms of personality, syphancy. Oh yeah. Yeah. Stickiness, you know, optimizing engagement maxing as it's called. Where are you going with this, Alex? I think I know. Love erotica. erotica. No, it doesn't even have to be. I'm just saying like Yeah. What do you do? No, no. I mean, and clearly Alexa is your companion, but I think [laughter] Thank you for reminding us all that. While I'm just taking photos of birds with my metal glasses. [laughter] we're hip. We're cool. no, I I Hold on. That's a really good question. What could they do or what should they do? Cuz like I'm going to throw it out there. They",
        "start": 2522.16,
        "duration": 5282.399000000007
    },
    {
        "text": "for reminding us all that. While I'm just taking photos of birds with my metal glasses. [laughter] we're hip. We're cool. no, I I Hold on. That's a really good question. What could they do or what should they do? Cuz like I'm going to throw it out there. They So my parents over Thanksgiving. It's It's very cute. They're just like, \"So, what do I do with AI?\" You know, like I'm trying to show them trying to show them like voice mode on especially like my dad has trouble kind of typing on the phone. I'm like this this literally will be amazing for you. And it's just conceptually it's still difficult to understand like what do I do with this? It's a blank screen on a chat. Like that's my call. Like educate the 6.2 billion people that don't really understand what how to use AI chat and that's your opportunity. And so how what what would you put in the marketing campaign? I think they've done a little bit of this. They do like fitness and diet not diet travel. That was a good campaign. I think it's amazing for fitness. I like as my fitness coach. No, no. Like and as you can tell viewers, it's paying off. [laughter] That's why Alexa is so interested. [laughter] So, so no, no, like the again it was good. It was like I remember it was like someone's car is broken down. It's like like help me fix my radiator. What should I do? Whatever. Like there is an opportunity there. I think the product is good enough. There's still that entire additional world of people that do not use it. focus on them. But but I really don't understand how they're gonna they have so much going on right now. They have to have so much going on. I I said it last week like the math still doesn't work to me of like what does their cloud business look like? What does their consumer devices business actually look like? But they have to focus and I I don't think they will. But how do they save themselves? I don't think it's a marketing campaign. Here's a way I think that you can make the product better and not resort to sickincy. improve memory. Memory to me within chatbt has been the killer feature. I find Chachi PT is remembering much more about me in a way that I find not creepy, very useful. I've been planning this trip coming up in December. , and we've been talking about logistics a tremendous amount and , and it it it really does a great job of pulling for from past conversations , and and again like losing this goldfish brain , that so many chatbots have starting to get to know people better. , I mean does that make you more make it more of a companion? Yeah, because it knows you. , but I think",
        "start": 2680.24,
        "duration": 5587.133000000006
    },
    {
        "text": "pulling for from past conversations , and and again like losing this goldfish brain , that so many chatbots have starting to get to know people better. , I mean does that make you more make it more of a companion? Yeah, because it knows you. , but I think useful and that's the direction. No, I think they're going agreed and and and I actually I agree with the caveat that like I have found it to the memory to actually be not good like it's supposed to retain memory within a project but across multiple chats within a project it does not like very clearly sometimes it does sometimes it doesn't at the kind of like when you get out of the project layer into the main chat it sometimes randomly remembers stuff so so I think they got work to do but I okay I like that that like I just imagine that that got Yeah. If that 50% better, which I think it can. No. And if you had like granular control over what is remembered, what's not remembered, where is it remembered? Like sometimes like if I'm like doing some like funny create song lyrics here, and then in another chat where I'm trying to do something more professional, like it'll pull in that random prompt I was creating like like giving users granular control over that is interesting. But I they got so much going on over there. I don't see how like that's one of those things that it all hands on deck. Let's win memory in context. That is interesting. But can they pull it off? I think so. Code red. I like the code red. You see you have a problem and you're you're going to attack it. Did you order the code red? Sam did. Yeah. Okay. Let's talk a little bit about enterprise before we move to Netflix. if we could talk about this briefly. ramp has this AI model adoption rate where it talks about businesses and Anthropic is really gaining ground on open AI there. let me take a look here. So they say that Anthropic has grown 2.1 percentage points over the past month. and they say at a business level API spend by business is larger than typical enterprise chatbot contracts. It's also probably getting stickier over time because business users are starting to figure out which models are best for which tasks. APIs are also more reliable re are more reliable revenue generator than consumer AI usage especially as consumers have an increasingly numbers of free options at their disposal disposal. So I'd be pretty happy to be anthropic right now. It's an underrated business. If you're looking at consumer adoption of AI tools and business use is their most important revenue generator generator. its customer base indexes to the tech sector. But that's changing as rapid adoption grows and moves across sectors. So there there it is anthropics bet on enterprises is really",
        "start": 2838.56,
        "duration": 5904.652000000002
    },
    {
        "text": "business. If you're looking at consumer adoption of AI tools and business use is their most important revenue generator generator. its customer base indexes to the tech sector. But that's changing as rapid adoption grows and moves across sectors. So there there it is anthropics bet on enterprises is really again like as I work in enterprise AI at writer like for us the big opportunities actually business users building workflows and like bringing AI into the way they work and anthropic I still feel I mean I mean from everything I've heard they've made claims that they're getting more into the actual business side of things but one coding and two API usage it's still a developer first company like even the way I actually have been working playing around with claude skills very developerdriven so they're going all in on like IT engineering and the business the that side of the enterprise like I think it's actually great for them and I think they're going to crush open AI and that so I think overall they have shown I think as a revenue scale from like 1 to six billion a lot of the coding they nailed I mean just being this API first offering they nailed so I think they're relatively well positioned, but I actually don't think the way this article called like API spend sticky. I don't think it's sticky really. No, I think like that's actually almost more having worked with this stuff. I mean just switching out what you're calling like truly this is where even as at one point if Opus 4.5 is better at coding cost is going to be the driver especially in the enterprise and being able to switch the moment you see that there's another model that can actually do the work at a like on par is going to is a very easy thing to do. Okay. All right. Well, the battle will continue. let's talk a little bit about this Netflix Warner Brothers deal. All right, so this from the Wall Street Journal. Netflix to buy Warner Brothers after split for 72 billion. Netflix has agreed to buy Warner Brothers for 72 billion after the entertainment company splits its studios and HBO Max streaming businesses business from its cable networks. A deal that would reshape the entertainment and media industry. the the deal was announced Friday and the two sides entered into exclusive negotiations for the media company known for the Superman and Harry Potter movies as well as TV shows TV hit TV shows such as Friends. it it seemed like it's going to be this big deal for Netflix. I just think that like you're going to if you get Warner Brothers Discovery and of course it's pending review by the Justice Department which may not like this deal. the the early reports are the Justice Department hates this deal. it may not let it go through. It may sue to block the block",
        "start": 2999.839,
        "duration": 6213.051000000002
    },
    {
        "text": "you're going to if you get Warner Brothers Discovery and of course it's pending review by the Justice Department which may not like this deal. the the early reports are the Justice Department hates this deal. it may not let it go through. It may sue to block the block this is going to create a streaming powerhouse. Netflix already extremely powerful, the number one streamer and HBO coming together along with other Warner Brothers Discovery properties. I think at Netflix it's a risky thing. They don't usually do deals this big. but at 72 billion the price is right and you couldn't let anybody else snatch up Warner Brothers Discovery. What's your take? I think it's that last point's the most important. You can't allow anyone else to get pick that up. I think like they are in they're still, you know, kind of the leader in this entire space. They don't have to like manage legacy businesses combined with the streaming arm that gives some advantage but also plenty of disadvantage. And so to to kind of pull that this entire gold mine of a catalog into your universe, I think it's it's a it's like a Yeah, it's not defensive in a negative way. It's defensive in a like strong way. Like we are trying we need to do this and it's going to put us in a better position relative to competitors. Yeah, I think Netflix needs to do this from a business standpoint. Smart move. I I do want the government to stop it. Now, the government might want to stop it because they preferred that Warner Brothers Discovery go to Paramount Plus. Fair enough. Why is that? , well, because of politics. , but the the other side of it to me is like even though, you know, as a Netflix subscriber, I might be happy to get some HBO content in in Netflix because I subscribe to both services. , we know how cable companies work. You know, they've worked as monopolies. They don't treat customers well. , they jack up the prices. there's nothing you can do about it. This might just create like one internet cable company and and and you know over time it's going to it's going to harm the people that are using these services. So I'm I'm against it. It's 100% going to I mean if you've I actually did this exercise recently and like went through my streaming bills like it is insane. Like I mean the price has just been increase and increase and increase. So, I'll admit I like took an HBO Max, Disney, Hulu bundle with ads, and it is the weirdest feeling to watch HBO with ads. Like, I feel I mean, just horrible about myself, but I'm still just going through this exercise right now. But like I mean, it is like they've just been increasing, but introducing these services at a heavy loss, getting",
        "start": 3156.319,
        "duration": 6513.293000000001
    },
    {
        "text": "and it is the weirdest feeling to watch HBO with ads. Like, I feel I mean, just horrible about myself, but I'm still just going through this exercise right now. But like I mean, it is like they've just been increasing, but introducing these services at a heavy loss, getting increasing prices regularly. and agreed like from a consolidation standpoint. Ted Sarandos called this like pro- innovation, pro- consumer. It's not. It's not. It's not. But but still, I mean, from yeah, purely Netflix standpoint. Good move. For consumers, it's all bad. Okay. So, let's end on another future of media story, which is that CNN is going to end up in a partnership with Khi, which is a prediction markets. This is from prediction market. This is from Axios. CNN has struck a partnership with Khi, the world's largest global prediction market company, bringing Kalshi's data to its journalism across television, digital, and social channels. The collaboration marks the first major news partnership for Kali as it looks to establish itself as the most authoritative source of information about real-time probabilities of major cultural and political future events. , plus and a minus here. The plus is that prediction markets have been ahead of the pundits on news events. Talk about elections, talk about other probabilities. so you might want to bring it close to home if you're a news operation. Second thing is I think there was a Kauashi executive this week that was talking about how they wanted to make everything bettable. Everything that has a potential disagreement about some future outcome, they want to make that betable. , I think we've already seen some of the dangers of sports gambling and how it's really destroying people's lives. And I think that you're going to see that again here. And I wonder if CNN is making a mistake mainstreaming this. So, having worked on a trading floor from 2002 to 2009, I can tell you everything can be bettable. [laughter] I lived in a world where literally any little disagreement and it was funny because the Koshi founder that's what he was talking about like any like basically trying to bring structure to disagreement I think he said like that's what would happen you you just disagree with someone let's put money on it and I have always loved the idea of prediction markets there was actually an early one in the 2000s called trade sports that started introducing politics I mean every step of the way recently as prediction markets have come in. I I think they add a true element of like context and have people having money versus punditry. I think they are better. I think from a gambling standpoint and Cali tries to say they're not gambling. I think it's hugely problematic. Like I think there are certain things like weather futures which I think Robin Hood is going to introduce. This stuff exists for like institutional c customers and like",
        "start": 3308.8,
        "duration": 6838.411000000002
    },
    {
        "text": "are better. I think from a gambling standpoint and Cali tries to say they're not gambling. I think it's hugely problematic. Like I think there are certain things like weather futures which I think Robin Hood is going to introduce. This stuff exists for like institutional c customers and like weather issues is it makes sense buying contracts that allow you to hedge against potential risk. That's the thesis of it. Trading for fun and just being like, yeah, I want to make or lose money the more it's out there is problematic. But I actually think this is kind of cool. I just don't like the idea that a news operation is bringing this gambling closer to people. I think it's ruining for instance daily fantasy sports or or fantasy sports is ruining the you know FanDuels and stuff ruining sports. No, they're cheat people are cheating. People are taking their student loans and putting them into these apps. Yeah. But no, no. Okay. But that is the enduser. like perfect world. You have some number of well-informed, well- capitalized people in these markets, which is what financial markets are supposed to be. and like they're the ones actually driving and towards this kind of prediction and potential outcome which in the political context is really interesting cuz my god I was home over Thanksgiving and my parents have CNN on and I forgot how terrible it is watching 10 people because I never do it just talk and argue around a table like versus here's some interesting data and if you think about it polling is an interesting science, but like this is another way of approaching that. But you on this show have talked about how it's gameable, how let's say somebody wants to get a candidate elected, you know, they might spend $100,000 on the super PAC or they might just put it on their name at Kelsey and then CNN's going to be like, \"Oh, candidate Y is doing so well.\" That is why normally this stuff would have happened in welle regulated wellestablished well monitored like exchanges where the SEC or the like others are CFTC are monitoring this. This is not that. So I recognize this is kind of a bastardization of what in principle I do love but like and I really think is valuable. So, I agree like on that side, my god, I'm sure these things are the most gameable things. And I agree, it's a problem where you game the Cali they start sending some awful tweet about that, it goes viral, everyone starts thinking this outcome is an inevitability, maybe someone drops out of a race. I think that stuff is terrible. Regulators go try to take a look at this. Let's build this in a responsible way. And that's that would be nice. Can't happen. No, I know. [laughter] All right. Well, speaking of predictions, it is getting close to the",
        "start": 3474.079,
        "duration": 7161.611
    },
    {
        "text": "out of a race. I think that stuff is terrible. Regulators go try to take a look at this. Let's build this in a responsible way. And that's that would be nice. Can't happen. No, I know. [laughter] All right. Well, speaking of predictions, it is getting close to the come back and do some predictions one of these weeks and tell folks what we think is going to happen next year and and then put money on it. [laughter] Technology prediction market and source that out big technology prediction market. Put these derivative contracts out there. All right. But that'll be a fun episode coming up. Rajan, always great to have you on and it's great to be able to do this in [music] person once again. Always fun. See you next week. All right, 57 and music taste. Yep. I'll take my creaky knees out of here right now. [laughter] All right, everybody. Thank you, Ron. And thank you all for listening and watching. We'll see you next time on Big Technology Podcast.",
        "start": 3638.88,
        "duration": 7246.893000000001
    }
]