[
    {
        "text": " How are companies finding value today from cuttingedge AI models? Let's talk about it with Promeo CEO Carik Kerpapuri who joins us today in a conversation brought to you by Promeo. Caric, great to see you. Welcome to the show. Thank you, Alex. Thanks for having me. So, a little bit about Promeo. You work extremely closely with Google's AI technology, which has been like a pretty good place, I would say, over the past few months to be. So, I'd love to hear just from your perspective because no one watches this as close as you do. your your company works extremely close with them. what have you seen over the past few years from Google and where do you do you think that they're building a lead over the competit the competition? Well, I hope so for the last part of it because we are we are all we do is Google, right? I mean that's all we're focused on and there's a good reason for it. kind of probably should take a step back you know for me as we look at it and we just came off our annual kickoff with our company and way we look at this is where the technology has been in the market and what Google has done I mean like 2023 you know late part of 2023 chat GPD took the whole world by storm and it's what's big novelty act I mean by the way it's a real right I mean not just novelty but it's a novel for for the end user right from a com commercial user adopting this technology and Yeah, Google probably got a little caught flatfooted at the beginning possibly, but the pivot that has happened in the last couple of years, I couldn't be happier as a as a partner of Google and the support that we have gotten from them in driving this with our clients as well and the technology stack itself, right? I mean so you know the the approach of being open in you know you know the technology itself is open it's secure and the hard pivots into model like you know you know you know Gemini pro 3.0 Oh that where we are in right now and which is giving multimodal opportunities it's been been very rewarding both for us me as an operator of a company as well as our clients as well right so I think it's you know overall the d-risking AI for our clients as well has been a big thing for us in terms of providing security you know full stack so yes so just to explain what this means basically Google will come up with these new models they're not going to be able to help the whole world implement them so what you guys do is you have built expertise within the Google models and then you will help the implementation on the business side. That that is exactly",
        "start": 0.08,
        "duration": 287.99999999999983
    },
    {
        "text": "Google will come up with these new models they're not going to be able to help the whole world implement them so what you guys do is you have built expertise within the Google models and then you will help the implementation on the business side. That that is exactly about 18 months ago right we started work partnering with Google to provide a lot of adoption services especially around Gemini for Google workspace we have done about 250 to 300 workshops at this point which which is pretty incredible from an investment standpoint for Google investing in clients and us providing the service for them and we see the adoption like all things in all things in the world at different scales with our clients but there is really good reason for that, right? I mean, but we are seeing the adoption hitting mainstream and you know the demand for it increasing day by day. Yeah. So yes, we know that Google was a little flatooted at the beginning. Yes, everyone knows I think theoretically that things have gotten a lot better. But from your perspective, just talk to us about the tangibility of this stuff and u when we hear okay it's gotten better. What have you seen on the ground? The models have gotten better at handling complex queries. they're hallucinating less. Talk a little bit about the progression. I think the progression the big progression right it I think is going from a novelty like you know hey give me answer some questions do some basic stuff to where we are right now I feel like with with the advent of agents at this point where you can do agent assembly lines the models have gotten very good you know you know very close to being good at discern discerning there's some still some work to be done in terms of hallucination and but Google's done a very good job of grounding you know the models providing visibility into it and that's the reason why we are super excited to partner with them and look there's still some work to be done here right I mean you know like and and this is not just a Google only race right I mean today the models are at a point where next you know you're going to get announcement with open AI there's going to be you know there's going to be leaps that are happening back and forth which overall I think like one of the things we like to say internally is this is as worse as these technologies is going to be it's only going to get better as things go and a lot of this still we feel like is grounded in the fact that organizations still struggle with data integrity and that is fundamentally what is the primary blocker right in terms of like you know really AI I mean models and agents working and reaching the full",
        "start": 143.84,
        "duration": 562.7990000000001
    },
    {
        "text": "go and a lot of this still we feel like is grounded in the fact that organizations still struggle with data integrity and that is fundamentally what is the primary blocker right in terms of like you know really AI I mean models and agents working and reaching the full feel about it and that's where we come in with our consulting services and provide that help for our clients yeah yeah so what does that mean that the data integrity is not there and that's the main thing holding them back the big thing right I mean I mean I'm a I'm probably aging myself this is the same thing that happened in the 1990s and you know the the digital transformation the biggest blocker that we see with digital transformation is where data is very siloed within an organization it is not really a readily available and then who has the proper definition of the single source of truth for that data that exists in organization so once you're able to align as an organization on what that is models can get better about grounding themselves and providing that level of insight and analysis that I think agents can then act upon and that provides better outcomes for our clients and that's what what we see you know when in even internally like as a as a as a COO at heart still I find that to be the biggest thing that because we want to be able to act on it in the most you know efficient manner possible so okay and And one more question about this. You said they've gotten better at discernment. Yes. What does that mean? That they're making better decisions. Well, they're getting better decisions based based on the information that's available, right? And you know and I would say there is you know especially with Google you know where with you know with the models have gotten very efficient very you know and then there's a level of transparency that's in there which allows you know have a visor into the thinking process that happens in that we are able to see it in you know inside what is happening what the decision is and you're able to tune how much of the hallucinations you know you can tolerate what you don't want to tolerate I'm I'm obviously you know speaking in very basic terms terms here, right? There's a lot of, you know, you can data sovereignty is a big thing. So, you don't want to go outside, you know, like things that you don't, you know, want to base decisions on. And that level of, you know, , you know, control that it's given to the user has gotten them, at least the Google models got be very, very effective at least internally that's what we see and that's what our clients are saying. So, okay, great. And there was, you know, it's interesting a couple months ago",
        "start": 284.16,
        "duration": 831.759
    },
    {
        "text": "you know, control that it's given to the user has gotten them, at least the Google models got be very, very effective at least internally that's what we see and that's what our clients are saying. So, okay, great. And there was, you know, it's interesting a couple months ago and is there any enterprise value? in in artificial intelligence and now it's like the entire conversation has shifted to what software companies going to actually you know survive this moment and I think that that to me shows that there's there's been this moment where there's companies like yours have taken the AI models used the improvements and translated that into real business outcomes that's happening now so I just want to hear your perspective when the model gets better how does that translate into your ability to do more with a with a customer Well, I our CTO John Perrett and I we spent a lot of time thinking about this and talking about this and one of the things we believe right the idea of the AI platform right is getting closer and closer. I mean I know you know I'm going to quote Satya right who talked about you know the idea like a few years ago he talked about the idea of you know these comp the platforms like CRM platforms that sit on top of data that exist in your organization and that's what we talk about AI platforms that are on top of it and how we work is going to fundamentally change you know and the I really fun I think we're and I'm not trying to like you know scare anybody to think that PowerPoint will go away but you are seeing being PowerPoint the people's reliance on PowerPoint is less than it used to be right and you know I we feel like the like as a as an operator of companies most people we don't want a plethora of AI tech tools out there neither do we want to have a IT sprawl with a whole bunch of you know platforms that exist what we want is ability to action and do our work you know you know with the data that's already exist in our organization and how do we interact with it and how do we make decisions on And I feel like that's where we are right now. And you know, I don't know what the time frame is, but I feel like it'll be a day when I can just ask what I need to do and I don't have to go check my email. I don't have to go check my CRM. I don't have to check my financial systems. I'll be able to interact with the data that exists in our organization, right? And so then as the AI models have gotten better, that's allowed you to do more of that or what exactly have model improvements translated to?",
        "start": 419.919,
        "duration": 1088.7979999999998
    },
    {
        "text": "my CRM. I don't have to check my financial systems. I'll be able to interact with the data that exists in our organization, right? And so then as the AI models have gotten better, that's allowed you to do more of that or what exactly have model improvements translated to? right? An example of this would be you you know we had talking about before about how we have a you know internally to our organization we are asking our people to be 30% more effective right I don't I never use the word efficient because efficiency means like all kinds of weird things and people are like oh what's about my job it's not about it right I mean like the idea is okay if you got 30% of your time back you know let's take our finance team for in our organization we know they cannot take PTO the first week of the month because they're closing, right? It's impossible for our CFO and our financial controllers and our FPNA team. So, what we have challenged them is how can we work in a way in which a lot of the tedious mundane task that's working in our own bespoke billing system that we have in there, how can that be automated so you can actually take PTO off, right? So that to me is what you know the agents that we are building and you know it's sitting on top of looker or bitquery you know that can action the mundane and gives time back whether you be use it for PTO or taking time off that much deserved or do something else investing in your career is what we talk about when we talk about that the gains that we want to make in people's growth and in our company's growth that's what that's what internally we have challenged our organization to be good at right and that's working Okay. Well, we we we're on a journey, right? We starting we have started on this one that you know we have we have we have kicked off a couple of projects at this point and most mostly focused on you know people ideas coming from our organization not top down. So that is one example I gave you about the close process. How do we get that tedious done? One of the things that the other thing is we one of our co-workers she brought up the idea of how do we automate a lot of automas we do sell a lot of Chromebooks for education and you know we got a full stack Google partner and one of the things that happens is Chromebooks sometimes don't work which you know people don't want to hear but you know it happens right the technology doesn't work so we she came up with an idea of how she got herself first of all geniic certified right and then she wrote the prompts to kind of",
        "start": 550.959,
        "duration": 1346.5569999999998
    },
    {
        "text": "Chromebooks sometimes don't work which you know people don't want to hear but you know it happens right the technology doesn't work so we she came up with an idea of how she got herself first of all geniic certified right and then she wrote the prompts to kind of working with one of our practice leaders. She wrote an agent to figure out how to automate the process and we're about to launch it. So the idea is can we get 8 hours back for our time in a on a weekly basis. That's the whole idea and that it's working. Yeah. So okay. All right. And I definitely have more questions about that. , I want to continue along our our line here talking a little bit about , what Google enables you to do because you said another thing that sort of , made me perk up which you said that the the model or Google models you're able to tune them in a way , that you might not be able to do elsewhere that if you you can have like a dial basically that says all right less hallucinations but maybe a more rigid answer , more you know potential for more hallucination but more creative answers. That's what I'm I'm guessing. And one thing I've heard is that maybe that that Google is not a a black box but maybe a gray box. So talk a little bit about that and how that enables you to implement the technology better. Yeah, I think you know with when you're when you're interacting vertex you know Vert.Ex AI which is at the core of what how Google you know exposes you know the thinking you know to us you know or to any of the users in there you're able to dial back and you know how much you know broad that you want the model to be or how narrow you want to be focused in the grounding that happens all of that to me you know you want to the whole idea of using these models right is one based on developing trust and what is the model using to make the decision it's it's you know it's going to give answers based on and what we're trying to figure out is the more transparent it is the better it is for the user and for the model to even understand the context of who you are and how you work and all of the stuff that happens in there right so I think that is what I mean by that I mean like the idea of like with Google has been has done a very good job of it in the last year or so what we are seeing is you know first of all one is making sure that the data that you are you know inputting into the model it is not used to train models global Right?",
        "start": 681.44,
        "duration": 1585.5969999999993
    },
    {
        "text": "been has done a very good job of it in the last year or so what we are seeing is you know first of all one is making sure that the data that you are you know inputting into the model it is not used to train models global Right? know as we we are we we develop our own SAS platform. The last thing we want to have is you know any code checks that we do is opened up as you have seen in the news that's happened to a couple of big enterprises like the IP indemnity that Google's providing it's it's impressive and you know that's that's those are the things that we are when we interact with CTOs they are talking about how much they appreciate and the confidence level is growing with what Google's providing in terms of how to interact with the models better in a more safe and a secure way. Can I ask you like why Google versus open source? Well, first of all, like to me, , it kind of goes back to, you know, the idea of like thinking about managed services, right? Like like one of the most 99% of the companies, I would say what they need is probably to consume this as a managed service in my mind and the full stack of Google's investment, right? If if you look at the full scale of it from infrastructure models and open I the ability to have interact with other models the investments that they have made in let's just say in developing agent A2K which is you know open to everybody right and agent to agent in integration all of that you get almost the best of both worlds like why recreate the wheel with the infrastructure that and spend that you don't need to do and the work has been done so consuming this and you get the latest you know learning the LLMs that you are already getting it's from a managed service provider like Google that's already invested in the you know and then and you can calibrate it the way you want to consume that to me yes there are some bespoke cases where you you know where there's you know we have a couple of clients who are building their own models and we are totally it makes sense for them but 99% of our other client you know the clients that we have are probably just okay with using just you know what I not quite off the shelf But you know what is generally available to you know for consumption. Yeah we had Arthur Men from Mstral in recently and he was also talking about how AI is effectively a managed service that it is a an intense technology to implement and you could be a technology company and sort of you know take a model and customize it yourself. For most businesses, the way to consume it",
        "start": 803.519,
        "duration": 1850.1569999999995
    },
    {
        "text": "recently and he was also talking about how AI is effectively a managed service that it is a an intense technology to implement and you could be a technology company and sort of you know take a model and customize it yourself. For most businesses, the way to consume it as an implementer and an optimizer and having them build the AI for your use case and that's where you get ROI. I I would agree with that, right? I mean, and I think personally I feel like this is one of those buy versus build decisions that faces all operators in the world. Yeah. I mean like I you know when we talk internally about investment decisions what we talk about is is this something we want to be good at right yes and if you want to be good at there's two ways to think about this whether do we have practitioners building it for us or do we want to have an experiment and try to build this ourselves and the time to market and time to effectiveness all of that stuff you know comes into play here and that is that is a tough call to make right but most cases I think it's made tougher by people wanting to say we are probably this we we don't need to We have to learn, continue to invest in it, continue to nurture it. That takes a whole lot of things that takes maybe away from the core value of why mission of the company feels like to me, right? Yeah. So then tell me where do companies get ROI or when do companies get ROI from this versus when do they not like what are the setups where you know a company goes full steam ahead and says all right we're going to implement AI and they actually end up realizing a return on their investment versus when do they not because there's definitely been I think the people who aren't getting value out of it are louder maybe it's a competitive disadvantage to you know shout to the world that this is working for you so talk a little bit about the the divergence here and and where people get the most value from it or when they're able to exploit that. Right. I think look I think I start we said we've done like 250 workshops you know like about adoption we always talk about right whether it be take you know we find the best use cases right where the best success clients have is when they start small when they have a clearly defined KPI in mind on what is it they want to accomplish right the two examples I gave you are tangible and we have actually have said okay we're going to start small like an RMA automation or you know a finance close operation and there's a whole bunch of things in",
        "start": 937.92,
        "duration": 2100.876999999999
    },
    {
        "text": "in mind on what is it they want to accomplish right the two examples I gave you are tangible and we have actually have said okay we're going to start small like an RMA automation or you know a finance close operation and there's a whole bunch of things in want to automate. So when and then there's also buy in from the top down about the success of what you know what you know something needs to happen. The biggest thing I will also say here that we see where ROI works and not work is you know the opposite is also true where we don't see ROI is when you try to boil the whole ocean where like oh we're going to be an AI first company. I don't know what that means, right? when when somebody says that, it sounds great in a board meeting or in a in a press clipping maybe in a release, but I don't know what AI first means. I mean, unless you're a software developer, it's fine. I mean, you want to be grounded in how you develop your your software, but the idea is to start slow, be very clear and then, you know, ensure that you know, you understand what outcomes you want to drive in there and then expand to the next use case and then, you know, and then be methodical about it, right? like all you know transformation work this is also at the core of it right I mean and the last thing I also say is it's not you know while I think we are there as consultants to come and helpmemes who run the business are key to you know making sure that the use cases are clearly defined and we can help facilitate the technology portion of how the technology works for the business operations but it's important that the key stakeholders are absolutely engaged in you know driving the you know the results that we need so yeah That's that's that's that's how we follow it and we try to punt when we we don't see the buy in and we we try to recommend it gently but with the clients who do it the right way see tremendous amount of returns. Yeah. So have you seen the the percentage of implementations where clients are getting ROI go up or have you seen even cases where it used to be pilots don't go into production more of those pilots are going into production? Yeah, I mean so I can well I can tell you a few examples of where this has happened right like Gold Bond I think we have some press we have a few press releases with them and they're a great example of a company that has you know started out you know in Google workspace Gemini for Google workspace and they saw 70% adoption right which is the first key metric that culturally there's a massive",
        "start": 1066.48,
        "duration": 2359.2779999999993
    },
    {
        "text": "some press we have a few press releases with them and they're a great example of a company that has you know started out you know in Google workspace Gemini for Google workspace and they saw 70% adoption right which is the first key metric that culturally there's a massive they went to the next use case about how do you visualize you know provide visualization of products on the website, you know, so that takes frees up more time to sell and then then they moved then we're helping them automate a lot of their, you know, , order processing and everything like that. And they are at a great transformational organization that really understood how to start it and then how do we expand it because and that I would say is probably what more of 2026 has in store for us. I mean because that that is if somebody can replicate that right over and over again you're going to see a lot more outcomes in there and the other thing we also is a good barometer in in our thing is right we you know like you know I one more thought on this one about outcomes that we need to drive here but when we see massive engagement after we do a pilot right when when it's not limited to like the managers or an executive organization when you see the attendance that's happening and then the usage build up even using Gemini for workspace right you know culturally that it's getting adopted because people do not want to do the boring tedious stuff over and over again right and then when that catches you know fire it it's going to you know really adoption get driven innovation starts at the very edge and then it's nurtured and fostered there right so that is that is how we think about is there a few more use cases I can give but that's kind of you know that's a good poster child of how we want to see this roll out so yeah very interesting especially the range of use cases just in that gold bond example AI for workspace order optimization you know trying to facialize products do you have a are the models today sort of equally good at all different things or do you have a sense as to like what the models are best at and where they could improve I I think the models today I I'll I'll zoom out and give a general answer of what I think the models do very well today right maybe that's probably specific so I don't upset any product managers anywhere but but what I would say the you know the models are very good at reasoning understand given context and it's it's it's very good at that where I think they can be a little bit better is and you know it's obviously we want to always limit",
        "start": 1197.12,
        "duration": 2620.158
    },
    {
        "text": "managers anywhere but but what I would say the you know the models are very good at reasoning understand given context and it's it's it's very good at that where I think they can be a little bit better is and you know it's obviously we want to always limit idea of becoming a little bit more it's just like people I would say is becoming more self-aware right as in you don't need to give an answer if you don't know something say you don't know it's something we tell our kids and people meetings, right? So, don't feel like you the idea of like you have to provide an answer needs to probably be minimized a little bit. And that's probably where I think the models in general probably need to get better at in my mind. And do you ever see them say I don't know or is that still there still kind of I still I when when the context is off, they're better at it. But most than not, it tries to connect dots that don't need to be connected in my mind sometimes. Yeah. Yeah, it's like the the friend who's read everything and Yes. and does seem like they always have a response. Maybe they don't, though. Exactly. Oh, I know how you feel. It's another example of that. Yeah. Oh, yes. I know how. Yeah, sure you do. AI model. Okay. I I said we were going to get back to this. I want to talk a little bit more about what's going on inside your company. So, you actually have an initiative where you've tasked a good chunk of the company to create their own agents. And we're kind of coming at this moment where where we have the surge of people building their own some on you know Mac minis and setting them loose in the world. and so I'd love to hear an update from you about how that's going. Well what we did actually is we we have not tked people to build agents. Okay. What we have told them is B we are going to be grounded in AI because if you're going to be consulting with our comp with our clients we want to be lead by example and show use cases that we actually want to show them because what we want to show is have our client CFOs meet with our CFO and say how do they you know close books and how do we integrate same thing with our finance team our client success teams all of that the visualization right so what we have really it's one of the ways that I can think about how do you accelerate the learning curve Because most people right this is new to a lot of people including our own co-workers internally I mean you know I you know so the way we are trying to do this right",
        "start": 1329.6,
        "duration": 2863.518
    },
    {
        "text": "one of the ways that I can think about how do you accelerate the learning curve Because most people right this is new to a lot of people including our own co-workers internally I mean you know I you know so the way we are trying to do this right of the things that we do employee feedback with our companies annually and you know one of the things people are like oh you want us to get all certifications and everything but give us time so on Friday afternoons we don't have any meetings so we have block learning blocks and I will say I'm very proud of the fact that people actually have taken that and and they most of them are geni certified in our company at this point right Google's courses and certifications that it provides and what we have seen right the I so we asked people to like you know you don't have to build this yourself what we want is you to think about the things that the use cases that you go through where you think this technology now can be applied so we actually did in I you know we had our company outing in Austin and most of our company ended up do in a hackathon along with our developers and our practice leaders and they work through a few of the use cases that we have and then we are going to use the next few months to go and implement this just like we tell our clients how to implement it right look like all things it's a question of prioritization right and we went through three of the use cases in Austin and there's about 20 more that's behind it right and so but the coolest thing about this is you now realize there's so much opportunity to be unlocked at this point and and the people are thinking about it the right way and you know about how to solve things that people usually don't like to do on over and over on a day-to-day basis right I mean you know like I don't want to create a power you know a Google slide every time and I want to be able to have a starting point that just it's more conversant with us so that is one thing that we have done internally the other thing I also say here is this is you know this probably you know not that much of a surprise But we are a software provider as well, right? We we have GP panel which provides you know workspace automation and management software for all of our workspace clients and we use you know generative AI to actually accelerate our road map you know our code development in our software development life cycle process and which has led to like acceleration and it it started last Q4 and we're seeing the productivity",
        "start": 1454.32,
        "duration": 3130.0779999999995
    },
    {
        "text": "software for all of our workspace clients and we use you know generative AI to actually accelerate our road map you know our code development in our software development life cycle process and which has led to like acceleration and it it started last Q4 and we're seeing the productivity are the kind of things that we see a lot of that's happening operation ation ally as well as our own software development. you know and both of them it's been very very useful and productive for us. Yeah. Okay. Fascinating. All right. Let me ask you one last question here because you we've talked a little bit about it but I think we should go a little bit deeper. Sure. you're talking about how you're working to implement AI in workspace and all this different these different knowledge work tasks. How do you think AI changes knowledge work economy? That's a that's a very broad interesting question. I mean, can you elaborate a little bit more when you talk about when you say the impact, what do you mean by that? Like, yeah. No, thanks thanks for clarifying. I I think that like I wonder how our workday changes, how the workplace changes as we include more and more AI into it. We won't hold you to it, but I, you know, dream a little bit. Look, I think I I kind of have been touching on this throughout this conversation, right? Yeah. , look, I think the the doing more with less is not going to end anytime soon. Okay? I mean, you know, even though we're grow, you know, we're hiring, but you're also seeing some I don't think it's all AI related, it's people related personally, but that's a different conversation altogether. But within the work space, right, within the workday, how it changes is this for me. So, I'll can give you a tangible example of this. We had an off-site in Q4 to start our planning for 2026, right? We knew what our strategic objectives were and that you know enough board meetings and you can say oh now we're going to convert that into some OKRs and it's going to the word smithing. We actually use Gemini to actually feed this into it. It we actually fed this into our plans for 2026 and the OKRs by department aligned with our overall strategic objectives for a three-year time zone and the 2026 plan. We did this in one hour. Amazing. So it is something that that is that is incredible, right? That's tangible and we actually showed the board about how we did that that process that is pretty cool. So yeah, it is pretty neat. So yeah, you know, it's interesting because there are some organizations that are out there that are like, do we do this? Do we not? And I think being someone who's leading a company who is so far forward in this, you don't really have",
        "start": 1588.4,
        "duration": 3395.4359999999974
    },
    {
        "text": "yeah, it is pretty neat. So yeah, you know, it's interesting because there are some organizations that are out there that are like, do we do this? Do we not? And I think being someone who's leading a company who is so far forward in this, you don't really have free. Yeah. I it's one of the reasons I work in a smaller organization, right? There's not we we can do a we are the one advantage that we have as a 100% company right is we can move fast and we can adopt technology faster and it just what that is advantage we have and we want to be we always never want to lose that and this is such a transcendent you know thing that is happening in our in our in our world I mean so awesome to be part of it right you know for all of us I know it's scary but it's also pretty exciting that you know you can take advantage of it and also use the experience we have as an organization, the the the tribal knowledge we have and use that to accelerate this fast. That's how we look at it. So, it's pretty exciting. You know, I think I'm also a I'm a nut for change. So, you have to be in this industry. All right. I love it. We are a growth equity back company and that's that's what they pay us to do. So, this is great. So, yeah, totally. If people want to learn more about Promeo, where do they go? Well, there are a couple of things, right? You can go to our website, promeo.com. We and then we're on follow us on LinkedIn. We we you know we provide a lot of blogs and then we you know and I allow to do a a plug. We have one of the best ISV u you know platforms that we have for Google Workspace. Gpanel.io is it own website where we have great tools ROI tools and everything as well. And yeah and our goal is to be integrating Gemini into you know our G panel so you can have conversion workspace administration you know right with with our which is a nobody wants to be writing scripts anymore right we want to be able to interact with it directly with GPA already does it today but you know we also do you know and then talk to look for our services blogs and our you know we are we are pretty our team provides a lot of it from our experience of clients so yeah please do okay good stuff Carryapuri thank you for coming on the show. Great having you. Thank you, Alex. I appreciate it. Yeah. Talk to you. All right, everybody. Thank you for listening and watching and we'll see you next time here on Big Technology.",
        "start": 1725.84,
        "duration": 3636.637999999998
    }
]