[
    {
        "text": " OpenAI is raising $50 billion. What happens if the funding runs out? Ads, meanwhile, are coming to Generative AI and Apple is developing an AI pin. That's coming up on a Big Technology Podcast Friday edition right after this. Welcome to Big Technology Podcast Friday Edition, where we break down the news and our traditional, coolheaded, and nuanced format. We have a big show for you today. We're going to talk all about the massive fundraising that OpenAI is reportedly engaged in. They want to raise $50 billion. [music] Also, right after we went off the air last week, OpenAI said, \"Guess what? It's advertising time.\" So, we'll [music] discuss the implication of ads in Generative AI chatbots. We also have an idea of what those ads are going to look like. And then finally, we'll spend a bunch of [music] time at the end talking about Apple developing a new AI wearable. according to reports an AI pin. is are they going to bring the humane team in? I don't know. We we'll find out. Joining us as always on Fridays to do it is Ranjan Roy of Margins. Ranjan, great to see you. Welcome back to the show. It's good to see you. I'm very excited to talk about Siri and all these other things. But first, I have to ask, where are you in the world right now, Alex? So, I am in my hotel room in or really a kind of an apartment in Davos. , I've just wrapped a massive week. This is the seventh podcast I've done in four days. , six of which are actually going to end up on the big technology feed. Three of which or yeah, three of which including this one are already there, including the Cristiano Oman Qualcomm CEO episode, the Demis episode, which just went up and now we we're talking. It's been a busy week. It's been a weird weird Davos. , I think that like this is the globalization conference and you've had Trump, you know, coming in saying he wants to the people in Iceland love him, but I think he meant Greenland and , you know, obviously there's that was one of the big things that have hung over the conference. Some of members of administration of his administration talking about not globalization but separation. but I would say for our purposes really the most interesting thing is the Davos is a basically a tech conference right now and you walk down the prominade and you basically see houses set up by every single tech company. you know there's Amazon is here, Facebook is here, Google is here. It's where I did the Demis conversation. LinkedIn is here. Anthropic is here. Not too much of a presence from OpenAI but they're certainly here as well. , and then you know there's a big presence from the Gulf States here as well. So Qatar has a big house. The Emirates has a big house.",
        "start": 0.08,
        "duration": 318.8000000000001
    },
    {
        "text": "Demis conversation. LinkedIn is here. Anthropic is here. Not too much of a presence from OpenAI but they're certainly here as well. , and then you know there's a big presence from the Gulf States here as well. So Qatar has a big house. The Emirates has a big house. like a one. Have you been to the Have you been to the Qatar House? I want to go to the Qar house. That's Well, I didn't go there. I don't know what's going on in the Qar house, but that's where I want to go. I think they are they are very interested in investing in tech. Maybe Sam Holtman is not even in the Qar house, but he's gonna make a stop there because he's definitely on a fundraising kick right now. But a fun fact, I did go to Qar over the summer last year. I spent a day there basically as a stopover on Qatara Airlines between Nepal and Germany and got a chance to take a tour and yeah, I I would say so. Listen, Qatar is a small enough country. Over was it over 24 hours in that in that range? In that r Okay. Okay. I'll give you Qar. I'll give you And Qatar is a small enough country you can see a lot of it in a day. And in fact, we saw a good chunk. We got a we took a tour of the north which is a lot of empty desert and some ruins and actually a defunct fishing industry that they had to shut down. by and large, there's still a couple fishing boats because they found natural gas in the ocean and that was that and that's one of the main sources of wealth. So yeah, their house here actually was of the colors of their flag which was very interesting. well, I'll tell you one one Davos observation. So we got some questions in the Discord. Who did you see and you know rub shoulders with? And honestly, I was really focused on the podcast. I didn't go to any parties. I got a chance to meet with a lot of great people here. that's kind of how I like to do things. But the most interesting thing to me here is it's one sidewalk. So as you walk up and down, you're just bumping into people as you go. And sometimes that means meeting people that you know from, you know, the the work world or friends from different lives. And sometimes that means literally bumping into people because some countries have people walking on the right side of the sidewalk as their custom and some people have, you know, some countries have people walking on the left side of the sidewalk as their custom. So you have way too many people here on a very narrow sidewalk and there's no agreed upon direction to walk back and forth on. So you're literally like slamming",
        "start": 159.92,
        "duration": 587.3600000000002
    },
    {
        "text": "some people have, you know, some countries have people walking on the left side of the sidewalk as their custom. So you have way too many people here on a very narrow sidewalk and there's no agreed upon direction to walk back and forth on. So you're literally like slamming the people as you imagine in a place like this are on their phones. So that to me has been the big takeaway. We need a universal left and right way of this is why this is why globalization was never meant to be because people couldn't all agree which side of the sidewalk to walk on. So actually on that what is the globalization vibe right now? Is it has everyone just moved on to AI right now or is like the World Economic Forum in Davos still selling the dream of a integrated hyperconnected world? Well, remember that was that dream was largely sold and orchestrated by a man named Klaus Schwab who has plenty of detractors and people who don't like this move towards globalization but anyway and he doesn't seem like he was a very nice person at all. and he actually ended up res resigning because of a nasty scandal. so this is now effectively like the Larry Frink Davos. So that and Elon Musk is here today. I think Zalinski's made his way here. So he I think there's there there's talk that Davos might be held in a different city like Dublin or Detroit or Jakarta in the future which you know that would be welcome because there's way too many people in such a small ski town. it's it's overwhelmed without a doubt but that the like I said at the beginning the vibe is weird. And one last thing, I think the sidewalk problem is an argument for globalization. Maybe the best argument for globalization because if the world can come together as one, at least we might be able to agree on which which side of the sidewalk or street to drive on, walk on or drive on. I believe I believe it's not over yet, folks. Globalization and world harmony are still in your shot as long as we all learn to walk on the same side of the sidewalk. Okay, one last one last note, then we can go and talk about OpenAI's fundraising. Lot of snipers and a lot of machine guns being moved moved about. Military vehicles moved about this one block. Yes. Lots of snipers. Lot of machine guns. Snipers on the rooftops just hanging out. Yes. Yes. See many that Yeah. When I'm hanging out at the guitar house, I want to make sure I have my own personal sniper just up on the roof just keeping an eye on me. That's all. You might need one because your your criticism of Siri is really not making you many friends. We'll get to that at the end.",
        "start": 295.6,
        "duration": 893.0400000000001
    },
    {
        "text": "guitar house, I want to make sure I have my own personal sniper just up on the roof just keeping an eye on me. That's all. You might need one because your your criticism of Siri is really not making you many friends. We'll get to that at the end. blood. [laughter] He's a powerful man. Ron John, don't cross the guy. , all right. Do you think Sam Alman has a sniper as he tours the Middle East as part of this fund raise? And that'll be my segue. , I think there's certainly some security involved for sure. and if he makes this fundraising deal go through, there's going to be a need for even more security. So, now that we've done our our Davos prelude, let's talk about what's actually happening in the world. , all right. Bloomberg says, \"OpenAI's Altman meets Middle East investors, Middle East investors for $50 billion or $50 billion round. OpenAI chief executive Sam Alman has been meeting with top investors in the Middle East to line up funding for a new investment round that could total at least $50 billion.\" Altman recently visited the region where he spoke with investors including some of the leading statebacked funds in Abu Dhabi. The chat GPT maker is looking to raise 50 billion or more in the round at a valuation of about 750 billion or 830 billion. I mean there's two reactions to this that I have right away. First of all, I wonder if the company can keep raising money like they're at the final boss which is the Gulf States. that's you you don't really have many places to go until after you tap the sovereign wealth fund. So it looks like he's doing that. So that's one question. Are they going to be able to keep fundraising? And the other question is do these do the size of these rounds put expectations on this company that will never be able to be met? What do you think? Ron John, I don't think the size is going to be any more of an issue that it than it already has. again like 50 billion at a 800 billionish valuation. I mean for the amount of money they have been raising this almost feels like a not unreasonable amount of money. I think more importantly though is what you were saying in terms of like really focused on the Middle East and sovereign wealth funds as you said that's always been a very specific type of fundraising strategy you know when it's when you've tapped out of a lot of other sources. So on that side, I think it can be indicative of is there or at least raises the question is there fatigue among all of those early investors or more traditional sources of funding. But by the same token like I mean MGX and all these other funds have been really focused on modernizing the economies and",
        "start": 450.56,
        "duration": 1181.0400000000004
    },
    {
        "text": "can be indicative of is there or at least raises the question is there fatigue among all of those early investors or more traditional sources of funding. But by the same token like I mean MGX and all these other funds have been really focused on modernizing the economies and the Middle East. So I think I think on that side it's it's not unexpected at all. What what do you think the signals? I think this is the thing like they're going to eventually have to make enough money to justify this type of valuation. I mean, think about it. I think Saudi Aramco was the largest the largest IPO ever and they brought in 40 40 billion in that IPO. And man, they legitimately are printing money. their oil comes out of the ground. , so we're really going to have to see OpenAI be able to make the money to justify this and we're going to get into that in a moment. , in terms of where that money is, you know what? Actually, screw it. Let's go right to it right now because this is important. , as they're going through this fund raise, , very interesting thing happens. They put a they put a blog post out by Sarah Frier, their CFO. she writes, \"OpenAI, a business that scales with the value of intelligence.\" She writes this, \"Looking back over the past three years, our ability to serve customers as measured by revenue directly tracks available compute. Compute grew 3x year-over-year or 9.5x from 2023 to 2025. While revenue followed the same curve, growing 3x year-over-year or 10x from 2023 to 2025. This has never before seen growth at such scale and we firmly believe that more compute in these periods would have led to faster customer adoption and monetization. So basically the argument is we will make more money if we have more compute because the limit right now is not interest on behalf of customers to use the technology, it's our ability to serve it. And we've talked a lot about how you know there are these rate limits and people have been frustrated by them and maybe they would use the products more if they weren't rate limited. and OpenAI is basically saying look you follow our compute our our revenue tracks directly with it. Therefore adding you know many you know $50 billion potentially they haven't I don't think they've confirmed that number is a good bet that we will make the money. Although the money of course, you know, it would be funny if they also had another chart what they paid for that compute. because the money is certainly still a drop in the bucket compared to the compute they're buying. So what do you think about this? Obviously, it's time to to the fundra. No, no, I I I agree because it was I think it was an incredibly well-crafted corporate communication because it laid",
        "start": 595.839,
        "duration": 1510.7200000000005
    },
    {
        "text": "money is certainly still a drop in the bucket compared to the compute they're buying. So what do you think about this? Obviously, it's time to to the fundra. No, no, I I I agree because it was I think it was an incredibly well-crafted corporate communication because it laid one ratio of growth in compute to revenue in terms of like 9xing and and on face I agree it sounds nice. It sounds really good. It's saying like we're actually scaling compute in parallel with revenue. But you're right, it's we know they're losing ungodly amounts of money. Even this week we saw anthropic I think it was 5.8 billion they're on pace to lo 5.6 billion last last year is now confirmed is what was lost. So like and we everyone is knows this and has been talking about it that these companies have been burning ungodly amounts of cash. , so when you dig in one level deeper, I think it doesn't really answer the question, but it still I thought was a pretty kind of craftily put together argument of why they actually are okay. But yeah, it doesn't it still doesn't add up overall, right? I mean, eventually they're going to have to start making money, right? That's the thing. Like, how many times can they go back and fund raise? They can have this. Okay, let's say they get this round from the Gulf States. they could probably go back to the Gulf States one more time for a mega round, right? So, let's say a hundred billion. , if the Gulf States are happy with the investment that because they have that money that maybe values them at 1 trillion, 1.25, 1, one and a half and then eventually you have to go to the public markets, right? So, how many So, it sounds like maybe they're looking at being able to raise ballpark 250 billion more and you know what what happens if they're not able to like and then eventually you got to start making money right like eventually you have to be a business as businesses go that that does seem to be the case and actually I will be in Abu Dhabi next week myself not raising $50 billion but speaking at the shop talk Lux conference and I wish maybe I'll finally somehow get go to the Abu Dhabi house if not the guitar house and get some kind of fund fundraising interest. But but I think in terms of this like yeah having to make money monetization it the the interesting part is it's clear that they've made that a much bigger part of the conversation. We've heard the story enterprise personal devices AI cloud they just made a big announcement I forget his name but the guy who came over from thinking machines under cloudies Barrett Zaf he is actually going to be heading enterprise which has been stated as one",
        "start": 762.56,
        "duration": 1814.9589999999994
    },
    {
        "text": "part of the conversation. We've heard the story enterprise personal devices AI cloud they just made a big announcement I forget his name but the guy who came over from thinking machines under cloudies Barrett Zaf he is actually going to be heading enterprise which has been stated as one I think it's clear that all the I mean actually it's funny almost like the idea that we just get to ADGI and it all figures itself out. They are trying to present themselves as a proper business this year. So in 2026 we're going to see is it real or not. And I think it's going to have to be for this to actually kind of continue as it is. I I I disagree Ron John. I think it's, you know, 2026, they're still going to skate by on on fundraising, but maybe I'm crazy. Eventually, they're going to have to make a profit, right? Like even if you are okay to make a loss, you don't have infinite sources of money. They're going to have to eventually make a profit. I don't, you know, it's a question right now. Obviously, they have this belief that if they're, you know, their their revenue is limited by compute, then they should get more compute, so they raise money to buy it. But, you know, they have to let's say demand continues to go up. I mean, they're going to still, you know, serve more people, make more money, but lose more money. Like, eventually the math has to work, right? I mean, yes. You're trying to bring a little rationality to a conversation that has not happened to me in a long time. So, I this Davos has changed you, man. Davos has changed you. But, , I think actually separate. So there's the actual like can OpenAI make money based on like all these kind of peripheral business models, but even from a competitive standpoint, I just saw a stat that Gemini is now at 22% of consumer AI usage, up from 13.5 just a quarter ago, which was their code red. I mean, we all know Claude code has gotten a lot more hype and excitement reasonably so than open AI. like open AI has not we've talked a lot about this this is my own the company I worked for writer like kind of autonomous knowledge work claude code manis to me this is the biggest most important part of trend in 2026 they don't really have an offering in this so I'm actually almost more interested in how they're planning to address all this competitive pressure versus on a straight chat GPT level can they make money or even chat GPT pro subscription ions maybe a little enterprise whatever else like they they I don't know they have to land or show promise in one of these additional business models very quickly I think for them to for them to raise that next $250",
        "start": 917.76,
        "duration": 2124.7200000000003
    },
    {
        "text": "they make money or even chat GPT pro subscription ions maybe a little enterprise whatever else like they they I don't know they have to land or show promise in one of these additional business models very quickly I think for them to for them to raise that next $250 like they have to show something all right well like you know user numbers is one thing right we always knew that Google would be able to you know juice its user numbers because it can bolt on its AI products and its standard products. but usage is this that you cited. That's the problem, right? Because as soon as open open AI, you know, for a long time, far and away had mo the most usage of any AI bot. And now it seems like, you know, they're still far in the lead, but that is being cut. It's not like a Google Bing situation, right? Like Google's making real real headway here. And again, they have the distribution. So just take us to 2027. and they have it they're let's say they're IPOing they're they're going to have to still have the product lead and the lead is shrinking. I was just on CNBC a couple minutes ago. I was speaking with the anchor Kelly Evans about this. I was like the product is in the lead and she said it's shrinking and you know that lead is it is shrinking and of course like is a AWS's lead is shrinking but AWS is still you know far and away the leading cloud provider. They're doing great. they're underpinning Amazon's entire valuation. So having the lead matters. but it's it's far from the like one horse game in consumer that it was not long ago. So what do you think that means as they try to IPO? Is that going to cloud their story? Oh definitely. Which is why again I think and I think what were we saying last week before it's is it the foundation model or the product and then we introduced is it actually the business model. they have to figure something out cuz it it's like again at a from a user perspective the switching costs are so low in any of these chat bots so far now everyone is talking about memory and context and that's going to be the moat but right now there is no moat like from a actual user experience just consumergrade chat AI is all pretty good like I mean people have different uses for different chat bots if you're an avid user otherwise maybe and as you said Google has distribution so I think user perspective is dangerous so they have to show we can make a lot of money doing drug development and pharmaceutical development and launching their own I think they're it was rumored they're going to be launching an AirPods type device. We're going to get into the",
        "start": 1076.16,
        "duration": 2424.4010000000003
    },
    {
        "text": "so I think user perspective is dangerous so they have to show we can make a lot of money doing drug development and pharmaceutical development and launching their own I think they're it was rumored they're going to be launching an AirPods type device. We're going to get into the that or I did see that. Yeah, that that that that's the rumor that it's going to be their first wearable. so that will be interesting. And yeah, we'll talk about the wearable side when we get to Apple in the second half. But one thing about this, I don't think memory is a mode. Remember, it's largely text. So here's a question for you. Let's say I'm in chat. I want to switch to Gemini. What if I just said, \"Print out everything you know about me. Use as many characters as you need.\" And then I copied that and I pasted that right into Gemini and be like, \"This is your memory. Let's go.\" I'm gonna be everyone try it. I'm going to try. I like it because I was just about to say, you know, like are they going to have some very defensive lack of export functionality in order to remain defensible, but it's a chatbot. It has very big context windows. We can drain their compute, too. We can just use up all just every word I've written to you. JBT print out and please put it in a format that will be legible maybe markdown for Gemini and I'm trying that after this can I I'll be honest I've done it before I mean I not I have asked it to print its memory but I also used I think I used Claude as a diet coach and then I copied and I copied and pasted the entire discussion and I dropped it into OpenAI because I thought OpenAI's memory would be interesting to experiment with and then I made open AAI the diet coach and guess what? It picked up on my tendencies. It picked up on the advice it should give right away. So, it's very No, I mean, you're right. You're right. It it it's not it can't be like singular part of your life context and memory. It has to be like knowing you inside and out and your companion and maybe lover, but it it's got to be it's got to get to that level. Otherwise, switching costs are too easy. The chatbot being your love partner is the only moat. I'm convinced is the only moat. Love is the only moat. Memory is not a moat. Only love is. Love is that honestly another great tagline that we've produced here on the Friday show. , [laughter] all right. So, so, so it has to get its business in order. And here come the ads. Last week we left off advertising. You know, who's going to be the company that gets advertising right? You said",
        "start": 1228.64,
        "duration": 2715.599999999999
    },
    {
        "text": "great tagline that we've produced here on the Friday show. , [laughter] all right. So, so, so it has to get its business in order. And here come the ads. Last week we left off advertising. You know, who's going to be the company that gets advertising right? You said after we signed off, OpenAI started to experiment with advertising in Chad GPT. This is from Wired. Ads are coming to Chad GPT. Here's how they'll work. OpenAI plans to start testing ads inside ChatGpt in the coming weeks, marking a significant shift for one of the world's most widely used AI products. Open eye says the ads will not influence chat GPT's responses and that all ads will appear in separate clearly labeled boxes directly below the chatbot's answer. For instance, if a user asks Chat GPT for help planning a trip to New York City, they will get a standard answer from the chatbot and then they might also see an ad for a hotel in the area. And these are going to initially go to the free users and the $8 a month go tier which is a new thing. the opening I gave an interesting example of what the ad could look like. you're looking for a some you're looking about you're looking up some information about Santa Fe and then underneath in a clearly labeled sponsored section they pop in a ad for a cottage rental in Santa Fe. Here's the cool thing about this ad. You can then tap the ad and start talking with the ad to you know to help book your trip. So it sparked this notion but then you can use generative AI to go even deeper. That's very engaging ad. So first of all Ranjan is this kind of what you expected cuz you predicted that they were going to go out first and what do you think about the way that they're structuring this? Yeah, I think and the reason I've been confident in this is because I work deeply in agentic commerce and trying to understand like what this is going to look like chatbased like suggestions like this that can have like a sponsorship basis make all the sense in the world. I do think someone will nail this model and I think everyone will be following and whether it will be Gemini or OpenAI will we'll see but but again like I use chat GPT all day long for travel planning for suggestions on where to eat and whatever else like those kind of things. So there's so much commercial opportunity there. I think they recognize it even like you know Fiji Simo had said like people trust Chat GPT for many important and personal tasks. It's crucial we preserve what makes chat GPT valuable. They have to get it right because the moment they feel interruptive it's a problem. Oh, and actually last week we said Meta potentially is in the best",
        "start": 1375.6,
        "duration": 3027.840999999999
    },
    {
        "text": "had said like people trust Chat GPT for many important and personal tasks. It's crucial we preserve what makes chat GPT valuable. They have to get it right because the moment they feel interruptive it's a problem. Oh, and actually last week we said Meta potentially is in the best has proven that they can just shove ads throughout the feed and everyone's happy and they can make really good ads. So, I think Chad GPT has to nail that experience otherwise it's a it's actually another competitive pressure on their user growth because it's not going to be it's going to make the product less useful and sticky. And and so here's the the question is you know is the thing that I saw well the thing that I saw on social media that made me laugh after we saw this news was someone tweeted that if openi really believed AGI was around the corner why would they be bother you know why would they be using ads like they're clearly going to be much more disruptive and useful forms of this technology so why do advertising And I brought this up to Dennis Sabis this week at Davos. He had a this was one his comments on OpenAI were pointed much more pointed than I anticipated. He said I think I think those are tells. I think actions speak louder than words. Going back to the original conversation cuz we started this way. Going back to the original conversation we were having with about Sam and others claiming AGI is around the corner. Why would you bother with ads then? And I I pressed him. I said, \"Well, you know, Demis, how about you?\" Right? because there's been some discussion that Google is going to do ads. He said, , we have no plan at at no plans at the moment to do ads. If you're talking about the Gemini app specifically, I think we're obviously going to watch very carefully the outcome of what ChachiPT is saying they're going to do. I think that has to be handled very carefully. Yeah, I I do kind of find it a bit rich that Demis is saying this when Gemini is adfunded. It's just not showing ads. It's just that you are living on top of a massive advertising monopoly and are able to actually fund the entire project and not have to show ads just yet. But I think I actually I'm surprised he was so aggressive about it too because remember Google's biggest challenge is the disruption to their monopolistic advertising model. and they have to figure out some way to actually turn what existed in search into what's going to be existing in GEO or LLM search or whatever you want to call it. So like I I I was surprised he kind of was taking that stance. It actually made me curious or think again organizationally like is he so sheltered from the business",
        "start": 1535.919,
        "duration": 3324.2410000000004
    },
    {
        "text": "search into what's going to be existing in GEO or LLM search or whatever you want to call it. So like I I I was surprised he kind of was taking that stance. It actually made me curious or think again organizationally like is he so sheltered from the business story and usage story? what do you think? Do you think he's just not no one's Sundar is not tapping him on the shoulder and saying make sure you're gonna have to make a bit of money at a certain point? this my guess would be that there is some sort of debate going on within Google that there is a group that really wants to roll ads out. In fact, and I brought this up to Demis on a recent earnings quarter Sundar talked about how they have some ideas about how you want to do advertising in in you know generative AI applications. So clearly it's a discussion within the company and I think the product side is probably just like let's hold off as long as we possibly can. and especially think about this maybe if if they if they if open AI goes and loses trust because of the advertising and then people copy and paste their their [clears throat] memory and drop it into Gemini. Yeah. As we're all going to do after this episode. Yeah. God. well you don't anyway I'm not advocating for this but you know then then that's a real advantage for Gemini right on the product side and remember they're in this product battle like all the time in tech you have companies that sort of compete based off of what they can offer to users whether that's incentives or you know the best possible product experience and then once the battle's won then they kind of muck it up with ads and they raise their prices and I think Google's been in these battles a couple of times and I think that must be the strategy I disagree though because I actually think to get to no one knows what advertising is going to look like exactly in AI and I genuinely believe there will be a new format on par with what search advertising was, what social platform advertising was. Each of these were like complete transformations of what advertising is. And I think it's going to be the same within an AI chat experience. And I guess either you just watch what others are doing and follow once someone figures it out, but it can be too late. And I think I actually would take OpenAI's approach here of starting small, experimenting, getting it right versus the idea that you're going to just wait it out for everyone else to do it. Because I think like Facebook invented social platform, right? They they mastered it. Like they didn't wait. they led the way and that's what gave them dominance. Google did",
        "start": 1686.88,
        "duration": 3617.2010000000005
    },
    {
        "text": "experimenting, getting it right versus the idea that you're going to just wait it out for everyone else to do it. Because I think like Facebook invented social platform, right? They they mastered it. Like they didn't wait. they led the way and that's what gave them dominance. Google did rather be testing experiment and figuring it out versus just trying to pretend it's not going to be a thing. But it wasn't the business model like Facebook didn't win social media because it created the social ads platform. It won because its products were the most sticky and it found a very effective way then to monetize. I think that this idea and Demi said it like very very clearly and by the way this is all from my end. We didn't talk about this other anything other than what he told me in the conversation. So I don't have any like deep insights about this or reporting. This is all speculation on my end. But he said like we are going to watch and learn what OpenAI is doing. And I don't think Google will pay a big penalty for being late because remember they can copy the format and they're Google. they have better data than almost anybody and they can apply that and copy the format. you know and and maybe the better example here is what Facebook did to Snapchat, right? It's you watch your smaller competitor or your competitor and then you copy the best stuff and let them make the mistakes. is no. But see, I would actually again push back like I and maybe it's like it's the business person in me, but it's like I think the Facebook innovating on the business model within advertising like infeed sponsored content kind of like ad bidding systems related to infeed sponsored ads. like that whole system that they built I think is what made them truly powerful cuz again when they IPOed remember there was like a lot of worry about losing money and there was like they they could have been in a position where imagine Mark Zuckerberg acquires Instagram because but they're not making any money and there's a massive investor backlash like there's so many kind of like historical moments that not having a cash machine kind of underneath the business would have meant a great product would not work. And actually talking about Snapchat, they have shown that you can't just replicate a business model even if if you have massive user engagement and growth. So I think I'm going to go with I'm still taking Open AI in the ad battle. You sound like you might be leaning Gemini in the end. Yeah. I mean that's the way I was. That's where I was last week and that's where I am this week. So let me ask you Yeah. Yeah. Well, well, this this will be a running this is our new product and",
        "start": 1836.799,
        "duration": 3915.7610000000013
    },
    {
        "text": "you might be leaning Gemini in the end. Yeah. I mean that's the way I was. That's where I was last week and that's where I am this week. So let me ask you Yeah. Yeah. Well, well, this this will be a running this is our new product and ad. It's less exciting, I'll admit. Okay. Let let me ask you one last question on this segment, then we'll go to break. , OpenAI, Sam Alman in particular, has said that advertising is sort of the last resort for a company. , put it into context. This is a company again trying to build AGI and you know if Sam believed that at one time what do you think it says about the company that is doing this now? I think it should again as per the earlier conversation I think 2026 they have to show promise on the revenue side and beyond subscriptions. So I think he has to I think like what all the AI cloud personal devices and whatever else is going to take time. So this is the most direct way. But I genuinely think if you're Sam Alman and next time you're on he's on the pod you should I hope you ask him like I think I would believe that my AI system can deliver great ads better than anyone else and that will bring value to people's lives and that will bring value to businesses and it will kind of keep just thinking about travel and hospitality like hotels got to find you. You find the right hotel, you book with them, they make money on you, they pay OpenAI to help find the customer, everyone's happy. So, if you truly deliver great personalized advertising, which potentially I think they can, I like I'm surprised he's so kind of cavalier about like it's, you know, last resort. It's not like kind of a long time ago. Yeah. Yeah. No, but but I I want him to come out and just frame it as we're going to deliver you the best goddamn ads you've ever seen and you're going to be thanking us for more ads and and again, Instagram has certainly shown that's possible. I think if I was him, I would start taking that that kind of line of of thinking on the public or public speaking on this. So, the best argument that I heard in favor of OpenAI's ad plan came from Brett Taylor, the OpenAI chair, , whose episode I recorded here at Davos. It'll be live on the feed in a couple of weeks. , but I'll spoil this part for people because I think it's pertinent and worth talking about. He basically said when you're a company like OpenAI, , people are going to get a lot of benefit out of it and you're not necessarily cut in on the benefit all the time. Somebody uses GPT 5.2 too pro to like solve some major business",
        "start": 1988.159,
        "duration": 4229.840000000005
    },
    {
        "text": "and worth talking about. He basically said when you're a company like OpenAI, , people are going to get a lot of benefit out of it and you're not necessarily cut in on the benefit all the time. Somebody uses GPT 5.2 too pro to like solve some major business month for it. So you got to find ways to make money, you know, and this is one way that's shorefire and has proven itself. So I think that's a pretty good argument. Yeah, I I think it has to be diversified in some way, especially on the consumer side. But yeah, I think we're going to this is going to be a bigger topic. I think we're all going to be seeing ads and this isn't going to be a Netflix pay five bucks extra to avoid ads. I think it's too valuable an opportunity for them to actually try to gate or like tier it out maybe at the $200 level or something like that, but I think we're all going to be getting sponsored recommendations from our digital companions very soon. Okay. Well, , let's go to break and after the break, I definitely want to talk a little bit about Apple because Apple I predicted just like so your big prediction this year was that, you know, the agent thing is going to break out. , my big prediction this year was that Apple's going to have its best year ever. , and it's certainly looking like that's the case. So, let's talk a little bit more about Apple's revived AI strategy right after this. And we're back here on Big Technology Podcast Friday edition with Ranjan Roy of Margins. Ranjan, big news. , Apple Apple's going to pin. Okay, maybe they won't, maybe they will, but let's talk about the story. The information says Apple is developing an AI wearable pin. , the pin is going to be the size of an Air Tag that is equipped with multiple cameras. Wow. A speaker, microphones, and wireless charging. The device could be released as early as 2027. Such a product would position Apple to compete more effectively with OpenAI, which is planning its own AI powered devices, and Meta, which is already selling smart glasses that offer access to its AI assistant. Do you think this is a good sign for Apple? I will give them credit that they're trying new things and experimenting with AI, even though the pin has been an object of much mockery and derision given its early flame outs in a couple of different formats. Humane pin fell so Apple could rise is what the story will be because we've we've talked about this even I'm during the humane pin conversation I think both of us at least acknowledged it was interesting for me the most exciting part of this is I mean I've been saying this for years like the form factor of a",
        "start": 2146.88,
        "duration": 4525.279000000003
    },
    {
        "text": "story will be because we've we've talked about this even I'm during the humane pin conversation I think both of us at least acknowledged it was interesting for me the most exciting part of this is I mean I've been saying this for years like the form factor of a kind of like the beall end all of devices has gotten really boring. So, anything that innovates it, I think it's why the meta ray bands have been so interesting and exciting for me. So, I'm team pin. Someone's going to make a useful pin. I actually was looking at there's like a something called plaude. It's like a card size dictation thing. , I don't know. like I I dictate all day long on my AirPods with my iPhone, but I I think the camera side what exactly it's going to try to be doing, it's all it's all interesting to me. So, I am excited for the pin. All right, here is the thing that really stood out to me. , of course, you know, the information story says Apple's development is in the very early stages and could still be cancelled and it's planning to m manufacture roughly 20 million units at launch. Guess how many lifetime Meta Raybands glasses, the most successful quote unquote AI wearable ever has sold. Guess how many units it sold? 2 million. So, Apple is believing that 10 times the amount of people that have bought Meta Rayban's lifetime will want to buy this pin. I don't think it's unreasonable though, 20 million. Again, you call it call it 199 bucks or something. I don't think this is going to be like the $7 million Apple fold folding phone that I will still try to buy, but it's, you know, like this is going to be probably like an entry level. Yeah. So, that's what I'm hearing. 7 million. I'm I'm sarcastic for that standing by that reporting. [laughter] I No, I think if it's an entry-level price again and it's why my lovehate relationship with Apple extends beyond Siri like ecosystem capture is Apple is mastered. So like here's this new device. If it's pretty good at a reasonable entry price, I think they're going to get a lot of people trying it. 20 million is high, but I think it could be I think it could be a winning device. I mean, I like that Apple is trying, right? This is the thing that you want to see from Apple. You want to see initiative and the story actually was very interesting because it shared a number of different AI products that Apple's working on and just seeing it all in context was interesting. So it says Apple's PIN joins a growing portfolio of AI powered products the tech giant has under development including AirPods equipped with enhanced sensors, a security camera, smart glasses, and augmented reality glasses. Apple is also working on a home product",
        "start": 2297.599,
        "duration": 4841.5980000000045
    },
    {
        "text": "just seeing it all in context was interesting. So it says Apple's PIN joins a growing portfolio of AI powered products the tech giant has under development including AirPods equipped with enhanced sensors, a security camera, smart glasses, and augmented reality glasses. Apple is also working on a home product a robotic swiveing base. A design with a heavy emphasis on AI features. That device could be released as soon as this spring. Man, like Apple, the company that once seemed to like ship like one product every bunch of years, starting to sound like Amazon now. The throw spaghetti at the AI device wall and just try to make it work. Yeah, you're right. Do you know I'd forgotten that there are Alexa glasses? Like Amazon really just stuffed Alexa wherever it could find. And like I mean once they put made the Alexa wall clock, it was all over. Yeah. And refrigerator and microwave. But but in reality though, like I think Apple's still got to prove it can make an AI enabled device and we're going to get into what that actually is looking like at the company. But I I have been slowly switching back to Alexa across my house. I had made the switch to HomePods and Siri couple of years ago and now I bought the Echo Show after actually I think what was his name from Amazon listening to your episode P. Yeah. Yeah. Yeah. listen to that. Got the one of the Echo Show five, I think the wall photo photo frame looking thing. , so it's just the it's night and day versus where it is today. So, so make the AI work is going to be critical to any of these cuz you imagine you get your PIN and it functions at the level of what Siri does today and you're just like, now what? Now what? Right. Are are you down with Alexa Plus? It's It's getting pretty good. I have it in my kitchen. I actually talk to it more. It's gotten It's really good at pulling up YouTube videos, I found. So, which is really cool when you're cooking, like, you know, give it a request, music video of something, some really specific Patriots highlights, whatever. And it it it nails it. It gets a right video, starts playing it. You can tell it to stop, get something else. So that asking questions in general, it's it's getting there. It still hallucinates sport scores very weirdly, which should be the most solvable problem, but other than that, I'm liking it. Yeah, it's working well for me, too. I integrated my calendar with it, so I say, \"Hey, what am I doing today?\" And it answers. , I think the thing is just getting people to understand what they can do with these assistants is going to be the hard thing because you know I often just fall back on play some music and well and we'll see",
        "start": 2457.359,
        "duration": 5144.797000000007
    },
    {
        "text": "what am I doing today?\" And it answers. , I think the thing is just getting people to understand what they can do with these assistants is going to be the hard thing because you know I often just fall back on play some music and well and we'll see the dark horse for digital companion? I feel people had the their first oh my god for the digital companion derby listeners Alexa Ron John's Alexa said I'm flattered to be considered for the digital companion Alexa stop please [laughter] digital companion derby well I mean there you go clearly it would be it sound it sounded very eager to help you that was pretty good that was pretty good so [laughter] yeah I got to be careful on any of those kind of prompts right now. But but yeah, overall I think in terms of like new devices, I I'm excited Apple's at least trying. I don't know what they're going to do, but I'm excited they're trying. Yeah. And I was going to say the thing that I I really think is important is the assistant inside, right? And this is sort of what this was what Deis told me about glasses. That was like I went into this interview basically saying I think the headline here is going to be AI glasses. , and and I felt that Deus really answered this this somewhat conclusively about the size of Google's bet on AI glasses because it's massive. He talked about like the various attempts to make smart glasses. And he goes, \"The thing it was missing was a killer app.\" And I think the killer app is a universal digital assistant that's with you helping you in your everyday life and available to you on any surface on your computer, on your browser, on your phone, but also on devices like glasses when you're walking around the city. And I think it needs to be seamless and knows each of those contacts and understands each of those contacts around you. And I think we're close now. He says it's one of the most exciting projects we're working on and it's one of the things I'm personally working on, making smart glasses really work. that that to me was basically a fullthroated endorsement of the smart glasses as the form factor here. And you know, you talked about what happens if the pin doesn't have a you know, has like modern day Siri in it. It's not going to work. And so what Demis is saying is like, yeah, we can make this work. I think the news is that it's going to ship this year. Google's AI glasses. and they believe they have the assistant there. So are you that could be a determiner? Are you team glasses or team pin in the end? What What is the form factor? I don't know. It's really hard for me to to want one of these things. Maybe I'm",
        "start": 2611.599,
        "duration": 5433.198000000004
    },
    {
        "text": "glasses. and they believe they have the assistant there. So are you that could be a determiner? Are you team glasses or team pin in the end? What What is the form factor? I don't know. It's really hard for me to to want one of these things. Maybe I'm better than anything else, which I which makes me excited for OpenAI's device, actually. Yeah, that's true. I mean, they're But we're all so used to them and they're natural. But I remember when AirPods first came out, it was actually not common to constantly see people just walking around with kind of like wireless earbuds and then they just made it totally normal. So I think there I don't know. I I'm team pin even though I currently enjoying my glasses, but I don't wear prescription glasses either. though at certain point I would either have to be wearing sunglasses indoors or have just kind of like fashion glasses. So I think maybe that's what makes me lean team pin. What happens if Apple's pin takes off because it just makes a cool pin and the assistant inside is Siri but Siri as a container for Gemini. So, Apple creates the killer app, but it's Google's assistant or based off of Google's assistant, which is what's happening, isn't it? Yes. Although, we did get we got a good reader email that pushed back a little bit on what I said last week about how like this is Google getting user behavior from Apple. You know, it's possible that Apple just uses Gemini as like a backbone to build its own app and then walls off that data from going back to Google. And I overlooked that last week. So, I thought that was really good listener feedback and just wanted to mention that this week. I think the one thing about the announcement this week around kind of enhancements to Siri, which I would say the winning part of it is it's codenamed Campos, which I don't know. Talk a little bit about about what they're doing. Yeah. So again like let's move beyond what is powering it even though it's reportedly Gemini but it's more what it will be doing and again being able to one of the big things that this reporting lean into is that again that idea of like tapping into data across your phone tapping into apps across your phone to try to leverage that context. That actually worried me a bit because as we've all seen and remember the what's her name from Last of Us who did the ad, Bella Ramsey ads that were like supposed to do all this a year and a half ago I think now. I think that was this a year ago at the Super Bowl. none of it worked. That is a hard problem to solve. like going through all these disparate data sets and trying to like understand or like vectorize them",
        "start": 2758.72,
        "duration": 5754.398000000007
    },
    {
        "text": "this a year and a half ago I think now. I think that was this a year ago at the Super Bowl. none of it worked. That is a hard problem to solve. like going through all these disparate data sets and trying to like understand or like vectorize them accessible is difficult. So like just making one standalone basic experience that just answers some questions for you like start there guys just just make it work. This worried me. I I I've been getting excited after last week and this actually kind of got me a little nervous. No, but this is if I read it right, they're actually going to turn Siri into a chatbot, right? So, I think that is actually the foundation experience that all these companies have been able to build and you'll be able to chat with them. Well, no, no, but but that part it already is theoretically a chatbot like you're supposed to be able to have kind of turns and instructions back and forth. So, so to me I saw it a few places and again here at the exact it's like add features including the ability to analyze oncreen content and tap into personal data and they keep talking about this universal search that right now when Siri kind of does a little bit of web results or pulls up relevant apps or starts like it does it a little bit that getting all of that and doing it very well but again I think that's like a pretty hard problem to solve versus just making just just getting on par with JPT and Gemini and Claude and everything else at the consumer level just making all that work. I think trying to say again I think when is my flight is going to be the question everyone will ask first and it better damn get it right otherwise like they they're going to have some serious problems. That that is a a question that I do not have the answer to right now whether it's with Siri or any app where where when is my flight because looks like mine is going to head right into this massive snowstorm we have hitting New York. So start with Davos and with Davos I think I think I'm now a permanent resident here. So I think I'll just be filming our podcasts and recording them from from the Davos and situation. should be fun. What is Davos like? Do you have any idea when it's not quote unquote Davos? When it's not world beautiful ski town, the the beautiful ski town there, the that sidewalk that I talked about is actually you know, you can take it between two lifts onto two different mountains that the you know, the town that is on either end of the town, city, whatever it is. , and I did manage to get out to one of the mountains on",
        "start": 2921.119,
        "duration": 6072.157000000007
    },
    {
        "text": "I talked about is actually you know, you can take it between two lifts onto two different mountains that the you know, the town that is on either end of the town, city, whatever it is. , and I did manage to get out to one of the mountains on this half-day ski pass. And I did that and it was really lovely and beautiful. And the only hiccup was I thought I was going down the red, which is in between the blue and the black diamond or yeah, the black the black trail. And I it was one of those things where I was like, \"All right, just go. Don't think about it.\" You know, let your body take you. And then I like realized that I was on a black trail and pin wheeled my way down that slope. So a AI could not help you navigate that one. [snorts] No. No. AI or my legs? [laughter] Well, I think the the ultimate flex is going to Davos when it's not World Economic Forum time and definitely dropping that you're in Davos at that time because that's when the real Davos people go. So maybe I'll try to schedule that. Yeah. One of the nice things on the slope was it was all locals because they're like this is like the one week where the slopes are free because all the tech and you know policy people have taken the hotels and they're they're down there like a bunch of dummies and meanwhile we have our local mountain empty. So it was really was some of the best skiing I've done for sure. All right. All right. I I'm going to need to try that off off seasoned. Not offseason, but offconference Davos. That's the goal. Other than that's still number one. Yeah. Let's have the first big technology summit in Davos off season. yeah, not offseason, off off conference. Off conference and just call it the real Davos. I think we could start a movement, get the entire harness harness hive out for a great meet and greet. Someone on YouTube comment said we should call it the harness horde, which I also like. I like that better than hive. That's kind of a more aggressive kind of like getting out into the world. So, harness horde. That's right. We see you. We see you. All right, Ranjan, thank you so much for joining as always. Great speaking with you. All right, see you next week. Hope your flight gets back in. It's it's highly unlikely, but I I I think I have the nice plan B. So, all right. Thank you, Ranjan. Thank you everybody for listening and watching. We'll be back on the feed on Wednesday likely with Joel Pino, the chief AI officer at Coher. We had a great [music] conversation here about the cutting edge of AI research, where the biggest problems are, how the [music]",
        "start": 3082.4,
        "duration": 6368.69800000001
    },
    {
        "text": "Thank you, Ranjan. Thank you everybody for listening and watching. We'll be back on the feed on Wednesday likely with Joel Pino, the chief AI officer at Coher. We had a great [music] conversation here about the cutting edge of AI research, where the biggest problems are, how the [music] the AI field is putting current applications current technology into practice. I think you're going to like it a lot. And again, if you've missed the Demis conversation, it's only a half hour. Definitely recommend you check that out. That's on the feed. Thank you so much for listening and watching, and we'll see you next time on Big Technology Podcast.",
        "start": 3235.2,
        "duration": 6404.13700000001
    }
]