[
    {
        "text": " The gates of content hell are open as OpenAI's Sora 2 debuts with ultra realistic AI slop and Apple has elevated its smart glasses plan and they could be coming soon. That's coming up on a Big Technology Podcast Friday edition with TechCrunch senior AI reporter Max Zeff right after this. Welcome to Big Technology Podcast Friday edition where we break down the news with our traditional, coolheaded and nuanced approach. Today we have Techrunch senior AI reporter Max Zeff joining us to talk about everything AI slop. There's so much slop, but maybe it turns into something. We'll talk about how it might challenge the creator economy. We'll also talk about Apple smart glasses and the fact that it's speeding it up in the road map and plenty more. Max, great to see you. Welcome to the show. Great to be here. Longtime listener. Definitely. Well, we are we always talk about your stories on the show. here is a hint for listeners and viewers. When you hear me cite a Techrunch story, it's almost always Max's. and Max, we're going to get into yours because you have some new reporting on the state of OpenAI after this Sorro 2 launch and how some of the employees there are trying to figure out what it means for the company. But let's start off talking about Sora 2. for those who don't know, Sora 2 is OpenAI's new video generator which they've now included in an app called Sora which is basically meant to rival Tik Tok and YouTube. This is from the Wall Street Journal. OpenAI is squaring up to Tik Tok, Google's YouTube and meta platforms with a new social media apps for its AI video generator that allows users to create highdefinition video clips with audio from text prompts. Users can upload short clips of themselves and insert them into Sora generated worlds describing the idea, style, and scene they want to see. They can also connect with other users watching and commenting on their content. Max, just first question for you. We've we're now a couple days into this Sora Madness. It's the number one app on the app store. how big do you expect this to get? Yeah, I mean I could see this taking off quite significantly. I think in the last year we've really seen AI generated images and videos really take over regular social feeds. And I think the idea here from OpenAI is let's capture some of that growth on one of our own platforms. And while it sounds terrible and you know at first it kind of makes you cringe at the idea of a completely AI generated feed, it's been surprisingly compelling I think to a lot of people as as you can see by the growth on the app store and just my own personal experience. You go on there and it's like this is terrible and I it's like you can't take your eyes away. It's",
        "start": 0.08,
        "duration": 349.35900000000015
    },
    {
        "text": "it's been surprisingly compelling I think to a lot of people as as you can see by the growth on the app store and just my own personal experience. You go on there and it's like this is terrible and I it's like you can't take your eyes away. It's the road. Yeah. Yeah, I think it's worth pausing just to talk about how realistic these videos are. I watched one of Sam Alman on the release day running around opening eye headquarters with a bullhorn telling them to get to the live stream. In the first few seconds, this was like one of my first Sora 2 videos that I had seen. I was just like, that's real. And I was like, wait a second, that's not real. And then I really got mad at myself this week because a friend of mine posted a video of Jake Paul coming to their book signing and you know my friend signing a book and handing it to a very happy Jake Paul. And these videos are so good that your brain doesn't process the fact that they're AI slop at first. And I was like you know when you see this stuff you go through these mechanations in your mind of like how did that happen? and I didn't know that he had a book. And then I was like, \"Oh my god, that's Sora.\" Like, it's crazy. Yeah. There was a really interesting take from a former OpenAI employee, , Miles Brundage, who kind of came out and said that, you know, we're getting into this era of AI generated video feeds. And it's worth noting that not all AI slop is created equal, which I thought was a surprisingly thoughtful take about something that seems at its face really kind of scary. But I think he's right. I mean I think as we saw with Meta's Vibes app last week that's Meta's Tik Tok competitor that's full of AI generated videos and that product doesn't let you make videos of yourself or your friends. And I think the reaction was people were like, well, what is this? What do I do with this? Whereas with OpenAI's product, it's immediately become really compelling because people can see themselves in it. They can see other people they know. And and that seems to be a really key detail here that is a big differentiator. You get the sense that two things happened. First of all, Meta thought that Meta must have gotten word that Opening Eye was going to release this and then rushed out vibes. U and I think the other broader picture is people started to question why Mark Zuckerberg was sinking so many billions of dollars into AI research and recently going on this hiring spree of AI researchers. I think it's worth noting that a lot of the researchers that he poached were working on multimedia formats, audio, video, images. And you see, I think this",
        "start": 175.28,
        "duration": 655.5189999999998
    },
    {
        "text": "Mark Zuckerberg was sinking so many billions of dollars into AI research and recently going on this hiring spree of AI researchers. I think it's worth noting that a lot of the researchers that he poached were working on multimedia formats, audio, video, images. And you see, I think this into focus that this could actually challenge the standard human created content feeds. And that's why it's like a nine alarm fire inside Meta HQ right now. Yeah. I mean, I think that this is the change that people have been talking about for a long time. I think it was hard to see for a while why a company like OpenAI was threatening to meta. And I think this week you see why. I mean, I think that this is very clear evidence that there is something here. I don't think that, you know, this product is necessarily the final version of it. I'm not sure if it has going to have a great impact on society at its, you know, at the net. But I I do think that this is compelling and a lot of people spent a lot more time on the Sora app in the last week than they did on threads or blue sky. And there's something to be said for that alone. We had a celebration for 5 years of big technology podcast this week in collaboration with human ventures. they hosted here in New York and we gathered a bunch of people around and we were talking about this and what the future is going to look like and Ranjan Roy who's usually here on Fridays told the story that he tells on the show so often about how his Facebook feed had become just a feed of AI slop and people commenting on it. And I think there had been some questions about why Mark Zuckerberg and Facebook were allowing the feed to fill with like shrimp Jesus. and again this this week is like bringing it into focus that that it is something that is going to be maybe already is a very engaging content format and if you are the engagement app which is or the engagement company which Meta is, you can't really let another company run away with it and maybe they already are seeing OpenAI run away with it. Yeah, I I I do have real concerns about what the impact is on people who use social media and society for something like this. I think that there's a sense to me of, you know, the these apps you really at their core are supposed to be about connecting you to other people. And I think we've seen all the ways in the last, you know, two decades of how that's not really the case and how they really are optimized to keep you on the platform. , I think there's a big question for OpenAI here of what they",
        "start": 329.919,
        "duration": 949.4369999999998
    },
    {
        "text": "to other people. And I think we've seen all the ways in the last, you know, two decades of how that's not really the case and how they really are optimized to keep you on the platform. , I think there's a big question for OpenAI here of what they experience. I think we've seen some good players emerge in the social media space like a blue sky that doesn't seem to be focused on getting people to, you know, just spend as much time as possible on the platform all the time. That said, I think it limits their growth. And I think Open is a very ambitious company. I think there's a real chance here that, you know, they are pushed by some of the incentives that social media companies have been pushed by for, you know, the last 20 years. But it it is different and I think it's worth taking this moment to just pause and talk a little bit about the underlying technology and how impressive it is and why to me at least this is not just OpenAI creating a a frivolous you know vapid social media app but how this might be the next point along a line of research that needs to get done to improve this technology. There's been so much talk about AI's need to understand the world and people have talked about world models, the understanding of physics, understanding of what happens beyond the LLM. And there was an interesting point here that a user on Twitter or X made that sort of puts opening eyes lofty ambitions into contrast with what it shipped Sam Alman two weeks ago. We need $7 trillion and 10 gawatt to cure cancer. Sam Alman today we are launching AI slot videos marketed as personalized ads. Sam Alman chimed in. He said I get the vibe here but we do mostly need the capital to build AI that can do science and for sure we are focused on AGI and with almost half sorry with almost all of our research effort. It's also nice to show people cool new tech products along the way make them smile and hopefully make some money given all the compute that we need. When we launched Chat GPT, there was a lot of who needs this and where is AGI. Reality is nuanced when it comes to optimal trajectories for a company. Just this line about the the the launch of Chacht, who needs this and where is AGI, I I just think it's it's important. I mean, this is sort of the key the key part of Sam's statement. And I'm not not here to be like Baghdad Bob for for Sam. but I will say that when you get this stuff starting to understand physics, you're just a step closer to I think the end goals. And Chhat GPT of course like seemed like a little toy at first, but obviously has emerged into something",
        "start": 479.199,
        "duration": 1258.6359999999995
    },
    {
        "text": "like Baghdad Bob for for Sam. but I will say that when you get this stuff starting to understand physics, you're just a step closer to I think the end goals. And Chhat GPT of course like seemed like a little toy at first, but obviously has emerged into something but I tend to side with Sam on this one. What do you think, Max? Yeah, I think it's I think it's a tough call. I I think I agree with Sam in some ways that he he's right that chat GPT it wasn't really understood at first how this really was going to be a vehicle for a lot of people to use AI and a lot of people to actually get the benefits of AI and I think we've completely seen that play out in the last few years. I think it's a little less clear to me how Sora gives gives people the benefits of AI world models in the same way. I totally agree that the underlying technology is really impressive. I mean, when the first Sora came out, I think last year, it blew people away just with how realistic the videos were, with how accurate it could get certain details. , and this one is objectively better. And I I think it's impossible to argue that there hasn't been a great leap in performance of the AI video models in the last year or two. , but chat GBT at its core is about helping people. That is I I do actually take OpenAI at its face when it says that it optimizes chat GPT to be helpful and not to just keep users in, you know, the these engagement loops. , I do think that I go to Chat JPT all the time to get an answer, I get it, and then I get off the app. I think with Sora, it does feel to me like it is I mean, he said it pretty plainly. It's it's about entertaining people. It's about, you know, it's supposed to be fun. And I think that these are very different products. And while I agree that there's something to be said for OpenAI's ability to make products to fund you know, its AGI efforts, I think that it's worth noting that he he's venturing into a very different space than he's been in before. Okay. Let me talk a little bit about what grounded my comments and then we're going to actually talk a little bit about your reporting that has OpenAI employees basically expressing similar concerns. To me, the thing that I've heard from AI researchers is you really want AI to be able to predict what's going to happen in the world. because when it can predict then it can plan and predicting and planning are core parts of intelligence. Now the thing about chat is or yeah text is it's somewhat easier to predict the next word than",
        "start": 635.279,
        "duration": 1546.7969999999996
    },
    {
        "text": "AI to be able to predict what's going to happen in the world. because when it can predict then it can plan and predicting and planning are core parts of intelligence. Now the thing about chat is or yeah text is it's somewhat easier to predict the next word than Yanukun example hold up a pen and drop it and predict where it's going to go because there's seemingly infinite possibilities. So when this technology gets better at understanding like a person what a person walking on a sidewalk does then that's a step forward in its ability to predict and then plan. and so the underlying maybe not the social app but the underlying advances that they're working on here to me seem like an important step forward but you I could be getting over my skis here. So so what's your thought on that Max? I think you're right. I mean I I agree that world models are an important next step for AI. there was just a viral podcast where a famous AI researcher Richard Sutton went on the Dwaresh Patel podcast and there was this really fascinating argument about how LLMs today they don't have a model about the world. I mean they can predict the next word but they can't you know predict the state of the world and and you know they can't predict they can't update their mental model about the world based on interacting with it and I thought it was fascinating conversation I would encourage people to check it out but it it was really I think you know this is something that Yan Lun has been like you mentioned talking about for a long time which is that you know world models are really a key to kind of a greater intelligence and greater ability to predict the world. So I do think that it's important for OpenAI and these AI labs to advance the world models. but yeah, I think the application is really the the key part here. Okay. so briefly, do you so your your perspective is the advances in video that we're seeing might advance world models or does advance this concept of a world model? but just the the feed is is where you start to feel a little queasy. Yes, 100%. I I think it is like you know you can take a good technology and use it for the wrong thing. I think is my feeling and I just wonder if this is that. Okay. Yeah. And you had some reporting that shows that even people within OpenAI are concerned there. And I think this is a great place to to focus and stop for a moment. here's your story. Several current and former OpenAI researchers are speaking out over the company's first foray into social media. AI based feeds are scary, said OpenAI pre-training researcher John Halman in a post on XX. , we're going to do our",
        "start": 782.24,
        "duration": 1851.037
    },
    {
        "text": "to to focus and stop for a moment. here's your story. Several current and former OpenAI researchers are speaking out over the company's first foray into social media. AI based feeds are scary, said OpenAI pre-training researcher John Halman in a post on XX. , we're going to do our hurt humanity. I mean, where have we heard that before? You had actually multiple current OpenAI employees being like, , I don't know about this. That's that doesn't happen too often in a major launch. So talk about the significance of that. Yeah, I think the level of kind of concern expressed by a lot of OpenAI researchers at the launch of this product felt very unique to me in a way that you don't usually see. Usually when an AI company launches a product, everyone is very gung-ho about it. Everyone is really excited. And I think this time just felt a little different. I think all I think a lot of researchers at OpenAI were very aware that their company was not just launching a new product. It's not a new feature in chat GPT. This is social media app. This is unchartered territory for OpenAI. And I think that raised a lot of concerns for people. I mean, something, you know, I I've heard over and over from AI executives, and I'm sure you've heard the same, Alex, is just, you know, they all talk about how we don't want to repeat the mistakes of the social media era. And I believe a lot of the researchers working at these labs don't want to do that. I think a lot of them grew up in an era where people were addicted to social media. and I think a lot of them don't want to create the same kind of dynamic with the products that they build. , but I I do think that just the incentives of running a social media platform are sometimes going to be very intoxicating and strong and you know I don't think Meta exactly set out to build a you know addictive platform but that's what you do when you need to make the user count grow up and you need to make the ad revenue grow up. So I think that that's what I heard from a lot of employees just like we have to be really careful here right and I think it's we should note head of product at anthropic Instagram founder head of product at openai former head of product at Instagram person who's running what all consumer applications at openai is also someone who's come from Facebook It it I definitely it's interesting to me to see these two cultures merge, right, which is like the typical Silicon Valley growth culture and this newer researchoriented AI culture and effectively, you know, we can see the conflicts happening within the companies as they go. Yeah, I mean this is something that's",
        "start": 936.0,
        "duration": 2173.277000000001
    },
    {
        "text": "definitely it's interesting to me to see these two cultures merge, right, which is like the typical Silicon Valley growth culture and this newer researchoriented AI culture and effectively, you know, we can see the conflicts happening within the companies as they go. Yeah, I mean this is something that's where there's this tension at the company where it is the world's fastest growing consumer business and it is also an AI research lab where a lot of the people joined to chase this lofty mission of developing AGI that benefits humanity and make sure that all of that goes safely and goes well. And I think those things have constantly been just kind of pushing at each other for the last several years. I mean, when Sam Alman was fired a few years ago, that was, you know, kind of a key consideration there. And I think that what I heard from a former employee that was really interesting was they said that, you know, OpenAI really the the consumer business funds the mission. I mean, that's how a lot of people see it. where it's like, you know, building chat GPT into this massive product makes billions of dollars that can go towards AI research that otherwise wouldn't. And I think that's true. You know, to build AGI, you probably need to be an enormous company. But I think there's a real question of at what point does OpenAI say no to a money-making endeavor? At at what point does OpenAI reject the idea of you know adding more users to its platform for the sake of its mission? I think that it is I my take about the SO app is I don't think that OpenAI is setting itself up for success with this because they are opening themselves up to you know the the kind of incentives of a social media app right yeah you asked that question in your story. At what point does OpenAI's consumer business overtake its nonprofit mission? I I think it's already there. So, but anyway, we can leave that open since you left it open as as a question in your story. I won't, you know, put you on the spot on that one. but yeah, it's a valid valid concern and you know, I think we can both agree that this is not just a video generation technology. It's a social app. And it does sort of then put forth this really interesting question which is what's going to happen to the creator economy. I'm writing about this in big technology this week. It'll probably come out right before our our episode comes out. But u you have this you know creator economy is kind of a misnomer. There's only a small amount of people that are able to work full-time creating content on the internet. That being said, u some of the people who have watched this have said basically like this puts creators right in the",
        "start": 1098.96,
        "duration": 2484.877000000002
    },
    {
        "text": "this you know creator economy is kind of a misnomer. There's only a small amount of people that are able to work full-time creating content on the internet. That being said, u some of the people who have watched this have said basically like this puts creators right in the guest hosted the Twit podcast over the weekend and I had a great quote from one of our panelists, Ario of Architecture Media. He said, \"The creators are all high in the hog right now, but I would be thinking they're one of the first things that could be totally annihilated by AI.\" I think it's worth taking a minute to talk about this because you have this new technology, a new app. It's obviously very engaging, number one in the app store, but instead of the painstaking process of creating content online, you could just prompt it. So, what do you think this means for the creator economy, Max? Yeah, it's really a interesting question. And I mean I think that people said some version of this for writers when chat GPT came out that you know why would I hire a freelance journalist to write something if I could just ask chat to write it and I mean certainly there are countless websites out there with articles written by chatpt now. so to some extent that's proven to be true. and yet Alex we we still can make a living doing what we do. So I think what have we learned from the text version of this story that's already played out is that people value the human touch and the human taste and judgment and they value kind of a professional's opinion you know on certain topics that has become actually I think more valuable in the AI era and I think that was something that a lot of people missed when chat GPT first came out which is that it actually made really highquality human content more valuable , I wouldn't be surprised if a similar thing happens with the creator economy. Like I think that we will see just more content in general as a result of these AI video models and Sora. , and I think that it probably does make it harder for content creators to stand out. It probably, you know, advertisers are looking at these AI video models and going, \"Huh, that's pretty interesting. should I, you know, maybe put some of my revenue or my my ad spend towards that instead? , but I think that there's creators out there who have a real relationship with their audiences. , and the audiences care about what they have to say in the same way that people care about what journalists have to say, , their favorite ones at least. And I think that that's kind of how I expect this to go , in all of the industries that AI will touch. But I don't know, Alex, I'm curious to hear",
        "start": 1256.96,
        "duration": 2777.1180000000018
    },
    {
        "text": "the same way that people care about what journalists have to say, , their favorite ones at least. And I think that that's kind of how I expect this to go , in all of the industries that AI will touch. But I don't know, Alex, I'm curious to hear people in the space. Yes. So, I actually have this like list that I it's basically my outline for my story of all the reasons why the creator economy won't go away. And okay, I think you've touched on a couple of them. It will change though in some ways. But, I would say like the first thing that I put on the list, which is somewhat corny and cliche, is just the word authenticity. And I think that when people are saying the creator economy is going to go away, they might be thinking of these like adventure videos on YouTube or like some others. I don't know. But I think they missing the fact that the reason why the creator economy or whatever it is emerged is because people wanted a more authentic alternative to let's say the mass media. And so they were able to have this connection in some ways with online creators and that powered the creator economy. So I think that you cannot replace that authenticity with with synthetic media. You just can't. it it's impossible to create. I think I could be proven wrong over time. but I think that's impossible to create. The other side of it is that that basically the reason why you would tune into someone is for new insights or ideas or information. And even if you could generate amazing videos, you're just recycling what exists and you lose that you know potential to gain those new insights and information or or even you know unique new entertainment. I think so. , so to me that is that is two of the main reasons why I think the creator economy is not going away. Now, I do think it's going to change because there are some things that are just going to be commoditized. and I'll just say it. I think that if you're a creator that's been making money on good looks, you might be in trouble. you might now see an a AI there already are AI versions of people who are doing like thirst trap content and they're going to they're going to commoditize that. So also this just sort of like there's a lot of like amorphous mid content out there that maybe if you filled a niche you can make a living, you probably won't be able to do that anymore. So that's kind of my read on it. I mean I think that's a fair point. Right. I mean, I think that that's kind of the flip side of what I was just talking about with the journalism conversation of, you know, I think that",
        "start": 1406.08,
        "duration": 3093.8370000000027
    },
    {
        "text": "able to do that anymore. So that's kind of my read on it. I mean I think that's a fair point. Right. I mean, I think that that's kind of the flip side of what I was just talking about with the journalism conversation of, you know, I think that business on aggregation of just taking other reporting and kind of repackaging it without adding some unique analysis or you know new reporting to it. they that largely can be done by AI. , and I think that that's what , you know, that kind of I'm not trying to say that's lower quality. I mean, I've done a fair amount of that in my career, but like I think that that is a part of journalism that is kind of going away in the AI era. And, you know, I think I could totally see a similar thing happening in the creator economy. I will say I'm curious what you think about kind of, you know, obviously I mean the creator economy is not held up by Tik Tok and Instagram paying out these creators. It's held up by like AG1, like these like, you know, massive advertisers that like will, you know, just like dole out money to the creators. And I'm not sure if they're, you know, going to want to put their ads in Sora or something, you know, like like I think that that kind of source of revenue seems pretty stable if you're a creator. But I'm curious what you think. Oh, I disagree on that one. I think advertisers are very simple animals. If there's attention, they will pay for people's attention. So, even if it's a feed of AI slop, if OpenAI can somehow win millions and millions of users over, then AG1 will will be right there and work out some deal to sell their very healthy supplements and all the other things. So, , AG1, if you're listening, big technolog is open for business, so, , we'll be human until we're not, , so let's talk. Okay. But that that's basically my take on that front. That that no, that makes sense. I mean, that you totally could be right. And I mean, Mark Zuckerberg has his idea about, you know, automating all AI , all the whole ad process with AI that, , you know, it's been talked about, you know, a few weeks ago. And you know I think a lot of advertisers ears maybe perked up and and maybe they cringed a little bit at that thought. But yeah I I guess we'll have to see. I do think that there is some value in like your attention is deeper when you're watching a creator that you love. So maybe that will you know prove to be resilient in this era. But I guess we'll see. Yeah. I don't want to be the gloom and doom on the creator economy ad thing, but ultimately like they the",
        "start": 1565.919,
        "duration": 3377.5160000000005
    },
    {
        "text": "attention is deeper when you're watching a creator that you love. So maybe that will you know prove to be resilient in this era. But I guess we'll see. Yeah. I don't want to be the gloom and doom on the creator economy ad thing, but ultimately like they the they're smart. They will see like what's leading to sales, what's not and then just keep investing more in that. May maybe who knows the meta can tune feeds in ways or open eye will tune feeds in ways that will make people more susceptible to this type of advertising. It's it's it's a it's an interesting world. And by the way, speaking of automation, I I want to bring this point up before we move on from this. there's a concept in artificial intelligence called reinforcement learning where like you give the AI a goal and it sort of makes a bunch of attempts and then you know basically tries to accomplish that goal and then realizes what to optimize for. I I had a thought that could we end up seeing so so while I think the creator economy is going to stay, could we end up seeing AI creators emerge where companies basically give bots this goal of like being mega influencers, allow them to create lots of accounts and then just sort of reinforce based off of the comments and likes and shares and follows. , and so we end up seeing a an AI creator force that will crush any human attempt to be to be better than it just because of its ability to basically create unlimitedly and in an unlimited fashion and optimize that way. Oh god, I I think that's going to be Meta's next AI benchmark and their next model releases. You know, how well can our AI grow its platform on social media? It's honestly a terrifying kind of example, but I could totally see that happening. I mean, RL has proved really good at doing specific tasks. , social media is a place where there is so much data coming in. It honestly is probably a pretty easy place to do something like that. , but wow. Yeah. RLE social media influence is great. Yeah. Yeah. It's great at playing games. Social media is a game. the retweets are the are the or the reshares. That's the points. So, so maybe we see it. All right. U in the second half, we're going to get into how Meta is going to use our so our our chat data or our engagement with its LLMs for advertising. And then we're going to touch on the launch of Anthropics Sonnet 4.5 model. And and we will also cover the fact that Apple has seen what Meta is doing with its AI glasses and decided to accelerate its own smart glasses roadmap. So, you know, as as I kicked a break, I'm just thinking to",
        "start": 1711.679,
        "duration": 3689.9159999999993
    },
    {
        "text": "on the launch of Anthropics Sonnet 4.5 model. And and we will also cover the fact that Apple has seen what Meta is doing with its AI glasses and decided to accelerate its own smart glasses roadmap. So, you know, as as I kicked a break, I'm just thinking to Meta, but it's in the conversation all across the board, whether it's hardware, advertising, or content feeds. something will work for that company. It always does. All right, we'll be back right after this. And we're back here on Big Technology Podcast Friday edition with special guest Max Ze. He is the senior AI reporter at TechCrunch. Max, you had a story this week talking about how Meta is going to use our AI chat data to target ads. And this has been something we've long worried about here on the show. not the fact that it's going to happen but the fashion with which it could be done because people are pouring their hearts out to these bots they're using them as therapists and lovers and there there is there an expectation I mean it's a tech product is there expectation of privacy I don't know but now it's going to be put into the meta ad machine so what can you tell us about this yeah I mean it was funny I was talking with someone at Meta about this you know earlier this week and they said you know I'm sure a lot of people already thought we were doing this But we're just announcing that we're going to start doing this. And I thought that was a really telling comment about how people view privacy on Meta's platforms. But yeah, I mean Meta has basically announced that yeah, we're going to take everything you say to an AI chatbot and we are going to basically have it affect the kind of ads that you see on Instagram and Facebook. of course there are some exceptions if you are talking about really sensitive issues. Meta has kind of called out a couple ones like if you talk about u religion or politics or kind of sensitive health issues then it's not going to suggest you ads based on that information but this is I think a really kind of fascinating moment where the AI companies are coming out and saying this and and it is really I think revealing of their playbook in the coming years. , you know, maybe these AI chat bots were once free products on their platforms, you know, that that we've gotten to use for the last couple years, but I think we're increasingly seeing that there are strings attached to using these free products. They are going to take your data and serve you ads on them. , they're going to train more models based on everything you tell it. , I think it might make a lot of people think twice about how much info",
        "start": 1870.24,
        "duration": 3978.5560000000005
    },
    {
        "text": "are strings attached to using these free products. They are going to take your data and serve you ads on them. , they're going to train more models based on everything you tell it. , I think it might make a lot of people think twice about how much info I'm curious to see if it really affects, you know, how people use them as therapists and friends and whatnot, right? It's good to see that there are some exemptions, but I can just imagine that the next scandal is going to be like, \"I've used the Meta AI chat.\" Someone saying, \"I've used the Meta AI chat as my therapist and now I'm getting ads in my feed for Prozac. Talk to your doctor about Prozac or something like that.\" Like that would be bad. It does seem bad. it. Yeah. I I think that there there is also Oh, yeah. I was just going to say I think that there's also this kind of really it's it's a incredibly valuable data stream for Meta and and I think that, you know, this is probably been the plan all along in some sense is to, you know, take this profile that they've built via the AI chatbot and and monetize it in some way. And we've been talking for so long about how, you know, you could put ads in a chatbot, but I think that people maybe have spoken less about just how valuable all that information is to serve you ads elsewhere. And Meta is probably the best positioned company to do that. The economics of this AI boom, do they make sense if they just boil down to serving us better ads or does it has to be something more? I think that ads have been the biggest business on the internet for a long time now. And I have no I I don't think that's going to change. Like I like I think that that is going to continue being the case. I think it could probably be a bigger business than it is today. I think you could probably get more specific kinds of ads and AI. I mean, I I share so I and and other people, everyone share so much more information with an AI chatbot than you do with your Instagram feed, with Google. And you have to think that, you know, these companies that already have this great profile on you, if they could fine-tune it even more to show you just the exact product that you want in the moment that you want it, , even better than they can today, I mean, there's clearly a lot of value there. , so yeah, I I do think that even if it just boils down to ads, I mean, that's that's gotten Google and Meta pretty far. So I wouldn't, you know, doubt that. Max, I'm I'm getting depressed. , anyway, I I So my take on this would be",
        "start": 2016.799,
        "duration": 4262.395000000001
    },
    {
        "text": "there. , so yeah, I I do think that even if it just boils down to ads, I mean, that's that's gotten Google and Meta pretty far. So I wouldn't, you know, doubt that. Max, I'm I'm getting depressed. , anyway, I I So my take on this would be substantially more than ads. They have to end up automating a good chunk of white collar work to make the valuations work. , but certainly the companies are going to be much more sustainable if they can use it to be much more effective in advertising. So, I think you're probably right there. I'm I'm curious what the vibe is inside of Meta right now given well state of vibes and the new talent and the the pivot or the the move towards commercializing its AI technology. This is from the information. A meta change on publishing research causes a stir in its AI group. In recent weeks, Meta Platforms made a change to its fundamental artificial intelligence research lab that rubbed members of the group the wrong way. Fair, as it's known, would have to undergo additional review of its research before publishing it. The new policy was a tough pill to swallow for some members of fair who perceived the change as a new restriction on the freedom that they had pre that they previously had to share their research outside of Meta. Meta has spent much of this year remaking its broader AI efforts and it has pushed fair to contribute to Meta's products and spend less time less time on sharing research externally. The chang the changes so bothered Yan Lakun, an AI pioneer who co-founded Fair in 2013, that he mused to colleagues in September that perhaps he should quit as fair's chief scientist. Max, what's your read on what's happening here? And do you think that we're just at the beginning of massive tumult within Meta's AI division because of the focus on products and because of this talent situation that they have? Yeah, I mean, this is a great report on the state of Meta right now. I think it lines up with things I've heard from people inside of Meta in previous weeks that basically the level of bureaucracy inside of Meta specifically in its AI division is really a problem for a lot of people. I think that this is something that new employees that have come in from OpenAI and you know scale and whatnot have complained about but but it also seems to be you know leaking into fair. What's interesting is that fair has been for a long time now allowed to kind of operate independently very you know they could kind of work on these lofty long-term goals you know so that sometimes wouldn't you know produce anything for you know 5 to 10 years but they were allowed to kind of operate independently and they've produced a lot of great work",
        "start": 2161.359,
        "duration": 4572.954
    },
    {
        "text": "of operate independently very you know they could kind of work on these lofty long-term goals you know so that sometimes wouldn't you know produce anything for you know 5 to 10 years but they were allowed to kind of operate independently and they've produced a lot of great work increasingly in jeopardy as AI just becomes too important to meta where you know as report states, I mean they they were like we need to be really careful about what we put out. We don't want to give, you know, our competitors an edge. and yeah, I think that there is a lot of moving pieces inside of MSL right now. and people are coming, people are going almost every week it seems. I don't think that this will be the last story we see about you know the kind of tumult inside of MSL. Yeah. Meta MSL meta super intelligence labs and it it is interesting because I've written a lot about the formation of fair back in the early 2010s and Zuckerberg was absolutely right in seeing how important AI was going to be and u it is interesting that you know they didn't have a high opinion of LLM within fair for a while and he probably feels behind the eightball and and trailing open AI or he definitely feels that way which is why he's spending this much money on talent. But question is now that now that that bet has sort of proved really smart how much you let a lab that's focused on future stuff continue to think about that as opposed to going full speed ahead on the present. So speaking of the present we have a new model from it and went completely under the radar this week. Anthropic launched sonnet 4.5 its best model for AI coding you write in in TechCrunch. it's capable of building production ready applications rather than prototypes a leap in reliability from previous AI models and also I think it can go autonomously for like 30 hours so Max you wrote about this what's the significance of sonnet 4.5 I think the story of sonnet 4.5 is really just anthropic needs to get back in the lead in the coding space I think that for a long time as you've talked about on the show before I mean anthropics models are really a favorite among developers and they have been for the last year or so. , and it's because they're they're very good at coding. They're very good at kind of aically working on their own. , so in apps like cursor, , you know, in these vibe coding apps, , a lot of people use them and it represents a huge part of anthropics business right now. GPT5, the model OpenAI released month ago at this point, I believe, , two months ago, it really changed that. , you know, people I've talked to at cursor say that, you know, it completely",
        "start": 2317.599,
        "duration": 4891.273
    },
    {
        "text": "of people use them and it represents a huge part of anthropics business right now. GPT5, the model OpenAI released month ago at this point, I believe, , two months ago, it really changed that. , you know, people I've talked to at cursor say that, you know, it completely AI and anthropics models in a way that they hadn't seen for a long time. And I think that anthropic, you know, for OpenAI, I mean, coding models are just a small piece of their business. Chat GBT is kind of the the big tuna for them. But, , for anthropic, I mean, this is existential like they need to lead in coding and this is their attempt to do that. And whether Claude Sonnet 4.5 does that, it's on benchmarks very impressive, but I mean, I've heard mixed things from people saying GPC5 is it's really strong. It's still my go-to. So, I'm curious to see if this puts Anthropic back in the lead. I was speaking with the CEO this week who unprompted was talking about like backwards compatibility with AI and said hey all all my engineers you know went from anthropics models and we ran towards GPT5 when that came out and then everybody ran back to sonet 4.5. So, , it is one of those things where you now you see this competition and, , if I was an engineer working with AI code, I'd be thrilled because you have these two heavyweight multi-billion dollar companies just trying to make my life easier at every possible turn. Yeah. I mean, it is an insanely competitive space right now. I mean, you you basically have to ship a new model every couple months to stay ahead of the competition. , and I think that this is a really tough business for anthropic to be in where it just has to execute at a very high level for, you know, the foreseeable future. Like it can't really take a break here. , and it can't miss a step. , I am curious to kind of see if this really changes the way people use AI coding models. I mean, Anthropic says that it's capable of building these productionready applications that, you know, you can vibe code up an app and it'll set up, you know, a database and it'll become SOCK 2 compliant and , you know, all of these things. And I'm curious to see if , this actually enables everyday people to start using AI coding models more or if it just makes a developer's life easier. I lean towards the latter. I think the latter probably is it. listeners and viewers, we have Mike Kger, the head of product at Anthropic. He'll be on the show next Wednesday for our Wednesday show. So stay tuned for that. We'll talk to him all about Sonnet 4.5. All right, final story this week. Let's talk about the Apple forthcoming smart glasses. This is from Bloomberg.",
        "start": 2480.079,
        "duration": 5191.192999999998
    },
    {
        "text": "Mike Kger, the head of product at Anthropic. He'll be on the show next Wednesday for our Wednesday show. So stay tuned for that. We'll talk to him all about Sonnet 4.5. All right, final story this week. Let's talk about the Apple forthcoming smart glasses. This is from Bloomberg. important to it that it's shelving the Vision Pro headset. this smaller one. Oh, actually, actually, no. I'm going to let me read the story. Apple is might be bigger than I expected. Apple Inc. has hit pause on a planned overhaul to its vision pro headset to redirect resources towards a more urgent effort developing smart glasses that can rival products from meta platforms. Smart glasses have emerged as a critical arena for tech companies which are racing to develop AIcentric devices. Future designs could eventually challenge smartphones as a must-have technology and Apple wants to be ready. The company is working on at least two types of smart glasses. The first one, dubbed N50, will pair with an iPhone and lack its own display. Apple aims to unveil this model as soon as next year ahead of a release in 2027. Apple is also working on a version with a display, something that could challenge the just released Meta Rayband display. The Apple version have been planned for 2028, but the company is now looking to accelerate development. This is this is a massive story. think I thanks to Mark German from from Bloomberg to for reporting it out. But it it's fascinating to me that Apple looking over at Meta now sees glasses as so important that it's shelving a big redevelopment of the Vision Pro reportedly to go after this. What's the significance, Max? Yeah, I mean I think that honestly Meta's Rayband display glasses were so impressive to a lot of people. I mean, if you try to book an appointment in the Bay Area to go demo these, , it's basically booked out for the next 2 or 3 months. , I mean, you basically just can't even Yeah, you can't even get an appointment right now. , so, , and you have to demo them to buy them, which is a weird detail about them, but but the the demand for them, I think, has been incredible. I think people are really fascinated by this new computing form factor. I think it's a lot more compelling than putting a pair of big goggles like an Apple Vision Pro or a MetaQuest on your face. , I don't know about you, I can't stand the headsets to be completely frank. I think they get hot. I think they're kind of uncomfortable, but the glasses are very comfortable to slide on. And I for one am really excited about this development. I think this is like a much better direction for Apple to go in than making a better Vision Pro. , but of course Apple is in a much better",
        "start": 2632.24,
        "duration": 5483.111999999998
    },
    {
        "text": "uncomfortable, but the glasses are very comfortable to slide on. And I for one am really excited about this development. I think this is like a much better direction for Apple to go in than making a better Vision Pro. , but of course Apple is in a much better connect it to iMessage. They can connect it to all the apps on your phone. So, I'm not sure what claim Meta really has besides being first to market here, right? It is interesting because you have these two things going on at the same time. Meta being first, like it's kind of I'm sure Mark Zuckerberg is loving the fact that Tim Cook is running after him in product direction. like he calls the company Meta, then Apple develops the Vision Pro. He builds glasses, then Apple builds glasses, you know? It's like he must love that. But you're right. I mean, Apple has this tendency to be last and best and or not maybe not last, but it releases when it's ready and it's and it's often best. The one thing I would say with Apple, it it's a these are these are effectively AI devices, right? these wearables become interesting because of the ability to integrate AI into everything. And at the risk of saying the same thing I've said on the show for like five years already in its entire existence, , if Apple's going to play here, it's got to get better at AI. It it definitely does. I mean, I think that this product more than any iPhone that Apple releases will be an AI first product. , that probably requires you to talk to an AI model to use it at all. , so it does need to get a lot better. , I have been hoping that Apple would just, you know, partner more seriously with OpenAI and Anthropic, , and, you know, just just opening up their platform so that other AI other AI models can really just, you know, , power some of these features that Apple clearly just can't develop. But, , Apple has a lot of pride, so I'm not sure if they'll go down that route. I just want to give a quick shout out for Apple. Apple, I know I've been tough on you on the show. , no apologies, but I will give you credit where credit is due. I recently picked up a pair of the new AirPods 3 Pro model and I've never used better headphones in my entire life. They are crazy. The sound is amazing. even though they're earbuds, the thing can really noise cancel and it's now my favorite new tech thing I've had in a while. Wow. That's Have you tried the There's like the AI translation feature in them. Have you tried that? Not yet. I need to figure out how to set that up. I think you need like to get the translate app and probably I'm",
        "start": 2780.319,
        "duration": 5773.670999999997
    },
    {
        "text": "tech thing I've had in a while. Wow. That's Have you tried the There's like the AI translation feature in them. Have you tried that? Not yet. I need to figure out how to set that up. I think you need like to get the translate app and probably I'm my wife's family or my wife and her family, they're all European. So, I think that it'll be really nice for me on our next visit out there to be able to turn turn this mode on and be able to communicate with their grandparents. So, yeah, I'm looking forward to it. This is the brilliant part about Apple is that when it does release an AI feature, it immediately has millions of people who are so excited to use it and interact, you know, with with their daily life. , this is the thing I can't get over and and I'm sure Meta is acutely aware of that just, you know, the smart glasses may take a couple years to come out, but when they do, I mean, that thing is going to sync up right to your iPhone. It's going to have, you know, all of your contacts in it. And I don't know, like I just think that Meta can has to really innovate in the next couple years and race ahead to have a lasting chance here. Yeah. But the thing is I guess it's now it's in the game. I the So I've had a chance to sit with Zuckerberg a couple of times and the thing that I saw him the most frustrated about in our conversations was was the fact that he has to go through Apple and Android in order to deliver his services. He hates just being an app on the phone. So, I think he'll take the fact that he's in the game. , but it's not going to be easy to run away with. So, , all right. I I want to end here. , on your desk, if I'm not mistaken right now, you have the friend pendant. , folks, I don't know if you've seen it, but friend.com is this AI wearable device that a company. They they listen to your conversations. They give you updates and on your day. They're running a massive ad campaign in New York right now. Everywhere you look, there's these friend signs. And as Ario said last week on Twitter that this is chaos marketing signs meant to be defaced because it's just like these white signs and you know unclear slogans. long story short, you have one and I'd love to hear your experience with it, Max. Yeah, I I do have one of the friend devices. I got it a few days ago and I think that it is a really fascinating experience to try out an AI wearable. I will honestly say that, you know, like there's a lot of things that Friend is",
        "start": 2925.599,
        "duration": 6042.151000000001
    },
    {
        "text": "Max. Yeah, I I do have one of the friend devices. I got it a few days ago and I think that it is a really fascinating experience to try out an AI wearable. I will honestly say that, you know, like there's a lot of things that Friend is Like I think that their marketing is honestly like like one of the smartest marketing campaigns I've seen in a long time. , even if it is rage bait, I mean, it's getting so many people talking about this. it's it's incredible. and then the actual product itself, I think the packaging, I think the design, the experience of getting one of these things is very thoughtful. It does feel kind of like an early Apple product in the way it's packaged at least. And I know that the CEO, Avi, definitely puts a lot of attention into that. The experience of actually using it is a little bit unsettling in some ways. I mean, the device is , you know, it kind of has a snarky personality, kind of like you're talking to a 22-year-old. , it it kind of has, you know, this I mean, it has this always listening feature where it is you can't turn it off really easily. Like I mean I've had some sensitive conversations with sources that I've just literally had to disconnect the device from my phone completely and like toss it in another room because and you you you also have to sign this like crazy privacy agreement with friend where you basically have to agree that you know they can use your data for whatever you know that you can't sue them you can't do a class action lawsuit against them. I mean there I think there are a lot of a lot of strings attached to using a friend device. , it does make me wonder the whole experience about how can there be a good version of an AI wearable like this? Like this is a pretty strong starting point, I think. But, you know, what is OpenAI going to come out with? Like, you know, is everyone going to feel the same way about OpenAI's device as this? Or is there some way to make people feel a little more comfortable about it? And the output that it gives you useful? I think the out Yeah. It gives you summaries of of your day. It'll sometimes just text you like it designed to be like a friend. like so it'll just you know like you could you could be like I was talking to someone and it texted me something about like something he said like like man like I can't believe Finn said that like like what what was this guy talking about? And it does feel like it is trying to just get you to engage with it more. like it is I'm almost feel like I'm being rage",
        "start": 3064.72,
        "duration": 6312.231000000001
    },
    {
        "text": "like something he said like like man like I can't believe Finn said that like like what what was this guy talking about? And it does feel like it is trying to just get you to engage with it more. like it is I'm almost feel like I'm being rage always listening to me and it is interesting. AI has said that early users of friend send like an average of 200 messages a day to it which is a lot. and yeah I mean I I have like a lot of thoughts about using this device. , I'm not sure if this is something that I will, you know, I'm going to be a power user of or I'm going to use forever, but I think that it's fascinating to get, you know, a first experience with an AI wearable like this. Very cool. You're the first person that I've spoken with who's used it and can give us some insight into what it's like. And I have to say, , I I'm not running towards it right now, but I I'm I will eventually I'm sure I'll eventually use one of these things, but but I'm not running towards it. All right, Max. , before you head out, why don't you tell folks where they can find your work and where they can find you online? Sure. So, you can find my work at techcrunch.com. My name is Maxwell Zeff and, , I'm on X at Zeffax. , and you can also find me on Threads and Blue Sky under the same handle. All right. Well, Max, as I mentioned, , big reader of your work and, , this is the first time we've gotten you on the show. , and I I hope we are able to have these conversations many more times. So, thanks again for all the great work. Thanks for having me. Would love to come back. All right. All right, everybody. On Wednesday, Mike Kger, chief product officer at Anthropic, is going to be here to talk about Sonnet 4.5. So, we hope to see you then. If you haven't checked it out, I have an interview on the feed with Scott Guthrie, the head of AI and cloud at Microsoft, who did have some things to say about the AI buildout and why Microsoft seems to now be taking what he might call a more careful approach than some of the others out there. So, definitely encourage you to check that out. All right, that'll do it for us here today. Have a great weekend and we'll see you next time on Big Technology",
        "start": 3202.72,
        "duration": 6537.989999999999
    }
]