[
    {
        "text": " Google had the best week maybe ever, breaking Gemini ground with Apple and fending off the feds. AI's costs are rising, or are they? And is immortality within reach? That's coming up on a jam-packed Big Technology Podcast Friday edition right after this. Welcome to Big Technology Podcast Friday Edition, where we break down the news in our traditional coolheaded and nuanced format. We have a great show for you today. We're going to talk all about the amazing week that Google has had. everything from fending off the Justice Department and getting to keep Chrome and Android to the fact that Gemini might be a big part of Apple's new plan for Siri. , and of course, there's Nano Banana. We'll talk about that. We also have a very interesting story to discuss about how AI's costs are rising despite the fact that every token you produce is actually getting cheaper. And then we'll talk about the debate around that Wall Street Journal article that we should definitely get into. And then finally, well, Vladimir Putin and Xiinping are talking about immortality. And so that's how we're going to end it today. So stay tuned as we get to that part of the show. Joining us as always on Friday is Ranjan Roy of Margins. Ranjan, great to see you. How you doing? Good. Good to see you. I will give Google the best year ever if they can fix Siri for me. So I'm excited to dig into this. You may be in luck because that is exactly where we're going to start today. There have been a lot of reports coming out about the new plans that Apple has both for its devices and for Siri. And every time a new story comes out about what's going on with Siri, it seems to point to Google, which is really great news for the pack at Mountain View, who again began this generative AI moment, behind the eightball, and now are looking at a potential moment where their rival phone maker is going to include their AI because they can't get it together. Anyway, this is from Bloomberg. Apple plans AI powered web search tool for Siri to rival OpenAI and Perplexity. Mark German writes, \"Apple is planning to launch its own artificial intelligence powered web search tool next year, stepping up competition with OpenAI and Perplexity. The company is working on a new system dubbed internally as World Knowledge Answers that will be integrated into the Siri voice assistant. Apple has discussed also eventually adding the technology into the Safari web browser and Spotlight which it uses which is used to search from the iPhone home screen. The underlying technology enabling the new Siri could come in part from Alphabet Inc.'s Google, Apple's longtime partner in internet search. The companies reached a formal agreement this week for Apple to evaluate and test a Google developed AI model to help power the voice assistant and it could",
        "start": 0.08,
        "duration": 342.0799999999999
    },
    {
        "text": "screen. The underlying technology enabling the new Siri could come in part from Alphabet Inc.'s Google, Apple's longtime partner in internet search. The companies reached a formal agreement this week for Apple to evaluate and test a Google developed AI model to help power the voice assistant and it could components of this new Siri. What do you think about this Ron John? I mean this looks like Apple is saying all right we tried to build it ourselves we couldn't. we're not going to acquire perplexity despite my numerous pleas for that to happen and they're simply looking to partner now with the best in breed to get this Siri thing to work. What do you think? Well, first of all, for any longtime listener who knows how I feel about Siri, anything that makes it work just a little bit better, I'm incredibly excited by. I mean, the more voice has become kind of like almost my key interface with how I interact with my phone, it just is a reminder that of how far behind Siri is. But I don't know, like the some of the wording in this article that just stood out to me is that the internal system is called World Knowledge Answers and Apple is aiming to release the service described by some executives as an answer engine. Like I'm still it's unclear to me what they're trying to do because we've talked a lot about this like is Siri going to just be the way you chat with a chat GPT even if by voice or is it going to be I want to do things on my phone and will Gemini actually be able to finally help you look up your flight that Apple promised us years ago now. I think it's still unclear to me what exactly they're trying to do with Gemini. So let's talk a little bit about what they're planning to do with Siri. This is again from the Bloomberg story. Apple is Apple is rebuilding Siri around three core components. A planner, the search systems for web and devices, and a summarizer. The planner interprets voice or text input and decides how to respond. The search system scans the web or user data, and the summarizer puts it all together into the answer. So Siri is going to work at least in part with third party models. Apple has been leaning towards using a customuilt Google Gemini model for the summarizer. and it's also considering using a Google model for the planner function as well. So basically it's going to be it'll be everything. Yeah, you're right. I I think we still don't fully know the extent that Apple is planning to use Google for this or what it actually is going to be. like in some ways it sounds a little bit like it's going to be a new perplexity, but the fact that it's incorporating ondevice data as",
        "start": 171.2,
        "duration": 631.7599999999996
    },
    {
        "text": "we still don't fully know the extent that Apple is planning to use Google for this or what it actually is going to be. like in some ways it sounds a little bit like it's going to be a new perplexity, but the fact that it's incorporating ondevice data as something that's supposed to be an Apple intelligence thing. , we can start to talk about that more as we get more clarity on it, but I think for the purposes of this episode and this discussion that we're having, , about Google really having a good moment, I I think it's worth focusing on how that this is just a complete coup for Google. , a year or two ago, we were talking about how they were so far behind in the generative AI , , race and they couldn't get anything right. They they were telling people to eat glue. Their image generator wasn't working. And now they're on the verge of pro potentially powering twothirds of the system within I would say the most careful device maker that we have today in Apple. I think this is great. This is if you're Google, you're celebrating this. It's massive. Yeah, I I definitely agree. whatever it is. And and I'm hoping to learn more about it. But I mean, yeah, gone are long gone are the days of Google telling us to put glue into pizza and to eat rocks, which are still two of my favorite moments in the whole AI journey. But but I think the most important part to me about this announcement is the idea that if they get access to helping parse Apple's user data, I think that actually is huge. that the the separating out Apple's entire promise around how they're approaching AI is we're secure. We trust trust us with your user data. It's on device. And if Gemini and Google are getting to get into that level of Apple's overall infrastructure, I actually think this is massive. So I think yeah Sundar anyone who counted him out we should all eat crow on that one. Yeah I think we had that episode talking about whether or not we should fire him and obviously you know that discussion looks silly in retrospect. and it is interesting that it's Google by the way. I think you're starting to see some of Google's advantages play out here. the fact that it can lose a little bit of money to serve this stuff. the fact that it has its own chips that it produces for this the TPU and you the two other options that seemed like they were considered were Proplexity which would have come in via an acquisition and maybe couldn't have done it in a cost couldn't have done this in a cost-effective way or could not have convinced Apple that it was capable because it doesn't have the foundational model experience that Google does.",
        "start": 318.8,
        "duration": 949.602
    },
    {
        "text": "were considered were Proplexity which would have come in via an acquisition and maybe couldn't have done it in a cost couldn't have done this in a cost-effective way or could not have convinced Apple that it was capable because it doesn't have the foundational model experience that Google does. know was going to charge so much money that it seems like it potentially lost this deal based off of the cash. So right now on the AI front you have Google not only you know using its Gemini technology to power its own devices to produce some other cool experiences like V3 and nano nano banana which we're going to talk about in a moment. but also being the the company that Apple looks towards to do the Siri thing which is just to me sounds like a grand slam and u one of the reasons I would say Apple can look to Gemini to power Siri is because and there'll probably be some financial arrangement there and who knows who pays who right because you know Google obviously pays to be the default search with in iOS but you know if it's providing this technology does it get something on the back end? It seems like Apple would probably pay them. So, to get their technology on Apple devices. so, that's a win. And the reason why it can make these deals is because it's been faced with one of the toughest antitrust challenges we've seen to date from a big tech company. It lost. It was found to be a monopolist by the district court in DC. And then this week, we got the remedies. And there was talk about whether or not Google would have to, you know, spin off Chrome, spin off Android, whether it completely had to stop doing distribution deals with companies like Apple. And the judge who brought the ruling on Tuesday at Meta basically ruled across the board, none of that needs to happen. It can keep Chrome, it can keep Android, it can continue to pay for distribution within Apple devices and the partnerships can continue even though it has to deliver some of its search data to competitors. We don't know how much, but it won't be to me it didn't read like it's going to be mission critical stuff. so Google's really good week continued here with u with this it seems like a win amid a loss in the antitrust case. So what was your read there Ranjan? Yeah, I think when amidst a loss or after a loss is the right way to approach that again the idea that what was it a year ago when the ruling came out everyone said this could break up Google and then in the end Chrome Android OS they get to keep all of it and and the remedy again it was around they have to provide some search data some user interaction data",
        "start": 480.08,
        "duration": 1245.601
    },
    {
        "text": "it a year ago when the ruling came out everyone said this could break up Google and then in the end Chrome Android OS they get to keep all of it and and the remedy again it was around they have to provide some search data some user interaction data as to exactly what it is. So I think and it's only to qualified competitors and what that means is that duck duck go is that perplexity I think is all up in the air. So I think coming out of the idea like antirust could Google get broken up that everyone was saying that that ruling was the most powerful one since Microsoft in the early 2000s and then in the end it appears that not too much is going to happen to them. I mean, what was really interesting to me about the remedy, so I I did read through the the remedy decision here, and you get to paragraph two, and the judge is already talking about generative AI. saying effectively that like generative AI has upended the way that searches performed today. And basically, I'm not, the judge is saying, I'm not going to change anything. And I'm going to let this play out and the market will decide what's going to be the thing that determines who wins here, not me. And it was fascinating that the judge even said from the moment the ruling was delivered till today, things have changed so quickly that I no longer feel com feel comfortable taking these big actions. So, it's it's fascinating to me that basically generative AI or the thing that threatened Google saved Google from being broken up. Yeah. I I actually to me when I was reading through that, it actually is one of the most kind of like technically astute things. Everyone always talks about how like regulators or the legal system don't understand the nuance of advanced technology, but I actually think it's correct. like from a year ago. We talk about this regularly is search is threatened traditional search is it going to live on is everyone going to be on chat GBT and perplexity or doing AI search which I do believe will happen. so the traditional like what made Google powerful in the context of the ruling is definitely not the case as it was a year ago. Like, can we argue that them actually now having a great week in the generative AI space and like being able to consolidate power in other ways is an is a problem? Definitely. But it's a different problem. Yeah. The point is that they're going to have to fight for it. And so when you look at what the judge did here, it's sort of remarkable. cleared ruling that Google had basically illegally become a monopoly. not basically, that was the ruling. and then a cleareyed look at the fact that basically what had gotten it to this",
        "start": 630.079,
        "duration": 1569.6810000000005
    },
    {
        "text": "fight for it. And so when you look at what the judge did here, it's sort of remarkable. cleared ruling that Google had basically illegally become a monopoly. not basically, that was the ruling. and then a cleareyed look at the fact that basically what had gotten it to this And yes, you could try to punish it for what it had done sort of disincentivize it it and other companies from attempting similar tactics because there should be a punishment there. and I think I hear the argument that the judge didn't go far enough in this ruling. However, I I think if you if you think pragmatically about what is happening in tech today, it was the right ruling where it's basically just like the government doesn't have a place to put its thumb on the scale and decide which companies win. and so judge said all right let's just let this play out and you know enforce this small remedy which is the data sharing and see see and basically may the best product be the one that dominates. Yep. Again, I I tend to feel there's not enough concrete antirust enforcement taken over the last 15 years, but this one I have to give that where technology is and how power was defined, it's not the case anymore. And again, even on the browser side, I don't know if you saw the browser company got acquired by Atlassian. If any arc browser fans are now who are trying deal like like there's competition. I don't use there's there's definite competition on that side on the generative AI side. So I think we'll we'll see how this plays out but and Google's doing pretty well. But the power isn't just on search and ad tech. Very quickly before we move on with Google's great week, is it just worth talking about the counterargument here which is that yes, there's this new era of generative AI. Google's probably just going to, you know, resort to its old bag of tricks and put a, you know, a product that is not clearly better than everything else into the hands of many many people because of its distribution advantages. I mean, now one of the interesting things in the in the ruling was that Google can no longer pay for the exclusive position within things like Safari. So it can can't be paid Apple to be the only thing, but it's allowed to pay for distribution. and so so that can continue. So why aren't we just going to see a repeat of history even if it's a new technology? Well, I think we don't know what the landscape is going forward. Like in the in the old world, the search bar in Safari in iOS actually was one of the most valuable pieces of real estate in the world. it isn't anymore. I mean, which is again, you can I'll agree with you that like putting Gemini into series",
        "start": 795.12,
        "duration": 1884.2410000000013
    },
    {
        "text": "going forward. Like in the in the old world, the search bar in Safari in iOS actually was one of the most valuable pieces of real estate in the world. it isn't anymore. I mean, which is again, you can I'll agree with you that like putting Gemini into series works on that side, whether it's all like completely walled off, but but but yeah, the the old world doesn't exist anymore. And if a new antirust case that actually clearly defines how they're setting up their kind of new power structure, it need it would need to be that versus what it started five years ago when this case was brought forth by the last Trump administration. Yeah, it's a very different world. And it also just reminds me that this week we also had the CEOs of basically all the major big tech companies sitting with President Trump. Zuckerberg was there, Sergey was there. interestingly Sundar Pachai, Tim Cook, Sam Alman and all of them basically like you know they they took turns going around the table pra praising the president. but it was interesting to hear them say like it is nice not to have a administration that's fighting our companies and instead supporting them. , and it's I mean that's interesting because again like Trump is more business friendly, more big business friendly, but he's still his one tweet and then everything changes. Yeah. But also the cases that he brought in his first term are still going forward. It's not like he withdrew them. It's not like he instructed the Justice Department to like stop the remedy phase of the trial. Let the judge decide it. But it's I guess it's neither here nor there. I think that the thing is the fact that they're feeling that way. sort of indicates that we're now in this moment where big tech, which has only grown more dominance and impervious to criticism over the years, is about as teflon as it's ever been. And nothing is basically stopping it from solidifying its dominance even further. as we go into this AI era which on one hand threatens yes to disrupt its products but also takes a tremendous amount of money and and data data center and and engineering talent and and only big tech has that. It's good to be have the name of the podcast big technology. Well, yeah, that's what we're not going anywhere. No, that's right. Neither is this podcast. I mean, if let's I'll just say like for the sake of argument, if big tech did to lose its dominance, we would we'd have great stories to talk about on the show for years. But it does seem like this the title of our show will be relevant for for a long time to come. , all right. Should we continue on this jolly adventure looking at all the good news that Google has had? It's a Google week. It's a Google week",
        "start": 953.839,
        "duration": 2210.6400000000026
    },
    {
        "text": "years. But it does seem like this the title of our show will be relevant for for a long time to come. , all right. Should we continue on this jolly adventure looking at all the good news that Google has had? It's a Google week. It's a Google week little bit about Nano Banana, which is something that I know that you're particularly excited about? Yeah, Nano Banana Google quietly released and then it started to kind of make waves and then there's been more and more noise, but basically it's a new image model. It's the the nickname for it. You can access it. It's like technically Gemini 2.5 Flash. And actually to Google's credit about how good of a week or month they're having, in the old days, they would have made a big deal about Gemini 2.5 Flash as the name of the official model, but somehow now they're even coming out with an amazing name like Nano Banana that actually everyone remembers and actually can go slightly viral. But mainly image generation, it's incredible. It's definitely leading the pack. Actually, one of the things that blew my mind is Adobe is now actually including Nano Banana/Gemini 2.5 Flash in Photoshop and Photoshop Express. Adobe who with its own Firefly model like and was saying this is the future. We're going to own this. It's copyright indemnified. They're actually the the fact that they're letting it into you know the premier photo editing software across like the entire enterprise world means that they're even giving into Google in this side and saying you guys have the best image model. So I think it's just at every level. But then the other part of it is it's getting people into Gemini while we're everyone's using chat GPT perplexity and claude that apparently 10 million people who were new to Gemini use the app to use it for images. So I think again more people using the core app for these new image editing capabilities. It's yet another yet another good thing for Google. Yeah, it's a very very impressive model. I mean, it can do crazy things like it can blend photos. So, you could ask it to combine two separate photos into one. , this is according to according to Android Central. , you could also take selfies and then ask it to put you in certain situations like turn you into a spacew walking astronaut or a rockstar or anything you can think of. It also does these really interesting things like continuous editings editing. So, you could tell you could tell Gemini or Nano Banana what to add to an empty room and then continue to tweak the design and like add follow-up questions. Like, this is this is amazing. This is natural language design and it looks incredible. I've seen unbelievable examples come through the timeline over the past couple days. , it's obviously being used for lots of hilarious sports memes,",
        "start": 1119.44,
        "duration": 2547.2000000000025
    },
    {
        "text": "then continue to tweak the design and like add follow-up questions. Like, this is this is amazing. This is natural language design and it looks incredible. I've seen unbelievable examples come through the timeline over the past couple days. , it's obviously being used for lots of hilarious sports memes, receiver, , CD Lamb, , trying to catch the game-winning touchdown with no arms. , but which he which he did not. U, but also someone put their selfie up and asked Nano Banana basically to give them four iterative , examples of this turning from a sketch into a drawing. And effectively you can see the drawing process take place just totally generated by AI. It it is astonishing. I I think that last part to really dig into why that's so impressive for anyone who' used like certain things like transform a selfie the big transformation that is just on quality. You've been able to do that with a lot of systems in the past but now it looks really good. But that idea of continuous editing, the reason it's so powerful is, and many of our listeners probably like experienced this at some point, if you create an image and you wanted to change something, every image model would redo the entire thing because that's how a diffusion model would have to work. It would reimagine all the pixels. and they were okay at trying to remember what was in the last model and actually creating something that kind of looks like a minor change, but actually they were not great and they were certainly not perfect. And with images that stands out very clearly. Now like actually being able to define I want to change only this one part hold the rest constant to to like the normal world that might seem like intuitive or that should actually be possible but with image models that that was actually one of the most difficult things to solve. So the fact that and I've tried that in a number of situations like the fact that it actually works is a big deal. Any safety concerns here? I mean, are we going into what's called the reality hole where you basically have no idea what's real and what's fake? I mean, we're already basically there, but as these things get as sophisticated as Nano Banana and VO3, starting to get a little nervous. Well, actually on that, I saw a tweet from Rob Leern, , where he basically it was Mark Zuckerberg smiling at Trump in an official Getty image, and this is actually he turned it into Mark Zuckerberg yelling at Trump. And the craziest part of it is it perfectly retained actually on this topic of continuous editing, it retained the Getty image logo perfectly. And he actually noted that the one of the craziest parts of this is Google a year ago or maybe a year and a half ago did",
        "start": 1289.919,
        "duration": 2859.120000000003
    },
    {
        "text": "the craziest part of it is it perfectly retained actually on this topic of continuous editing, it retained the Getty image logo perfectly. And he actually noted that the one of the craziest parts of this is Google a year ago or maybe a year and a half ago did of people that you upload for safety purposes. And now that's out the window. You can do whatever you want. So, so I think it there definitely needs to be it seems like for the sake of progress, they've just gone all in. Let's just move as fast as possible and see what happens. But it's it's a problem. Yeah. I mean, we had Dario Ammoday on a couple weeks ago or last month talking about this race to the top that he wants to incentivize, but those rarely happen. Typically, it's a race to the bottom. I mean, remember OpenAI sort of took away those sort of guard rails within Chat GPT and let you do anything with its image editor and that's how we had this Studio Ghibli moment and now clearly Google's just right there with them. Yeah. Yeah. Actually, I remember and if you remember that moment, at least for myself, like everyone was creating those Studio Ghibli images, but like you couldn't exactly ask it to do the copyrighted name or like the the actual name. and you had to do workarounds which still was at least some kind of guard rail whereas now it's just like here's a photo of Zuckerberg and Trump make him yell at Trump and it just does it and it does it right all right so let's recap we've talked today about Google's AI foundational models being good enough that they might end up powering Siri we've talked about Google fending off one of the most intense antitrust challenges we've seen to a big company in the United States in in century. , we've talked about Google being a being able to lead with these image generation models. , and of course the business is crushing, right? The fact is that they continue to make more money from advertising and search than they did and they're jumping up by double-digit percentages year-over-year. Oh, yeah. And they have this cloud business that's benefiting from , generative AI as well. just announced, this is something that came up in our discord. they just announced this $10 billion deal with Meta for AI infrastructure. So Google's just firing on all cylinders. So may a culpa for a criticism of Sundar's ability to lead this business cuz again this came up in our discord what the stock is looking like. and I was like well I wonder if Google's actually back. Here's the stock. up 10% in the last five days, up 19% in the last month, up 33% over the past six months, up 40% over the past year. Not bad. So rosy picture, but in the spirit of",
        "start": 1448.24,
        "duration": 3167.680000000004
    },
    {
        "text": "and I was like well I wonder if Google's actually back. Here's the stock. up 10% in the last five days, up 19% in the last month, up 33% over the past six months, up 40% over the past year. Not bad. So rosy picture, but in the spirit of Google that can actually still bring them down and end up with Sundar on the hot seat? Still the same thing, right? I think that we just we are so early here. We don't fully know what the interaction mode of generative AI is going to be, but search will definitely be one of the cases. So, it's like one of those things that it's like the answer to your long-term threat doesn't get revealed two years into or three years into the change, right? It's something that happens over, you know, maybe a decade, which is great for Google because you have like a decade to figure it out. but ultimately I don't know about you but I see myself doing more and more searches within chat GPT and of course perplexity and Google will obviously like maintain a large share of searches moving forward. We just had the people running the search team on the show a couple weeks ago but it's not a guarantee. Yeah, I think that's I think that's at least when the core business is still under threat. They're still going through the innovator's dilemma. I mean the web is still dead in my opinion or in secular decline. so yeah I think they have to execute on all these different paths that they're taking. They have to execute well. So but they're doing it so far at least in the last week in the last couple of months. Let it be known that the first week of September 2025 has been the week where Google said all that criticism enough with all that. We are we are in shape. We're trucking along and we might be even further inside the iPhone in in just a couple months. I think all this makes me actually feel are we just is this a death nail for Google? all this positivity is it is this a top I appreciate that skepticism but I'm gonna say no. What do you I It's I mean again all the pieces are in place they have to execute on them. , so yeah, I'm not going to say that, but I don't know. Anytime the stars seem this aligned perfectly together for a a giant this complex, it's it it doesn't always go that smoothly. But think about it this way. I mean, if you think about, let's say, businesses powering these strategies, , they're still the cheapest tech giant on the S&P 500, , or of the Magnificent 7 when you look at the PE ratio. So, they've been doing this all with like very low expectations and they're executing and it's still there's",
        "start": 1607.12,
        "duration": 3492.238000000004
    },
    {
        "text": "think about, let's say, businesses powering these strategies, , they're still the cheapest tech giant on the S&P 500, , or of the Magnificent 7 when you look at the PE ratio. So, they've been doing this all with like very low expectations and they're executing and it's still there's the $4 trillion valuation. And by the way, some one crazy thing that came out of Nvidia's earnings last week was I think something like two companies make up 39% of its revenue. that that doesn't sound good to me. That's I think economists would call that concentration risk. Yeah, I think actually that's a good point. One of life's great lessons that low expectations are always a a better place to start and that's worked well for Google unlike GPT5 in recent weeks. Google took the the other path and it seems to be working. Yeah. I mean, you wouldn't see Sundar on the Theo Von show talking about how Gemini is gonna be everything. That happens. That's top. That's top. That's top. Sundar on Theo. That's top. But okay, hold on. If they record that show in a Whimo, driving autonomously through New York. Not top. That's AGI. That's AGI. And this idea brought to you by the agency of Gantro and Roy. That's right. You can send us We'll send you the bill, Google. the van in a whimo with Sundar being like, \"Yep, this is what meth feels like.\" All right, let's take a break and come talk about these new iPhones coming up and then of course the cost of AI. We'll do that right after this. And we're back here on Big Technology Podcast Friday edition. All right, next week we have two, well, no, one big event from Apple. I was going to say two new iPhones. It's actually three new iPhones that we have coming up. we talked about that a bit with MG Seagler. but folks, next week for all intents and purposes is going to be the iPhone 17 Air event. Now, of course, this is from Mark Gurman at Bloomberg. they're going to be new high-end versions, the iPhone 17 Pro and the Pro Max, which will have new backs and give a fresh look to the camera areas. But there's this allnew model, which is expected to be called the iPhone 17 Air with an ultra thin body. Here are the specs. The Air will be roughly 5.5 mm, making it about a third thinner than the iPhone 16 Pro. , that comes with some drawbacks, including a drop in battery life and the inclusion of only a single rear camera, which sits in a pill-shaped bump. Ranjan, you and I, I think, will lead the show next week talking about our reaction to the new iPhones. But, , I just temperature check right now before we move on to our next story. , what do you think about the Air and is it something that you're",
        "start": 1771.279,
        "duration": 3802.559000000003
    },
    {
        "text": "Ranjan, you and I, I think, will lead the show next week talking about our reaction to the new iPhones. But, , I just temperature check right now before we move on to our next story. , what do you think about the Air and is it something that you're Not interested. I'm going to be Whoa. be very very direct. Angry. I know. Angry. Put the foot down. I'm saying Ranjan. Ranjan has has had it with Apple. The big promises about a new Siri and Apple intelligence and now they're going to give me a less powerful, thinner phone. Throw it out the window. No. No. But but that's why that's why it's so out of touch for me that no one is complaining about the width or the thinness of the iPhone. Battery life has always been a consideration or complaint consideration. Everyone loves the camera. This one of the main selling features. So to move in that direction, but the reason I think like I'm more skeptical is Samsung is killing it from a marketing perspective with the new fold. like and I think what's the tagline? It's like your phone can't do this or it's some it's like feels very appley of the old days where they're coming right at you and saying you want this and your phone can't do this. I was actually last weekend I was at like a gathering and someone had one of the not the fold like the larger fold ones but the ones that f it's about the normal size of an iPhone but it folds in half and they took selfies and like set it up and everyone was just like wow this is amazing like I have not se that was the first time for Samsung I've ever seen a group of people who all have iPhones be like wait that's really cool versus when's the last time you've seen someone with an Apple piece of hardware be like, \"Wow, that's cool.\" So, I think Samsung is making waves. People the innovation in phones is around folding. Maybe there's going to be something else, but it's not. I don't need my phone to be 5.5 mm thinner. I hear you. That's sort of been the crit the criticism is that Apple has just refined its devices, made them smaller, thinner, made them a little bigger, now making them a little smaller. maybe this is a move end route to the fold. It's possible that you have this thinner phone. You just put two of them together. You know, it's easier to fold. I don't know. I'm kind of grasping at straws here. but but that they I think next year the folded will be you're right that will be the big the big phone and this will I think they'll still see some sales because it will be cool. but I think the educated consumer will hold out for I don't I for",
        "start": 1930.72,
        "duration": 4093.4380000000037
    },
    {
        "text": "but that they I think next year the folded will be you're right that will be the big the big phone and this will I think they'll still see some sales because it will be cool. but I think the educated consumer will hold out for I don't I for I'm gonna get the fold. It just sounds feels bulky. But I mentioned this last week with MG Seagler. Every time I see somebody using a folding phone, they just seem happy and very satisfied. So folding makes you happy. Folding makes you That's the one thing I see it too. People are smiling. They're like excited. They're they're just walking around with their either smaller foldable phone or their giant foldable phones that were they they're just happier people. Yeah. Just like Yep. They're They're very thrilled to show you. They're like, \"Look at this It's a phone. Now it's a tablet.\" Yeah. Phone. Now it's a tablet. How How do you feel with your How How do you like your smaller, thinner iPhone? Do you Do you feel good about your limited battery life and one camera in a pill? I didn't think so. Look at this. In a pillshaped bump, pillshaped bump. All right, that's a good setup for next week. Let's continue this next week. In the meantime, I think we should be talking about this very interesting article from the Wall Street Journal that touched on the economics of artificial intelligence and really seemed to do some great reporting. It's by Chris Mims did some great reporting on a conversation that we have often on the show. So, here's the story. cutting edge AI was supposed to get cheaper. It's more expensive than ever. Mims writes, \"As artificial intelligence got smarter, it was supposed to become too cheap to meter. is proving to be anything but. Developers who buy AI by the barrel for apps that do things like make software, analyze documents are discovering their bills are higher than expected and growing. What's driving up the cost? The latest AI models are doing more thinking, especially when used for deep research, AI agents, and coding. So, while the price of a unit of AI known as a token continues to drop, the number of tokens needed to accomplish many tasks is skyr skyrocketing. The cost of inference is going down by a factor of 10 every year. But despite the drop in cost per token, what's driving up more cost for many applications AI applications is reasoning or thinking. So I am kind of curious what you think about this Ranjan. There was this idea that you know the the guts of AI was supposed to be close to free. That's where this like too cheap to meter idea which comes from open AI began. And now it looks like yes the cost per token is dropping but because AI has advanced and the new techniques ask it to",
        "start": 2078.72,
        "duration": 4383.599000000003
    },
    {
        "text": "the guts of AI was supposed to be close to free. That's where this like too cheap to meter idea which comes from open AI began. And now it looks like yes the cost per token is dropping but because AI has advanced and the new techniques ask it to more to use it because you just need that thinking to happen. So AI isn't actually that cheap after all. What do you think about this? I I this was very interesting or it's very important to me because again given I work very closely with enterprise AI like this the conversation of cost comes up all the time but to me the part this is missing is and we've debated this about GPT5 and whether like tool calling and re reasoning can be too much is that really what we want if I just want a simple answer this only is a problem when everything starts with the singular chat interface that I'm starting in the same place and I'm trying to do something from scratch every time. But what what I can tell you is at an enterprise level, the way people are approaching this is once I figure out how to do something, I'm not reasoning through it. I already know what tools need to be called and whatru the structure is and I can make it very cheap. like I don't have to have the model figure it out from scratch every time versus if you even think about like at a consumer level if I'm trying to search for flights and then book the ticket and something we always kind of come back to as our example once you've defined go to this website or this flight database go here here's my credit card info like it should be a very slim down process that can be very inex inexpensive. It It does not need any reasoning. It just needs execution. But to me, what's happening right now is we're all evaluating this based on I'm starting with just a blank chat screen. The system is starting from scratch every time. Memory is starting to get interesting in this overall, but that's why it's so expensive and it's not sustainable at all. But because the systems are probabilistic, right? So, it's trying different paths every time. , is there such thing as basically determining a path that works for you and then following it every time or is it still going to kind of get lost along the way if it's going to operate the way that we know these bots to operate? No, no. This is where again the way like we look at this in my world is structured versus unstructured agentic. Unstructured is what a GPT5 is. It's I will decide what tools to call every time. But then structured is I know what tools to call. I define them and it will take go down that specific path. So",
        "start": 2225.04,
        "duration": 4692.959000000003
    },
    {
        "text": "look at this in my world is structured versus unstructured agentic. Unstructured is what a GPT5 is. It's I will decide what tools to call every time. But then structured is I know what tools to call. I define them and it will take go down that specific path. So completely probabilistic like if you approach long workflows completely probabilistically every single time even if it's stuff you're repeating over and over if you think about like customer care agentic AI it'll never be economical. It'll it'll only get more and more expensive. So, I think that's the big distinction here. Very interesting. All right. I loved what Aaron Levy had to say about this. He says, \"This is precisely Jeban's paradox in action in the purest form. Because the cost of AI tokens has gone down, we can now afford to use far more of them for increasingly complex tasks. The key point, thus, is not that AI is getting more expensive. It's that it's because it's getting cheaper and more capable. We're using it to solve problems better. For almost every like for-like task, we're just using way more tokens to complete the tasks to deliver far better output. Whether it's writing code, answering a healthcare question, or analyzing a contract, we're using far more AI today to perform that work because we need the additional points of performance. Getting 99% getting a 99% correct answer when working with a legal contract is very different from a 99 90% correct answer. and it's easily worth the 10x to 100x increase in tokens. Now, at some point, we will start to reach plateaus for certain types of tasks and then the cost per task will go down. , but the general cycle will essentially go on forever because we will just keeping raising the bar of what we do with AI. I thought that that was really really interesting and I think probably right. Yeah. No, that that's exactly it. Like forlike tasks. There's no reason to breaking out into those two things. Like for like tasks, there's no reason to go through reasoning from scratch. And then certain things should require a lot more attention to get to that 99% accuracy. And it's still funny that to me like he uses 99% not 100%. but for those they should be more tokenheavy. they're more important to get it exactly right versus certain things just should be token inexpensive and again open AAI said with GPT5 it's supposed to be able to understand the difference and but but it very clearly like from the way people had been seeing it being used early on and again this was your complaint too like sometimes for the most basic questions that in the past would have just shot out an answer back to you now it's going to go do 10 different things and come back to you with like an entire PowerPoint presentation that you don't want and",
        "start": 2381.28,
        "duration": 5018.398
    },
    {
        "text": "was your complaint too like sometimes for the most basic questions that in the past would have just shot out an answer back to you now it's going to go do 10 different things and come back to you with like an entire PowerPoint presentation that you don't want and think that's where the problems are right now that will get solved. All right, folks. And speaking of Aaron Levy, he's actually coming back on the show. We're going to have him back on Wednesday, September 17th to talk a little bit more about what he's seeing and some of the latest announcements that he's going to make at his Box Works conference coming up this month. So, more from Aaron Levy coming soon. I'm sure we'll talk with him about this. Speaking of my complaints and everybody's complaints about GPT5. Well, if you thought that the era of the big model was over because GPT5 didn't blow everybody away and you know usher in this era of super intelligence and AGI. The money says no. The money says you know let's keep scaling. here is the latest story on that. Anthropic has raised a 13 billion series F at a postmoney valuation of 183 billion. That's 183 billion with a B on Tuesday. It's complete. It said it completed this new funding round that valued it nearly three times from where it was 6 months ago at $61.5 billion. The investors include Altimter, , Black Rockck, Blackstone, CO2, D1 Capital Partners. The company also says its run rate revenue, which was 1 billion at the beginning of 2025, was more than 5 billion by August. And Cloud Code has already generated over 500 million in run rate with the usage growing more than 10x in just 3 months. , of course, it was at a zero base anyway, so what does that 10x mean? But anyway, another big funding round for a big foundational lab company. The scaling will continue around John. Scaling will continue. SC I mean for me actually my favorite part of this announcement was it literally was like an Avengers assemble of every late latest late stage high growth fund there is. Altimter Bailey Gford Blackstone CO2 D1 General Atlantic there's two Tros Troll Price Associates. Troll price investment management like got to get all the T-R you got to get two T-RO in your round otherwise you're not going to make it. every everyone every n Ontario teachers pension plan like to their credit they assembled every latestage momentum all that money all in one place at a a very hefty 37 I mean actually no I mean the valuation is insane it's close to it's more than 60x revenue it's big and and guitar's there investment No, got to got to get a little bit of that 37x revenue. 37. They did raise from the the Gulf States, right? So, they had talked about Daario had talked internally",
        "start": 2547.68,
        "duration": 5377.039000000001
    },
    {
        "text": "valuation is insane it's close to it's more than 60x revenue it's big and and guitar's there investment No, got to got to get a little bit of that 37x revenue. 37. They did raise from the the Gulf States, right? So, they had talked about Daario had talked internally give up like not raising from countries that are run by dictators and and indeed it's done it.\" Or authoritarians, I don't know. Call it what you will. Guitar is in the round. two T-RO, a Gulf State, and a couple of ex-tiger cubs, and you got yourself a $183 billion obligation. Yeah. Yeah. I mean, it's it's obvious that Anthropic sees this moment has has shown incredible momentum with the coding thing and despite everybody trying to catch up with them is still leading. I mean, you see OpenAI really trying hard to push this narrative that Codeex is the leading coding application and maybe it's doing well. I don't doubt it, but but they they clearly are going to have to do a lot of work to catch up with anthropic. So all right, new funding for anthropic. Let's end this week with a hot mic moment caught between Xiinping and Vladimir Putin. This is from the AP. Xi and Putin's hot mic moment. How long will science extend the human lifespan? , Chinese leader Xiinping and Russia President Vladimir Putin chatted about how advances in science could prolong the human lifespan in a rare hot mic moment in the Chinese capital. She spoke first and said before it is said to be very rare to live up to 70 and now it said you are a child at 70. Putin said according to some translator in a few decades as biotechnology continues to develop human organs will continue to be transplanted and people will become younger and perhaps achieve immortality. Xi appeared to break into a slight smile and then said some predict within the century may be possible that people will be able to live up to 150 years old. I mean obviously this is something that's of interest in Silicon Valley as well. So I thought it was interesting to bring it up. but let me just give my first simple reaction. It's very interesting that in the short amount of time that these world leaders have you know to spend time with themselves they're talking about transplanting human organs and pursuing immortality. What what what do you make of this story? I mean I I'll admit on one hand it was kind of like fascinating to me and it made me wonder like do either of them follow Brian Johnson on Twitter? I don't know if people know the you know Brian Johnson, right? Yes. But tell tell folks who who he is. He Bri he is a fascinating character. He was the ex-founder of Brainree, a payments, a startup that was bought by PayPal that actually and then made a",
        "start": 2730.0,
        "duration": 5682.398000000006
    },
    {
        "text": "Twitter? I don't know if people know the you know Brian Johnson, right? Yes. But tell tell folks who who he is. He Bri he is a fascinating character. He was the ex-founder of Brainree, a payments, a startup that was bought by PayPal that actually and then made a prolong his life and does all sorts of thing things on social media to show himself working towards life extension. And some of them are kind of horrifying, some of them are just comical. But but he's the face. check him out if you for a little bit of entertainment. But I think or or some guidance if you're into life extension. But to me, the part that jumped out was that biotech like human organs. I mean, when you're talking about transplanting human organs and you're an authoritarian dictator, it's man that was crazy. It hits you. And they're smiling. That was the best. They're just like But but you know what? If you are a like world authoritarian dictator with a managing a billion odd people for one, managing a large nuclear arsenal for another. It that that was actually the more fascinating thing to me is that they do think about this stuff that like they're it it's it's on their minds and they're talking about it versus I'm just worried about the trade war or some other policy issue that's going on. They're literally thinking about living up to 150 years old. I mean, this is definite like Squid Game stuff. , you know that if they're talking about it, they're thinking of doing it for themselves, right? Like harvesting the human organs. And it's just so interesting that like as they sort of start walking with each other, I mean, one of them has got to be like, \"Hey, man. , so I'm trying to live forever. Here's how I'm going to do it. We got a lot of people living in my country and my getting old. Oh my god, that would be they should get a podcast. I would take it some transparency. I mean, yeah, podcast in a Whimo talking about harvesting organs. Harvesting organs. It's crazy. Antonio Garcia Martinez reacting to this says, \"Life extension, never mind curing death, would be the most stifling thing in human history. People complain about boomers now. Imagine living in a world where leadership cast dates from centuries ago immortality would be the death nail of humanity. I like that. I think that makes sense. I mean, we should do a what would it do to the housing market and housing supply? I don't know. I've seen a bunch of stuff around like it's the aging population within the US or other developed economies are actually one of the biggest reasons that you know housing gets more expensive. just overall being younger becomes more difficult and I think that's the more extreme version of that. If you had some",
        "start": 2884.079,
        "duration": 6001.116000000005
    },
    {
        "text": "of stuff around like it's the aging population within the US or other developed economies are actually one of the biggest reasons that you know housing gets more expensive. just overall being younger becomes more difficult and I think that's the more extreme version of that. If you had some plot of land and you can't buy, you're just renting from him. That's where we're all going. let me ask you this as we end this week. All right. Let's say you're you're 80 years old and your organs, you know, they got some mileage on them. And in an ethical way, someone says, \"Hey, we'll give you some some organs some new organs, some young people organs, and some lab grown organs, you know, even. And and we could maybe give you another 60 years of life.\" Are you saying yes? Wait, wait, wait. Hold on. I'm not going to let you go with there's a lot to unpack in the last two minutes of the show there. In an ethical way, they're going to give you some young people's organs first. How does that happen? It's I mean, it's possible that just like maybe some young people happen to have passed away and decided to be organ donors and there's lots of organs now and so I don't know. It's it's actually quite hard to imagine now that we're unpacking this scenario. Yeah. Okay. Labrown orans. Lab grown. Lab grown organs. Lab grown. Lab grown. Cut me open and throw it in there. I'm in. You're doing it. I'm doing it. Lab. Actually, I I read something around there was a pig heart transplant or sorry, lung transplant and apparently like lungs when they're in bad shape are one of the most difficult. There's been like liver transplants in the past and it kept someone who was in a comeosse state or vegetative state. actually it helped them it showed that it was like on the way to potentially working it worked for a brief moment. So I think how would you feel about that animal organs? Are you ethically okay with that? Okay. Sure. I mean I also think that we just spoke a little bit about these brain computer interface applications on the show on Wednesday and it's amazing. Then the previous Wednesday we talked about how electricity might be used to stimulate new organs. U because that's effectively the signal telling them to to grow. So I I think we might be not too far away from a version of this question actually being real and not the sinister way that we heard from Putin and G this this past week. So I think it's a relevant question is what I'm saying. This is now a life extension podcast. no longer a big Oh yes, we were always heading this way. I mean, how else are we gonna I'm sure we have some young listeners, you know, if",
        "start": 3045.52,
        "duration": 6298.477000000005
    },
    {
        "text": "this past week. So I think it's a relevant question is what I'm saying. This is now a life extension podcast. no longer a big Oh yes, we were always heading this way. I mean, how else are we gonna I'm sure we have some young listeners, you know, if able to do this podcast for your entire natural life. And so, the only way for us to do this is by implanting lab grown, ethically labown. That's why we're doing it mostly is because we want to keep making this show for you. That's why that's why I want to go from 80 to 140. Exactly. Do you think All right, last question before we leave. Was that all right? Obviously, it was picked up by a hot mic. These people aren't idiots. They know that there's cameras and mics all around. Was that an intentional conversation? No. Everyone can get hot micd. I feel even Putin and she I think that especially she like in an authoritarian regime where you don't want that thought getting out among people amongst people. That's true. Well, we might be the only ones actually hearing about it here in the outside of China. , but you know, I think the best way to prevent these hot mic moments is to get get a thin iPhone, an iPhone air because it can't record anything. That thing won't do anything for you. So, all right, Raj, we'll talk about it next week. Thanks again for coming on. Great speaking with you as always. All right, see you next week. All right, everybody. Thank you for listening on Wednesday. Bill Vas, the chief technology officer of Booze Allen will finally be on the show talk about whether we can use AI and technology to fix the government. So very much looking forward to bringing you that episode and we'll see you next time on Big Technology Podcast.",
        "start": 3197.68,
        "duration": 6472.237000000005
    }
]