[
    {
        "text": " Where does the AI race go from here? And is all this AI agent hype real? Let's talk about it with the CEO of Snowflake right after this. Welcome to Big Technology Podcast, a show for coolheaded and nuance conversation of the tech world and beyond. We have a great show for you today. We're going to talk about the state of the AI race, looking at the Open AI versus Google access with someone who really knows what's going on in the competition. And we'll also take a look at the state of AI agents and what AI programs can do when they organize their data. Well, we have the perfect guest to do it with us here today. Sar Ramaswami is here. He is the CEO of Snowflake, third time on the show. Welcome back, Swedar. Alex, always great to talk to you. Thank you for having me. So, it's been a couple years since we've spoken. For those who don't know you, you spent 15 years at Google. your last job there was the SVP of ads and commerce. You founded Neva, an ads-free search engine in 2019. You sold that to Snowflake in 2023. You became the CEO of Snowflake in 2024. Snowflake for the uninitiated. 59 billion public company. It is a data cloud company which stores, analyzes, and helps you share data. And you really have a front seat to the AI race. So, let's begin with the AI race. Just give us your perspective on the state of the AI race. Now, it seemed like for a while there was OpenAI and the rest. Now, it seems like there's two axes that are forming the I'll call it the uncomfortable marriage of OpenAI and Nvidia and then the the Google side of things where they have the model, the TPUs, and they seem to be giving the incumbent a run for their money. What's your perspective? First of all, the AI race changes every month. We should all feel great about making predictions because one of them will come true and it'll the world will change enough that we have to make new predictions. I think u the gap between the truly great model makers of the present era it's like open AI the anthropic and Gemini very much in that mix and everyone else is quite staggering and it's also a world in which no incumbent should feel comfortable about their position because things are changing so much and a great new model can sometimes end up producing a lead that's like a year long which is an eternity in in today's world and and so I would say from that perspective it's early there's a lot of change what is also quite profound about this moment is the things that we can get done with the models that have already been launched where it's merely an issue of stuff like mechanics for can you get inference",
        "start": 0.08,
        "duration": 352.159
    },
    {
        "text": "would say from that perspective it's early there's a lot of change what is also quite profound about this moment is the things that we can get done with the models that have already been launched where it's merely an issue of stuff like mechanics for can you get inference think that's the part that sometimes people overlook about what is remarkable about this moment these models they can do amazing things we'll get into some of the things that we snowflake are doing I think it is their ability to create value their ability to help among the most priced of professions today software engineering I think that's the thing that will drive so much impact. Lots more to come, but I would say it's very very early in the AI race. I I agree with you and I want to drill down on this a little bit because you are somebody who has the mentality that sort of is needed to analyze what's going on. You're not only somebody who spent more than a decade at Google, including time at as in the highest ranks of the company, you competed with Google. Mhm. And so if it's like when we think about what's going on with the AI race now, Google is this it's a beast and it has this distribution advantage and in fact we recently published some data on big technology that showed that OpenAI had opened up a very big lead. It's still growing quickly. It's grown 50% web visits January 2025 to January 2026. But the lead is shrinking and Google has for instance grown its web visits by not 50% like OpenAI but 647% in the same time period. When you say web visits you mean for things like Gemini correct? Yeah. Not just Google itself. Yeah. The the chatbot visits for Gemini. and some of the the aura around opening I was predicated on it having this lead and not letting it go. In fact Sam Alman I think he was in India and he was like you could try to build a model like ours but it won't work. Y and now with things like Deep Seek Communic 2, we've seen people able to catch up on that front. So it's being pushed by Google on one hand, the open source model builders on the other. Help me figure out how open AI can can continue to lead this this race if it can or is it just one in the pack? I mean, I think the fact that it has become OpenAI has become the Google of choice when it comes to chat for most of us, that's actually a durable advantage. And I I I I use it quite often for all kinds of things, including solving problems in the real world. My coffee machine not working or I can't open my gate anymore. like it the amount of use that you can get is pretty remarkable. I",
        "start": 175.2,
        "duration": 649.2809999999997
    },
    {
        "text": "a durable advantage. And I I I I use it quite often for all kinds of things, including solving problems in the real world. My coffee machine not working or I can't open my gate anymore. like it the amount of use that you can get is pretty remarkable. I hand, something pretty simple like not simple, it's hard, faster image generation or more accurate image generation, which is what Google pioneered with Nano Banana. It's actually having a profound impact on things like their usage and OpenAI was late to the game just for that one feature. You think, come on, it's a small feature. How much can it matter? it matters. People like being able to create things. It just tells you that yes, competition is actually very fierce and u big companies generally have a lot of birthing issues when it comes to new things. It's just it's a matter of how they work. First of all, they don't often have a clear perspective of what amazing means in a new area. And what they struggle with even if they can understand amazing is figuring out a path to that amazing. One can argue that XAI for example has actually produced what is widely acknowledged to be a world-class model that is out there. But that act of sheer creation is not something that anyone should take for granted. It doesn't matter how many how much resources you have. It's not that easy to figure out all the little things that you have to get right in order to get to a point like that. You see other companies with tons of money struggling to be at the same caliber as OpenAI and Anthropic. Google now has had a set of pretty deep advantages in this area. They kept deep mind quite separate and deep mind was all has always been at the cutting edge of AI and it's become a real weapon for them in terms of getting to the front and once they get there all of the other advantages that they have of distribution the bottomless you know well of money that they can borrow from investments in things like TPUs which kind of looked crazy back then that we would invest in it. All of those become accelerants. But I think what one should take away is that like that breakthrough which is so hard to achieve especially for big companies with specialties Google has managed to achieve. This just means that open AI and anthropic need to understand that any kind of lead that they get is not going to be a long lived one and they really have to work hard and compete. Honestly, I think that's a good thing for all of us. Just to give you some points of comparison, GPD4 by all accounts was ready in August 2022. Long time ago. And it took anthropic I would say roughly 2 years, summer of 2024",
        "start": 327.36,
        "duration": 990.6409999999995
    },
    {
        "text": "have to work hard and compete. Honestly, I think that's a good thing for all of us. Just to give you some points of comparison, GPD4 by all accounts was ready in August 2022. Long time ago. And it took anthropic I would say roughly 2 years, summer of 2024 quality to GPD4, like two whole years, which is an eternity. And then soon after Anthropic launched a coding model that was widely acknowledged to be the state-ofthe-art and they have stayed there. It took OpenAI and Google again a year plus to catch up to that. It tells you that leads are shrinking and there's going to be more and more competition and of course there's a pressure from things like the open- source models. to just turn this into a whole other ballgame in terms of what is possible with them. On the Google front, given the time that you spent there, are you are you surprised at what's happened there? It seems like they just kind of woke up and started shipping with a sense of urgency that I hadn't seen from them for a while. Google always had and the founders definitely they were always well calibrated for crisis. I remember back in 2005 when wislive.com the precursor to Bing first came out with what appeared to be a really good search engine. We got into what's called a cordolo. It's like meet every day all hands on deck drop everything else. We got to be faster better than them. What was it called? It was called live.com. But the it was just a it was called a cord yellow. It's basically get the teams together, show up in front of Larry, tell them what you're doing today. And then they went to code with this open AI thing at a certain point. Yeah. Yeah. But the point is and every year that I have been at Google, I can think of one or more crises that required us to operate very differently. and what looks like a placid company from outside is very motivated, very driven. They've also struggled with structural boundaries. for example, the thing that we did for a social network which was called I forget remember Emerald C++. that was sort of a disaster because you know it's it's it's first of all it's hard to be it's hard for a new player to break through especially with something like a network effect of a social network. is just really really hard to do. and so they struggle with new things that they do but they've also demonstrated an ability to adapt Google Cloud by you know Google Cloud is a pretty big success. Obviously a lot of credit goes to Thomas for making that making that happen. It is an adaptable company. It is a malleable company. So it's I'm not surprised and you know I'm not that close to Google anymore but folks speak",
        "start": 500.96,
        "duration": 1312.4010000000003
    },
    {
        "text": "know Google Cloud is a pretty big success. Obviously a lot of credit goes to Thomas for making that making that happen. It is an adaptable company. It is a malleable company. So it's I'm not surprised and you know I'm not that close to Google anymore but folks speak about DeepMind is having Sergey in the mini kitchen just hanging out talking to people and so that that sense of time that sense of what is a pivotal moment that's what great leaders bring and Google's always had that in spades. I remember when Google Plus launched I actually was supposed to go to meet a friend at Facebook that weekend and they were supposed to have their their barbecue, their company barbecue and they canceled it and I was like what happened? And he's like don't you realize we're at war. That's correct. And it seems like that's really what's happened with both Google and OpenAI two code reds. That's what greatness takes, right? For you to realize these crucible moments and go all out. So the question is where to focus, right? There was there were some reports recently that Nvidia CEO Jensen Wong has been saying privately that he doesn't love OpenAI's business approach and you could read that as maybe as the finances. I really read that as as a criticism of focus and I could be speculating here but OpenAI is doing the consumer chatbot. They're doing video generation models. They're doing the device and they're doing enterprise now. And enterprise is actually going to be a big push for them this year. And in fact, you're part of partnership with them. Yep. Just announced a $200 million partnership with OpenAI. , and I think for our purposes, it would be great to hear your perspective on why enterprise is a worthwhile bet for them and where they stand compared to anthropic, which has been focused on enterprise from the beginning. One issue we should all keep in mind is that , when you're seizing lots of ground, when times are early, if you're successful, people will call you a genius. If on the other hand they don't go well and a threat shows up in the main thing that you do people will say lack of focus for the longest time Google was criticized for being a onetrick pony in search and after a while it was criticized for having too many efforts that lacked focus and now we are back to putting Google as a hero because they succeeded in Gemini. So we should all remember that judgments are postfact and dependent on the outcomes produced rather than the actual strategy. There's a little bit of that. Having said that, OpenAI has a lot to offer enterprises and we are excited to partner with them because many customers are joint customers of Snowflake and of OpenAI. We've created an agentic platform called Snowflake Intelligence that's been quite transformative. Over 2,000",
        "start": 664.48,
        "duration": 1635.2810000000006
    },
    {
        "text": "strategy. There's a little bit of that. Having said that, OpenAI has a lot to offer enterprises and we are excited to partner with them because many customers are joint customers of Snowflake and of OpenAI. We've created an agentic platform called Snowflake Intelligence that's been quite transformative. Over 2,000 2,000 customers are using it pretty much you know 3 months after we released the product to G. Enterprise customers are fussy about using products only in in NGA and it's among our fastest growing products ever launched and it's it's focused on data and snowflake. Back to your point about focus, we wanted to make sure that we created a product that could enhance the value of things that people had already done with Snowflake. We didn't want to go and pitch our enterprise customers and say, \"Hey, we're doing something dramatically new. you know, work on it with us. We said you can get value from your data a whole lot faster. Not only that, we also said we live what we preach. And so I often show them things like our sales agent, which puts the every piece of information that my sales team has about every customer at my fingertips. What meetings did this customer have yesterday? What are the outstanding use cases? All of that is available to me. But it's also programmable. I can I can get the information the way I want, share it the way I want. And but there's a lot more in this world of agents and enterprise. How do you help people take action? How do you help people be better grounded about the consequences of their action? How do you help them analyze situations? These are the things that we are excited to be collaborating with OpenAI on. Yes, one part of it is us using their models, but I think the much more interesting thing is going to be what are areas that are very amenable to AI creating value and how do we make sure that we make it easy for enterprises to realize that value. To make this super concrete, I was visiting a big manufacturer yesterday. They make my eyes kind of popped out when they said, you know, listen, we have 5 million SKs. 5 million SKs that they sell. And part of their issue is we have trouble pricing this because it's it's a big dynamic marketplace. We don't know what competitors are pricing it at. We don't know what kind of like you have to take into account the margin that we have on the product, the NPS for the product. Can you create an agentic system that can help us do pricing better? We have all our data on snow. And that's an that is a situation in which the power of agentic technology, the ability to look at a complex situation, break it down, follow best practices for how work should be done is going to be a big",
        "start": 828.32,
        "duration": 1940.7200000000007
    },
    {
        "text": "do pricing better? We have all our data on snow. And that's an that is a situation in which the power of agentic technology, the ability to look at a complex situation, break it down, follow best practices for how work should be done is going to be a big done. There's potentially hundreds of millions of dollars of additional revenue that this company can make if they can do a better job just with this one single project. That gives you an example of the kind of things that people are looking to do together with with with with OpenAI and Anthropic and a data platform like Snowflake. So how does the product work? It would be a a agent basically that goes and takes a look at the pricing and then with the GPT model I mean explain exactly what Well, this is a great question and it it goes to a topic that I'm pretty passionate about. I call it what does work look like in the future? And today our work is pretty much we go look at our email, we go look at our to-do list and then decide what are the things that we should be that we should be doing or you know if you're like me you have meetings on calendar where where work shows up. the future that we envision very much is you describe what you want systems to do. Hey, these are the kinds of things that I should be looking at every day. For example, I look at our revenue alerts every day. Mhm. I go and look at the dashboard. If there's a if there is a a big up or a big down, I send out questions and so on. Very automatable. And so you have an agentic system that is connected both to the past information that's typically sitting in snowflake or what was performance-like. it is also it has access to things like prediction models that say if something changes what does the future look like? also things like ambient information, your emails, your documents, other or even things like the stock market, ambient information about the world and your work very much becomes these are the five topics that you should be paying attention to and here is a brief for these five topics and potentially even recommendations. So you give the agent a task, you give it basically like you would an employee, you give it these this instruction. if you are let's say the manufacturer, right? You say, \"Hey, I want you to take a look at the pricing.\" Say, \"I want you to look at the spread between how I price, how the market is pricing, identify the top 10 opportunities I should be paying attention to in my department today, generate a report for me.\" My job is, okay, I'm going to go through this, go through the recommendation, and figure",
        "start": 982.959,
        "duration": 2215.6009999999997
    },
    {
        "text": "to look at the spread between how I price, how the market is pricing, identify the top 10 opportunities I should be paying attention to in my department today, generate a report for me.\" My job is, okay, I'm going to go through this, go through the recommendation, and figure make a change, what approvals do I need to get within the company? So, it does the leg work for you. You come in and your decision is based your your task is basically to make the decisions as opposed to spend a week looking at all the information. And the magical thing about this by the way we are living this with our support team. We have changed our support team from 50 people writing software, 300 people using this software to help debug support cases to much more of a builder user model where there are a set of tools available within our coding agent Cortex code. And whenever a support case comes, they use these tools to analyze what is happening. And then they tell the customer what to do. And sometimes they decide, you know, these tools are not enough. I need to build a new tool. And they add that tool itself to the suite of tools that everyone else can use. So this is work self-correcting, getting itself better over time. And the goal is just things get done a whole lot faster. already we are seeing 10x not 10% 10x reductions in the amount of time that it takes to debug complex cases that come in and so let's just go to this question of is this working because there's been a lot of discussion of agentic AI every time we talk about it there's always like a segment of the audience that says you know this is still a lot of hype push back harder conceptual largely still And you know this is something that you know might in demos look really good but when you actually put it into practice it struggles. What's what is your read on that? You got to walk the walk. We were in Davos together. Yes. and you know two weeks ago and I probably met 20 odd CEOs, CIOS, lots of partners and my sort of SOP standard operating procedure for each of these meetings would be I would ask our sales agent for information about the customer. What's the state of our relationship with take your pick and it generates a report. I would turn it on and show my phone to them. , and they would go, \"Holy cow.\" But uniformly, not one of these CEOs has the same tools that I do. I see. That's the difference between actually getting the work done, making AI serve meaningful needs and yes, the hype that you're describing. All of the people that are in the camp that you're describing have never had useful products built for them that deliver",
        "start": 1123.28,
        "duration": 2523.760999999997
    },
    {
        "text": "same tools that I do. I see. That's the difference between actually getting the work done, making AI serve meaningful needs and yes, the hype that you're describing. All of the people that are in the camp that you're describing have never had useful products built for them that deliver that lives this the amount of feedback that my poor team gets about how difficult the mobile experience is, how to make it better. We just launched like Face ID authentication. That's a big deal because I don't have to log in all the time. It's taking care of all of those kinds of nuances, making enterprise data come alive available for you and then helping you with decisioning. That's the magic and that's why you are hearing people say it's hype. But it's companies like Snowflake that are actually living what we are preaching. And I give that same feedback to my exact team which is hey all of you need to be demanding tools that are as good as the one that we have for the sales agent and our team should be providing them to you and you should be using them dayto-day in how you can work better. I agree that there is work to be done but the sheer potential of something like this is magical. I'll give you one more small example of something that is cooking this very week. I'm working with our ops team, our operations team that helps manage snowflake, the software running in the cloud about how to get on a more agentic bandag like you know super cruddly infrastructure engineers that are like what is this you know we know better but we're walking through this journey of no no let's create tools that our coding agent can use and you will genuinely find that is a lot easier and so someone created a tool that will help detect things like oh are there problems with warehouses resuming. Warehouse is a basic unit of work that gets stuff done for our customers. And when our customer says start this, we wanted to start quickly. in like 10 seconds, I had generated a histogram of resume times, put a nice graph and I sent it to the team with one prompt, all English on top of a tool that somebody had built to look at resume times in warehouses. and the team is like, \"Holy cow, that's the magic of Asgentic platforms.\" But yes, you have to do the leg work to put them into place, put the guardrails, things like that. But there's real magic here. Couple of things. So, first of all, what you're saying is kind of reminding me of something that Arthur from Mistral, the CEO of Mistral, said here couple weeks ago, which is basically that the technology has these capabilities, but it's not just like it's not like in that AGI mode. tell it what to do and it can",
        "start": 1278.799,
        "duration": 2814.080999999997
    },
    {
        "text": "saying is kind of reminding me of something that Arthur from Mistral, the CEO of Mistral, said here couple weeks ago, which is basically that the technology has these capabilities, but it's not just like it's not like in that AGI mode. tell it what to do and it can getting enterprise AI to work is a managed service which means that it could take some time for what you're talking about to be visible within the entire economy as opposed to those who have already put the time to figure it out well that's also where magic can happen right and you know I told you that we released a new product called Cortex code which is our data coding agent. we launched it GA yesterday and it dramatically lowers the amount of time that it takes to get stuff done on Snowflake. Mhm. We all get carried away with how does AI make it easier for a business user like me to get access to my data. That's great. But on the other hand, everything from how do you set up a database to how do you move data from a production like on like a transaction database over to Snowflake for analysis. How do you build a machine learning model? How do you build an agent that you can then give to the business user? Cortex code is meant to address all of that again in natural language. And part of what we have built there are what we call a series of skills that help automate this work. And this is a theme that's going to come up again and again, which is how do you use AI to make launching AI products go faster, right? That's the feedback loop that one needs to be on. It's a little bit I it's a little bit of a red pill moment where you're like, wait, you mean I can release new software products pretty much every day? because releasing a new piece of functionality is as simple as writing a recipe in English which all of us are very capable of doing. I think using AI to make AI go a lot faster is something that we are excited about and this product is among the best in terms of how do you get it from Snowflake. It's it's interesting that you talk about how easy it is to build software now. That has been both a a benefit for software companies and something that people are worried about because where is where does the moat look you know where is the moat if it's so easy to build. This is from this is from Ben Thompson's pretty interesting his his perspective. He says AI coding doesn't kill software. Customers pay for products not code. They are paying for support compliance integrations security patches. someone else owning the neverending maintenance commitment. That stuff doesn't just go away because writing the initial app got",
        "start": 1426.08,
        "duration": 3104.9609999999984
    },
    {
        "text": "is from Ben Thompson's pretty interesting his his perspective. He says AI coding doesn't kill software. Customers pay for products not code. They are paying for support compliance integrations security patches. someone else owning the neverending maintenance commitment. That stuff doesn't just go away because writing the initial app got says, \"But if every software company can write infinite code cheaply, the competitive dynamics change.\" Yep. The SAS playbook of finding a niche and growing your slice worked when building was expensive. Now, everyone can build into adjacencies overnight. Shifts from growing this pie to it shifts everything from growing the pie to fighting for share. It's something that you know it seems like you're enabling and you're living. Yeah, I think there is going to be a concentration towards platform players. but I would also be cautious about general pronouncements for the simple reason that we are all actors in this space. We all get to change the outcome. I feel very good about Snowflake as a data platform. But I honestly do not want to be in a situation where access to snowflake is always mediated through someone else. That's always a very dangerous place to be, especially in a moment like this. This is the reason that we develop not only snowflake intelligence, which is the best way for a business user to get in to get access to their business information that is trustable through the devices that they want like their phones rather than trudge through dashboards. But we are also investing massively in how do you make creating data products? How do you make creating applications a whole lot easier? Absolutely. It's going to be the case that there's a lot of functionality that sits in complex applications. We're actively working with all of those folks whether it's a service now or a Salesforce or SAP with whom we have a big partnership in creating this agentic future together. Agent Future is very much going to be what I said past, present, future and actions and so we think we stand a very very good chance of being the platform where this work happens but as I said it's a foot race and it's all about creating value really fast for your customers. and I would shy shy away from X is going to win or Y is going to win. the the companies that are going to win are the ones that have great capabilities but also take the time to figure out how to create value for their customers. There was we're speaking on Wednesday, February 4th. This is going to go a week later. but there was an interesting thing that just happened this week that I think we should talk about which is you made such an interesting point where what when I when I asked you about this you said listen we do not want to be an input into somebody else's software and",
        "start": 1575.2,
        "duration": 3402.081999999998
    },
    {
        "text": "was an interesting thing that just happened this week that I think we should talk about which is you made such an interesting point where what when I when I asked you about this you said listen we do not want to be an input into somebody else's software and within the most recent days anthropic released a legal plugin and the market got wind of this and then all of a sudden Thompson Reuters I think it had its worst day on the market in history. stocks like Legal Zoom just, you know, dropped like a rock. And I think and I was trying to think through like why this could be because it was just one legal plugin from Anthropic. And the perspective might be that with generative AI, there is a risk that some software shifts from being the place you do the things. You know, Lexus Nexus, you do the research there to an input into a platform. And if that's the case, I think what the market is thinking is that you lose that control that you had. You become you become a feature in a platform as opposed to the platform itself. That's the risk. It's a very real risk. I think people that were confident about their position in the world because they were essentially wall gardens for data and functionality and are slow at providing modern ways of dealing with information are going to struggle in this world. This is the reason that I stress us living by what we speak in terms of AI and agentic platforms and this future of work concept precisely because unless you live it, you don't actually feel it. And unless you live it and feel it, you're not going to help your customers get there. I think na niche SAS software providers that basically benefited from lock in. Think about it. If you used a piece of SAS software, logged into it on your browser, God help you if you want your data back. Just like not going to happen. Yeah. What this current moment is pointing out is that that's a very dangerous place to be. And a lot of these players risk becoming dumb backends to the models, which is why Snowflake is so leaning forward on agentic AI and living by what we speak because that's the place where value is going to get created. The market doesn't really seem to know what it's doing when it comes to software. Doesn't really seem to know how to value software in this moment. this is from Liz Thomas. she says, \"Software's forward 12-month price to equity ratio has compressed from 33.1 to 23.2 multiple contraction of 30%.\" Which is wild because software gets these big valuations because of what it is. Here's another stat. SAS index from Talia Goldberg. SAS index is down 32% year-over-year despite most companies meeting or beating plans while the markets are up 15%. Is what do you think",
        "start": 1725.2,
        "duration": 3734.561999999998
    },
    {
        "text": "multiple contraction of 30%.\" Which is wild because software gets these big valuations because of what it is. Here's another stat. SAS index from Talia Goldberg. SAS index is down 32% year-over-year despite most companies meeting or beating plans while the markets are up 15%. Is what do you think just we had Brett Taylor on he said it was just kind of the uncertainty of who wins. Is that your perspective or why do you think despite like like you know Talia is saying here the the fact that these companies are meeting their earnings expectations they're still getting hammered and the multiples are contracting. There are a few things that we should take into consideration here. As you know, companies are valued not on what they're doing today, but on what they're going to do in the future. And I would actually distinguish data platforms like Snowflake from pure software providers operating on a subscription model. Not that it's a bad model but the way they have operated is AI became another skew for these folks and customers have had to sign up for AI products regardless of whether they created value or not. That's sort of become the favored way of becoming AI native. I think what the current moment points to is a real risk that that is not a winning AI strategy. meaning that work is not going to get done by interacting with a chatbot on a particular SAS app that you used. Which is why our our vision of agents operating on a data platform that has much of the analytic insights about the past as a lot of our customers do but with the ability to bring in integrations via MCP via other APIs for how do you talk to other systems. I think that's the compelling vision. I think companies are going to win if they have both a convincing vision for how work gets done in the future but are able to back it up with and here is how we help you the customer get it done fast. The model makers approach it from the from this view of the model is everything and nothing else matters. We approach it from the viewpoint of it's the entirety of the experience. It's the model. That's why we partner with all of these folks. It's the most critical data that's valuable to your company, but it's also integrations with the operational systems that really help get work done. I think that's the compelling vision for how work gets ready. What the markets are in some ways pricing is the fact that AI as a bolt-on to SAS software does not feel like a winning strategy. , you know, I feel much better about the path that we are pitching. Also, our products are consumption based, meaning that if something doesn't get used as much, there's not a penalty to like to just building them and and and using them",
        "start": 1893.84,
        "duration": 4067.201999999998
    },
    {
        "text": "not feel like a winning strategy. , you know, I feel much better about the path that we are pitching. Also, our products are consumption based, meaning that if something doesn't get used as much, there's not a penalty to like to just building them and and and using them But can I ask I mean, you know, as we've had this conversation, the idea that people would come to like a snowflake agent, right? Cuz all their data is there. So they can go through all these use cases that we talked about and that's compelling, but why doesn't that just end up getting subsumed into some like m you know master agent that has not just not just the snowflake data but everything else. That's very much a fear that we need to operate with. That's very much the opportunity of the moment. Okay. the big model makers want to create a world in which all of the data for all of the enterprises is easily available to them through like a GPT through yes I I and you know everything else the world is just a dumb data pipe that feeds into that big brain that's the vision that they would like to see come true and the vision that I would like to see come true is hey we host the most important data for every company and the most important predictive models for every company and I can create agents that can deliver substantial value. But by the way, we also follow like others do an interoperability strategy because if a customer comes and says I want to build a data product on Snowflake, fine, it can have an AI interface but I really want it to be accessible somewhere else. I don't get to say no to that. The only people that win are the ones that effectively deliver what customers want, right? Is this going to be the the big battle field in technology over the next couple years? I mean, we we even had an example. I think it was Amazon who like protested in a big way from having I think perplexity scrape its pages and it seems like this is going to happen on consumer and this is going to happen because this is this a conversation that OpenAI has with you. Hey Sar, , we'd love to have your, you know, all your data available in ChachiPT enterprise. We stick to customer choice. What do customers want, right? If they want to access data through a snowflake intelligence agent, the OpenAI doesn't , team doesn't say no. If on the other hand, our customers want to expose, you know, data like important enterprise data that they have as an MCP endpoint into chat GPT. We don't get to say no. So then how much agency does a software company actually have like one in your position? Because if it is up to customers, it's all about creating products and",
        "start": 2062.72,
        "duration": 4364.083999999995
    },
    {
        "text": "data like important enterprise data that they have as an MCP endpoint into chat GPT. We don't get to say no. So then how much agency does a software company actually have like one in your position? Because if it is up to customers, it's all about creating products and has an insurmortable ad chatb like OpenAI doesn't get to say the only way you get 5.2 is to come to chat GPT, right? I don't get to say the only way you get to access data on Snowflake is to come to Snowflake intelligence. It's a little bit of it's pretty much may the best player win. And so it's very much about creating value and the burden that you have is is large because I if people are going to go to like a specialized bot as opposed to a centralized bot that specialized bot has to be you know orders of magnitude more useful because it's requiring a different behavior or maybe I'm wrong may maybe not I it's this is the part it's very very early and remember we are still living in a world I don't know how many tabs you have open Alex mine is 200 okay that's the state of my world. That's pretty good. And I have enough that I can't read the tab names. I'll put put that way. Command shift A if you use Chrome is your is your magic answer to all problems. But still and so I think it's early. Yeah. when when your stock price gets kind of caught up in like the the market has says category, you know, this category must do this and your stock price gets caught up. How do you manage that as a CEO? because it must be in some ways frustrating to see that like the market acts on categories versus individual companies. It's my job to make us stand up. It's my job to make sure that our prospects are clear. It's my job to make sure that our company accelerates to seize the moment that is today and come have these come have these conversations. yes the markets are reacting to the best information that we have. If we get clubbed with other SAS software providers that tells you that I have more work to do that's fine. Yeah. Okay. I want to talk to you about the about shadow AI and how people are individuals are starting to build their own AI programs. We've seen that a lot over the past couple weeks. Yeah. so let's do that when we come back right after this. And we're back here on big technology podcast with Sedar Rama Swami, CEO of Snowflake. Swedar, great to have you on the show. Thank you for coming back. Always great to chat. What did you think when this open claw clawbot multbot moment happened when people started running all their own agents on their on their computers and doing crazy things?",
        "start": 2212.0,
        "duration": 4653.522999999995
    },
    {
        "text": "Swami, CEO of Snowflake. Swedar, great to have you on the show. Thank you for coming back. Always great to chat. What did you think when this open claw clawbot multbot moment happened when people started running all their own agents on their on their computers and doing crazy things? on their own computers, but still some were and got their API keys exposed and Exactly. Exactly. No, I think old rules of security don't vanish because of because because of AI. It's remarkable. I'm fortunate in that I have two young sons who are both in software and you know I get to see the world through their eyes and as it turns out one of them had one day between when he came to San Francisco from he moved from New York and when he started his job on Tuesday and in that one day when I was at work and he was home he had managed to get like you know an Ubuntu instance on AWS completely separate from everything else including his laptop, thank God. And he had set up OpenClaw on it as his personal AI assistant and it comes with things like Telegram integrations. You can talk to it. He started using it as his to-do list and he set up a little chat bot for giving me a summary of cool AI happenings on X because I told him like X can be a lot. I don't like to spend that much time on it. I still want to get what's important. So, I get like a briefing every day of cool things happening in AI done entirely by the chatbot. Tell him not to productize that cuz I could be in trouble if he does. I'll get I think it took all of a few hours for him to do that. Build this newsletter. And but funnily enough, he was to build the entire self-contained working thing that can literally react to any question that he has. as if he if he says, \"Hey, I have this hobby and I need you to help me get better at this hobby.\" It'll start sending him messages every day about what should he do to like learn a new skill. The general purpose nature of this is truly truly mind-blowing. Took him a few hours to set up. Yeah, that's the wildness of the moment. But funnily enough, he's 26 and he was like, \"Yeah, yeah, yeah. I want no part of this maltbook thing. I think it's a bunch of hype. I think it's actually people posing as you know as agents that are posting this. You wanted no part of that. And so it's it's funny. I think it's a remarkable moment in terms of you know in terms of what is happening out there. but I do think that you're seeing what happens as these agents or you know agent frameworks become easier and",
        "start": 2359.599,
        "duration": 4957.842999999994
    },
    {
        "text": "You wanted no part of that. And so it's it's funny. I think it's a remarkable moment in terms of you know in terms of what is happening out there. but I do think that you're seeing what happens as these agents or you know agent frameworks become easier and figure out a set of security guard guard rails for how to use that and and and things like that. This is I think a it's it's a pretty remarkable moment. Yeah. notebook 175,000 posts 1.1 million comments as of it's the social network for the AI bots as of the time we're speaking so I don't think it's entirely I mean if that's entirely human it's a pretty successful social network on the rise so it's done that in a week pretty interesting you made some predictions ahead of the year and one of them really stood out to a couple of them stood out to me we could talk about them both but one of them that I found really interesting was you said, \"Shadow AI will drive enterprise adoption from the bottom up. Employees who select their own free AI tools will will remain the primary driver of enterprise AI adoption in 2026 rather than waiting for IT departments to sanction approved products. Workers are using chatpt claude and other consumer AI tools for their daily work, forcing organizations to catch up. I think that's so interesting and it's something that I've talked about on the show before how it seems like there's these two tracks. Companies that are kind of slow to move and adopt these tools and individuals that are starting to find ways to use them in their work. Why do you think that is? First of all, I mean, anyone who's been inside a even moderatelysized company knows that it's filled with approvals and lawyers and you know pilots. I have a simpler answer. Yes, it's the true 10xing of the moment. I talked to you about how with something like a cortex code, you can get a job that you need to do on Snowflake. Like working with data is tough. It's tedious. Yeah, you have to get lots of things right. A lot of little details. can use our CLI and just automate this stuff and get it done in less than a tenth of the time it would have otherwise have taken you. Right? That is remarkable. And I now write documents. This is with our officially approved enterprise version of our chat bots. I write position papers coming out of dialogues that I have with these chatbots. I say this is the situation. These are my thoughts. These are the options. What do you think? You sort of go through almost a Socratic process of debating stuff and producing something that looks mighty polished. Mhm. But if I've done pricing studies entirely inside chat bots, right? We have to change prices. You trust them because sometimes when I",
        "start": 2513.28,
        "duration": 5268.164999999995
    },
    {
        "text": "are the options. What do you think? You sort of go through almost a Socratic process of debating stuff and producing something that looks mighty polished. Mhm. But if I've done pricing studies entirely inside chat bots, right? We have to change prices. You trust them because sometimes when I I I never I am I have never ever run a coding agent with accept all my recommendations. Okay. I am as anal as they come. Okay. , my first rules when I started using our coding agent was never delete a data. Never ever delete a database. Never ever switch an account because I have access to production systems that have snowflake data. I'm like don't switch to it when I'm playing around with something else. You got to put the guardrails. You got to be smart about how you work. , and you got to check the work, right? And so when I did the pricing study, it's like, hey, plot this for me. How does revenue and margin change? You got to go study the work. But it's a massive accelerant and the benefit that you get from something like this unlike a handwritten doc is let's say you decide to change your mind and want to introduce another new thing you know normally we just don't do that in a document or a study because it's so tedious to go make all the changes the chatbot they don't get bored they're like you want to redo this work not a problem they redo the work for you I think it's that value creation that's driving the adoption and it's snowflake we are actually trying to be a lot more receptive to this because as we know that we would rather have a tool with enterprise controls than just have everything go underground and so it's it's it's worked pretty well and I'm and most companies are also doing things like approve AI policies on top of Snowflake for example a lot quicker than what they have what they would have done before because it is that value creation that they're all hungering for right but I think the thing is and and I mean this is your prediction so we couldn't go deeper into it is that individuals is it a 10xing of the moment I would say yeah there's definitely value to be found in these applications but it is interesting that it's the individual and maybe this is normal the individuals are finding this technology and doing it in in a way that you describe as shadow AI right where companies are a little bit slower to move so how does that change the dynamic of companies if you have a couple of people in there that are like leaning all the way into the tools and the company is like yeah we're in we're working through this Well, part of what every company has to do is to figure out how to embrace",
        "start": 2670.72,
        "duration": 5532.243999999994
    },
    {
        "text": "dynamic of companies if you have a couple of people in there that are like leaning all the way into the tools and the company is like yeah we're in we're working through this Well, part of what every company has to do is to figure out how to embrace that they're surfacing what they want to do and the value that they're getting to everyone. Mhm. I wanted to roll out Cortex code to the entirety of our solution engineering team, 2,000 people. It's a lot of people. And the way we we did that was we selected a subset of them over 30 40 people and gave them a little bit of training and said hey you should go try this out see what this is like. We call them our AI champions. Mhm. We celebrated the fact that these were the forwardleaning folks and we also made them effectively responsible for spreading the word down to the different to the different teams. change in any large company is not going to come from top- down mandates. You know, let's face it, what I know about AI is minuscule compared to the sum totality of what my 9,000 people know about AI. And you need to create an environment in which the most progressive of the ideas that are coming up, the most innovative of the people, they have a way to quickly surface the idea up. In fact, for the next all hands, I've been working with my comm's team. It's in it's in a few weeks. they wanted to have, you know, a regular all hands standard set of discussions with the exec staff. I said, I want to spend 2 minutes personally because I have to say something as a CEO. I want the rest of the time to be devoted to finding these fire brands, looking at what they do and highlighting this as the champions we need to figure out how to identify and how to learn from. And we have to embrace the moment in terms of how do we use our collective wisdom to drive our organizations forward. It's very interesting because it seems like as these tools get better, there are going to be companies that will have that mentality and there'll probably be companies with leaders who are just like, I don't know about, you know, all this AI stuff. And it can actually change the competitive balance of industries pretty quickly if you have organizations with more permission versus less. I would I would distinguish it more as progressive organizations. Okay. What does that I what I mean by that is we always have to balance. I will flip out if I find out that anyone's running openclaw on a snowflake laptop. Please don't do that. That's not safe. We will help you get like a free Ubuntu machine on AWS if you want. there are smart things that people should be doing and dumb things",
        "start": 2805.04,
        "duration": 5825.283999999993
    },
    {
        "text": "I will flip out if I find out that anyone's running openclaw on a snowflake laptop. Please don't do that. That's not safe. We will help you get like a free Ubuntu machine on AWS if you want. there are smart things that people should be doing and dumb things progressive head of security is an important asset here where they let the innovation happen. Y without making people do unsafe things. we are custodians of data for some of the most valuable companies in the world and we take that part very very seriously and so it is that balance that that one needs. But back to your point about changing competitive dynamics very very very real. I think we can end here. You also have this interesting prediction about big tech big tech's grip on AI models loosening. I'll just read a little bit of it. For years, conventional wisdom held that only a handful of tech giants could afford to build competitive AI models. In 2026, that will change. New approaches to training like those developed by Deep Seek have shown that building the biggest, most expensive models isn't the only path to strong performance. You know, we're a year, this is great timing. We're a year after DeepSeek didn't fully change the AI industry in a way a lot of people anticipated. And so it's interesting to see that that is the prediction you made, especially if I'm if because if I'm right, Snowflake did try to build some foundational models and then decided that was not the game you wanted to play. I think foundation models became very expensive to build. We now have four players that are creating models that are like widely acknowledged to be the state-of-the-art. but a new Quen model came out yesterday that is shockingly close to the best sonnet model that there is from Anthropic. There continues to be a lot of innovation in this space. I think that's very very healthy for us and from a selfish perspective. Snowflake as a data data platform prefers a world in which there are many people making great models especially open source models because we also have a really good infrastructure team. We are very good at running them at at at scale. But this is a world where a lot of value is being created and a lot of change is happening. And I think being nimble and ready for that future of agent KI, that future of work while always having a laser focus on what makes a difference to your customer. Those are the enduring qualities through the year. Life will keep changing. You're comfortable with the Chinese open source models. So we test them, we use them, we try to we we try to learn from them. we also partner with US companies that are trying to create open source models. There's actually a company that's based in in in Brooklyn and San Francisco that is that",
        "start": 2954.079,
        "duration": 6143.362999999994
    },
    {
        "text": "open source models. So we test them, we use them, we try to we we try to learn from them. we also partner with US companies that are trying to create open source models. There's actually a company that's based in in in Brooklyn and San Francisco that is that Which one? this if I remember correct this is Reflection AI. Okay. And it's a remarkable company. I think there is a lot that we are missing out in not having a robust open AI ecosystem. We sometimes get caught up in this world of you know we have the best AI companies on the planet. But we also should understand that much of their work has effectively become walled off from the rest of the world. You and I simply do not know what techniques open AI and anthropic are adopting to produce the great models. You can say how does it matter? Google search for example pretty much died as an academic as an academic area after Google became big. Why? They published nothing and they were ahead of everyone else by a million miles. Area just died. M and that was okay for us geopolitically because Google was an American company. I think part of what you're reacting to is this fear now of open source is not here but much more in in a situation where there is no winner. What is happening right now is that it's the Chinese companies that are publishing their work. And what then happens is all the universities, all the students and professors in our country are looking at their work and figuring out how to build on top of it. And so academia is diverging from what's happening in the research labs. That's part of the danger of this moment. And that's the reason why we need to have a more robust ecosystem. If it been if it had been a world in which there was one model maker that was a winner and there was an American company, I think we'd have a slightly different attitude. It's very clear now that that's not going to happen. Hence the fear about about open models. And then if these you know I think there's been such so much conversation about the Chinese open models over the past couple weeks. you know I think Demisab has said at the crack of the new year that the US or the west is four years ahead sorry four months ahead of them. Recently there's been some discussion that it's kind of you know closer than that. is what happens in the world where like those models become on par with the leading US foundational models for most of us. Yes, it opens up lots of opportunity. The as you know the very existence of something knowledge about the existence of something can spur innovation in other areas. You don't even have to know exactly what someone did. This history",
        "start": 3118.0,
        "duration": 6456.002999999995
    },
    {
        "text": "with the leading US foundational models for most of us. Yes, it opens up lots of opportunity. The as you know the very existence of something knowledge about the existence of something can spur innovation in other areas. You don't even have to know exactly what someone did. This history that something is possible makes people work feverishly on making the same thing happen. You can bet that reflection is looking at it and going we can do better than this, right? So from a macro perspective, I would say that that is actually a positive because Mistrol is going to figure out how to reverse engineer all of this stuff stuff and go one step forward which will be good for Europe and Reflection will figure out how to do this in the US. This will also force Meta to be doing more things in the in the US. I think in a weird way that's actually a net positive for us as a whole. I think the impact on the model companies that becomes a little bit more little bit more murky but welcome to welcome to this world Alex you know this change every month it's constant the website is snowflake.com streetar so great to see you thank you for coming down thank you Alex always a great conversation definitely really is we hope hope we can do this again soon thank you all everybody thank you for listening and watching and we'll see you next time on Big Technology podcast.",
        "start": 3276.559,
        "duration": 6574.7229999999945
    }
]