[
    {
        "text": " How is generative AI changing Google and how does Google think it's going to change everything for all of us? Let's talk about it right after this. Welcome to Big Technology Podcast, a show for coolheaded and nuance conversation of the tech world and beyond. Today we're going to go deep into how Google is handling the generative AI challenge or opportunity with two of the executives spearheading the change within the company. We're joined today by Nick Fox. He's the SVP of knowledge and information at Google. Nick, great to see you. Welcome to the show. Great to be here. And we're also joined by returning champion Liz Reed, the VP of search at Google. Liz, great to see you. Delighted to be invited back. So Nick, you and I spoke for my book, Always Day One, which was a book about reinvention. Y and the idea was there are going to be technology shifts that tech companies are going to have to deal with, and the ones that stay relevant are the ones that get ahead of change. Yep. I think we both agree that this generative AI moment is a moment of radical change in tech. I agree. How do you figure out the timeline with which you are willing to implement change because this technology is moving extremely fast and it's not moving fast in a uniform fashion, right? There's going to be moments where it will excel in some areas and not in others and in some moments it will be able to handle certain challenges but then you add something new and then it hallucinates more. So with such a quick changing technology such a powerful technology how do you plan how do you move forward with this change? First of all great to be here thanks for having us both. I think Google's is a I think Google search is a story of reinvention through really really for for Google's entire history. If you think about you could think about the mobile revolution was a moment of of reinvention of search. Search was going from desktop to a mobile device. What does that mean? Will people still will people still search through that moment? What does it mean for advertising etc? Google embraces these moments of reinvention, right? We if if we look out I've been at Google for 22 years. Liz has also been at Google for 22 years. We look over that course of history. Each of the technology revolutions, each of the technology leaps have been fuel for the company. They've been fuel for the product. They have been the things that have dramatically expanded what search can do. and so so we're excited by them and and we embrace them. The so we tend to be very quick to embra to embrace them. Sometimes we embrace them in small ways to get started with, right? So generative AI as an example we were",
        "start": 0.24,
        "duration": 309.8410000000001
    },
    {
        "text": "expanded what search can do. and so so we're excited by them and and we embrace them. The so we tend to be very quick to embra to embrace them. Sometimes we embrace them in small ways to get started with, right? So generative AI as an example we were as as ranking improvements way back in the early days really as as as the technology was new that enables us to get our feet wet with it. those were maybe relatively more subtle changes relative to where we are today. but the we embrace quickly we are sort of careful we are thoughtful about it mostly more than anything else because we care deeply deeply about trust. Right. But I understand all these things. I guess the question that I'm asking you though is everybody in the tech world right now is saying there are all these new capabilities. Some of them are working, some of them don't. How do you organizationally say we're going to pursue this route? I mean it is a technology that let's say I'm a startup, right? I can just throw the latest model in, see if it works. If it doesn't roll it back, Google doesn't have that luxury. So you have to be really sure about where things are going. Do you have a process internally where you're just like we're going to bet on this, we're not? I mean, everything else you're saying makes sense, but like talk about specifically how you think about this stuff. I would say we have thesis of of of where things are going to go, right? And so, , early on, we understood that gender AI as a technology was going to be, you know, this is technology that's right at the core of information. , and so we understood that that would be transformative for how search works. that was that was a in some ways a relatively obvious area to lean into. but other areas we view it from in in many of these areas I would say all of these areas in fact we view it from the standpoint of what are we trying to do with the product. So if you look at something like Agentic, right? This is a it's it's clear that users want to get things done in search, right? They if if you're looking for a hotel, you ultimately want to go book that hotel. If you're looking for a product, you ultimately want to go buy that product. , and so that's an area. It's clear that that's the future. It's clear that that's that's that's where things are going to are going to go. So again, we embrace it and and and and even if it's even if it's early, , our view is is to embrace it from an early stage because it's clear that's that's that's what our users are are going to look for and it's clear that's where things are going.",
        "start": 155.12,
        "duration": 548.32
    },
    {
        "text": "again, we embrace it and and and and even if it's even if it's early, , our view is is to embrace it from an early stage because it's clear that's that's that's what our users are are going to look for and it's clear that's where things are going. you in a second, but I have to follow up here. Yeah. U, you speak about Agentic. This goes exactly to the question I'm asking you here. We've seen Google, we've seen Amazon, we've seen Apple all try to roll out this contextually aware assistant that gets things done for you. Y I don't think anyone's doing a great job right now of it. I mean, just to be honest, and from a user experience, a part of that is is the technology ready for it? I think, let me just use Apple for an example. I think Apple thought the technology was ready for something they wanted to do and they couldn't pull it off. now as a skill issue or a culture issue. ultimately I think if it was easy to implement this technology if it was working you know up to par we would get some company that's that would be able to do this. so again like when you think about you have to prioritize what you work on. You have to decide whether or not to go full steam ahead with this agentic move. how do you go from taking the research and and development and deciding when it's time to put it into production? I think we're convinced that we're convinced that's the future and so that leads to the decision to invest and and the confidence to invest. you and then you roll it out to the extent that it's to the extent it's ready to be rolled out. So some things you've seen us do with search are we start in in in labs even with AI overviews which has become a huge success started as search generative experience in labs and so that enables us to get started get our feet wet and then we build confidence through that to actually know when it's ready for everyone and so we have a we also run experiments along the way etc. So we don't have to make these as sort of yes or no black or white sort of decisions. We're able to invest with conviction because we know it's the future and then build it and then assess where we are in terms of how how broadly we roll it out. Okay. So, Liz, AI mode, which is Google's way of giving you long large language model search, has been rolled out to I think everybody in the United States. Yep. What are you seeing? Seeing so it's still very early. It's only a few weeks in. but really happy with the adoption and that we're seeing people use it. We're getting positive feedback. we have a small",
        "start": 277.759,
        "duration": 814.0790000000002
    },
    {
        "text": "has been rolled out to I think everybody in the United States. Yep. What are you seeing? Seeing so it's still very early. It's only a few weeks in. but really happy with the adoption and that we're seeing people use it. We're getting positive feedback. we have a small really power users. We see them heavily engaging with it, using it several times a day. we're seeing them issue longer queries, experimenting in in different ways, these more sort of harder questions, just asking more of what they want. we got a lot of work to do. we rolled it out last week to India also seeing some great early reception in India across. But I think it's very exciting to just see how people start to use the product. we see people do more follow-ups, right? That's one of the things that we saw with AI overviews is people liked AI overviews, but you couldn't really ask the next question. And sometimes these hard questions, you have different refinements you want to ask. , so that's been great to see how people are going on there. And we got a lot of features coming ahead this week. I think it's this week, we rolled out Gemini 2.5 Pro and deep search for our pro and ultra users in AI mode, so they can ask even harder questions going forward across and a lot of exciting work coming up ahead. Okay. And for our viewers and listeners, we're going to run this a couple weeks after the interview. So, okay, these are loose timelines that we're sharing here. but but AI mode is a reinvention of search, so to speak. it takes the search from typical keyword searches to something more conversational. U do you think that the future of search is going to be AI mode style or is it going to be both? Because when I thought about generative generative AI chatbt, you know, in the early days, I've always thought it's different use cases than traditional search. So, how does Google think about it? I think there's a large spectrum of questions that people ask, right? if all you wanted to do is get to big technology, you don't have to go have a conversation about it. You're just going to continue to type in the keyword, navigate to the site, right? other times you have harder tasks. Those are the ones that invite more of that conversational style. , but sometimes it's not black and white. Somebody asks a question that they think is a quick question and then they get inspired and then they continue the conversation. , we were coming up here and we were wondering how fast the elevator is up to the top. It's pretty fast is the is the short answer, right? , so he gave a response then then I ran and went and read an article about how they said they they changed the speed of it to",
        "start": 411.6,
        "duration": 1090.5600000000004
    },
    {
        "text": "we were wondering how fast the elevator is up to the top. It's pretty fast is the is the short answer, right? , so he gave a response then then I ran and went and read an article about how they said they they changed the speed of it to the exploratory deck on one world trade center. So I learned about it then I had another question to ask and so I think came in with a quick fact but then it evolved into a longer conversation. , and so I think the thing about search is it's a very broad space and so there's all different types of questions and so I don't think use cases are all one or the other. , I think we'll see people interact fluidly. I also don't think it's just text, right? You said is it quick or not? , we've rolled out search live in search labs with a with AI mode. , we have lens that's continued where people are doing more image searches. , so I think what we'll see is that people will ask their questions in whatever way is natural like what is the way that you would like to ask that question? what's the most effective way? What's the most efficient way? , and then we should make it easy for people to explore. Well, then why are we going to have two different experiences? Is there a point where Google's technology gets smart enough that if I type in, let's say, big technology, it's like, oh, you want the link, here's the link. Or if I type in a longer query, it should maybe have some understanding of the intent there and answer longer. Yeah, I think we absolutely attemp, you know, continue to evolve to try and adapt it. to some degree that is what the main search page has historically done. we've had image search which says okay if you want a few images you get them on the main search page but if you want to dive in deeper you can go to image search right now that's the way AI mode is really is okay if you don't if you just have a question you shouldn't have to think about it just go to search ask your question if you want to dive in deeper then you can engage with AI mode and we'll see how they both evolve does AI mode continue to grow does the main search take in more of AI mode capabilities and evolve we'll see where they end up where are you doing most of your searches I do them across both of them. It depends what type. A lot of my You don't Wait, you don't have a feeling of like where the majority of your queries are going, whether it's in the AI mode or the just they're split. They're split pretty strongly. I don't know if it's",
        "start": 551.68,
        "duration": 1320.0800000000002
    },
    {
        "text": "across both of them. It depends what type. A lot of my You don't Wait, you don't have a feeling of like where the majority of your queries are going, whether it's in the AI mode or the just they're split. They're split pretty strongly. I don't know if it's depends on on the types of questions, right? right now, if I'm trying to find a restaurant to eat, I still find main search more effective for a lot of those questions. When I'm curious about a new topic and I'm exploring, I often find AI mode better. or if I'm checking a sports score, I'm still more likely to use main search. So, it just depends on on the question. It's a hard question to ask us because we tend to use our products in in odd ways almost to try to break the product or to to sort of really see us the edges of the product. And so, I I don't think our our our natural searching behavior is is is particularly normal, right? But I feel like we could learn a lot by asking the people at Google the way that they're gravitating. So, , by the way, speaking of the information that's in AI mode, I'm actually curious, Nick, what you think about this. There is a growing field, , for AI SEO. We'll go to both of you on this one. We'll start with you, Nick. , first of all, what do we call it? Is it go like generative engine optimization or how do people call it within Google? I think I heard geo for the first time today actually. I hadn't I hadn't heard that. We deeply need a better name like an AI SEO. I think this industry won't keep running without proper jargon. So I think that's right. I think you know I think I think it's a very natural question. How do I you know people people websites are clearly interested in how do I optimize for this experience? We are talking to websites website owners etc. publishers etc. about that. Our general advice to websites is the way you optimize for generative AI is actually the same you would generative AI in search is similar to how you would optimize for search overall. what's particularly helpful in in generative AI is is deeper content because in some cases the AI response will be sort of the first layer first layer of the response and and what we hope is that the the web links will enable the user to go deeper and really explore a topic in more detail. So that's that's a but but that would have applied for for traditional search as well. , but that is certainly an area that that that there's a lot of interest and and we're trying to help publishers through that experience. The thing I've heard is that it's driving marketers nuts because they",
        "start": 669.2,
        "duration": 1604.5600000000006
    },
    {
        "text": "a but but that would have applied for for traditional search as well. , but that is certainly an area that that that there's a lot of interest and and we're trying to help publishers through that experience. The thing I've heard is that it's driving marketers nuts because they they're not quite sure what to do. Maybe that's good. Liz, what do you think? Is that good that they're not able to game the system just yet? I mean, I think what we've always tried to do with our guidelines is get publishers to focus less on how do they change the ranking and more on are you producing content that people want to read? Okay. and so that's what I would tell the marketers. Could you stop working on trying to figure out how you focus on the system and really just is this content that you as a user would want to go read and spend five minutes on? , and I think the more that we can surface that content, , the more it becomes the case that people aren't focused on answering the first part of the question, but really thinking what do they bring to the content, , what's the the the thought in it, the perspective, the experience that they bring, and that's what they're talking about. , then I think the better everyone will be. And so I think if marketers have to just focus on building content for people, that that's awesome. Have you ever heard the warning that Wikipedia gives people and when they want a a Wikipedia page? I don't know if they still do it, but in the past, I'm pretty sure they would tell you you might not want a Wikipedia page because once something happens and you're involved in it, it could get on there and you have no control. And so be careful what you wish for. And I actually was speaking with a reputation management person who was like, I don't know what we're going to do with Gener AI because if someone types a person's name in, it's going to start becoming like that Wikipedia page where if they did something bad, it's probably going to show up whereas before they used to be able to like, I don't know, create results and push that down. What do you think about that? It's interesting, right? Changes things. I think it's really interesting that we're going to get to a a world right now where people can get more perspective often, right? I think that's one of the nice things about AI overviews is that you know it's it's great that you have all of these different web results, but to the extent that the web results gave different perspective, people might have only clicked on one and sort of assumed that was the whole thing. but the AI reviews will give you actually multiple perspectives. then you say, \"Oh, there's",
        "start": 813.76,
        "duration": 1864.7990000000004
    },
    {
        "text": "you have all of these different web results, but to the extent that the web results gave different perspective, people might have only clicked on one and sort of assumed that was the whole thing. but the AI reviews will give you actually multiple perspectives. then you say, \"Oh, there's read more about each of them.\" , and so that opportunity to understand more holistically about a topic. , I think is really exciting and then you learn new things and you know the new things can be all different flavors. , but I think it's great for people to sort of gain more perspective on different things. Yeah, I definitely think that's happened. I had an experience recently where there was a an a nasty insulting word that was being used on Twitter, but I didn't know the meaning. So I typed it into Google and I think the first result was an Auburn fan and then the second result was the explanation of that word the one that I was looking for and I was like wow it is interesting how AI overviews can be comprehensive like that and show both. Yeah and that's really the the design intent is is to is to give as much much breath of perspective or understanding of a topic as we can and then again help people go deeper if they want to explore further. So, let's talk a little bit about what reinvention really means because Nick, you started your comments today just talking about how Google is in reinvention mode. I've said it's in reinvention mode. , and the first thing you say is, do you reinvent search? Do you go from keywords to more natural language, for instance, and let people have conversations with search in AI mode versus just being like, okay, you know, writing like our own little computer language to get in. But I wonder, is this actually going to be the format? , more and more we're seeing people build AI companions, , therapist lovers, and as long as they are generative and plugged into the internet or the system, they might start asking them questions. So, you were involved deeply with the Google Assistant back in the day. You still are overseeing it. I do not. You don't oversee it. No longer. Okay. So, strike that. You were, but you were, we spoke a lot back when you were involved. with the assistant. do you think that the way that we interact with the web information online becomes a different form factor than traditional type in the words and get the answers? I think it will expand. that's my expectation. People are obviously using chat bots sort of more these days. In some ways that's the evolution of of assistance. our bet, our belief is that people will continue to use search and grow their grow their usage of search as well. There's probably a meaningful amount of",
        "start": 946.399,
        "duration": 2148.7190000000005
    },
    {
        "text": "my expectation. People are obviously using chat bots sort of more these days. In some ways that's the evolution of of assistance. our bet, our belief is that people will continue to use search and grow their grow their usage of search as well. There's probably a meaningful amount of There's I think it's unlikely that that that the future of search is is sort of a companion that you're sort of building maybe emotional relationship with. it's possible. but TBD today what we see is is is people are using both, right? And and and there's certainly people that are using chat bots. There are certainly still people using search. They go back and forth between them quite a bit. and so I think how exactly this evolves is is is is still to be seen. from a search point of view you know back to your reinvention point it it's it's it's critical that we continue to reinvent again I mentioned this at the beginning it's been the story of search but we we see these reinvention opport we see these reinvention moments to really expand what you can do with search that's what we're seeing with AI over it's amazing to see with AI overviews the increase in queries from AI overviews is is amazing to see we we announced we shared at at Google IO that people are doing 10% % more queries for the types of queries that trigger AI overviews. That's a lot, right? That that's that's that's that's a meaningful change in user behavior. These are longer queries. These are more sort of who, when, where, why type queries. so we see them as so we see each of these reinvention moments as as as these expansionary opportunities. So again, we lean into them pretty hard. Okay? because I'll I'll explain a interaction mode I have with search now that's very different than one I've ever had. Okay. when I want to when I'm on the go and I want to find things and you probably know where this is going. I just like pull out chat voice mode. There is a character that I speak with and I say, \"Hey, can you help me figure it out?\" And instead of being that guy on the sidewalk who everybody hates like typing and walking, now I'm just having a conversation with the internet. So, are we going to end up like Liz, are you already brainstorming this idea of having like a Google search avatar that we speak with or a personality? , I don't think we've quite thought of it as an avatar, but we have actually rolled out search live in labs that allows you to have more of a conversational experience. Ask the questions, get a response. we also bring up links so that if you get intrigued by something, you can continue to dig in. , I don't think it's necessarily at this point that we're",
        "start": 1089.6,
        "duration": 2437.8370000000004
    },
    {
        "text": "search live in labs that allows you to have more of a conversational experience. Ask the questions, get a response. we also bring up links so that if you get intrigued by something, you can continue to dig in. , I don't think it's necessarily at this point that we're personality. I think it's important that Google has more of a a neutral and trustworthy one of it doesn't have a particular angle on things but brings multiple perspectives. But the idea that should be fluid in an audio form and doesn't have to be by text is absolutely something we see and this is how we started to roll out search live. I probably do about half of my personal AI mode queries by voice. , maybe it's that I'm on the go, maybe it's that it's a much longer query, so it's going to be a bit annoying to type in on my phone. But I do expect that voice will will, you know, voice voice is already a big part of search. I expect it'll be a growing part of search as well, particularly as queries get longer. So, it's interesting that you mentioned that Google has to be neutral. Do you either of you ever worry about the startups in the rearview mirror because they have much more flexibility. And I'll point out again, people are some people are falling in love with their AI companions. I mean, if you have that sort of relationship with technology and you start asking it things that can search the web, , that's latitude that a company like Replica might have that Google doesn't. So, is that like an innovator's dilemma problem that you're worried about? We I mean the the biggest the biggest thing that we really try to make sure is is is that we maintain our users trust and we grow our users trust over time. So that's the the thing that to the extent that anything holds us back, it's we don't want to make a mistake for our users. We we don't want to violate the trust of our users. So that's always a very front and center front of mind for us. I get it. So if Google breaks up with you, then you're going to have a very different feel of what Google is for the rest of your life. Yeah, we we would be worried we we we would be worried about something like that. we have experimented much more in labs and so so having the labs environment has been important for us because we can try things that are a little bit more nent. We started AI overviews in labs. We started AI mode in labs. that enables us to experiment with users who want to be more on the cutting edge. we can be and so we can push further there for the for the core main search experience. we really try to make",
        "start": 1238.559,
        "duration": 2701.7569999999987
    },
    {
        "text": "started AI overviews in labs. We started AI mode in labs. that enables us to experiment with users who want to be more on the cutting edge. we can be and so we can push further there for the for the core main search experience. we really try to make before before we bring it to that experience. But the experience of going from labs then to experiments and then then to shipping has rapidly has also gotten really fast. We're we're shipping really fast these days. and so so we think that we think that cycle works. Can you explain to me how that happened? Because the world watched OpenAI take the lead with Chad CPT and myself included, we all said, \"Where's Google? Where's Google? Where's Google?\" We knew we knew you had a working large language model inside the company called Lambda because one of your engineers thought it was a real person or sentient. , so everybody knew Google had the technology and then it seemed like a switch flipped and I mean we go back to the spring where IO came and now there's IO. Now there's AI within everything in Google. Now maybe this was a perspective problem because Google have been talking about AI for many years. I've been to many of your developer conferences. It seems like the theme is AI. It's been it's been a thing for a while, but it seemed I guess the difference is that it seemed like things were shipping or this urgency to get things in labs, get it tested, this boldness to say, \"All right, we have a format of search that might disrupt our current form of search, but we're just going to roll it out right next to regular search and see what happens.\" , how did Google go from the company that was, it seemed like, to the outside, afraid of generative AI to one that embraces it? I think the technology needed a lot of maturation right very early on if you sort of rewind rewind to those early days the technology hallucinated quite a bit certainly within the context of search factuality matters a lot we don't we don't you know people trust that when they when they search for something on Google the results they get are are highly accurate they're high quality etc so that was a that that was a big area of concern for us and the technology was was was truly nent and and and had a lot of risks around it. so we invested aggressively and and Liz can talk more about this in in grounding in factuality in in getting to that point. And so that was really I would say that was the real unlock for us is is is was developing the technology and developing all sort of everything around it that we could feel confident that was the thing that made sense to put in front of our users.",
        "start": 1372.48,
        "duration": 2985.915999999998
    },
    {
        "text": "point. And so that was really I would say that was the real unlock for us is is is was developing the technology and developing all sort of everything around it that we could feel confident that was the thing that made sense to put in front of our users. obviously Google had that incident where someone asked it how to make a pizza and it said put glue on it or eat rocks or any number of weird things. And from your position, it you go from that moment where I think maybe a reaction would be let's clamp this down. We've certainly seen that with Bing, although it was a more extreme example, but when it tried to steal a New York Times columnist away from his wife, they kind of said we shouldn't do that anymore. But so how do you then go from like oh that's a problem to even still because it's more risk roll this out as broadly as you have. Yeah. So I think there's a couple of things that were important there. one search search has never been perfect. you know people will go and say with AI featured snippets have had challenges. Knowledge graph is web ranking isn't perfect. and so we're always on a relentless pursuit to make the quality even better. what we saw with with that incident was both those queries were quite rare. We saw them only like one in seven million these these types that that people were phrasing but we still really cared about the trust and so we felt like we needed to take action on it. And so there's so much potential with the technology that we didn't think the right thing is is clamped down but the right thing isn't all either just let it be. So we put a lot of effort into understanding what were the types of failures that were getting surfaced. , one of the things that was different with generative AI is we were seeing , new types of queries than we had previously seen. You you mentioned eat rocks. , people previously did not come to Google search and say how many rocks should I eat today or a day or any other form of how many rocks should I eat today because they already knew they needed a little affirmation about eating those couple about those ones, right? High and iron. So, so if you went and and sampled our queries and you looked for general things and you know we did extensive vows, we weren't seeing queries like that, right? you can say that that's a particular one, but more more generally these sort of false premise questions, right? We're like it's not really a question that that people are seeking out sort of cropped up in new ways. the other thing that cropped up in new ways was essentially how do you think about forum and UGC content,",
        "start": 1515.919,
        "duration": 3247.595999999999
    },
    {
        "text": "more more generally these sort of false premise questions, right? We're like it's not really a question that that people are seeking out sort of cropped up in new ways. the other thing that cropped up in new ways was essentially how do you think about forum and UGC content, really thoughtful forum discussion that includes one sarcastic comment about about glow on pizza that we picked up on there. Okay. So it wasn't enough to understand the site. It wasn't enough to understand a page. We had to get smarter about each section on a page even if a page was trustworthy in that. and so when when you look at the the the value the tech can do, we don't view it as oh well there's some problems therefore don't try. we view it as a challenge to figure out how do you overcome how do you handle the challenges that come up in the problems. and so people really put a lot of effort into figuring how to do that and then we saw with our vows that we had really made progress on those problems and continue to grow and we'll always make mistakes will always continue to improve it but we have quite a rigorous aval and testing process and feedback loop on it that helps guide us to ensure that we're doing the right thing by users. Okay, so I want to talk about the future of the web and how publishers are going to be able to survive this moment because even if people are spending that 10% more time in AI in AI mode, maybe they're not going to websites anymore. So, let's do that right after the break. And we're back here on Big Technology Podcast with Nick Fox, the SVP of knowledge and information at Google, and Liz Reed, VP of search at Google. Of course, one of the issues that we see in this moment is that the way that the information gets into the bots is it's kind of like a reverse Robin Hood where it takes from these poor publishers and sort of gives to the already rich Google and allows it to surface this information to users without sending the traffic back. You might dispute the characterization, but I think it's important to bring up Matthew Prince, the CEO of Cloudflare, talked about how back in the day you would get two crawls per page and that would send one visit, two Google crawls, and eventually you would get one visit from those crawls. Now that number is something like 18 to1 or even even higher. people don't like going to the footnotes because they're starting to trust these bots more. That's what he says. So, how is there a future for a healthy web if we keep moving this way? So, we love the web. We deeply believe in the web. That's good. That's good. , same here.",
        "start": 1648.64,
        "duration": 3528.955999999999
    },
    {
        "text": "going to the footnotes because they're starting to trust these bots more. That's what he says. So, how is there a future for a healthy web if we keep moving this way? So, we love the web. We deeply believe in the web. That's good. That's good. , same here. you know, Google's a company that's grown up on the web, right? And I don't think it's an overstatement to say that there's no company that cares more about the web than than Google does. And so, we we care about this deeply. We think about this deeply. , and we have built both AI overviews and AI mode to be to be very web forward. it is a losing battle to to fight users, right? There's a user change happening here. users are looking for it's clear that users looking are looking for a different kind of experience. If they're looking for a summary, we should not stand in the way of giving that user a summary, right? a product has to evolve and you have to evolve listening to your users. so that's not a choice. what is a choice is is how we do it, right? And so the approach that we've taken is to be very very web forward. We we have links throughout the experience. we try to very prominently feature content. we try to not recite content. when we do you know if we're referencing a specific a specific publisher or a specific perspective we try to say according to big technology or according to Bloomberg or whoever it might be that will be linkified right and so so so to drive traffic so that's our that's our approach that's our ethos the if you look holistically traffic to the web from search has been stable over time there's lots of reports of of of large decreases there. You know, at any given point in time, there are sites that do well, there are sites that that that struggle, but if you look holistically over across traffic broadly to the web from Google has been has been largely stable over time. so, a lot of this is it's there is clearly a change happening. we're trying to do it in a very web forward and friendly way. and and that's that's our approach. I think just one thing to add we we definitely understand that that that publishers and and some folks are are are seeing less traffic, but what's also going on here is other traffic shifts. we're here doing a podcast. We're doing a podcast because people actually like podcasts these days, right? , so you're seeing a shift, especially among younger users for where are they going to information. So they're going more to podcasts, they're going more to forums, they're going more to social posts and less away from some of the traditional media. And so some of what people are assuming is about what's happening with AI is actually",
        "start": 1792.159,
        "duration": 3859.0369999999994
    },
    {
        "text": "users for where are they going to information. So they're going more to podcasts, they're going more to forums, they're going more to social posts and less away from some of the traditional media. And so some of what people are assuming is about what's happening with AI is actually media that that people are seeking out. Whereas the overall traffic is relatively stable, right? But there are publishers that have marked decreases when AI overviews started rolling out. I mean just to give you one example and I've given it on the show before speaking with the publisher World History Encyclopedia who saw a 25% decrease in traffic like tied directly to AI overviews coming out. I don't I don't think it's productive for us to like have a back and forth over like whether that was actually AI overviews related or not. He believes it is. Google might believe that there's like you know these fluctuations. I guess the question is what do you do about it? Because that information is valuable to the web and to to people forget the web just to people in general and without ways to support themselves we might not get that as much. So could you envision a way where instead of someone from like world history encyclopedia which is the number two history site or number two yeah number two history site on on the web after the Library of Congress that they just like write that content for the LLMs and then it gets sort of ingested by let's say AI mode and then sorted to users if that's the new way that people want to spend their time. I think that's possible. I but it it's not the bet we're making. the bet we're making is that the that the value exchange that search has has existed on for years is largely intact and it's and it still makes sense. websites make their content available for indexing and and and and as a result of that, Google sends traffic to those sites. Again, it will vary site by sight, right? There's some sites that will do incredibly well. Mhm. there are some sites that that may struggle. and so and but that's been that's been the history over time when when we did mobile, a site that didn't adopt mobile maybe would would have struggled etc. or sorry when when the world evolved to mobile you know different different different sites did well through that. but by and large our view is and and the approach we're taking is that traffic still matters and that fundamentally users want to visit the web, right? I was giving an example the other day of I'm going to London was looking for a hotel. I was looking for a hotel near a park convenient to to the airport convenient to a certain train state. You I was sort of had all these all these details that I was",
        "start": 1959.12,
        "duration": 4171.515999999997
    },
    {
        "text": "giving an example the other day of I'm going to London was looking for a hotel. I was looking for a hotel near a park convenient to to the airport convenient to a certain train state. You I was sort of had all these all these details that I was response. It gave me gave me some good recommendations. Ultimately though, it's a hotel. I wanted to see a review of that hotel. So I clicked through a review site. Ultimately, I wanted to actually finally book that. So, I click through the booking site. I think it's I think it's too reductive to say it's AI or the web. Okay. and our our our our view is that it's AI and the web. and and those and and those work together. and and and so that's our approach. I think I might have been a little too snarky in the way I set this segment up because if you think about it, Google's actually sending far more traffic per crawl than the others. I think Anthropic is up to something like 60,000 to one according to the Cloudflare data. And I always felt that and I I might make some enemies saying this, but I always felt that this publisher insistence that Google pays them for highlighting their information in Google News for instance. So that headline in two sentences that to me felt overboard like this is a service where you're going to get highlighted, you allow the crawl and you're going to get a ton of traffic. Like I'm a small independent publisher. I'd love to be in those Google News results. , so I think that that was a little overboard, but this is this is a little different, I think. And maybe the traffic is consistent, but u it just feels like given this like history example, you could spend your time reading about it on the website or you could just like read about the history event you want to in AI mode or what I'm starting to do now, have a conversation with the AI voice. So is there ever some concern that that the training data for the models will go away if the economics don't make sense for them or like for instance maybe these websites will go away if they're not because even though Google doesn't Google's just indexing them and not not like responsible for their existence like a lot of companies really did count on that Google traffic to stay alive. it is for sure the risk if if we get this wrong, right? and and it's a it's a large part of the reason we care so much about it. a a in some ways a search engine ceases to exist if there's if there's no web to search over, right? And so so this is when I when I say that we love the web, this is a large part of",
        "start": 2117.599,
        "duration": 4454.556999999998
    },
    {
        "text": "the reason we care so much about it. a a in some ways a search engine ceases to exist if there's if there's no web to search over, right? And so so this is when I when I say that we love the web, this is a large part of really is the ecosystem with which and on which Google search operates, right? And so we deeply care about it. We don't see signs that that again we we see that we see the we see the traffic value. It's it's it's why we think it matters that the traffic is is healthy and stable over time. is if not then we would start to get worried about that. Now again in pockets right may maybe it's tougher to be you know a certain type of encyclopedia given given what these tools do. So again there may be pockets where it's where it's tougher where it's where it's different. , but that's always been the story of the web, right? There there have always been those that those those that thrive and those that struggle. You have to lean into what the future is, right? It's it's we have to evolve to where where where users are, where users are going, what the technology can do. and again, we just have to our approach is to do it in a way that that enables the web to thrive through that moment. So are you're here in New York speaking with publishers. Are you both speaking with publishers or was it we both had we've we both had a set of meetings with with with publishers. So how are those going? Let's go to you Liz. Like are they understanding this moment and what's what's being discussed? I imagine it was about generative AI. When we talked about search and search includes search includes generative AI. I mean I think you know many publishers these days are sort of trying to understand how is the future going to evolve right I think the the understanding you know as Nick mentioned standing still is not going to work it's not going to work for any of us search search included but we all really do want to find a way to make this work for publishers for media and I think without that we don't have a search engine. We don't have a product and so we have to go find a way to make it effective. I think what we will see if we do it right is that really great in-depth rich content that people bring when people bring their perspective, their opinion, their experience, their expertise that content will continue to thrive because people want to hear it. They're not giving their fashion advice to an AI bot by and large. Okay? The people I know who are giving their fashion advice are not the people who are spending any time on fashion before. They're spending no",
        "start": 2262.56,
        "duration": 4748.555999999999
    },
    {
        "text": "content will continue to thrive because people want to hear it. They're not giving their fashion advice to an AI bot by and large. Okay? The people I know who are giving their fashion advice are not the people who are spending any time on fashion before. They're spending no But the rest of the folks who care about it, they still want to read that influencer. They still want to read the style magazine. those folks who are really deeply interested in tech, they're going to still want to hear your podcast, right? Like you can talk to an AI bot about generative AI or we can hear your thoughts, right? and so we really want to continue to make that content thrive. and come to the surface and we spend a lot of time thinking about not just how are AI overviews or AI mode really high quality but what does it mean to really make it web forward how do we surface those links what are the best links to do how do we allow people to understand the value in continuing to go deep and progress what will they get when they get to those websites we started initially with more of a tray of of web links and then we said okay that's great we still believe in that but we want to add links within particular sections because maybe you don't know which of the general sites but you want to learn more about this one particular part. then we started doing as Nick was referring to in some cases according to big technology according to somebody else and linkifying that when we think it's really about their voice could be according to a Reddit user or could be according to big technology. You'll think about the sentence that follows differently and you'll want to hear about it and read about it differently. , so we're constantly have folks experimenting on the teams with how do we really take the beauty of the web and surface it in a way that allows people to to dig in deeper on it. How is search revenue continuing to grow the way that it is in this moment. I would imagine that as people use AI as it's still nent in terms of the way that it sends traffic to publishers, still nent the way that you monetize. , but every time I'm like looking at the numbers for the quarter or seeing them come in, I'm just like, huh? You know, it doesn't seem like it should be possible to grow. I think it's like double digits search revenue somewhere in that area in this moment. What's going on? So, there's a there's a few interesting things that are all kind of happening at the same time. , the first is queries continue to grow. and and we've and and and we've shared that on a year-on-year basis, queries are growing.",
        "start": 2413.76,
        "duration": 5018.6349999999975
    },
    {
        "text": "that area in this moment. What's going on? So, there's a there's a few interesting things that are all kind of happening at the same time. , the first is queries continue to grow. and and we've and and and we've shared that on a year-on-year basis, queries are growing. generative AI, right? And so generative AI has been in a lot of ways fuel for growth. as as as users realize they can ask more questions, they can bring more questions to search. So that's that's that's a big part of it. the second part of it is AIO overviews fit into the existing search results page. The search the existing search results page has advertising on as well. and so as we drive more queries you know those queries monetize and and and we have an existing advertising model for that which also drives traffic to advertisers who are selling things or enable people to book hotels and things like that. so that's that's another major piece of it. The third piece is at the same time as all of that's happening on the on the on the on the results page itself. We're applying generative AI to our advertising products too. and so you know the in a lot of ways the holy grail of advertising for the longest time has been advertising come to us with here's my site, here's how much I'm willing to spend. Here's the ROI goal I have. Go do it. and we've been on that journey for for a long period of time. Generative generative AI takes us an additional step towards that. So we can be better at matching ads to queries. We can be be better at generating creatives, you know, those types of things on on behalf of our of our advertisers. The fourth thing is as the queries get more specific and and detailed that leads to more valuable traffic to advertisers. So advertisers care about their conversion rate. They care about obviously their return on investment. The higher the conversion rate, the higher that that the higher the more valuable that click to the advertiser is. So the more that that we're able to provide enable users to specify their their intent more specifically, the more we're able to to deliver a more qualified lead to the advertiser. So all of those kind of work together in in a in a pretty symbiotic way. And there have been people that have surmised that there's less impressions. So the CPC is up co cost per click. Is that wrong? we don't we don't share overall ad impression numbers. It's not one of our financial disclosures. We do share that pay clicks have grown over time as as as well as CPC. So both both of those are are growing over time. Okay. How about shopping? I I just think that shopping is going to be a real important new thing that happens",
        "start": 2550.319,
        "duration": 5347.914000000002
    },
    {
        "text": "our financial disclosures. We do share that pay clicks have grown over time as as as well as CPC. So both both of those are are growing over time. Okay. How about shopping? I I just think that shopping is going to be a real important new thing that happens gotten to the point where I won't buy anything unless I research it with a generative AI chatbot. , what's the future of that going to look like? Liz, do you have any thoughts? , yeah. I mean, I think there's a few things. I I think generative AI makes shopping exciting in a number of different ways. , one, you know, you've got different types of shopping. You've got ones that are sort of more apparel or stylistic. you've got others that are you're going to go buy an appliance, right? in the case of appliances, you want to do the research, but but sometimes you want to understand about two or three different products, and those are not the two or three products that people have chosen to compare with. Somebody compares one product with with another product, someone compares this product. And so, it's not really allowing you to do research on the subset of products you want to look at. Okay? But then with generative AI, you can because you're no longer dependent on one web page talking about the three products you want to compare. You get to specify. You also often have criteria that you want to that you care about that are maybe not really what people are spending the time researching on, but that information is buried somewhere on the web. , and so I think that ability with something like an appliance to really gather the information across the web, understand holistically what it is, , and then dig in deeper on the web is pretty exciting to see. On the apparel side, there's lots of times where you both want, , some level of like, okay, the dress has to fit my size, so I have a couple of structured data fields, but then beyond that, what I want is not really a structured data menu. It's something that's to describe. I want to feel more classic. I want it to feel summary. I want, you know, I I would describe it to a friend or to a sales person differently than you might have previously done with keyword ease. But generative AI lets you actually sort of start to describe what do you actually want, right? and that kind of changes, I think, what we can do with shopping going forward. and really allow both in in some cases the the more unique merchants, right? These these merchants who are undiscovered that have great products your local merchants, others that have ones to be found because now people can actually express something in a way that narrows it down to where they shop. And so I think",
        "start": 2716.8,
        "duration": 5626.315000000003
    },
    {
        "text": "some cases the the more unique merchants, right? These these merchants who are undiscovered that have great products your local merchants, others that have ones to be found because now people can actually express something in a way that narrows it down to where they shop. And so I think we'll also see a lot of work around agents. We talked about some of the efforts at IO with the ability to decide that you want to track the price of something and so when it goes on sale do that. try virtual tryon was a highlight at IO. I am so I never know what the clothes are going to look like on me. Do I have to buy then do I have to return it? Returning it's like not fun for me. It's actually not fun for the merchant, right? It's not usually good for for their business if they have a lot of returns. This idea that you can actually just see what it looks like and so have more confidence when you buy it that that you'll keep it I think is really great. So I think there's a lot of opportunity with shopping in Jiren of AI. I don't know if there's anything you want to add Nick. I think you got it. Yeah. No, I I'm definitely watching that space pretty closely and probably another good emerging well not emerging business because Google Shopping is a big business already but I think probably an area for a lot of growth. A lot of space for transformation. Yeah. Yeah. What about visual? I mean, we I I think Google started with Google Glass, went away. Now everyone's building AR glasses. Is that going to be a format of search in the future? I think so. I think I think I mean it's a rel it's a relatively nent space. Lens is doing pretty well. Lens is doing on fire. Let's talk about that. Lens is doing phenomenally well. The combination of lens and AI overviews is is doubly on fire. Okay. So, it blends is you point your photo at an item and you can ask it a question about the Yeah. And there's really two things that are taking off. One is you can point your camera at something and and say what is this or sort of here's my homework. Can you give me some help with my homework? These types of things. So, it's doing very very well with with younger users too. the other piece of it is circle to search which is so that's that's the camera version of it. But what if I want to search something that's on my screen? , so I might have a homework assignment on my screen or I might see a bag that I like in say an Instagram post or something like that. , , ties back into shopping. Maybe I want to",
        "start": 2859.2,
        "duration": 5872.235000000008
    },
    {
        "text": "what if I want to search something that's on my screen? , so I might have a homework assignment on my screen or I might see a bag that I like in say an Instagram post or something like that. , , ties back into shopping. Maybe I want to it is or whatever it might be. and so that sort of combination of input is visual and then the AI summary or the AI response and then again with links to do I want to buy it, do I want to go deeper is is is proven to be a really really powerful combination. Okay, I want to make a note about actually let's talk can we talk about notebook LM? Sure. How's that doing? , so Notebook LM, by the way, folks, I'm sure many of our listeners know it. If you don't know it, you can drop a bunch of links in it. It will make sense. Do a FAQ timeline. It will create an audio podcast. , by the way, Liz, to your point about people continuing to want to listen to this podcast. I hope so. , I've had multiple people tell me that the voice, the male voice in these Notebook LM podcast sounds like me. Well, that's true. Even still, we're we're growing. So, it's not killing big technology. They want your perspective, not just the sound of your voice, right? Yeah. Welcome to the deep dive. I think we're pretty close. So, how's that product taking? the product, so neither Liz nor I work on it. and but but the product the product is doing well. it's it's also doing quite well in in the education use case. It's quite useful if you could upload your syllabus or a study guide or sort of point at your textbook, things like that, to actually to go to go deeper in a topic. obviously the the podcast version of it you know has really taken off. We've brought some of the podcast capabilities into search. Maybe you want to talk about the how we've connected those back. Yeah. so there's a there's a couple of things within Discover. We've been playing around with with daily digest seeing okay you get in the morning ones can you understand what some of the different stories are. , we have a lab where we're experimenting with if you come to search and you issue a query for those who opt in, can you get a short little podcast about the topic that you ask about? , so it's great if you're on the go and you don't want to do this and you want to understand it. , I think you have both a conversational one like search live or Gemini live, but sometimes there's a different feel between you just asking questions versus hearing people discuss it. , so we're constantly playing around with the with the general technology of taking content and turning",
        "start": 2983.28,
        "duration": 6156.634000000008
    },
    {
        "text": "understand it. , I think you have both a conversational one like search live or Gemini live, but sometimes there's a different feel between you just asking questions versus hearing people discuss it. , so we're constantly playing around with the with the general technology of taking content and turning notebook LM really piloted, but it's making its way into other Google products is relevant because it's just a it's a it's a fun way to learn about something going forward. Okay. , as we come close to an end here, I want to just ask some bigger picture questions. I think there's like a there's two views of how this is going. Like there's one curve about that people think about with generative AI that we've had great advances for a while and now it's leveling off. And there's another curve that people think about where like all right this is cool but we're at the beginning of an exponential and it's about to get crazy personally. What where do you both land on that? I can go first. Go for it. Do you want to go first? No, go ahead. I I believe it's it's closer to the latter. I think I think it's I think I think it's easy to underestimate where a technology is kind of when you're when you're in it. But actually the way I see it sort of the most is there are at least from the point of view of search there are so many questions that we have in our heads that we're not asking. the amount of information that that people are interested in, would be interested to consume is so much vast is so much more vast than what what what what people do. We've we we've said this before, one of the great things about our our mission is that at any given point in time, we're barely scratching the surface of of of what that mission can be. And so, , you know, I said this earlier, the the, , the opportunity that generative AI technology brings for a product like search is massively vast and I think we're really, really early on in it. What do you think, Liz? I'd also agree it's very early. , I think one thing in particular is the the models are getting much better at reasoning and they're also getting much better at tool use. And LM are great at a set of things. They're not great at everything. , we have great tools that exist in the world for other things. But if you can now teach an LLM to use tools, what does that now enable? And to use multiple tools across, right? , so you take something like you have a trivia question about finance. LMS are great about reasoning through it, but you don't want them to make up the numbers. They're not going to know what the latest financial data are. But if",
        "start": 3126.559,
        "duration": 6438.714000000007
    },
    {
        "text": "And to use multiple tools across, right? , so you take something like you have a trivia question about finance. LMS are great about reasoning through it, but you don't want them to make up the numbers. They're not going to know what the latest financial data are. But if real- time finance data, real-time sports data, and then pull it together and ask the question, then you can ask much more interesting questions than you could previously asked on search, but they're grounded in actual data. They're not just made up numbers. And so I think particularly a bunch of the reasoning, the tool use, the agent capabilities, , they will really unlock a lot. , and then just to double down on Nick's point, whether or not somebody asks a question isn't just a question about whether or not they had a question. It's whether or not it was worth their time. Right. Right. And and so people do that question, right? You were curious about the flower, but if you had to figure out how to describe the flower in words, no way. So, you didn't ask the thing. Okay. But then now you can take a picture of it and now you ask the question, right? It wasn't there was it wasn't like suddenly people became curious about what the flower was or your plant is dying and now people take a picture and say why is it dying how do I help it they cared about whether their plant was dying they just they just didn't know what to do about it right and so there's a lot of possibility to open up when you just lower the barrier to information access lower the barrier to information understanding the last thing I think that's kind of still very underexplored is transforming content right we talked about the podcasts from Notebook LM. but just this ability to take content in in one form and and transform it into another without so much work I think is both exciting from a search perspective because people learn differently. people are in different environments where where they can get it. but also from a creator perspective. You're creating content. Do you have to create the content in every single form or can you create the content in a podcast and easily turn it into a nice article and then easily turn it into short clips of video? , and so I think there's a lot of possibility there around that sense of like remixing content in a way that's interesting. Very interesting. So you've both been at Google for 22 years. Did you start? Were you in the same orientation with those? Did they have the spinny hats? We were on different coasts. We were in I was in New York. Okay. I spent 10 years in New York. All right. I was in Mountain View. Okay. It's a long time at Google. Where",
        "start": 3271.2,
        "duration": 6692.874000000006
    },
    {
        "text": "Were you in the same orientation with those? Did they have the spinny hats? We were on different coasts. We were in I was in New York. Okay. I spent 10 years in New York. All right. I was in Mountain View. Okay. It's a long time at Google. Where change most exciting? But I want to know about like so obviously you've seen shift from desktop to mobile. You've probably seen like the cloud shift as well, shift from portals to search. Where is this the number one shift like the most intense shift or is this like somewhere in the middle? I think it is the most There's always there's always like recency bias and things like this. To me, it feels like Google when when I started that there's a there's a there's a strong feeling of the sky's is the limit. There's a there's a strong feeling of of of opportunity. paired with the ability to we are shipping in search at a pace I can't even like it's such a fast pace I can't even remember. , and that's fun because the technology is fundamentally enabling us to do things that we might have might have only dreamed about doing before. And so you know again we don't see these things as scary and so it's not I didn't ask which is the number one fearful moment. It's it's it's just a really exciting and and and and fun time. Okay. I think in search in particular like there have been many technology shifts but this is a technology shift like at the heart of what search is right about understanding information and ability to organize when you go back to our our mission organizing information making it useful making it universally accessible so it's a technology shift that's right at the root of that and and so that makes it exciting and I think we we have a lot of folks in search that have been in search for quite a long time and they have been trying their ideas. Mhm. For many years, right? you know, sometimes people think, oh, when when we ship it, it's the first time we thought of it. No, actually often times we thought of the idea 15 years ago, 10 years ago, 5 years ago, you tried, it didn't work. You tried, it didn't work. Or you tried and it was more incremental. You can make a little bit of progress. Suddenly, we're at a time where you try those ideas and you're like, \"Wow, I can I can probably do them this time.\" Right? oh, I cannot just do small tweaks and make a little bit of progress. I can make big jumps. And that's that's really exciting to people because it, you know, you you work hard. You're building a product for multiple billions of people, which is just a a daunting thing at its heart. , but now",
        "start": 3400.079,
        "duration": 6967.034000000004
    },
    {
        "text": "tweaks and make a little bit of progress. I can make big jumps. And that's that's really exciting to people because it, you know, you you work hard. You're building a product for multiple billions of people, which is just a a daunting thing at its heart. , but now life for billions of people, and that makes it really exciting.\" I have two more questions. Can we just lightning round through them both? Let's do it. U, I asked Sergey when we were at IO what the web looks like in 10 years, and he's like, I'm not even going to begin to attempt. What does the web look like in five years? What is it's a long time right now you got you got people guessing AGI and two right I think if we do our job right the web feels like it is filled with really rich and interesting content where people where creators feel like it's one of the most thriving times where they can bring their perspective where anyone can come and share their content and and be discovered and connected with people. I think it is probably even more multimodal, multiiformat. Like I would certainly expect video to continue to grow. I would certainly expect audio and not just you know text with some images to grow. So I think you'll see more and more of different types of content that people do. but I I think if if we all collectively but but certainly Google search which has as has a key role do our job right then you see content really thriving. The thing I'd add is I think the web will be much bigger. I think I think there will be I think the other thing that we haven't talked much about I think I think this moment will also lower the barrier for creation of content and we and we see that happening a lot. We see that with things like V3. but I think the barrier for creation of content multimodal but as attacks as well will come down quite a bit. I think that will enable an explosion of a creation of content as well. Okay, here's my last one. We've talked about this moment of reinvention for Google. We've talked about some of the speed bumps that you've put in for yourself or these these moments where like you don't want to go too far because you might lose user trust. And you've both said that we're at the beginning of an exponential. So, do you ever worry that even though you're in reinvention mode and changing a lot that you're not changing fast enough to get ahead of this? my view is I mean I think you always worry about that right like you you I think you always worry are you prioritizing the right things are you doing the right things are are are you doing it fast enough so for sure speed for",
        "start": 3539.44,
        "duration": 7274.471000000001
    },
    {
        "text": "get ahead of this? my view is I mean I think you always worry about that right like you you I think you always worry are you prioritizing the right things are you doing the right things are are are you doing it fast enough so for sure speed for the things that Liz has you know we we've sort of collect collect collectively been emphasizing with the teams again, you know, we take this responsibility very very seriously that we have and so so so I think we need I think we need to build quickly. I think we need to experiment quickly and then we need to make sure that we're shipping to our to the billions of users who use Google when things are ready and and so that that's the approach we need to take. does that enable us to go fast enough? I think it's a good qu I think that's a good question but but we're not willing to sacrifice the trust of our users and we take the responsibility of those users seriously so you know we do it as quickly as we as is reasonable take us on I think you know I think I am probably both personalitywise a reward and part of my job is to always obsess with that question right are are you doing enough how can you go faster without breaking not at the expense of trust but can you go faster can you do a better job can you raise the bar. , and so we spend I spend a lot of time with my team just always asking the question, how can how can we be more effective? , and I think being obsessed with like the alternative of not worrying is being complacent. , and so I don't want to be complacent. I'd rather worry. All right. And focus on Liz and Nick, it was great speaking with you. , I've appreciated our conversations through the years and I hope to continue them. Thank you. We hope to be back. Oh, you will as long as you want to. Okay. Thank you everybody for listening and we'll see you next time on Big Technology Podcast.",
        "start": 3697.04,
        "duration": 7469.353000000003
    }
]