[
    {
        "text": " Pour one out for Stack Overflow. [music] Stack Overflow is basically dead at this point. And honestly, that's kind of sad. It's been the go-to place for developers when they have questions or bugs and they can't figure something out. Stack Overflow has been the community. You go there, you post your question, you post your bug, and other developers try to help you. They try to answer your questions. It's basically Reddit for coders. As a developer, I would always have a Stack Overflow tab open when I was working. But that all changed when ChachiBT launched. And now Stack Overflow is basically dead. But the story is even wilder than that because Stack Overflow actually caused its own demise. Let me tell you all about it. So, first, this is Stack Overflow. As I said, as a developer, you would go to this website. If you had a question, if you ran into a bug and you couldn't figure it out, you go here first. You would search if other people had that same issue. And then if they did, most likely lots of people would answer it and the best answer would be upvoted. Here's what that looks like. Here's a question. I'm working on a simple C++ project in VS Code. And down below, somebody answers it. Now, from there, you get upvotes. There's this whole point system. It feels very similar to Reddit in that way. So launched in 2008, it absolutely exploded in popularity and became indispensable to developers everywhere. Look at this growth. This is number of questions asked monthly and it absolutely peaked during CO 19. Everybody was home. Chat GPT hadn't been released yet and everybody was coding. But then look what happened. Chat GBT launched right at the end of 2022 and it was just absolutely devastating to their usage. Stack Overflow is effectively not being used anymore. But what makes this interesting is that most likely Chad GPT and other AI systems used Stack Overflow's data to train their models. Which means Stack Overflow essentially contributed to its own death. Whether they agreed to it or not, Stack Overflow's data was public. It is on the web. It was indexed by Google and thus OpenAI gobbled it up and trained their models on it. And that is a huge reason why these models are so good at coding. This was really the foundation for how they gathered all of that data. And this is all because the nature of software development is changing so rapidly. Not only do people not really have a need to go directly to Stack Overflow anymore, but also people are relying on agents more and more to write their code. And so they're not writing the nitty-gritty of the code and thus they're probably running into less in the weeds bugs that would have required Stack Overflow. And speaking of things affected by artificial intelligence, we actually put",
        "start": 0.08,
        "duration": 344.08099999999996
    },
    {
        "text": "people are relying on agents more and more to write their code. And so they're not writing the nitty-gritty of the code and thus they're probably running into less in the weeds bugs that would have required Stack Overflow. And speaking of things affected by artificial intelligence, we actually put use today. It is a free downloadable ebook. It's from me and my team. Go get it. Link in the description. And I saw this post from Ham on Twitter and he brings up a really good point. This is a catastrophe. Stack Overflow provided data to LLMs. LLMs replaced Stack Overflow and now no new Q&A hub exists to provide fresh data. It's a self undermining casual loop like mold growing on food, consuming it, and dying once the food is gone. Now, there's a few ways to think about this one. Let's assume he is right. And the fact that there's no new data, meaning humans aren't running into bugs, posting them online, getting them answered, and then that's retraining the model. Maybe that's true, but at the same time, maybe the models are figuring out the bugs themselves, and all of the history in your chat conversations are being used to retrain the models. Don't fool yourself into thinking they're not. And so when a model writes a piece of code, there's an error, it can actually see that there's an error, get the error code, and go back and forth and try to fix it. And then all of that data is then used to train subsequent generations of models. So maybe this public message board version of solving programming issues isn't really needed anymore. But the story gets even crazier from here. The founders of Stack Overflow sold Stack Overflow right before Chat GPT was announced. Basically a year and a half before ChachiBT first came out, before their massive decline, specifically June 2021st, Prous, a Netherlands-based subsidiary of South African media company Naspers, announced a deal to acquire Stack Overflow for $1.8 billion. The founders got paid and then it basically went to zero. And this is just another example of technology eating something that had previously been a centerpiece in society and culture. I really think of Blockbuster as a perfect analogy to this. Blockbuster was the place that you went to go get movies on Friday night. You go there with their family. You browse all the movies. You argue about which ones you're going to watch and then you take one home and watch it. But with the advent of Netflix streaming, and really the advent of Netflix movie delivery, Blockbuster just got decimated. And for those of you who are a lot younger than me, I really can't stress how much of a cultural cornerstone Blockbuster was for a lot of us growing up and then seemingly overnight it just disappeared. And I feel the same way about Stack Overflow. Whatever you think about Stack",
        "start": 174.239,
        "duration": 644.8809999999994
    },
    {
        "text": "those of you who are a lot younger than me, I really can't stress how much of a cultural cornerstone Blockbuster was for a lot of us growing up and then seemingly overnight it just disappeared. And I feel the same way about Stack Overflow. Whatever you think about Stack snarky developers on there and a lot of I'm better than you attitude, but for all intents and purposes, it was a great resource for developers and you can get your questions answered and find answers to some of the most challenging bugs that you would run into and then one day it's basically not needed and it's going to disappear. Younger developers just won't know the feeling of finding a great piece of code on Stack Overflow. And so this is basically another in a long line of products and services that are just going to be absolutely killed by artificial intelligence. CHEG is another example and it's a public company. CHEG provides homework help, textbook rentals, and a bunch of tutoring services and basically overnight was decimated by Chad GPT because as a student you could just go to ChatPT directly and get a perfect 247 tutor for free. And so over the past 5 years, Czech is down 99% in terms of their stock price. And a quick thanks to Dell Technologies for sponsoring this portion of the video. Dell Technologies has a family of incredible laptops called the Dell Pro Max featuring Nvidia RTX Pro Blackwell chips, which are portable AI workh horses. It comes in 14 and 16in screen sizes and up to 32 GB of GPU memory. Perfect for onthe-go AI workloads. Check them out. link in the description below. This is just what happens with technology. When one technology takes over, many others die because people realize there's a better way of doing things, either more costefficient, faster, higher quality, and artificial intelligence provides all of that. But that doesn't mean I'm not a little bit sad. Many of nights I spent on Stack Overflow over the years and yeah, just a little bit sad about that. What else do you think is going to be eaten by artificial intelligence? I think the kind of traditional search like Google search is definitely going to be eaten up by artificial intelligence. Google has already started promoting Gemini and search and their more AI based search features. So, they're hopefully going to be able to pivot and get ahead of things. But although it's sad, technology progress marches on. If you enjoyed this video, please consider giving a like and subscribe.",
        "start": 328.08,
        "duration": 909.6789999999993
    }
]