[
    {
        "text": " Adobe just made Photoshop free inside chat GPT. OpenAI dropped GPT 5.2 after going into code red mode. Satya Nadella flew to India, built an AI app live on stage and announced Microsoft's biggest bet in Asia ever, $17.5 billion. Meanwhile, China just mass-produced 5,000 humanoid robots by and this one does full-on kung fu. The CEO let it kick him across the room to prove it's real. But wait until news number six when the world's biggest military starts officially preparing for super intelligent AI that changes everything. This week was absolutely stacked. Let's get into it. Chad GPT users just got an insane deal. You now get Adobe Drop Photoshop, Express, and Acrobat directly inside ChatGpt for free. Photoshop normally costs $20 a month and most people never learn it because the interface is overwhelming. Now you just type what you want in plain English. Upload a photo. Type make the people pop in my vacation photo. Photoshop automatically adjusts exposure and contrast. You can try comic book effect. Merge your resume and cover letter into one PDF and bid party invitations. Express gives you templates to customize and you can even animate the whole thing. It's available on desktop, web, and iOS right now. Android gets Express first. Photoshop and Acrobat coming soon. You can now edit photos, design graphics, and handle PDFs, all without leaving ChatGpt. Procreative tools for $0. Is this a gamechanger or just a gateway to subscriptions? But free Photoshop isn't the only thing OpenAI dropped this week. OpenAI just dropped GPT 5.2. The model has three variations. Instant for quick everyday stuff like writing and translation. thinking for the heavy lifting, coding, spreadsheets, presentations, long documents, and pro for the hardest problems where you absolutely need the right answer. The good news is OpenAI is giving you automatic model choice. You don't have to pick which version to use. This version is definitely better than 5.1. It makes 38% fewer mistakes. Microsoft has already integrated GPT 5.2 across M365 Copilot, GitHub Copilot, and Azure. With work IQ, Copilot can now reason across your meetings, emails, and docs to actually help with strategic planning. OpenAI is celebrating their 10-year anniversary this week. After Google's Gemini 3 was crushing benchmarks and Anthropics Claude Opus 4.5 was beating them on coding, OpenAI went into code red mode and they came out with this new model. We've made a dedicated video testing if it's actually better than its competitors and what it can do. Check that out to see if Code Red was a serious wakeup call or just a marketing gimmick. AI just reached another level of accuracy. The pioneer of modern AI and co-founder of OpenAI, Andre Karpathi, just dropped a project called LLM Council. It's a system where multiple AI models answer your question, debate each other's responses, and then one chairman A I picks the best parts and gives you a final answer. You ask a question. GPT, Claude, Gemini, and Grock",
        "start": 0.16,
        "duration": 371.91999999999985
    },
    {
        "text": "of OpenAI, Andre Karpathi, just dropped a project called LLM Council. It's a system where multiple AI models answer your question, debate each other's responses, and then one chairman A I picks the best parts and gives you a final answer. You ask a question. GPT, Claude, Gemini, and Grock each other's work without knowing who wrote what and rank the answers. The chairman takes all of that and writes one final response. The idea behind this is that one AI can hallucinate. But when four AIs peer review each other, the chances of that happening is way less. Kapati says in his tests, the AIs consistently ranked GPT 5.1 as the best. But he personally preferred Gemini's shorter answers. It's free and open- source on GitHub and already has almost 10,000 stars. Links in the description if you want to try it. I've got a WhatsApp community where I drop everything I discover. Tools, workflows, updates, all in one place before they go mainstream. If you want access, links in the description. The world has its eyes on India. Google invested 15 billion. Anthropic opening offices. OpenAI is giving away free access. And now Microsoft just committed $17.5 billion, their biggest bet in Asia ever. Microsoft CEO Satya Nadella was just in Bengaluru for an AI developer event and he did something unexpected. He built his own AI app and demoed it live on stage. The app is called Deep R and it's basically the same as Karpati's LLM Council. Satya even credited Andre Karpati for the idea. He calls his version chain of debate instead of chain of thought. For the demo, he made the AI models argue over India's greatest cricket team ever. But the Microsoft CEO didn't fly to India just for this demo. 2 days before this demo, he met with Prime Minister Modi to announce that $17.5 billion investment. That money is going towards AI infrastructure, training 20 million Indians in AI skills by 2030 and building what Microsoft calls sovereign capabilities so India can run AI on its own terms. The AI giants are betting on India. But my question is, are we truly ready? While the world is fighting to build the best AI model, China is also doing wonders in robotics. Agi Bot, a Shanghai startup that's not even 3 years old, has mass- prodduced 5,000 humanoid robots. They've got three different models. One built for heavy industrial work, one that moves crazy fast, and another designed for manufacturing and logistics. These robots are already working, handling security, cleaning buildings, sorting packages. Another company named Engine AI showcased the capabilities of their T800 robot, and it's absolutely insane. This thing does flying kicks, spinning attacks, and fullon martial arts like it's straight out of a kung fu movie. People online thought the videos were fake. So, the CEO literally suited up and let the robot kick him across the room to prove it's real. and they're now",
        "start": 188.879,
        "duration": 690.7189999999998
    },
    {
        "text": "insane. This thing does flying kicks, spinning attacks, and fullon martial arts like it's straight out of a kung fu movie. People online thought the videos were fake. So, the CEO literally suited up and let the robot kick him across the room to prove it's real. and they're now December 24th. While everyone else is still making prototypes, China's already mass-producing. They are not here to play. The country with the biggest military budget on Earth, are now preparing for AI, the USA, officially ordered Pentagon, their headquarters of the entire US military to start preparing for super intelligent AI. The 2026 defense bill just dropped and buried inside is a mandate to prepare for AGI. AGI or artificial general intelligence is AI that can match or beat human brain power at everything. The bill creates an AI future steering committee. And this isn't some random panel. It's co-chared by the deputy secretary of defense and vice chairman of the joint chiefs, two of the most powerful people in the military. The deadline is April 2026. By then, the committee must be up and running. By January 2027, they need to share the full report to Congress on AGI threats and what America's enemies are doing. This is historic. The US government isn't treating AGI like science fiction anymore. It's a national security priority. When the Pentagon starts planning for super intelligent AI, that tells you how close we might actually be. We just made history. World's first LM in space just got trained. About a month ago, an NVIDIA H100 went to space aboard the StarCloud 1 spacecraft to try and train AI models in orbit. Running inference in space means instant insights for things like wildfire detection, plus 10 times lower energy cost than data centers on Earth and access to unlimited solar energy in space. And now the nano GPT model from Andre Karpati was just successfully trained on the complete works of Shakespeare. They also ran inference on a pre-loaded Gemma model and they're planning to try even more exciting models in the future. This is a giant leap and the possibilities from here are endless. An A10 just dropped version 2.0 beta and it's not what anyone expected. No new features, no redesign, nothing flashy, just something for better security, reliability, and performance. Here's what happened. For two years, the N8 team has been waiting to make a bunch of improvements, but they couldn't because it would break people's existing workflows. So, they found a solution. They built something called a migration report that scans your setup and shows you exactly what needs fixing before you upgrade. Now, they are shipping all those improvements packaged as 2.0. Your workflows might break if you don't follow the migration report process. So, make sure to do that before you upgrade to this newer version. And once you're through that, everything will still look the same, but it's more secure, more",
        "start": 349.919,
        "duration": 1016.1599999999993
    },
    {
        "text": "they are shipping all those improvements packaged as 2.0. Your workflows might break if you don't follow the migration report process. So, make sure to do that before you upgrade to this newer version. And once you're through that, everything will still look the same, but it's more secure, more there is one small change that you're actually going to notice. They added a publish button. Before this, saving a live workflow meant it went live immediately. Now, you can save your changes without touching what's running. The changes only go live when you choose to hit publish. Now, that a helpful upgrade. Beta's out now. Full release is December 15th. Notion had a busy week. They dropped three updates. First, their mobile agent just became fully native. Earlier, it used to run in a web view, basically a browser inside the app. Super slow. If you compare the two side by side, you can see how much faster the new version is. Second, your agent can now see exactly what you're looking at. Just highlight something on screen and the agent knows what you're focused on. You can then ask questions and you get the answers right there. And third, GPT 5.2 just landed in notion. Better at long tasks with conflicting info, the stuff that trips up older models. The speed with which every app is adopting AI shows that the AI bubble is not bursting anytime soon. Google also dropped a few updates this week. Google Stitch just did a shipmass week, 5 days of updates. Here's everything they dropped. Day one, their redesign agent can now generate code. So, you screenshot your app. Nano Banana Pro redesigns it and now you can actually export that as working HTML instead of just an image. Day two was a command pallet. Hit command plus K, type what you want, zoom out, jump to a screen, publish. There's even a hidden zen mode that hides the chat if you want to focus. Small but handy if you're a keyboard person. They also snuck in predictive heat maps that day. shows you where users will probably look on your design before you build anything. Day three was the main event. They switched their default agent to Gemini 3 Pro. It thinks through your design before writing code. Handles complex dashboards and CSS better than what they had before. They also added prototypes. You can stitch multiple screens together into a clickable flow. Test the interactions and export the whole thing to your coding agent. That's where the name finally makes sense. Day four was multi-screen export to clipboard. One click copies all your selected screens as code. Paste it straight into cursor, copilot, whatever you use. No more downloading zips. Day five was a few smaller things. You can now rightclick anywhere to get quick options. You can type at in the chat to talk about a specific screen and you can paste a",
        "start": 514.88,
        "duration": 1313.8400000000001
    },
    {
        "text": "screens as code. Paste it straight into cursor, copilot, whatever you use. No more downloading zips. Day five was a few smaller things. You can now rightclick anywhere to get quick options. You can type at in the chat to talk about a specific screen and you can paste a design inspiration. And that was a wrap for shipmas. But Google had more things lined up this week. They just added a discovery feed in Doppel, their fashion app. So now you can scroll through looks, tap try on, and see how it looks on you. If you like something, there's a shop button that takes you straight to buy it. It's live in the US on iOS and Android. Then they added animations in Pomelli. You can now animate your designs. You make something in Pomei, hit the animate button, and it turns into a video. It's powered by their VO model. free right now in the US, Canada, Australia, and New Zealand. And finally, the Big Drop Project Aura. These are Google's smart glasses. They showed them off this week, and they're coming out next year. So, how do they work? You put them on and you see the real world through clear lenses, but then it projects apps and windows into your view. You can pin a YouTube video here, a chat window there, browse the web, all floating in front of you. And Google's Gemini is builtin. So, that's Google. This week, Stitch got a bunch of updates. Doppel lets you shop now. Pomellle allows animations now. And we finally got a real look at those smart glasses. Busy week from Google. Now for our top 10 coolest AI tools that launched this week's segment where we look at the most fun and underrated tools. Let's go. This week's different. We've got seven big upgrades and three brand new tools. Let's go through all 10. Number one, Lovable is now free for teachers and students until the end of the year. Build projects in class using AI. Number two, Disco from Google Labs turns your open browser tabs into custom web apps using Gemini. Number three, Runway 4.5 just dropped with better video generation across the board. Number four, Mistral launched Devstral 2, their new coding model in two sizes, both open-source, both free. They also released Vibe CLI, which lets you code by talking to your terminal. Number five, Crea AI now includes Nano Banana Pro elements for better image generation. Number six, Figma added AI image editing. Erase stuff, expand backgrounds, isolate objects, all built into design and draw. Number seven, Orchids is a new coding IDE where AI builds apps like a human developer. Browser, database, payments, all in one tool, number one on the app bench. Number eight, Kelly handles all your customer conversations. Support sales, onboarding, bookings, works across web, WhatsApp, Slack, email, even voice and video. 90 languages free for 30 days. Number nine, Ko AI watches your search",
        "start": 665.92,
        "duration": 1619.0400000000004
    },
    {
        "text": "human developer. Browser, database, payments, all in one tool, number one on the app bench. Number eight, Kelly handles all your customer conversations. Support sales, onboarding, bookings, works across web, WhatsApp, Slack, email, even voice and video. 90 languages free for 30 days. Number nine, Ko AI watches your search drop. Stops content decay before it kills your traffic. Number 10, Sispace explains research papers. Highlight confusing parts. Get simple answers. Search without keywords. Which one of these tools are you trying first? Let me know in the comments. Free Photoshop inside Chat GPT. Kung fu robots getting mass-produced. and the US military preparing for AGI like it's a real threat. We're watching history unfold in real time. Drop a comment with your thoughts and subscribe for next week's AI news. See you then.",
        "start": 820.72,
        "duration": 1679.8380000000006
    }
]