[
    {
        "text": " Artificial intelligence is spreading faster than electricity, PCs, and even the internet. This is all from a new report that Enthropic just dropped with how AI is affecting everything from jobs to different states, different countries, how they're using it, what they're using it for, everything. And it's fascinating. Let me show you. And this video is brought to you by Code Rabbit. More on them later. AI differs from prior technologies and its unprecedented adoption speed. In the US alone, 40% of employees report using AI at work, up from 20% in 2023, 2 years ago. So we have doubled the usage, doubled the adoption in the US in just 2 years. And listen to this, historically new technologies took decades to reach widespread adoption. Electricity took over 30 years to reach farm households after urban electrification. Now there's a lot of differences between AI adoption and electricity. First of all, it was necessary to have huge infrastructure buildout for electricity and the electricity really had to reach the last mile which is the home. Now with AI, obviously there needs to be huge infrastructure buildout, but it's much more concentrated and a lot of these companies already had some infrastructure buildout, but we're talking about decades compared to single-digit years. The first mass market personal computer reached early adopters in 1981, but did not reach the majority of homes in the US for another 20 years. So again, this is being adopted. This is moving more quickly and evolving more quickly than any other technology in history. And AI isn't just automating existing tasks anymore. It's actually creating whole new categories. And listen to this, the share of tasks involving creating new code more than doubled, increasing by 4.5 percentage points. So from 4.1% to 8.6%. 6%. And interestingly, debugging and error correction tasks actually went down. This may suggest that models have become increasingly reliable, such that users spend less time fixing problems and more time creating things in a single interaction, and educational institutions and research institutions seem to be using AI more and more, which is fantastic. While computer science and mathematical tests still dominate overall usage at 36%, we're seeing sustained growth in knowledge intensive fields. Obviously, if it's very knowledge intensive, that's exactly what AI does very well. Educational instruction and library tasks rose from 9% to 12%. Life, physical, and social science tasks increased from 6 to 7%. Meanwhile, the relative share of business and financial operations tasks fell from 6 to 3% and management dropped from 5 to 3%. And so, you might be asking, why are those things decreasing? their explanation. This divergence suggests AI usage may be diffusing especially quickly among tasks involving knowledge synthesis and explanation. This was really besides for code generation the first use case in the business world. That means I'm going to load up a PDF and ask it to explain it to me. I'm going to have it create some",
        "start": 0.16,
        "duration": 362.87899999999996
    },
    {
        "text": "be diffusing especially quickly among tasks involving knowledge synthesis and explanation. This was really besides for code generation the first use case in the business world. That means I'm going to load up a PDF and ask it to explain it to me. I'm going to have it create some look through all of these documents and ask questions to it. And this is just such an easy, straightforward, high-value use case that everybody adopted it super quickly. And here we can see the trends itself. So you can see life, physical, social sciences, business and financial operations percentage decreasing. And remember this is the usage share trend. So of the overall pie of use cases, this is how each one is trending. Architecture and engineering decreasing quickly, management decreasing quickly, education, instruction and library increasing and computer and mathematical staying pretty consistent. And how people are using AI is changing. Automation versus augmentation. At a high level, we distinguish between automation and augmentation modes of using Claude. Automation means interaction patterns focused on task completion. You give it a task and you expect the AI to complete it entirely with no human in the loop or very little. Augmentation means you're working with AI to complete a task. Collaborative interaction patterns, learning, task iteration, and validation. And what do we see? Augmentation is decreasing and full automation is increasing. And that's also reflected in what they call directive conversations, which means you're telling AI what to do. So, for example, write me an essay about pickle ball versus here's an essay that I wrote. Can you make some improvements? That is collaborative versus directive. And because learning AI tools is so critically important for your future, let me tell you about today's sponsor, Code Rabbit. Code Rabbit is the AI code review platform, transforming how engineering teams work by allowing them to ship faster with AI without sacrificing code quality. Quality code reviews are critical but time consuming. Code Rabbit acts as your AI co-pilot, providing instant code review comments and potential impacts of every pull request. Beyond just flagging issues, Code Rabbit provides one-click fix suggestions and lets you define custom code quality rules using a GP patterns, allowing Code Rabbit to apply those to your pull requests. That'll allow you to catch subtle issues with your code that traditional static analysis tools might miss. Code rabbit is available in VS Code, Cursor, and Windsurf. And the best part, Code Rabbit is free for all open source projects. So check out Coderabbit today. The links are down below. coder rabbit.link/matthew and that'll let them know that I sent you. So please check them out. And thanks again to Code Rabbit for sponsoring this video. And now back to the video. And you might be thinking, okay, well, if automation is increasing, that means we're going to start seeing a lot of job loss. Now you know how I feel about that. I am very optimistic. I",
        "start": 181.599,
        "duration": 686.6389999999997
    },
    {
        "text": "again to Code Rabbit for sponsoring this video. And now back to the video. And you might be thinking, okay, well, if automation is increasing, that means we're going to start seeing a lot of job loss. Now you know how I feel about that. I am very optimistic. I transformation, but I still think if you learn these tools and if you're watching this channel, you're probably already ahead of the game. But if you learn these tools, you will be well ahead of the game. And according to their research, you will be higher paid. Workers most able to adapt to new AI powered workflows are likely to see greater demand and higher wages. In other words, AI may benefit some workers more than others. Now, what people have been saying from the very beginning of this new AI wave is AI is not going to replace you. A person who uses AI is going to replace you. So, just keep that in mind. Learn these tools. And from all of the AI leaders that I've spoken with, the common sentiment is yes, the best thing you can learn right now is how to use these AI tools. It may lead to higher wages for those with the greatest ability to adapt to technological change, even as those with lower ability to adapt face job disruption. And according to a paper referenced here, clear evidence that entry-level workers with high AI exposure have had relatively worse employment prospects since late 2022. Setting aside questions of causality, the straightforward interpretation is that this is due to AI substituting for work previously done by early career workers and relatively faster employment growth for experienced workers reflects AI making such workers more productive and thus in high demand. So if you're early in your career, you might have more trouble getting a job. But I don't think that's going to last forever. I think once all of the dust settles, once companies really learn to adopt AI, they're going to need more humans to prompt to verify, to review the work. And even though that takes more experience in the niche that somebody's in and whatever category of role they're in, just being knowledgeable about how to use the AI tools is probably going to set you up for success. So, if you're early in your career, once again, I'm going to say it, go learn these tools. All right. What about by country? Which countries are benefiting the most? Which countries are falling behind? Well, look at this. These are the top 20 countries by anthropic AI usage index. And this is per capita. Israel by far has the most per capita usage of claude. Singapore also. And basically what that means is smaller, very technically advanced countries seem to be adopting AI much more quickly. According to the paper, the results reveal a striking pattern of concentration among small technologically advanced economies. Israel leads global per capita claude",
        "start": 345.6,
        "duration": 987.6790000000001
    },
    {
        "text": "most per capita usage of claude. Singapore also. And basically what that means is smaller, very technically advanced countries seem to be adopting AI much more quickly. According to the paper, the results reveal a striking pattern of concentration among small technologically advanced economies. Israel leads global per capita claude of seven. Meaning its working age population uses cloud seven times more than expected based on its population. Then Singapore and Australia, New Zealand and South Korea round out the top five. Now in global share of usage, of course, the United States being more technically advanced and also having a huge population sees the highest percentage of usage across the globe. India being number two. Clot adoption overall is highly geographically concentrated in terms of total global usage. The United States accounts for the highest share 21.6% with the next highest usage countries showing significantly lower shares. India 7.2, Brazil 3.7. However, concentration is affected by population of the country. All right. But how are people actually using it? What are the trends for how they're using these tools? As we move from lower to higher adoption countries, claude usage appears to shift away from programming dominant tasks, which is really the most dominant task for AI right now, to a more diverse mix of tasks, though the overall pattern is noisy. You can see per country how people are using it. So, check this out. In the United States, provide comprehensive cooking, nutrition, and meal planning assistance. That is number one. Help with job applications, resumes, and career documents. So of the top over represented requests, none of them in the US are for coding which is very interesting. Look at this. Provide personal relationship and life guidance support. But then if we look at India, India fix and improve web and mobile application UI. Half of all of India's AI usage is for coding. Brazil provide translation service and comprehensive language learning assistance across multiple languages. Vietnam help with cross-platform mobile app development, debugging and feature implementation. So you can see India and Vietnam all about coding. Brazil and United States more general use cases. Now here's another interesting finding. Markets in which have higher adoption rates for artificial intelligence, specifically Claude, tend to use Claude more as a collaborator versus just handing it the wheel and making it do everything. Markets with less adoption are the opposite. they have AI and specifically Claude take the wheel and do everything. And so that gives me even more hope that as people learn to use AI, as we kind of get to the cutting edge of use cases, they're figuring out, okay, humans are needed in the loop. Now, here's AI usage in US corporations. And as you can see, it's increasing and increasing pretty quickly, but it's still a very small number. At its current point, it is nearly at 10%. That means one out of every 10 companies is using AI. That",
        "start": 497.84,
        "duration": 1317.5999999999995
    },
    {
        "text": "needed in the loop. Now, here's AI usage in US corporations. And as you can see, it's increasing and increasing pretty quickly, but it's still a very small number. At its current point, it is nearly at 10%. That means one out of every 10 companies is using AI. That potential for somebody who knows AI to go in and implement it at a company, whether as a consultant or an employee. If you're an employee at your company and you see your company as not using AI, go learn the AI tools and show them how to do it. You will become insanely valuable. Now, of course, if your company is in the information sector, there's a much higher adoption rate, but it's still only 25%. One in four information sector companies are using AI. It's insane to think about. But remember, we're in this little bubble where everybody knows about AI. Everybody talks about AI, but outside of our little bubble, really, nobody knows about it. People hear about chat GPT and that's about it. They don't know what's possible. And so, it's our job to go help them figure out what's possible. It's our job to go implement AI at businesses. So, some more data about how companies are using AI. 77% of AI transcripts show automation patterns, especially full task delegation, versus just 12% for augmentation. But, of course, that makes sense. If you're going through the API, there's probably going to be much less human interaction. Based on a sample of conversations from Claude AI, so that's the UI, the split between automation and augmentation is nearly even. Looking across economic tasks, the degree of cloud automation through the API is even starker. 97% of tasks show automation dominant patterns in API usage compared to only 47% in cloud AI. Programmatic API access naturally lends itself to automation. Businesses provide context. Claude executes the task and the output flows directly to end users or downstream systems. And it turns out companies don't really care about cost all that much right now. They just want good results. Overall, we find a positive correlation between cost and usage. Higher cost tasks tend to have higher usage rates. When something's working, you're going to double down. I believe this is just Jevon's paradox being highlighted. The positive correlation between cost and usage suggests that cost plays an immaterial role in shaping patterns of enterprise AI deployment. Businesses likely prioritize use in domains where model capabilities are strong and where cloudpowered automation generates enough economic value in excess of API cost. And what is the biggest bottleneck? Well, you can probably guess it's context. How do you provide these models with the context of your business, of your personal life in the most effective way? Context constrains sophisticated use. Our analysis suggests that curating the right context for models will be important for high impact deployments of AI in complex domains. This implies that",
        "start": 664.64,
        "duration": 1635.2799999999997
    },
    {
        "text": "How do you provide these models with the context of your business, of your personal life in the most effective way? Context constrains sophisticated use. Our analysis suggests that curating the right context for models will be important for high impact deployments of AI in complex domains. This implies that and organizational investments to elicit contextual information may be a bottleneck for AI adoption. So we have all of this unstructured difficult to use information and we need to get it to a place in which we can provide it to AI really well. This is probably why they changed the term prompt engineering to context engineering because providing the context is the hard part. Writing the prompt is kind of the easy part at this point. But it's not all good. What does this mean for the earth as a whole? If the productivity gains are larger for high adoption economies, current usage patterns suggest that the benefits of AI may concentrate in already rich regions. Rich regions are adopting it more quickly which means they will be gaining the benefits more quickly and then it's kind of a snowball effect at that point. The rich countries will get richer possibly increasing global economic inequality and reversing growth convergence seen in recent decades. Their study also suggests that as I said earlier, if you learn AI, you will likely become more valuable. If AI automation improves the productivity of workers with tacit organizational knowledge, as some of our evidence suggests, then more experienced workers could see rising demand and higher wages even as entry-level workers face worse labor market prospects. And so, it does seem according to this research, it's not just enough to know the tools to make you more valuable. You also have to have the organizational knowledge. And so I think this is one of those problems we're going to have to figure out for entry-level workers. How do you make them more valuable? How do you make them attractive in the job market when they don't have that organizational knowledge just yet? My guess is that if they become even better at using AI, that's the skill they're bringing in the company and then they will learn the organizational knowledge. And ultimately the economic effects of transformative AI will be shaped as much by technical capabilities as the policy choices societies make. So the policies we choose are going to be critically important for AI adoption and AI value. Now this same research paper has a really cool interactive section and you can basically segment all of this data really easily, visualize it really easily. So for example, let's look at California. And within California, we can see how people are using Claude, the different job groups, the usage rank, usage index, most frequent topics, everything. And that's broken down by the US, the state, and job type. So definitely check it out. I'm going to drop all of this in the description",
        "start": 826.0,
        "duration": 1925.5220000000004
    },
    {
        "text": "within California, we can see how people are using Claude, the different job groups, the usage rank, usage index, most frequent topics, everything. And that's broken down by the US, the state, and job type. So definitely check it out. I'm going to drop all of this in the description for sponsoring this video. I'm going to drop all of their links down below. Click them, let them know I sent you, try it out. They've been a great partner. Let me know what you think. If you enjoyed this video, please consider giving a like and subscribe.",
        "start": 974.16,
        "duration": 1950.3230000000005
    }
]