[
    {
        "text": " Something satisfying is happening on the internet right now. People are hiring AI employees that actually do the work. They're buying Mac minis not as their main computer just to run one piece of software, setting it up in a corner, leaving it there forever. Why? Because now you can use your phone to text this computer from anywhere in the world and it does things for you. One guy texted it an idea for his app, went out for a walk, came back and his whole app feature was deployed autonomously. Another guy stopped checking email entirely. This isn't Chad GPT. ChatGpt tells you what to do. This actually does it. It's called Claudebot. It's free and open- source. In this video, I'll show you what it is, what you can actually do with it, and how to install and start using it right now. But stay till the end. I'll show you what the community is building, including someone whose AI employee installed another AI just to save him money. Let's start with what this thing actually is. So, let me explain what this thing actually is. Think about what happens when you use chat GPT. You type something like organize my desktop and it replies, great idea. Here's how you could organize your desktop. Step one, create folders for different categories. Step two, move your screenshots to a screenshots folder. Step three, consider using a naming convention. Really helpful advice. Genuinely useful suggestions. But then what? You close the tab and you have to go do all that work yourself. Now, here's where Claudebot is completely different. Cloudbot doesn't give you advice. It actually does the work for you. There's like four things that make this really different from anything else out there. First, it runs on your computer. So, your files, your data, everything stays with you. Nothing goes to some random server in the cloud. Second, you message it like a friend. WhatsApp, Telegram, whatever. And even when you're away from your computer, like you're at dinner or something, it's still working in the background. You can just text it. Third, it remembers [music] everything. Like you tell it once, \"Hey, I hate spam emails. Never show me those.\" It remembers that forever. You don't have to keep repeating yourself every conversation. And fourth, this is the crazy one. If it can't find a tool to do something, it just builds one. So, at this point, you're probably thinking, \"Okay, cool. How do I actually install this?\" I'll show you. full setup step by step. But first, let me show you three things I actually tried with it so you can decide if this is even worth your time. Quick thing, if you want to stay updated on stuff like this, new AI tools, new updates, all that, I have a WhatsApp community where I share everything. Links in the description. Join if you want. Okay, back to the",
        "start": 0.16,
        "duration": 316.7199999999999
    },
    {
        "text": "you can decide if this is even worth your time. Quick thing, if you want to stay updated on stuff like this, new AI tools, new updates, all that, I have a WhatsApp community where I share everything. Links in the description. Join if you want. Okay, back to the had this external SSD core GS just full of random video files, podcasts, tutorials, everything dumped in there. [music] Total mess. So, I opened Telegram, typed check the core GSSD and organize everything properly. Sent it. First thing, a permission popup. Jarvis would like to access files on a removable volume. I clicked allow. Now, it's scanning. I can see it going through the video files like it's actually looking at what's in them. Few minutes later, it comes back with this whole breakdown in Telegram. Current issues, empty folders, duplicate files, system junk, and then a proposed structure. How it wants to reorganize everything. I just typed yes, it starts working, moving things around, deleting the junk. Done. Now I open Finder. The drive has clean numbered folders. 01_CL clawbot tutorial 02_GPT_5.2 two all that everything in the right place then I typed organize my desktop as well few seconds later done files grouped desktop clean okay that was local files let's try something online okay so I wanted to do some content research figure out what's working on LinkedIn check my own YouTube patterns all that so I open Telegram type this go on LinkedIn analyze all the top AI update posts and analyze what makes them go viral and get more reach find that pattern and also So go on my LinkedIn vibinti and analyze what works on my LinkedIn then write a post on cloudbot send it few seconds later Chrome opens by itself it's going to LinkedIn logging in scrolling through posts I'm just watching at this point about 2 minutes later browser closes and in telegram I get this whole breakdown hook lines at work short paragraph patterns specific numbers people use CTA styles okay cool but I wanted more so I typed go on YouTube and find my channel called Vibe Cici and check the AI updates playlist. Understand the pattern of scripting and what makes those videos get good reach. Then do the research for this week's AI updates and create a script. Browser opens again, goes to YouTube, finds my channel, opens the playlist. It's going through video by video. Few minutes later, it tells me files are ready. Two markdown files sitting on my desktop. One research doc, one full script. But I still wanted a Twitter coverage. So I just typed do the research from Twitter, opens Twitter, starts pulling recent AI news, Sam Alman stuff, anthropic updates, whatever is trending, comes back with a summary in Telegram. Then I said merge everything and it combined all three LinkedIn patterns, YouTube analysis, Twitter news into one final script. Total time from first message to",
        "start": 159.68,
        "duration": 639.7609999999999
    },
    {
        "text": "from Twitter, opens Twitter, starts pulling recent AI news, Sam Alman stuff, anthropic updates, whatever is trending, comes back with a summary in Telegram. Then I said merge everything and it combined all three LinkedIn patterns, YouTube analysis, Twitter news into one final script. Total time from first message to right, next one. I wanted to redesign my startup's landing page. So I typed I want to revamp growth school. That's my startup website as it is. But the design should be inspired from Apple's website design. Use replayit on my tools account to build this. Sent it. First thing browser opens to apple.com. It's looking at their iPhone page probably analyzing the layout, the spacing, whatever. Then it goes to growthchool.io checking the current content then ripplet. It logs in starts setting up a project. At one point it told me to install this browser extension claudebot browser relay for local integration. So I did that. Now it's actually writing code. I can see the file structure being created in replents styles all of it. Few minutes later first preview shows up. It's got that Apple style typography and spacing but the colors are off. Logos wrong. Images are placeholders. So, I typed, \"Please match the color, theme, and logo of Growth School, as well as have real and correct images of the people I mentioned.\" Now, here's [music] the thing. It lost context. Memory compaction happened. It actually said, \"Hey, Vibbuff, I lost context. Could you help me catch up?\" So, I just explained again. We're building a clone landing page of my startup growth school. We were making it on Replet all the testimonials and referred people names. It picked back up, went back into ripplet, started updating the code, and now let me scroll through this. It updated the color theme to purple green. It picked an icon that's close to the growth school logo, but not the actual one. And the photos, it tried to import them, but they didn't come through correctly. So, not perfect. But here's the thing, it got like 80% of the way there. Not 100% perfect, but way faster than starting from scratch. Now, let me show you how to set this up. So let's go and open Claudebot. Just search Claudebot on Google. And once you see this, click on the first link. Now you'll see it says Moldbot here. Yeah, they changed the name. Some copyright issue with Anthropic, the company behind Claude, but it's the same thing. Don't get confused. And look, the AI that actually does things. It clears your inbox, sends emails, manages your calendar, checks you in for flights, all from WhatsApp, Telegram, whatever chat app you already use. Now scroll down to quick start. Don't get overwhelmed by all this stuff. See here in the corner, it's defaulted to Mac OS/ Linux. Now, because we're using Mac OS, we'll go with Mac OS and copy this link. If",
        "start": 325.52,
        "duration": 939.0399999999996
    },
    {
        "text": "all from WhatsApp, Telegram, whatever chat app you already use. Now scroll down to quick start. Don't get overwhelmed by all this stuff. See here in the corner, it's defaulted to Mac OS/ Linux. Now, because we're using Mac OS, we'll go with Mac OS and copy this link. If Simple. Now, we just need to copy this oneliner. Just click the copy icon right there. Once you've copied that, we need to open terminal. So, on Mac, just press command plus space. When you do that, Spotlight will open up. and then just type terminal and hit enter. That's it. Once terminal opens, let's make it full screen so we can actually see what's happening. Now just dot Ctrl + V to paste that oneliner we copied and hit enter. And now it starts installing all the stuff it needs. Just let it do its thing. All right, everything's installed. This is what you'll see. Big Clawbot logo. Now it's showing you a warning. I understand this is powerful and inherently risky. And honestly, this is why I'd recommend don't install this on your main laptop. Use some secondary computer that you're not using for important stuff just to be safe. Now, here's [music] the thing. You can't click with your mouse in the command line. You got to use your keyboard's arrow keys, left or right. So, I'll choose yes and just press enter. Now, it starts the onboarding. Two options, quick start or manual. Look, we're not prodevelopers here. I'd recommend quick start. Let's go with that. Okay. Now it's asking which AI model provider do you want to use? You can use OpenAI, Anthropics Claude. There's a bunch of options here. I'll go with Anthropic. That's Claude. So I'll just press enter. Now it's asking for Anthropic API key. Go to your browser. Search Anthropic Developer Console. Click the first link. Get API key. Then create key. You can name it whatever you want. I'll call mine Claudebot Jarvis. Hit create. [music] And there's your key. Copy it. Now go back to terminal. Remember, you can't rightclick and paste here. Just do Ctrl +V. Now, it asks which model you want to use. I'll go with Claude Opus 4.5. It's the latest and the best model by Anthropic. Select a channel to quick start. So, like [music] how do you want to message it? Telegram, WhatsApp, Discord, Slack. There's a lot of options. I'll go with Telegram. It's asking for a Telegram bot token. Now, we'll actually set this up through the dashboard. It's way easier to see what's happening there. Configure skills. Now, let's say yes. Node manager. I think npm is the good one. Install missing dependencies. We can skip this for now. Google places API. No, I don't want to set this now. Local places. No. Nano Banana Pro. No, we can always add these later. Now it's asking how do you want to hatch your bot? Two options. TUI,",
        "start": 477.36,
        "duration": 1222.881
    },
    {
        "text": "the good one. Install missing dependencies. We can skip this for now. Google places API. No, I don't want to set this now. Local places. No. Nano Banana Pro. No, we can always add these later. Now it's asking how do you want to hatch your bot? Two options. TUI, the web UI. I'd say let's open the web UI. It will open the web UI and browser. Here we go. This is the Claudebot [music] gateway dashboard. First thing you see is chat. This is where you can chat with your Clawbot and send commands. But the skills tab, this is interesting. You can install different skills like one password support, Apple notes, notion, voice calls, WhatsApp. There's a ton of stuff you can add. And docs. [music] Now, if you're ever struggling, everything's explained here. Now, we didn't connect Telegram in the command line, right? We chose to use the dashboard instead. So, right here in this chat, we can just ask Cloudbot to connect Telegram for us. I'll just type connect Telegram. And look, it gives us step-by-step instructions. Step one, open Telegram and chat with atbotfather. So, let me search at botfather in Telegram. And this is the botfather it's talking about. I'll click start. Now, it says send/newbot. Okay. /newbot. Please choose a name for your bot. All right. Let's call it Jarvis. Now, it needs a username and it must end in bot. So, I'll say Jarvis 300K bot. Done. Congratulations. We got the bot. But what we really need this token right here. Let me copy this back to the dashboard. Paste that token in the chat and send. It's configuring our Telegram bot now. And done. Telegram is connected. Next step, pair your account. Open Telegram and DM your new bot. Okay, this is the final step. Let me click on this Jarvis bot link and I'll start a conversation with it. It says claudebot access not configured and it's giving us a pairing code. Let me copy this code. Go back here, paste that pairing code and send. Hooray. You're in. Your Telegram is now linked. Go send me a message there. And that's it. Now our Telegram setup is done from anywhere in the world just using your phone. You can chat with this Telegram bot and it'll execute whatever you ask. All right. So, that's Claudebot or Moldbot, whatever you want to call it. Subscribe, hit the [music] bell. Now that you know Claudebot, I'd recommend learning Claude code too. Full tutorial linked right here. See you in the next one.",
        "start": 621.68,
        "duration": 1480.1600000000005
    }
]