[
    {
        "text": " People are building 3D models in Blender just by typing. Filing taxes automatically. Scraping Instagram for restaurant recommendations all with one tool. [music] And most people don't even know it exists. I'm not technical at all. I avoided this for months thinking it wasn't for me. Then I figured out the truth. You don't need to write a single line of code. I use a version of this system to make videos for this channel. A lot of you have been asking how. Today I'm showing you the foundation. By the end of this video, you'll have one, a personal AI assistant that remembers everything about your projects. Two, your first AI agent built and deployed. Three, a full content army working on autopilot. All with just three commands. The tool cla code. And I'm not just going to tell you about it. I'm going to build the whole thing live right now. Let me prove it. Now, most of you might be thinking, \"Oh, Vehav, Claude in the browser works just fine for me. Why should I even switch to Claude code?\" Let me break it down simply. Claude in the browser, that's Tony Stark without the suit. Genius. Can solve most problems. But there's a limit. He gets tired. He can only be in one place. He forgets things between conversations. Now, Claude Cod is the full Iron Man suit with Jarvis builtin, unlimited capabilities, a genius AI assistant that remembers everything, has access to all your files, never loses context, and everything is saved on your own computer. Jarvis doesn't forget. Javis knows your preferences. Javis can run your entire workshop while you focus on the big picture. Tony without the suit versus Iron Man with Javis. That's the difference. And today, you're getting your suit. Now let's install and set up claude code. There are two ways to do this. First way, go to the link, copy the respective command for Mac or Windows and paste it in your terminal. I know terminal can be scary and intimidating. So there's an easier, simpler way. Just download the Claude desktop app on your computer. Once done, just loging in with your Claude account. So Claude code is only available on the paid plans. You can get started with Claude Pro that cost $20 per month. Just as I was recording this video, Claude announced Claude Co-work. That's Claude Code specifically built for non-developers. But as of now, it's only available on Mac [music] and you need a $100 Claude Max subscription to run it. For this video, we're using regular Claude code, which works on both Mac and Windows with the $20 pro plan. Let's suit up. Now, here's something that blew my mind. Tell me about you. What do you like? What do you do at Anthropic? Like, how are you involved in this? How am I involved in this? , I've been at Anthropic for a little bit, but",
        "start": 0.24,
        "duration": 331.19999999999993
    },
    {
        "text": "$20 pro plan. Let's suit up. Now, here's something that blew my mind. Tell me about you. What do you like? What do you do at Anthropic? Like, how are you involved in this? How am I involved in this? , I've been at Anthropic for a little bit, but built here. We sprinted at this for the last week and a half. , what we're trying last week and a half, that's an anthropic employee, the company that makes Claude, they built an entire product, Claude Co-work, in 10 days, and they built it using Claude code. Let that sink in. The tool you're about to learn built another tool. While the developers just guided it, this isn't some side project. This is the most powerful AI tool most people have never heard of, and you're about to master it. Now, there are a lot more commands available /clear/compact/context/course/resume and others. I've put together a complete command cheat sheet. I'm sharing it in my WhatsApp community. link is in the description. Make sure to join. But for building what we're building today, you only need three commands. I'll teach you each one as we go. Now, before we build anything, there's two concepts you need to understand. Skills and agents. Back to Iron Man. You know how Tony's suit has different protocols? Stealth mode for infiltration, Hulkbuster for heavy combat, house party protocol when you need an army. In Claude Code, those protocols are called skills. playbooks that tell Claude how to do specific tasks. Need a presentation? There's a protocol, spreadsheet protocol, PDF protocol, and the best [music] part, Enthropic already built a ton of these for you. There's an entire GitHub repository with pre-built skills ready to go. Now, agents, remember House Party protocol where Tony activates an entire iron legion in Clawed Code. Agents are your Iron Legion. Multiple AI assistants each specialized for their mission. Skills are the protocols. Agents are the suits that run them. Remember that. Now that you understand this, let's get into part two and actually build our AI content army. All right. So, let's start with something simple. Research. Instead of opening 10 tabs and copy pasting everything, Claude Code can do all of that for you. So, I'm just asking it to research about Claude cowork, something they just launched, and save everything in a markdown file. That's it. No complicated prompts. Just tell it what you want and where to save it. Now, it's asking permission to search the web. This is ask mode doing its thing. It checks with you before taking any action. I'll hit allow. See, it's pulling information from different sources. Techrunch, Axios, Fortune, stuff that would take you 20 to 30 minutes to read through. Claude's doing it in seconds. It's reading through all these articles, pulling out the important stuff and organizing everything for me. And look at this. Overview, key features, use cases, availability, everything nicely",
        "start": 173.04,
        "duration": 649.518
    },
    {
        "text": "different sources. Techrunch, Axios, Fortune, stuff that would take you 20 to 30 minutes to read through. Claude's doing it in seconds. It's reading through all these articles, pulling out the important stuff and organizing everything for me. And look at this. Overview, key features, use cases, availability, everything nicely it is. The files been created. And inside you've got all the research properly formatted with all the sources listed at the bottom. Research that would have taken you hours done in few minutes. Okay, so the research is done. But here's the thing. What if I want Claude to remember all of this for later? That's where the next command comes in. It's called slashinit. Now, this is one of the most powerful commands in claude code. What it does is create a claude.md file. Think of it as claude's memory. Whatever you put in here, Claude remembers forever. No more copy pasting the same context over and over again. So, I'll just type /init and hit enter. It's asking for permission again. We'll allow. Now, it's creating that memory file for me. It's looking at the folder, understanding what's in there, and setting everything up. And there we go. Claude.m MD file created. Let's open the folder and see what's inside. So, it's got the project overview, the structure, how to work with content, everything saved. This is stored in Claude's memory. Next time I open this folder, Claude already knows what's going on. No explanations needed. All right. So, now you've seen how the init command works. Claude creates the claude.m MD file and stores everything in memory. So even if you close the app, open a new chat, come back later, Claude already knows what's going on. Now, let's get into the exciting stuff. Agents. This is where we actually create our own specialized AI assistant. Quick thing to use agents, you need to use the CLI. Don't panic. You don't need to open any scary terminal. Just click on CLI at the bottom right of your cloud desktop. That's it. Everything works exactly the same. To create an agent, just type / aents. Simple as that. Now, I'm going to create a new one for this project. First, it asks where to save. Project level or personal level. Project means it only works in this specific folder. Personal means you can use this agent from anywhere on your computer. I'm keeping it at project level for now. Now, here's the cool part. You can either manually configure everything or just let Claude generate the agent for you. We're going with generate with Claude. Way easier. So, I'm just writing a simple prompt. Create a script writing expert for short form content that goes viral. Include hook, body, CTA, and visual notes for my editor. That's it. Now, Claude's doing all the heavy lifting in the background. It's writing all the rules, conditions, everything [music] the agent needs to follow. All",
        "start": 337.6,
        "duration": 948.798
    },
    {
        "text": "simple prompt. Create a script writing expert for short form content that goes viral. Include hook, body, CTA, and visual notes for my editor. That's it. Now, Claude's doing all the heavy lifting in the background. It's writing all the rules, conditions, everything [music] the agent needs to follow. All Agents created. Now, it's asking about permissions. All tools means it can read, write, edit, delete, run code, everything. Read only means it can only look at stuff. For script writing, I need it to write. So, I'm selecting all tools. Model selection. For script writing, I want the best output, so I'm going with Opus. Color is just to help you tell your agents apart. And done. Viral short form script writer agent created. See, it even named it for me. Now, let's actually look at what Claude built. So the agent file is saved in a hidden folder called doclaude. To see hidden folders on Mac, press command plus shift plus period. On Windows, it's view then hidden items. Now you can see it. Let's open the agent file. Remember, I only wrote three sentences. Look at what Claude created. It's written out everything. The entire playbook for this agent. It's got the hook structure. First one to 3 seconds needs to grab attention. Body 20 to 50 seconds. And you can even edit anything in here. Add stuff, remove stuff, customize however you want. It's even got visual notes for editors, output format, how the CTA should sound, everything. I gave it three lines and it built this entire system. That's the power of agents. All right, so we've created our agents. Now, let me show you how to actually use them. I've set up a few different agents for this demo. Hookw writer, script writer, and a couple others. Let's start with one so you can see how it works. So here's my prompt. Write me hooks using the research we already did. Remember that cowwork_ressearch.md file? I'm referencing it with the 8 symbol. Then I'm telling Claude to use the hook agent specifically and save everything in a new file called hooks.md. Hit enter and watch what happens. It's not just following my instructions blindly. It's actually thinking about which agent to use. See how it first reads the research file. Now look, I just said hook agent, but Claude code figured out I meant the viral hookw writer agent we created. It's smart enough to connect the dots. Now, while it's working, let me explain something important. You get 200,000 tokens per session. Once you hit that limit, Claude automatically compacts everything, summarizes what you've done, and saves it. So, you never really lose context. It just gets compressed and done. It created hooks.md with seven viral hooks. Notice I never said how many hooks I wanted. The agent just knew that giving options is better. That's the power of a well-built agent. Let's check the file. There it is. Hooks.md. Opening it up.",
        "start": 491.199,
        "duration": 1262.9590000000003
    },
    {
        "text": "context. It just gets compressed and done. It created hooks.md with seven viral hooks. Notice I never said how many hooks I wanted. The agent just knew that giving options is better. That's the power of a well-built agent. Let's check the file. There it is. Hooks.md. Opening it up. all the way to seven. Different types of hooks, why it works, and what type of content it's best for. So, the agent didn't just write hooks. It explained the strategy behind each one all from one simple prompt. So, we've used one agent. Now, let me show you where it gets really powerful. Using multiple agents all working together. Here's what I'm doing. The research is done. The hooks are ready. Now, I want a full script. So, I'm telling Claude to use all the files we created, the research file and the hooks file. But here's the thing. I'm not using just one agent. I'm chaining three agents together. First, the storytelling agent creates the narrative structure. Then, that output goes to my YouTube analyst agent. This one knows my tone of voice, the words I use, everything about my style. And finally, all of that goes to the script writer agent for the final output. Now, watch what Claw does. It's not running all three at once. It's smart enough to go one after the other. Takes the output from the first agent, feeds it to the second, then to the third, just like an assembly line. Quick tip. If you want things to run parallel, you can do that, too. Like sending three research agents to search Instagram, LinkedIn, and Reddit all at the same time. Saves a ton of time. Now, here's something important about tokens. The agent used 15,000 tokens, but my main chat only used 4,000. Each agent gets its own fresh 200,000 tokens. So, if I had done all this research and writing in my main [music] chat, I would have burned through my entire limit. But with agents, everything stays efficient. The YouTube analyst is done. Now it's passing everything to the script writer. The one we built earlier. Let it do its thing and done. It's asking permission to save the script. I'll allow. Now let's see what we got. Look at this complete YouTube script on Claude co-work. Video title, core transformation for viewers, everything. And remember the agents worked with each other automatically. I didn't have to copy paste anything between them. We've got the hook, act one, act two, the demo section, retention hooks throughout, plus all the visual notes for my editor that I asked for, a complete expert level script, and look, it even added an emotional arc showing how the viewer should feel throughout the video. On top of that, title and thumbnail options. The agent went above and beyond. You get all this output without burning through your main context. That's your AI content army. research hooks, full scripts, all done automatically while",
        "start": 650.24,
        "duration": 1560.5590000000004
    },
    {
        "text": "an emotional arc showing how the viewer should feel throughout the video. On top of that, title and thumbnail options. The agent went above and beyond. You get all this output without burning through your main context. That's your AI content army. research hooks, full scripts, all done automatically while finally did it. From being scared of that word code and thinking Claude code is only meant for developers to building a full army of AI agents all working together writing viral scripts on autopilot. Let's recap the three commands that built your entire Iron Legion. Command number one /init gave Jarvis permanent memory. Command number two / agents deployed your Iron Legion. Command number three at targeted your files. Three commands. That's all it took. Now I want you to actually start using it. Go unlock these superpowers and become 100 times more productive. This one tool will help you get ahead of 99% of people. Most people don't even know this exists and you've already mastered it. When it becomes mainstream, the new normal, you're way ahead. And look, there's so much more I couldn't cover. custom skills, MCPS, automations. If you want a video on that, drop it in the comments and I'll make it happen. All right, go build your AI army.",
        "start": 801.2,
        "duration": 1677.1980000000005
    }
]