[
    {
        "text": " Michael Bur just put in a massive short on the AI industry. Are we in an AI bubble? Let's get into it. So, this is Michael Bur. He is famous for having called the 2008 financial crisis when essentially nobody would bet against the US housing market. Michael Bur took out a massive short position on it and ended up being right. They even made a movie about it called The Big Short. Hey, there's a bubble. And now he is saying the AI industry is in a massive bubble. And by the way, if you're figuring out how to get the most value of artificial intelligence, check out our brand new ebook, The Subtle Art of Not Getting Replaced. It provides you with 100 practical use cases for AI that you can use right now. Download it for free. All you got to do is subscribe to our newsletter, link down below. Check it out. But first, let's define what a bubble is. So, of course, I went to AI to ask. An economic bubble is when the price of an asset like real estate, stocks, or crypto rises far above its real or sustainable value because of excessive demand, speculation, and hype. Chachi PT even gave the stages of a bubble. First, displacement. New innovation or trend attracts attention. Well, that's obvious what this is. It's AI. Then, a boom. Prices rise rapidly as more investors jump in. And here's Nvidia stock price over the last 5 years. So, yep, check. Prices have risen rapidly. Then, euphoria. Speculation and greed dominate. Prices detach from fundamentals. Maybe we're there, maybe we're not. Let me give you a couple proof points, but save that for a moment. Then, profit taking. Smart investors start selling. Now, we might also be there, and again, keep this in mind. We're going to come back to it in a moment. Panic, prices collapse as everyone rushes to sell. We are definitely not there. We are at all-time highs across all of the Magnificent 7. Those are the biggest companies in the world, really holding up the GDP of the United States. Now, there seems to be two types of bubbles. There are ones that pop and cause irreparable damage, and then there are ones that pop and it just seems like the timing was actually wrong. Let me give one example of each. In 1929, we had the Great Depression that was caused, to put it in the most overly simplistic terms, by people leveraging up too much with credit. When that bubble popped, it caused massive, massive damage to the economy for over a decade. So during the leadup to the 1929 crash, there was no infrastructure buildout. It was just mainly people taking risk, taking on credit, leveraging up, and there was no infrastructure being built out. that is very different from the other bubbles which were infrastructure buildouts and just had the wrong timing. A great",
        "start": 0.08,
        "duration": 346.3990000000001
    },
    {
        "text": "leadup to the 1929 crash, there was no infrastructure buildout. It was just mainly people taking risk, taking on credit, leveraging up, and there was no infrastructure being built out. that is very different from the other bubbles which were infrastructure buildouts and just had the wrong timing. A great internet in the late '9s. Massive amounts of fiber were laid in the ground in anticipation of the internet absolutely blowing up. And now obviously in 2025 the internet is one of the most important inventions in the history of humans. So it worked out. But at the time the vast majority of fiber wasn't being used. So even though they were installing it in the ground and laying fiber, the vast majority of it was in preparation for demand that wasn't even there yet. So keep that in mind as we talk about the AI bubble. Now let's set the scene a little bit. I want to show you just the absolute massive size of the investment that's happening in AI right now. Bank of America now sees global hypers scale spending rising 67% 67% in 2025 and another 31% in 2026 with total outlays climbing to 611 billion. Bank of America also says AI capital spending will nearly triple over the next 5 years constrained only by the ability to scale buildings and power. McKenzie says, \"Our research shows that by 2030, data centers are projected to require 6.7 trillion worldwide to keep pace with the demand for compute power.\" So that just speaks to the massive investment happening in AI infrastructure. We're talking about data centers, power, and chips. And these articles are saying that that infrastructure investment can't even keep up with the demand. And that's the important part. If the demand is there, then the infrastructure buildout, the investment is worthwhile. But there's two layers to demand. One is the inference providers. Those are products like Gemini, ChachiPT, Anthropics, Claude and so on. And they are gobbling up as much compute as they possibly can. But the second layer of demand comes from consumers of inference who is actually using these models that are built on top of all of this infrastructure. So that's consumers like you and me and enterprise businesses. So, let's talk about demand because that is really the key indicator of whether we're in a bubble or not. Now, let's start with the elephant in the room. Chat GPT, the verb that defines artificial intelligence. Just chat GPT it, right? So, let's look at their growth. November 2022, when they first launched, they had a million weekly active users. Fast forward one year, they had 100 million weekly active users. Fast forward October 2025, they have nearly 800 million active users with plans to have a billion weekly active users by the end of this year. And it is estimated that they have hundreds of millions of people paying them a subscription for access to the",
        "start": 173.519,
        "duration": 686.9590000000001
    },
    {
        "text": "million weekly active users. Fast forward October 2025, they have nearly 800 million active users with plans to have a billion weekly active users by the end of this year. And it is estimated that they have hundreds of millions of people paying them a subscription for access to the seems like demand is there from the consumer side. And remember, OpenAI primarily serves consumers. They definitely have an API business and they absolutely serve their models to enterprises, but what they are known for and where the majority of the revenue comes from is from consumers. Now, let's look at Anthropic. They are growing incredibly quickly, but in a very different way. Anthropic's primary source of revenue is enterprise businesses built on top of its API. It has a much smaller consumer business. More often than not, people are using Anthropics models through the API for business use cases versus chatbt which is primarily through chatbt.com and for consumer or personal use cases. At the beginning of 2025, less than two years after launch, Anthropic's run rate revenue had grown to approximately a billion dollars. By August 2025, just 8 months later, our run rate revenue reached over $5 billion, making Anthropic one of the fastest growing technology companies in history. So this is not just growth based on the valuation of the company although they are growing that very quickly. This is actual demand actual companies paying them real money to buy their services. Let's continue to talk about demand. Here's a report put out by Menllo Venture Capital which is a very well-known venture capital firm in Silicon Valley. This is 2025 the state of consumer AI. Now, let's talk about the adoption of artificial intelligence. First in the US and then in the world as a whole. More than half of American adults, 61% have used AI in the past six months, which doesn't seem like a big deal because once in 6 months isn't true usage. It's just, oh, I heard about it. Let me try it out. But here is what is important. Nearly one in five rely on it every single day. 20% of the adults in the United States rely on it every single day. And now keep in mind AI in its current form the generative AI wave just started about 2 and 1/2 years ago. But for enterprise deployment has been a little slower. They are trying they are still experimenting but mass adoption and mass implementation is not quite there yet. So this is a report put out by McKenzie a global consulting company very wellknown. And here are their key findings. Most organizations are still in the experimentation or piloting phase. Nearly twothirds of respondents say their organizations have not yet begun scaling AI across the enterprise. And from my experience with my friends running companies as well as just being inside and sometimes consulting for companies, that's what I'm seeing as",
        "start": 346.24,
        "duration": 996.8
    },
    {
        "text": "organizations are still in the experimentation or piloting phase. Nearly twothirds of respondents say their organizations have not yet begun scaling AI across the enterprise. And from my experience with my friends running companies as well as just being inside and sometimes consulting for companies, that's what I'm seeing as how to get it to work in a really secure, reliable way. So on the enterprise side, it is still very early. And there's an interesting way to think about demand. Demand is not simply how many people want the thing, but that is actually a proxy for how much value they're getting from it. And so the real question is to sum all of this up, are people gaining value from artificial intelligence? Well, to speak for myself, I am gaining tremendous value. Obviously, I am on the cutting edge of adopting AI use cases, but within those use cases, I am gaining tremendous value. And everybody I know seemingly is using chatbt. And I'm not just talking about my highly technical friends. And so let's finish the value side of the equation with this tweet from Max Weinbach reading a JP Morgan AI capex report. And this is such a great way to put AI ROI into perspective. To drive a 10% return on our modeled AI investments through 2030 would require $650 billion of annual revenue in perpetuity, which equates to $34.72 per month from every current iPhone user. So, what do you think? Is that possible? every single iPhone user plunked down between $400 and $1,500 for their phone. So, on average, would they be willing to pay about $35 a month for the value that artificial intelligence brings them? But overall, the demand is certainly there, especially since it's only been almost 3 years since ChachiPT first came out and changed the world. But there's definitely some things that I just can't understand. And I think this infographic speaks volumes. This is an infographic by Bloomberg News showing how the different major AI companies are all essentially working together, paying each other. It's kind of wonky. Let me break this down for you. So in the center we have the monster Nvidia, 4.5 trillion. I believe they actually just crossed 5 trillion. And so everybody buys chips from them. They are really the only game in town. There's also AMD which we see over here but they are much smaller. Nvidia is the main player. But here's where it starts to get weird. First we have the data center companies and NeoClouds. Those are companies that are buying Nvidia chips and providing inference or training services to other companies. So here we have Oracle and as you can see Oracle buys chips tens of billions of dollars from Nvidia. Here's Coreweave a neocloud. Check this out. Nvidia sells services to Coreeave. Coreweave buys hardware and software from Nvidia and also Nvidia made an investment in Coreeave. So it's basically like saying, \"Hey, I'm Nvidia.",
        "start": 504.0,
        "duration": 1351.0400000000002
    },
    {
        "text": "and as you can see Oracle buys chips tens of billions of dollars from Nvidia. Here's Coreweave a neocloud. Check this out. Nvidia sells services to Coreeave. Coreweave buys hardware and software from Nvidia and also Nvidia made an investment in Coreeave. So it's basically like saying, \"Hey, I'm Nvidia. Coreweee and 80 billion of that you're going to turn right around and buy my chips. And by the way, I'm also going to take a percent of your company.\" Microsoft and Open AI both buy inference from Coree. But here's where it gets even more interesting. Nvidia invested in OpenAI and OpenAI buys chips directly from Nvidia and Nvidia invested in OpenAI in a very similar deal to Coreweave like hey here's a bunch of money and most of that money you're going to ship right back to me and buy my chips and Nvidia kind of did the same with a bunch of other little companies. So here's Mistral they invested in them and then Mistral turned around and bought their hardware. Figure AI the robotics company same thing. Nvidia took a piece of them and then figure turned around and bought a bunch of chips. Same thing with Grock. Nvidia invested in them and then Grock turned around and bought a ton of chips. Then we have Nvidia investing in Nebus which is another NeoCloud. Microsoft buys services from Nebus. Microsoft also buys hardware directly from Nvidia for their Azure data centers. And so you could start to see all of these companies are either sending chips, sending investment, sending revenue to each other back and forth. And it's hard to understand how all of this is actually producing new value versus just trading value. And a quick thank you to Dell Technologies for sponsoring this part of the video. Dell Technologies has a family of laptops and desktop PCs featuring Nvidia RTX Pro Blackwell chips which are absolute beasts for AI workloads. Check out the family of products linked down below. Now, let's go back to the definition of a bubble. So, we explained displacement. We have this absolutely incredible new technology called artificial intelligence that is going to change the world. We have a boom in the form of the magnificent seven just exploding in value. Nvidia going from kind of just a middling company to the most important influential and valuable companies on the planet. Then we have a little bit of euphoria speculation and greed dominate prices detached from fundamentals. Now this is the key. Have prices detached from fundamentals? I think since we've shown the demand is actually there for all of this infrastructure buildout. I don't believe it has. Now the key is whether all of that infrastructure buildout that is going to power artificial intelligence can then turn around and that AI can provide value to the end user the consumers and the businesses as we've seen on the consumer side certainly has on the enterprise",
        "start": 682.72,
        "duration": 1669.7590000000002
    },
    {
        "text": "it has. Now the key is whether all of that infrastructure buildout that is going to power artificial intelligence can then turn around and that AI can provide value to the end user the consumers and the businesses as we've seen on the consumer side certainly has on the enterprise able to move more quickly and adopt this technology now but for a lot of enterprise businesses they are still trying to figure out how to implement AI successfully now let's move on to profit taking smart investors start selling. Let's go back to where we started. Michael Bur, famous short investor. Now, although he isn't technically selling, he's shorting, which means he's betting against artificial intelligence. Now, of course, he became famous for calling the 2008 great financial crisis the housing bubble. But here's the thing, he was really early. He mistimed it greatly. He still made a ton of money to be clear, but his timing was way early. And to be even more clear, Michael Bur has made other mistakes, false predictions in the past. But now, one of the best investors on the planet, Masaasan of Soft Bank, a Japanese investing powerhouse, has sold as of today, as of filming this video, all of their Nvidia shares, which is wild. So, according to Fortune, SoftBank dumps its entire Nvidia portfolio worth 5.8 8 billion as its CEO goes all in on open AI to the tune of 30 billion. So, it's not like he is doubting artificial intelligence. He's going from the hardware layer to the model layer. Now, I want you to watch this video because I just find it absolutely hilarious. This is Jensen Hong, the CEO of Nvidia, talking to Masa, completely trolling him in that Masa sold all of his Nvidia shares before the Generative AI boom. Watch this. Many of you probably don't know this, but at one point, MASA was the largest shareholder of Nvidia. [applause] It's okay. [laughter] We we can we can we can cry. We can cry together. [laughter] And so I find that hilarious. Let me just put that into context. SoftBank owned about 5% of Nvidia in early 2019, the biggest shareholder. They sold it in 2019, realizing returns of about $3.3 billion. If they would have held it, that 5% stake would be worth over $150 billion. That is why Masa is crying on Jensen's shoulder. I just find that hilarious. Okay, so we do have some smart investors selling, some smart investors shorting, but is that a bubble? Let's keep going. I want to talk about the Magnificent 7. These are the biggest tech companies in the world that are the primary drivers of artificial intelligence. Companies like Meta and Nvidia and Google. And if you look at these public companies, they are really driving the United States GDP. In fact, there have been claims that without artificial intelligence, we would be in a recession. BNP Parabus chief US",
        "start": 843.839,
        "duration": 2011.3009999999997
    },
    {
        "text": "are the primary drivers of artificial intelligence. Companies like Meta and Nvidia and Google. And if you look at these public companies, they are really driving the United States GDP. In fact, there have been claims that without artificial intelligence, we would be in a recession. BNP Parabus chief US in a round table with reporters this week. AI has kept the economy out of a recession. And so look at this graph. Look how crazy this is. The green is the MAG 7. Microsoft, Nvidia, Google, Apple, Tesla, Amazon, Meta. And look at that absolute growth from January 23 through basically a few months ago. And then here is the rest of the S&P 500 just absolutely flat. So you can see the total percentage of GDP, the total percentage of the stock market accounted for by these seven companies is growing like crazy. It is extremely concentrated which is definitely worrying to me. But again, let's go back to Michael Bur. Why is he actually shorting AI stocks? Here is the crux of his argument. Understanding depreciation by extending useful life of assets artificially boosts earnings. One of the more common frauds in the modern era. Basically, what he's saying is that Nvidia and all of the companies that are buying Nvidia chips are saying they're going to last for now six, seven, maybe eight years. and he's saying, \"No, no, these chips are not going to last that long. They're going to last maybe just three, four years.\" And why is that important? Well, if the chips last longer, you're going to get more value out of it once you've already spent the capex. So, just imagine this. You buy chips for $10 and from that you can earn back, let's say, $2 a year. So, if the life of the chip is five years, you're break even. You spent 10, you earned 10. But if the life of the chip is now eight years, you've spent 10 and made 16. So you can see that math is very different depending on how long you say these chips can last for. That's called depreciation. But of course you can project all of these things, but eventually the rubber has to hit the road. The chips actually have to be useful for 6 7 8 years. Michael Bur is saying they're not. So remember Cororeweave, they are the Neocloud company. They provide GPU inference. They provide training. Basically, they bought a bunch of chips and they're leasing them out. According to their public documents, they say that the current generation of chips should last 8 to 12 years. But again, let's talk about when the rubber actually hits the road. We have examples of chips being in the market for many years. Let me show you a couple. Here's Michael Bur is wrong here. Google 7 to 8 years old TPUs that is their custom AI silicon are still running at 100% utilization",
        "start": 1023.12,
        "duration": 2324.2609999999995
    },
    {
        "text": "when the rubber actually hits the road. We have examples of chips being in the market for many years. Let me show you a couple. Here's Michael Bur is wrong here. Google 7 to 8 years old TPUs that is their custom AI silicon are still running at 100% utilization A100s sold in 2020 are still running and H100s won't retire before 2027. So what's actually happening here? We have a ton of demand and even though these might be last generation chips, we just can't build enough chips and deploy them fast enough. So, a lot of these companies are like, \"Okay, I'll just get your previous generation chips.\" And we are still running at 100% utilization of the entire marketplace of chips. Now, there's one key thing to remember. All of these chips, all of these data centers, they can be built out and installed, but ultimately if we don't have power, we can't run them. And so, a lot of people are saying GPU utilization across the marketplace of GPUs is nearly 100%. But again, there's one exception. Satia Nadella, CEO of Microsoft, says there's not enough electricity to actually power all of the GPUs they have. CEO Satia Nadella said during an interview alongside OpenAI CEO Sam Alman that the problem in the AI industry is not an excess supply of compute, but rather a lack of power to accommodate all of those GPUs. In fact, Nadella said that the company currently has a problem of not having enough power to plug in some of the AI GPUs the firm has in inventory. Basically, they have chips just sitting in storage, not being able to be powered on because they don't have the power. That's an entire video discussion in itself. I'll save that for another video. All right, let's wrap this video up. We have the biggest infrastructure buildout in human history happening right now. We have enormous demand for artificial intelligence from the consumer side. We have demand from the enterprise side, although implementation is actually lagging behind. We have, in my opinion, the most important technology humans have ever created, artificial intelligence. This is the worst AI will ever be. And as mentioned, we have a ton of infrastructure buildout to support the future value of AI, not just the current value, but the future value. We haven't even begun talking about embodied AI, robots. And so, if you look at the history of bubbles, you see the two types of bubbles as mentioned earlier. We have the ones that are not based on infrastructure buildout that end in irreparable damage to the economy. And then we have bubbles that were infrastructure buildout that were just clearly mistimed from the railroads to the internet buildout to the dotcom bubble. And so we are certainly in the infrastructure type of bubble, if we're in a bubble at all. And really, there's only one outcome that could actually have a massive irreparable damage",
        "start": 1180.72,
        "duration": 2630.260999999999
    },
    {
        "text": "infrastructure buildout that were just clearly mistimed from the railroads to the internet buildout to the dotcom bubble. And so we are certainly in the infrastructure type of bubble, if we're in a bubble at all. And really, there's only one outcome that could actually have a massive irreparable damage AI is truly going to change the world. And so, the question is, do I believe we're in a bubble? The short answer is no. There is just too much opportunity in artificial intelligence. I do believe that our AI infrastructure buildout is definitely outpacing our ability to actually deploy that value, but the demand is certainly there. Whether we're talking about consumer use, enterprise use, curing all disease, figuring out new materials, robots, the opportunities are just enormous. So, we may see some short-term contraction, but overall, this is the future. artificial intelligence is here and all of this infrastructure buildout is going to be worthwhile. If you enjoyed this video, please consider giving a like and subscribe.",
        "start": 1337.6,
        "duration": 2725.700999999999
    }
]