[
    {
        "text": " You're still paying for 10 different AI tools? Stop. Just stop. Google just dropped the biggest updates to Notebook LM ever, and they basically turned it into a full endto-end AI tool. We're talking AI podcast in 80 plus languages, research that writes itself, visual infographics with Nano Banana, study systems, video overview, and something I'm saving for the end that genuinely made my jaw drop. And all of this free. In this video, I'm going to walk you through six practical use cases. stuff you can actually use today, tomorrow, every day. And by the end of this video, you won't just know Notebook LM. You'll have mastered it. Let's get into it. Search Notebook LM and create a new notebook. Three sections. Sources on the left, dump your PDFs, YouTube links, websites here, chat in the middle, ask questions, get cited answers. Studio on the right. This is where all the magic happens. That's it. Now, why should you even use this over other AI tools? Three reasons. One, it only uses your sources, not the internet, not random data, your documents. That's it. Two, zero hallucination. Everything it says. Citation. Click it. Verify it. Done. Three, it's all in one. Podcasts, videos, mind maps, flashcards, presentations, infographics. You're not paying for 10 different tools anymore. That's why Google built this separate from Gemini. Different purpose, different [music] architecture. All right, let me show you what this thing can actually do. So, I've got a WhatsApp community where I drop everything I discover, tools, workflows, updates, all in one place before they go mainstream. If you want access, links in the description. Okay, use case number one. And this is something I do every single morning. So, you know that feeling when you wake up and there's like 50 AI announcements, papers dropping, product launches, it's impossible to keep up, right? So I use the same sources actual researchers use archive for papers MIT news deep [music] mind not random Twitter threads actual research add all these as sources website paste [music] insert notebook reads everything audio overview format I'll do deep dive now check this out 80 plus languages Hindi Tamil Marathi Spanish Japanese whatever you need I'll do Hindi custom instruction focus on today's AI developments generate namaskar or the deep. You hear that? Two AI hosts having a natural conversation about my sources in Hindi. [music] I listen during my commute. By the time I reach, I know everything. But okay, daily news is great. What if you need to go deeper like actual research? This feature launched November 13th, 2025 and it completely changes how research works. Chat GPT gives you answers. Perplexity gives you summaries. Notebook LM gives you a complete report with 40 plus verified sources. Click deep research. Type your topic. Future trends 2026 AI and AGI. Now watch. It's not doing a quick search. It's creating a research plan. Browsing hundreds of websites. finding papers, articles,",
        "start": 0.16,
        "duration": 363.7579999999999
    },
    {
        "text": "you answers. Perplexity gives you summaries. Notebook LM gives you a complete report with 40 plus verified sources. Click deep research. Type your topic. Future trends 2026 AI and AGI. Now watch. It's not doing a quick search. It's creating a research plan. Browsing hundreds of websites. finding papers, articles, research report, executive overview, strategic analysis, timelines, everything backed by citations [music] you can actually verify. Click any citation takes you directly to the source. This isn't AI making stuff up. This is legitimate research. But here's where Notebook LM does something no other tool can do. Import this as a source. Now go to studio slide deck. Remember when I mentioned Nano Banana Pro at the beginning? This is it. Google's latest image generation model. [music] It actually gets text right. No weird artifacts, no spelling mistakes. TEDex style presentation. Storytelling first inspired by Steve Jobs. Super minimalistic. [music] Generate. The great reckoning AI and the autonomous ascent. Look at this. Minimalistic professional text is perfect. Every word readable. This is keynote ready. Research question to presentation under 10 minutes, one free tool. Now, research and presentations handled. [music] But what about when you just want to quickly understand something like a 2-hour podcast you don't have time to watch? All right, this one's super practical. This podcast went viral. Nikil Kamut interviewing Elon Musk. Almost 2 hours. Be honest. Who's watching the whole thing? And even if you do, you're going to forget half of it. Copy the link. Add a source. Done. Give me the key takeaways. Future of robotics. AI [music] safety, Starlink, the X situation, two-hour conversation, 30 seconds. But watch this infographic. Also, Nano Banana Pro, key AI takeaways, brutal neomorphism style. Look at that dark, sleek, perfect text. 2-hour podcast poster you can reference anytime. Let me show you one more thing with this. Going for another video. So, this is a conversation between my good friend Raj Shamani and Kunal Sha. As you can see, 3 hours long. What we'll do is just copy the link. Come here, paste that link. And once it's inserted, we'll first make a slide deck. When I click slide deck, so for this, we'll go for a detailed deck. Comprehensive breakdown. That's what [music] we want. Length, we'll keep it default. And you can do like let's try something like a 3D pixel voxil style. I feel this would be a fun style to test with. Just hit generate. And it's been generated. As [music] you can see, our PPT is ready. Let's see what result it's given us. The Vauxil code, a blueprint for building an A+ mindset. Insights distilled from Kunal Sha. Okay. Wow, that is so cool. The Vauxil pixel style that I asked for. And look how beautiful it's come out. This is so cool. Let's create an infographic from that video itself. Click on infographic. Let's do landscape standard. And I'll say Gibli style. I",
        "start": 198.239,
        "duration": 675.2780000000002
    },
    {
        "text": "distilled from Kunal Sha. Okay. Wow, that is so cool. The Vauxil pixel style that I asked for. And look how beautiful it's come out. This is so cool. Let's create an infographic from that video itself. Click on infographic. Let's do landscape standard. And I'll say Gibli style. I on this. So, let's hit generate. Let's see what we're going to get. Infographic is ready. Gibli style. Let's see what it's given us. Kunal Sha's framework for success. And the infographic has been generated. [music] The unstoppable mindset Gibli style. As you can see, this is so good. I can literally print this and put it in front of my desk. Okay. But what if you need to actually learn something like exam tomorrow, zero prep? This one's for the students. And honestly, anyone who needs to learn something fast, 11 p.m. exam tomorrow, hundreds of pages, zero preparation. We've all been there. Step one, dump everything. [music] Textbook, PDF, YouTube lectures, whatever you have. Pro tip, configure the chat. , I use a prompt called the academic revisionist. Makes everything simpler. Use this analogy. Straight to the point. Full prompts in the description. Mind [music] map. One click. Entire subject visualized. All concepts how they connect. This would take hours manually. One click. Flash [music] cards. 77 cards from your material. Click to flip. Don't understand? [music] Expand and explain. This is a cheat code. Quiz 15 questions. Wrong. Explains why. Right. Move on. Understand. Memorize. Test. [music] One night. Now, everything I've shown you, impressive. But that fifth thing I mentioned at the beginning, this is it. Video overview. This launched July 29th and almost nobody talks about it. Which is crazy because just watch. You have a document. [music] You want a video. Normally animators, editors, voice over, thousands of dollars with video overview, one click. I have this script about Lakit Borfukan, the Aome general who defeated the Mughals. A story every Indian should know. [music] Upload, video overview, explainer format, heritage style, heroic documentary like Johnny [music] Harris. Generate video plays. Okay, picture this. A general, he's gravely ill and he's leading his army from a stretcher in the middle of a massive raging river. His soldiers are begging him, \"General, please don't push yourself any further.\" From a text document, no animator, no editor, no voiceover artist, free. Okay, but here's the thing. What if you don't even have a script? Like, you're starting from zero. Check this out. So, I'm going to take videos from three creators I really like. Iman Gaji, Ryan Trrahan, Mr. Beast. Just grab their video links and add them as sources. All right. Insert. Cool. So, now I'm going to ask it to make me a script. something like, \"Give me a complete 10-minute video on OpenAI versus Google.\" The whole AI was thing. I want the explainer style like Iman does it, entertainment vibes like Ryan, and that Mr. Beast retention editing style, full script.",
        "start": 357.44,
        "duration": 1002.7169999999999
    },
    {
        "text": "now I'm going to ask it to make me a script. something like, \"Give me a complete 10-minute video on OpenAI versus Google.\" The whole AI was thing. I want the explainer style like Iman does it, entertainment vibes like Ryan, and that Mr. Beast retention editing style, full script. I'm also going to run a deep research on the same topic. Right? So, basically, we're getting the creator styles and proper research like best of both worlds. Okay. Okay. Okay. First draft is here. It's it's good actually, but I want it in a specific format. Let me ask for a table like left side all the visuals and editor notes right side the dialogue. You know the format we use for our scripts. Let's see what it gives us. Okay. Wow. This is exactly what I asked for. Like exactly. Look at this fast-paced drone shot flying through massive warehouse. Dude, this is a full script. Like you could literally go shoot this right now. But wait, we're not stopping here. Let's go to studio video overview. For the style, I'm going to pick anime. It looks really cool. Explainer format and just tell it from this script. Make me the full video. Generate. Let's see what happens. All right, it's done. Let's play this. Let video play, guys. 12 minutes, full documentary, anime visuals, professional voice over, six chapters, charts, [music] timelines, everything from YouTube links, and a prompt. That's it. No script writer, no animator, [music] no editor, no voiceover artist, nothing. end to end, one tool and it's free. [music] Now, let's talk about this brand new feature called data table. And this one's really cool. So, let's say I want to plan a trip to Japan and I've already watched some videos, read some blogs, and I want my trip planned based on only those details, not some random stuff from the internet. So, what I'll do is go to ad sources, click on website, and just paste all the links that I think are good and verified. This way, it doesn't pull in any random information. and then I'll hit insert. Once that's done, now I'll click on data table. And you can actually tell it exactly how you want the table structured. So I already have a prompt ready for this. I'll just paste that in. Basically, I want a data table of top attractions mentioned across all these sources with columns for attraction name, estimated cost, travel logistics, review highlights, and time required. Now I'll just hit generate. So now we wait. And while it's generating, just know that you can ask all kinds of different questions from these sources. This is just one way to use it. All right, looks like we're all set for our Japan trip. Data table is ready. Let's see if it gave us what we asked for. And you can actually export this directly to Sheets. Let me open it",
        "start": 522.56,
        "duration": 1276.157999999999
    },
    {
        "text": "questions from these sources. This is just one way to use it. All right, looks like we're all set for our Japan trip. Data table is ready. Let's see if it gave us what we asked for. And you can actually export this directly to Sheets. Let me open it attraction name, estimated cost, travel, logistics, reviews, [music] time required, everything. It even shows which source each row came from. like Nara Park here. It says it's free 1 hour from Osaka and even warns you that some deer may be aggressive all pulled from those blogs and videos. So, this is a really powerful feature from a bunch of scattered sources. I now have a clean structured trip plan. And you can use data tables for so many other things. Meeting transcripts, messy documents, research notes, basically anything you want to organize. You can edit it, play around [music] with it. Super helpful. Wait, I promised you six use cases, but there's one more I discovered recently and I genuinely couldn't keep it to myself. So, one recent notebook LM hack that I've been myself using and testing out and it's been giving me really amazing results. Basically, what I do is I upload YouTube videos every single week. One of the buckets we have is AI news. , whatever the latest developments are happening in the AI world. So, I made a long- form YouTube video and now I need to turn it into a Twitter thread, a LinkedIn post, maybe a [music] carousel or newsletter content. Doing that manually would definitely take hours. [music] And if I try to use chat GPT or any other tools, it usually hallucinates and gives me some random things that I haven't talked about in the video. So, you can literally turn notebook LM into your own content repurposing agency all for free just with a few things. So, basically what I'm going to do is click here on add sources. [music] Then go over here and paste the YouTube video link for which I want to repurpose. Just click on insert. So now it's inserting. So now it's done. Write a viral Twitter thread for this topic. Let's see what we get. Basically repurposing the YouTube video and turning it into a viral Twitter thread. Let's see what we get. All right. So as you can see, code red at OpenAI. We've got eight insane updates. This is exactly how I usually write Twitter threads. And it has given me the viral format. China versus OpenAI. So, right from the start, it's given me the China angle, runway gen 4.5, perplexity supermodels, and as you can see, everything is from the video itself. No outside information, right? Write a nice personalized POV humanlike LinkedIn post. Now, let's see if it gives me a LinkedIn post. [music] Twitter thread was already killer or Xthread as you call it now. But let's see what it gives",
        "start": 662.0,
        "duration": 1558.2369999999983
    },
    {
        "text": "you can see, everything is from the video itself. No outside information, right? Write a nice personalized POV humanlike LinkedIn post. Now, let's see if it gives me a LinkedIn post. [music] Twitter thread was already killer or Xthread as you call it now. But let's see what it gives a few more months before the next big AI [music] shift. I was wrong. We usually talk about incremental updates. As you can see, it's a personalized post. [music] It feels like I'm literally writing it myself, but I didn't do anything. It's exactly how I write LinkedIn posts. And it's like, wow, it's crazy. So, this is another very, very useful bonus use case. I hope you enjoyed it. Quick heads up on the different plans Notebook LM offers. Free and this is what most of you will use. gives you 100 notebooks, 50 sources per notebook, 50 chats a day, three audio overviews, three video overviews, 10 flashcards, quizzes, and reports. Plus, for active learning and deep dives, you get two times more generations, early access to new features, and up to 100 sources per notebook. Pro for active learning and deep dives. You get five times more generations, early access to new features, and up to 300 sources per notebook. Ultra for power users and complex projects. 50 times more generations, highest access to Gemini models, priority access to features, and up to 600 sources per notebook. But here's what matters. All the features I showed you today are available on the free plan. And all of this now on your phone. Background playback. Listen while doing other stuff. Offline downloads. Commute without internet. Flashcards and quizzes on mobile. Study [music] on the metro. Camera integration. Snap a photo. Instant source. Share sheet. See an article. Share to Notebook LM. Infographics and slides rolling out to mobile right now. Complete package right in your pocket. And one quick update you need to know. You can now upload your Notebook LM notebooks directly into Gemini. So you can combine multiple notebooks and build on top of your existing research. This is Google's master stroke. Their plan was always to keep you inside the Google suite. And now notebook LM connects to Gemini 2. Everything talks to everything. All right, [music] let's take a step back. You just learned how to turn any topic into an AI podcast. Do actual research and create presentations. [music] Summarize hours of content in seconds. Build complete study systems [music] and turn any document into an animated video. All free. You're not paying for 10 different subscriptions anymore. Look, you've just mastered Notebook LM. I'm not saying that lightly. I've given you the practical use cases, the workflows, the prompts, everything I actually use. You have everything you need. Go try it. Experiment. Build your own workflows. Explore the different possibilities. The tool is free. There's no risk. Just go play with it. I'm confident that you can take what you",
        "start": 804.959,
        "duration": 1866.421999999998
    },
    {
        "text": "you the practical use cases, the workflows, the prompts, everything I actually use. You have everything you need. Go try it. Experiment. Build your own workflows. Explore the different possibilities. The tool is free. There's no risk. Just go play with it. I'm confident that you can take what you with it. Now, Notebook LM is just one tool from Google. I made another video. Google's secret [music] seven AI tools just destroyed chat GPT. Breaking down seven more tools that almost nobody knows about. Completely free stack. Over 250,000 people have already watched it. If you still haven't, you're missing out a lot. Give it a watch after this one. Links right here.",
        "start": 961.04,
        "duration": 1912.8209999999979
    }
]