[
    {
        "text": " Today, Open AI is the one [music] hitting the panic button. Sam Alman sent an internal memo with two words in the subject line. Code red. Code red. Code [music] red. Code red. Code red. That's their emergency signal. Get out. Run. It means drop everything. We have a crisis. And here's what caused it. Google just released an AI that's beating Chat GPT on almost every test. The company that was supposed to be years behind, they're now ahead. This is the story of how OpenAI [music] went from winning the AI race to fighting for survival. November 18, 2025, Google quietly drops Gemini 3 Pro. No big announcement, just a blog post. And here's what it did. There's a website called LM Arena where people blindly test AI models and vote [music] on which one's better. It's a ranking system to see how leading models stack up across text, image, [music] vision, etc. Gemini 3 Pro scored 1,5001. [music] First AI ever to break 1500. Chat GPT, not even close. Then there's this brutal test called humanity's last exam. Designed to be so hard that no AI should pass it. Gemini 3 Pro is 37.5% and OpenAI's best model is 31.64%. Now, Google is six points ahead on [music] the hardest test in AI. That's when Sam Altman sent the memo. But here's the thing. Open AAI was already in trouble before Gemini 3 even launched. Remember their GPT5 launch earlier this year? [music] Death Star memes everywhere. 12 days of teaser videos. Betting markets said there was a 75% chance it would be [music] a massive breakthrough. By launch day, those odds crashed to 14%. One Reddit post that went viral. GPT5 is horrible. 6,000 upvotes. This is OpenAI's pattern. Overpromise, underdel, repeat. Meanwhile, Google's approach, a simple blog post, no hype. Let the product speak. Mark Beni off, CEO of Salesforce, tweets, I've used Chat GPT every day for 3 years. Just spent 2 hours on Gemini 3. I'm not going back. Just one month earlier, Salesforce had announced [music] an expanded strategic partnership with OpenAI. When your competitors are doing your marketing for you, you've already won. And that's Google right now. Here's the uncomfortable truth Open AI doesn't talk about. In 2017, Google published a research [music] paper, eight researchers, one invention, the transformer. That single invention powers every major AI today. Chat GPT built on it. Claude built on it. Even [music] Gemini, same foundation. OpenAI's $150 billion empire runs on technology Google open-sourced for free. And now the inventors want [music] their lead back. Let me show you exactly how much ground Open AI is losing. August 2025, Google releases this AI tool called Nano Banana that turns your selfies into 3D figurines. It goes viral on Instagram. [music] 13 million new users for Google in just 4 days. 200 million images created. Gemini becomes number one on the app store in 108 [music] countries. Zero marketing spend.",
        "start": 0.16,
        "duration": 384.08099999999996
    },
    {
        "text": "Google releases this AI tool called Nano Banana that turns your selfies into 3D figurines. It goes viral on Instagram. [music] 13 million new users for Google in just 4 days. 200 million images created. Gemini becomes number one on the app store in 108 [music] countries. Zero marketing spend. get. And [music] honestly, that was just the warm-up because on October 30th, Google pulled off something [music] way bigger. They partnered with Reliance Gio. If you're not from India, Jio is basically a telecom giant. 56 million subscribers. And Google just told all of them, here's our premium AI free for 18 months. We're talking 35,100 rupees worth of AI per person. That's almost 3,000 rupees a month, which by the way is more than what Chat GPD Plus costs. Except Google's not charging a single rupee. Now, if this sounds familiar, it should. 2016, Jio gave free 4G to 400 million Indians. Changed [music] the entire country, made India the cheapest data market on the planet. Same playbook, different technology. This time it's [music] AI. So what did OpenAI do? They panicked. November 4th, they announced free chat GPT for India. 5 days after Google already locked up the market, [music] 5 days late to a 500 million user market. That's not competition. That's damage control. But before we dive in, I share updates like these daily on my free WhatsApp community. Links in the description. But here's what makes this really dangerous for OpenAI. They're not just fighting Google. They're fighting on three fronts. Front one, Google. [music] 650 million monthly users built into every Android phone. OpenAI can't match that distribution. Front two, Anthropic, the company behind Claude. There's a test called SWE Bench that checks if AI can [music] fix real coding bugs. The same bugs human engineers deal with. Claude just scored 80.9%. First AI ever to break 80%. OpenAI is best around 77%. That's why big companies like Amazon and Goldman Sachs are [music] switching to Claude. Anthropic went from $1 billion to $5 billion revenue in 8 months. Front three, their own users. Chat GPT has 800 million weekly users, more than Europe's population. But that number is slipping. Open AAI is being squeezed from every direction. Google from above, Anthropic [music] from the side, and their own users are walking away. And it gets worse. The people who built Chad GPT, they're leaving OpenAI. Co-founder John Schulman and safety lead Jan Leer both gone to Anthropic. Chief scientist Ilia Sodskiver, one of the most important AI researchers alive, started his own company, $32 billion valuation. And CTO Mera Morati, the woman who was interim CEO during the Sam Alman drama, she's gone to started her own company, raised $2 billion. her official reason stepping away to explore. But here's what actually happened. She was stuck between two groups. Sam Alman saying ship faster. The safety team saying slow down. We need more testing. Mira Murati and Ilia Sutzkever quietly compiled a",
        "start": 197.44,
        "duration": 728.0809999999999
    },
    {
        "text": "gone to started her own company, raised $2 billion. her official reason stepping away to explore. But here's what actually happened. She was stuck between two groups. Sam Alman saying ship faster. The safety team saying slow down. We need more testing. Mira Murati and Ilia Sutzkever quietly compiled a Alman allegedly misled the board, especially about safety approvals and a secret control of the OpenAI startup fund. When they launched their AI model, multiple employees said it wasn't ready. Safety testing wasn't finished. By August 2024, nearly half of OpenAI safety team had quit. And then there's a story I need to tell you carefully. Such Balaji, 26 years old, Indian-American, helped build [music] GPT3 and GPT 4. In October 2024, he went public, told the New York Times that OpenAI was doing things wrong with their data practices. One month later, he [music] was found dead. He was 26. I'm not making claims about what happened. But when the people who built something [music] start leaving or worse, you have to ask what's going on inside. So, what's OpenAI doing about all this? Here's where it gets interesting. This is breaking news from this week. They're secretly building a new AI code named garlic. According to reports, it's already beating Gemini 3 Pro and Claude in internal tests. Could launch as GPT 5.2 or GPT 5.6 6 [music] early next year. But here's what makes garlic special. It's smaller, but just as smart. Usually, making AI smarter means making it bigger and more [music] expensive. OpenAI figured out how to get the same intelligence with less computing power. That's the bet. That's the crisis. Garlic is either their comeback or their last stand. I want to leave you with something that puts all of this in perspective. Ilia Sutzkar, the guy who left OpenAI to start his own company, said something on a podcast. What are we scaling and pre-training to scale? It was a particular scaling recipe. Yes, the big breakthrough of pre-training is the realization that this recipe is good. Meaning the way we build AI today is about to become outdated. Whoever figures out the next method first wins the next decade. And here's the wildest part. In April 2025, 7 months before Gemini 3, Google posted a job listing. Job title, post AGI research scientist. Job description, study what happens [music] after we achieve human level AI. Half the internet is debating whether AGI exists. Google's already hiring for what comes after. So what does this mean for you? If you're in India, and I know many of you are, pay attention to the geo deal. 500 million people are about to get free access to the most powerful AI tools in the world. If you're a developer or building with AI, the tools are changing fast. The API you're using today might not be the best choice in 6 months. And if you are just trying to figure out",
        "start": 371.52,
        "duration": 1036.0010000000004
    },
    {
        "text": "about to get free access to the most powerful AI tools in the world. If you're a developer or building with AI, the tools are changing fast. The API you're using today might not be the best choice in 6 months. And if you are just trying to figure out The company winning today might be losing tomorrow. OpenAI looked unbeatable 2 years ago. Look at them now. But some things don't change. the ability to learn quickly, to build things that actually help people. Focus on those. The AI tools will keep changing. [music] You need to be ready to change with them. Subscribe if you want more breakdowns like this and tell me in the comments, who do you think wins the AI race by 2027.",
        "start": 528.32,
        "duration": 1089.7610000000002
    }
]