[
    {
        "text": " Sam Altman just declared code red at OpenAI. An open-source model from China just outscored GPT5 on math. Google just let you build AI agents in minutes with zero code. And Cling AI dropped five major announcements in 5 days. Video Gen will never be the same. The AI world went crazy this week. These 10 actually matter. Stick around for the tools section. [music] There's one you absolutely can't miss. Let's get into it. China just embarrassed OpenAI. GPT5 was crushing every math test out there until this open-source model just scored higher. Deepseek just [music] dropped two new models, V3.2 for everyday work and V3.2 Special for heavy reasoning. You can use Deepseek's V3.2 Special to solve insane math problems and work through research papers. Basically, anything that needs serious thinking. Both the models are free to download, but if you want to use special through their API, December 15th is the deadline. So yeah, Deepseek is giving all the major models out there some serious competition. Sam Alman just declared code red at OpenAI. He's stopping everything. Ads, health features, shopping, all the side stuff. The whole team is now focused on one thing, making chat GPT better. We did a full breakdown on this. What's happening, why Altman's worried, all of it. Links in the description. Plexity just solved the biggest problem in AI. Instead of juggling multiple platforms, you now get the best of Google, OpenAI, [music] Anthropic, and Moonshot in one place. Max subscribers now get Nano Banana Pro as the default image generator. That's Google's Gemini 3 Pro image model with perfect text rendering and up to 4K resolution. For video, Sora 2 Pro is now default. It comes with integrated audio. Both pro and max users now get Kim K2 thinking and Gemini 3 Pro. Kimmy K2 is privacy first with reasoning mode always active. Perfect for step-by-step problem solving and [music] technical tasks. And if all this wasn't enough, the Max users also get Claude Opus 4.5, [music] Anthropic's flagship model built for demanding reasoning and agentic workflows. Plus 03 Pro, OpenAI's top tier reasoning model. So now you've got Google's best image and text model, OpenAI's best video and reasoning models, Anthropic's most powerful [music] model, and Moonshot's trillion parameter beast, all on one subscription. This is how AI should work. But before [music] we dive in, I share updates like these daily on my free WhatsApp community. Links in the description. Google just dropped something insane. It's called Workspace Studio, and it basically lets you build your own AI agent in minutes. So here's how it works. You just type what you [music] want in plain English. something like when I get an email, check the tone. If it's negative, label it and draft a reply. And Gemini just builds it. The whole workflow with steps, triggers, everything. You don't need to code or learn all the technical stuff. Just describe the problem and Google AI",
        "start": 0.08,
        "duration": 351.28099999999995
    },
    {
        "text": "English. something like when I get an email, check the tone. If it's negative, label it and draft a reply. And Gemini just builds it. The whole workflow with steps, triggers, everything. You don't need to code or learn all the technical stuff. Just describe the problem and Google AI Gmail, Drive, Sheets, [music] Chat, all your workspace apps. And they've got a bunch of templates already made for you, like auto follow-ups, alerts for urgent emails, pinging your team every [music] week. It's all just sitting there ready to use. Let's try this one out. Premeating briefs. Turn it on and you'll get a quick summary before every call. Who's there? What matters? What to do? But here's where it gets wild. You can also build from scratch. You just tell it what you want. Like, hey, when I get an email, check if [music] it sounds angry. If it does, label it and write me a reply. Okay, check this out. We have an email from an angry customer. The agent picks up on the tone, writes an apology, and drops in a 30% discount code. You didn't touch anything. Google's calling it Gemini powered automation for everyday work. And honestly, [music] this changes everything. What would you automate first? AWS just launched an AI that can control your browser and actually do stuff for you. It's called Nova Act. You tell it what you want in plain English and it takes over your browser and just does it like log into this site, pull the sales numbers and drop them in a spreadsheet and it figures out the clicks, the scrolling, everything. Now, you're probably thinking, \"Yeah, I've seen these before. They break after 5 minutes.\" This one's hitting [music] 90% success rates at actual companies. Herz is using it and they're moving five times faster now. [music] The difference is Amazon didn't just slap an AI onto a browser and call it a day. They trained the entire system together. The AI, the browser controls all of it, so it actually understands what it's doing. Bite Dance just dropped a stealth update that nobody is talking about. Cdream 4.5 is live and it's solving the biggest headache in AI image generation. Cream 4.5 excels at character consistency. It can now fuse up to 10 reference images and keep everything locked. Face, clothes, lighting, style. The text rendering is also insane. Small text, logos, posters, it actually reads clean now. And it just hit number seven on the textto image arena leaderboard. That's the public voting benchmark where real users pick their favorite outputs blind. What's wild, this isn't some major overhaul. Bite Dance calls it a refinement focused upgrade. Meaning they just made everything work better. Cinematic lighting, sharper details, better spatial reasoning. The kind of stuff that actually matters for e-commerce, film, game art, [music] advertising. It's free to try right now on Bite Plus Model Arc. 200 images, no",
        "start": 180.56,
        "duration": 647.361
    },
    {
        "text": "Bite Dance calls it a refinement focused upgrade. Meaning they just made everything work better. Cinematic lighting, sharper details, better spatial reasoning. The kind of stuff that actually matters for e-commerce, film, game art, [music] advertising. It's free to try right now on Bite Plus Model Arc. 200 images, no of, but what about videogen? Clingai had one of the busiest weeks ever. They just wrapped up their omni week. 5 days, [music] five announcements. Here's everything they dropped and whether any of it is actually worth your time. On day one, they [music] dropped Cling01. It's a unified model where video generation and editing happen in the same place. It's crazy what all you can do with this thing. You can morph images, put yourself into any video, remove unwanted objects, swap faces, and change camera angles or art styles [music] just by typing a prompt. We have done a detailed video on this where I tested it with nine increasingly difficult use cases. Video link is in the description. Check out to see how it did. Moving on to day two, they introduced image 01. As the name suggests, this [music] is an image gen model. It comes with one-click outfit swaps, turning floor plans [music] into 3D renders, and much more. If you're on their Pro, Premiere, or Ultra [music] plan, you get a year of unlimited access to it. Day three, and this was a major update. The only criticism that Clingo 1 was getting was their lack of audio. Cling shut the noise down with the announcement of video 2.6. It [music] generates audio with your video, dialogue, sound effects, ambient noise, all in one pass. Cling put out a short film called [music] I have a secret to demo it. I have a secret. I have a secret. I have a too big [music] secret that I never told you. Jesse, day four was for Avatar 2.0. This one's for creating AI spokespersons [music] and presenters. You can generate full talking head videos up to 5 minutes long. The demo reel is kind of wild. The expressions are more natural than the usual AI avatar stuff. Less stiff, more like someone [music] actually talking. It handles different languages, too. Korean, Chinese, English. They're pushing Avatar 2.0 for ads, explainers, that [music] kind of content. Day five marked the last day of their Omni launch week, and they ended it with a bang. Cling launched their element library. You can now build your elements with images from multiple angles and have Clingo One remember your characters, items, and backgrounds for consistent results regardless of how the camera moves or how the [music] scene develops. Alex Patrascu, the creative partner of Clingi, made an epic film using Cling, specifically the [music] the element library and shared it on Twitter. The quality of this 6-minute film shows how good this Cling lineup is. So that's the full week, five updates, one platform.",
        "start": 330.96,
        "duration": 943.2800000000002
    },
    {
        "text": "the [music] scene develops. Alex Patrascu, the creative partner of Clingi, made an epic film using Cling, specifically the [music] the element library and shared it on Twitter. The quality of this 6-minute film shows how good this Cling lineup is. So that's the full week, five updates, one platform. contest running until December 14th. Top prize being a,000 bucks. Cling came out of nowhere and seized the video gen game. Now, who will take this crown next? I might know the answer to that. Runway just released their new video [music] gen model and it's insane. Runway Gen 4.5 produces cinematic and highly realistic outputs while providing limitless creative freedom and precise control over every aspect of generation. It understands real world physics way better. Objects move with actual weight and momentum. Surfaces behave like they would in real life. Gen 4.5 can follow complex prompts with camera choreography, scene timing, and atmosphere changes in one go. Texttovideo, imagetovideo, key frames, videotovideo. All coming to this model. 2 years ago, they launched Gen 1, the first public video generation model. Now, their latest model, Gen 4.5, is the number one AI video model in the world. It [music] scored 1,247 ALO on the artificial analysis leaderboard, beating every other AI video model in the world. It's rolling out now and will [music] be available to everyone in the coming days. Runway Gen 4.5 is now the new standard for AI videos. Korea just dropped something huge. They are calling it node app builder and it lets you turn your workflows into simple apps that anyone [music] can use. So, Crea Nodes lets you chain together 50 plus AI models, image generators, video tools, audio, 3D into one workflow. But now with Node App Builder, you can package any of those workflows into a clean app. There's a new button on the left sidebar of create nodes. Click it to activate the [music] app builder. From there, you click on any property in your nodes to make it an input. Scene descriptions, file uploads, whatever you want users to control. And yeah, you can add multiple inputs, then you click the output of any node [music] in your workflow to display it in the final app. Let's say you want to build a photo shoot app. You upload a product image, type a scene description like underground cinematic [music] or snow mountain, and it generates insane product renders automatically. You can rename each input [music] and output from the sidebar, and you choose who sees your app, public, private, or only visible [music] to your teammates. Your workflow can now become apps for the whole world to use. In robotics, we have some good news from Tesla. They just shared a video on Twitter where the Tesla Optimus is seen running. Now, some internet analysts have claimed this might be the fastest running humanoid robot at 8.5 [music] mph. This record is currently officially",
        "start": 488.24,
        "duration": 1246.000000000001
    },
    {
        "text": "whole world to use. In robotics, we have some good news from Tesla. They just shared a video on Twitter where the Tesla Optimus is seen running. Now, some internet analysts have claimed this might be the fastest running humanoid robot at 8.5 [music] mph. This record is currently officially Star won at 8 mph. But here's the insane part. Just 2 and 1/2 years ago, this thing could barely walk. Now, it's potentially matching [music] the world's fastest humanoid robot. Pilot production is already running at their [music] Fremont factory. They're planning a bigger Gen 3 production line for 2026, and [music] they're targeting a cost of just $20,000 per robot. What most people miss is that Optimus runs on the same tech as [music] Tesla's cars, same batteries, same AI chips, same training data from billions of miles driven. A lot of people still think humanoid robots will never be practical. But when someone like Elon Musk is investing this heavily into it, maybe it's worth paying attention. And honestly, I think we're just getting started. Last month, Tesla shareholders approved Musk's trillion dollar pay package. And this is how they celebrated. [music] The next few years in robotics are going to be insane. Now for our [music] top 10 coolest AI tools that launched this week's segment where we look at the most fun and underrated tools. Let's go. Number one, Sticker Box is screenfree AI for children. You talk to it and it prints stickers. No phone, no screen, [music] just a thermal printer that turns your voice into instant stickers. Number two, 11 reader reads anything out loud with supernatural AI voices, books, PDFs, articles, anything. Students and teachers get it free for a whole year. Number three, App For Studio lets you build real iPhone apps just by chatting on your phone. No laptop needed. Just describe your app and it builds it. Number four, Clever teaches you [music] software without switching tabs. It watches your screen and shows you exactly where to click in Figma or Blender. No more pausing tutorials. Number five, XDesign 2.0 [music] keeps your branding consistent. It creates something called brand DNA. So your logo, [music] packaging, and signs all look like they came from the same designer. Number six, Gleam roast your designs before you launch. It gives you feedback from 10 different AI [music] experts like an accessibility checker or a harsh critic. Number seven, Neural Agent takes over your computer. It's not a chatbot. [music] It actually clicks, types, and scrolls through your apps to finish tasks while you watch. Number eight, Taskade Genesis builds entire workflows from one sentence. You type what you need and it creates the whole system with AI agents already working. Number nine, Protage is like having a marketing agency in the cloud. You give it your brand rules and it creates the whole campaign with [music] copy, strategy, and visuals. And number 10, Superfill. This one's wild. It remembers",
        "start": 640.959,
        "duration": 1558.9440000000006
    },
    {
        "text": "and it creates the whole system with AI agents already working. Number nine, Protage is like having a marketing agency in the cloud. You give it your brand rules and it creates the whole campaign with [music] copy, strategy, and visuals. And number 10, Superfill. This one's wild. It remembers applications, essays, anything. One click and it's done. Works offline and stays private on your device. Which one of these tools are you trying first? Let me know in the comments. Open AAI is in panic mode. China keeps dropping free models that embarrass billiondoll labs. And the AI video war just hit a whole new level. Drop a comment with your thoughts and subscribe for next week's AI news. See you then.",
        "start": 805.6,
        "duration": 1606.9440000000004
    }
]