[
    {
        "text": " Google just dropped Gemini 3 Flash and it may be the best model on the planet. Not in terms of just acing every benchmark, which it kind of does, but also because it is a fraction of the cost, extremely fast, and very efficient. And here's the catch. It actually beats Gemini 3 Pro at coding. You now have one of the best coding models on the planet with Gemini 3 Flash, which is insane to think about. All right, let me show you this quick comparison. On the left, we have Gemini 3 Flash. On the right, we have Gemini 3 Pro, and they're both going to create a Flock of Birds simulation. All right, so after 21 seconds, we have a full flock of birds simulation using only 3,000 tokens. Very few tokens, and Gemini 3 Pro is still building, but this simulation is quite good. Let's look. Yeah, pretty darn good. And now after 28 seconds, we have what I consider a less good version of a flock of birds simulation. It used just about the same amount of tokens, but those tokens were much cheaper and much faster. Let's look at one more here. They're both going to build a 3D terrain with a blue sky. Just over 15 seconds. We have Gemini 3 Flash's version using 2600 tokens. And that's pretty nice. 3D looks good. Everything's consistent. and Gemini 3 Pro is still working. Now, here's something interesting. It went up to 4,300 tokens, many more than Flash, and it took three times as long to generate. Now, let's look at the results. I think they both look really good. I wouldn't say one is better than the other. The one on the right has some fog, and the one on the left looks to be a little bit more detailed, but overall, cheaper, faster, and equally as good. All right, and last, a weather app. Again, look at the difference. 4,500 tokens for Flash, 6,100 tokens for Pro, 24 seconds to build it for Flash, 67 seconds to build it for Pro. And look, one definitely looks better than the other. My personal preference is Flash. Let's look at what they actually look like live. We have movement. It's very beautiful. And then we have something very simplistic on the right. Okay, so as you can see, we have something special on our hands. Let me show you the full benchmarks. So, here are the benchmarks. We have Gemini 3 flash thinking and first of all it is a fraction of the price. So input price 50 cents per million tokens versus Gemini 3 Pro which is $2 that is 25% a quarter of the price. And then let's compare it obviously to GPT 5.2 it is about a third of the price and Claude Sonnet 4.5 it is about6th of the price. Now comparing humanity's last exam, it scores a 33 and a 43% as compared to GPT 5.2, 34, and",
        "start": 0.08,
        "duration": 333.75999999999993
    },
    {
        "text": "quarter of the price. And then let's compare it obviously to GPT 5.2 it is about a third of the price and Claude Sonnet 4.5 it is about6th of the price. Now comparing humanity's last exam, it scores a 33 and a 43% as compared to GPT 5.2, 34, and does get beat by Gemini 3 Pro, but just barely. GPQA Diamond, which is a scientific knowledge benchmark. We have a 90% versus 91 for Gemini 3 Pro and 92 for GPT 5.2. Here's MMU Pro, multimodal understanding and reasoning, the number one model out of everything. It is absolutely crazy. Amy 2025 with code execution getting nearly 100% versus 100% for Gemini 3 Pro, 100% for GPT 5.2. Now, here's the wild one. Sweetbench verified. Here we are. 78% versus 76% for 3 Pro, which means it actually beats Gemini 3 Pro at coding for the SweetBench verified benchmark. Now, still the number one model, GPT 5.2, coming in at 80, but they're basically right around the same score. Here's another important graph to look at. On the y-axis, we have the LM arena ELO score. On the Xaxis, we have the price per million tokens. So, really, what you want to have is the highest and most to the right. So, all of these on the outside are the best. And what we're seeing right here, Gemini 3 flash as compared to Gemini 2.5 Flashlight. The reason 2.5 Flashlight is all the way down here is because the ELO score is quite low. All of a sudden, we have this huge jump in ELO score and it is much cheaper. So really, it almost reaches Gemini 3 Pro's LM Arena score while also being much cheaper. And I'm already starting to use this model in some of my automations. And if you want to learn what automations I'm talking about, let me tell you about the sponsor of today's video. I've partnered with HubSpot to bring you the nine most powerful automations that my business actually uses. So, if you've ever wondered how I stay up to date on everything in the AI industry, it is obviously by using a ton of automation. And that's why I recommend downloading for free the nine AI automations that power Forward Future, my company. This is a completely free behindthe-scenes tour on how we automate every aspect of the business from our automated research assistant to our media to content pipeline to making sure that we take our content and get it to every platform. My favorite part is that these automations are generalized and can apply to any business, not just if you're a content creator. So, this resource is provided for free by HubSpot. I worked with them directly to show them what I was doing. They documented it and now you can download it. So, go get this guide. I'll drop a link down in the description below. And thanks to HubSpot for sponsoring this",
        "start": 167.12,
        "duration": 622.6399999999998
    },
    {
        "text": "this resource is provided for free by HubSpot. I worked with them directly to show them what I was doing. They documented it and now you can download it. So, go get this guide. I'll drop a link down in the description below. And thanks to HubSpot for sponsoring this It can understand video, images, audio, text, anything you throw at it, it can understand. And it is quickly becoming the default model across all of Google's suite of products. most importantly is Google search and specifically AI mode. This was a no-brainer. The vast majority of searches do not require prolevel reasoning and even if they did, Flash basically achieves it. So, you have a much cheaper, much more efficient, just as good model serving up AI mode queries. This is why I think this might be the most economically viable model on the planet. You're going to be getting search results back faster. You're going to get follow-ups back more quickly. And Gemini 3 Flash is now the default model in the Gemini app, replacing 2.5 Flash. All Gemini users globally will get access to the Gemini 3 experience at no cost, giving their everyday task a major upgrade. They are giving this model away. I can't emphasize enough how critically and competitively important this is. The math makes sense for them. And as I've been saying, Google is incredibly well positioned to win or dominate the AI race. They have now the best models, the cheapest models, the fastest models. They have all of the distribution by putting Gemini in all of the different products that they offer. They have all of the data in the world. They have their own custom silicon. It is Google's game to lose at this point. And if you're a vibe coder or if you use any agentic coding at all, Logan Kilpatrick says Gemini 3 Flash is the new default for vibe coding. Obviously, he's going to say that, but also obviously it's kind of true. Many of the agentic coding companies like Windsurf and Cognition with Devon and Cursor, they all made their own small, fast, really good at coding models. But then all of a sudden, Google offers it for free. And it's so good and oftentimes better than their in-house models. I mean, look at this. Here it is on humanity's last exam. It is really close to Gemini 3 Pro and really close to GBT 5.2. So, it is basically the frontier of intelligence at a fraction of the cost and multiple times faster. And it's not just faster in terms of how many tokens it can output per second. It's actually more efficient with those tokens as well. So this is an average of token usage against all of the Gemini models. And as you see, Gemini 3 Flash on average uses less tokens for the same result. Here's Paul Klein from browserbase. We got early access to",
        "start": 313.84,
        "duration": 935.1989999999996
    },
    {
        "text": "second. It's actually more efficient with those tokens as well. So this is an average of token usage against all of the Gemini models. And as you see, Gemini 3 Flash on average uses less tokens for the same result. Here's Paul Klein from browserbase. We got early access to stage hand agent, it nearly matched accuracy with Gemini 3 Pro while being cheaper and faster. This is especially important for computer use models because they typically tend to be very slow and sitting there watching them take a screenshot of the screen or look at the DOM, click into it, it is brutally slow and now we have a really fast model to work with. Here's the artificial analysis intelligence index. It went from here's Gemini 2.5 flash all the way to boom Gemini 3 flash reasoning beating Claude Opus 4.5 right below GPT 5.2 to extra high and below Gemini 3 Pro. So, it is amongst the best models right now. And Gemini 3 Flash is also doing well on ELO for Ella Marina. Here it is coming in at number three, just below Grock 4.1 Thinking and Gemini 3 Pro at number three, which is excellent. And I know you guys are sick of me saying this, but I just want to keep hammering it home. It is very good, very efficient, very fast. Here's ARC AGI1 by the ARC prize. Gemini 3 flash preview high gets 84.7% at 17 cents per task and ARGI 2 33.6% 23 cents per task. Competitive performance at substantially lower cost than other Frontier models. Aaron Levy from Box released their benchmarks. They are only comparing versus Gemini 2.5 Flash, but as you can see a much improved quality score across the board. And of course, yes, you've heard me say it. Cheaper, faster, better. Yes, yes, yes. So, this is an incredible model and the best part, you basically get it for free. Go to Gemini, go to AI mode in Google search. This model is free and fast and great and Google's not paying me to say any of this. I just really think this is the way to go. I am a speed maxi. But when you also pair that with having extremely high quality frontier model quality, you have something special. If you enjoyed this video, please consider giving a like and subscribe.",
        "start": 472.479,
        "duration": 1174.4790000000003
    }
]