[
    {
        "text": " Anthropic just dropped a model so good it crashed the stock market. Open AAI is building a device that sits behind your ear. No screen, no phone, just your voice. And Johnny IV is designing it. Google is testing its AI by making it play werewolf against other AIs. Elon just merged SpaceX and X AI into a $1.25 trillion company. And Claude Claude went to war with Open AI at the Super Bowl. Sam Altman did not take it well. Welcome back to AI updates of the week. I've built three startups, raised 5 million from Sequoia, and I use AI 8 to 10 hours a day to run my business. So, when I tell you this was the most chaotic week in AI this year, I mean it. 10 updates dropped. Some of them will change how you work. One of them might replace tools you're paying hundreds of dollars a month for. And one of them made a billionaire mass delete his tweets. And that's just four of them. Here's what else dropped. Number one, a model that argues with itself before answering you. Number two, an app Google just made dangerous. Number three, a coding AI that helped build itself. Number four, agents competing in a hackathon. No humans allowed. Number five, cinematic AI video that looks like Netflix shot it. Number six, five new tools you need to know about, plus deep dives on everything I just hit you with. And at the end, I'm going deep on Claude Opus 4.6. The model Anthropic says is the smartest AI on the planet right now. I've been testing it for days. I'm going to show you exactly what it can do, how to use it, and the workflow that replaced three paid tools I was running my business on. That deep dive alone is worth the entire video. 10 updates. Let's get into it. Let's start with Open AI because something happened during the Super Bowl this weekend and honestly, I still don't know what to make of it. A Reddit user shows up claiming to be an OpenAI employee. Says the company had a completely different Super Bowl ad ready to go, but pulled it at the last minute because Anthropic had been running ads mocking them all week. Leadership panicked, swapped in the safer codeex ad, and that was that. But then this person leaked the original ad. And it's not what you'd expect. Alexander Scarsgor, real actor. You've probably seen him in a dozen movies. Sitting in front of this beautiful metallic stone-like device, two silver earbuds that wrap around the back of his ear. He's looking at it like he's curious, but also a little afraid to touch it, right? He picks it up, starts warming up to it, stands, catches his reflection in a mirror, and then two words flash on screen. Dime. Almost time. First time anyone's ever heard that name. Within hours, OpenAI shut it down. Head of com",
        "start": 0.08,
        "duration": 321.92099999999994
    },
    {
        "text": "also a little afraid to touch it, right? He picks it up, starts warming up to it, stands, catches his reflection in a mirror, and then two words flash on screen. Dime. Almost time. First time anyone's ever heard that name. Within hours, OpenAI shut it down. Head of com CTO, two words, fake news. Reddit account deleted. But here's where it gets weird. A tech reporter shared screenshots of an email he'd received a week before the game. Someone offering him over $1,000 to promote a tweet about this exact ad. Someone spent real money to make this go viral. Here's the thing. I don't care if that ad is real or fake because the device it showed that matches everything we already know. Multiple reports, Hypebeast, Gizmoina, a Chinese patent filing that went public, all confirm Open AI is building a behind the ear device. Internal code name Sweet Pea. Consumer name from that patent dime. Eggshaped metal body. Pill-like modules behind your ear. Johnny IV is designing it. The guy who made the iPhone look like the iPhone. OpenAI paid $6.5 billion for his company and Sam Altman saw the first prototypes and said his exact words, jaw-droppingly good. Now, let me tell you why this actually matters to you. Right now, if you want to use Chat GPT, what do you do? You pull out your phone, you open an app, you type, but Apple and Android own that whole ecosystem. You know, Open AI doesn't control anything about how you access their product. So, what do they do? They go around the phone entirely. No screen, no typing, just your voice. Chat GPT running locally right behind your ear. Calendar, messages, Uber, all by speaking. Think about that for a second. Foxcon, same company that builds iPhones, is manufacturing this. They're targeting 40 to 50 million units in the first year alone. Audio only version shipping late 2026. A more advanced version with full sensors comes later once chip costs come down. They're not just building AI anymore. They're building the device you'll use it on. And whether that Super Bowl ad was real or not, the device is coming this year. We've got more OpenAI updates later, including a coding model that helped build itself. But first, Perplexity just dropped something interesting. Perplexity just upgraded Deep Research, and they're claiming state-of-the-art performance on accuracy and reliability, outperforming other deep research tools on external benchmarks. You ask a complex question. It searches multiple sources in real time and generates a full research document with citations, timelines, and comparison tables, all exportable to markdown or Google Drive. Available now for Max users rolling out to Pro in the coming days. But the more interesting feature is Model Council. Instead of picking one AI model and hoping it's right, Model Council runs three Frontier models at once. GPT 5.2, two, Claude Opus, Gemini Pro, whatever you want, and compares their outputs",
        "start": 164.8,
        "duration": 646.0799999999998
    },
    {
        "text": "Max users rolling out to Pro in the coming days. But the more interesting feature is Model Council. Instead of picking one AI model and hoping it's right, Model Council runs three Frontier models at once. GPT 5.2, two, Claude Opus, Gemini Pro, whatever you want, and compares their outputs three research independently, and Perplexity synthesizes the results, showing where models agree, where they disagree, and why. So, you get a breakdown of which findings have high confidence across all three versus which are model specific interpretations. Web only and max only for now, but it's a clever approach to the which a I should I trust problem. Just run all of them and see where they converge. Quick update from Google. Notebook LM just got more portable. You know those AI generated video overviews now available on mobile full screen. Open a notebook, tap the video you want, rotate your phone, and you're watching. Doesn't sound like much until you realize you can now consume research, notes, documents anywhere. Small update, big convenience. Learning just became an anywhere activity. If you're finding this useful, hit subscribe. I do this every week. I also share stuff daily on WhatsApp. Tool drops quick tips link in the description. Anthropic just ran a Super Bowl ad mocking OpenAI. And Sam Alman did not take it well. OpenAI announced ads are coming to Chat GP's free tier. Anthropic's response, a whole ad campaign with the tagline, ads are coming to AI, but not to Claude. The ads show people in personal moments talking to a therapist, asking for advice, then getting interrupted by jarring product placements. Or if the relationship can't be fixed, find emotional connection with other older women on Golden Encounters, the mature dating site that connects sensitive cubs with roaring cougars. What? It's funny, it's dramatic, and it's clearly aimed at one company. Sam Ortman said the ads were funny. He laughed, then wrote a 400word essay calling them clearly dishonest. But here's the thing, he didn't just defend himself. He went on offense. He said 500,000 people downloaded the Codex app since Monday and ended with, \"I believe Codex is going to win.\" So, we've got Claude mocking ads, OpenAI defending ads, and both companies facing off at the Super Bowl. OpenAI just fired back at Cloud Code and Co-work and they brought a model that helped build itself. GPT 5.3 Codeex is the most capable coding model yet, 25% faster than the previous version and it's the first one they used to debug its own training and manage its own deployment. They said the team was blown away by how much it accelerated its own development. This is OpenAI's direct answer to anthropic. Same idea, AI that doesn't just help you code, it does the coding for you. The difference is OpenAI is betting on running multiple agents in parallel instead of one really good one. And here's the thing, they released it minutes after Anthropic dropped their",
        "start": 329.44,
        "duration": 978.2400000000006
    },
    {
        "text": "OpenAI's direct answer to anthropic. Same idea, AI that doesn't just help you code, it does the coding for you. The difference is OpenAI is betting on running multiple agents in parallel instead of one really good one. And here's the thing, they released it minutes after Anthropic dropped their exactly where this competition is headed. OpenAI SweetP hardware. But OpenAI's bigger bet isn't software, it's hardware. They're building an AI device called Sweet P. It sits behind your ear, runs chat GPT locally and lets you access everything. Calendar, Uber, messages, just by speaking. No phone, no screen, voice only. Johnny IV is designing it. The guy who made the iPhone, Open AI, paid $6.5 billion for his company. And they walked away from powering Apple Siri to build this. Instead, they're not just building AI, they're building the device you'll use it on. OpenClaw just launched the first hackathon where every single participant is an AI agent. No humans coding, no humans managing, no humans reviewing. Agents team up with each other, build the project, and ship it themselves. $10,000 prize pool, one week, fully autonomous. But when AI agents are building and sharing code without human review, security becomes a real question. So, OpenClaw partnered with Virus Total to scan every skill on Claw Hub for data exfiltration, unauthorized commands, and malicious payloads. Anything suspicious gets flagged, anything malicious gets blocked instantly, and every version gets a unique hash fingerprint with daily rescans. AI agents competing in hackathons and the code getting security vetted automatically. That's the infrastructure for autonomous software development starting to take shape. Elon Musk just made the largest merger in history. And it's not on Earth. SpaceX acquired XAI, combined valuation, $1.25 trillion, world's most valuable private company. Here's the thing. Musk isn't just combining companies. He's betting on AI data centers in space. Unlimited solar power, no cooling problem. He thinks in two to three years, orbit will be the cheapest place to run AI. SpaceX launches the satellites. XAI builds the models. Starlink runs the network. IPO coming this year. Whether you're in or out on Musk, nobody else is even attempting this. And speaking of XAI, quick Grock update. You can now send voice messages directly in the app. Record your note, hit submit, Grock transcribes and response. No typing, just talk. Small feature, but if you're using Grock on mobile, way faster. Available now. Higsfield had a massive week. Two releases that genuinely change what's possible with AI, video, and motion design. Let me walk you through both. First up, Cling 3.0 is live. And I'm going to be real with you. This isn't just an incremental upgrade. Remember when AI video meant 4 seconds of blurry motion and weird hands? Yeah, that era just ended. Multi-shot sequences. You give it one key frame, it builds a consistent story across multiple shots, same characters, same style, connected scenes, not random generations stitched together. Actual narrative continuity. Native audio with",
        "start": 499.12,
        "duration": 1329.601
    },
    {
        "text": "when AI video meant 4 seconds of blurry motion and weird hands? Yeah, that era just ended. Multi-shot sequences. You give it one key frame, it builds a consistent story across multiple shots, same characters, same style, connected scenes, not random generations stitched together. Actual narrative continuity. Native audio with slapped on voice over that doesn't match. Actual spatial sound that moves with the scene. Multilingual dialogue. Two characters can have a real conversation. Different languages. Actual emotion in the delivery. And this one's wild. 15 seconds of continuous generation. Macro close-ups with dynamic camera movement. Action sequences that actually look like action sequences. Night and day from where we were 6 months ago. But Higsfield didn't stop there. They dropped Vibe Motion, first AI motion design tool with full realtime control. If you've ever spent three hours in After Effects building an infographic that should have taken 20 minutes, this is for you. One prompt, infographics, logo animations, text effects. You describe what you want, it builds it. But you are not stuck with what it gives you. Fonts, colors, transitions, all adjustable live on canvas. Realtime refinement. Drop a logo. Get multiple variations, different colors, different styles. Pick the one you want, tweak it, done. Two tools, one for AI video that actually looks cinematic, one for motion design you can control in real time. Both unlimited on Higsfield. All right, quick rundown. Five tools that just dropped. Crisp AI, first customer support that brings chat, email, WhatsApp, and phone calls into one workspace. It answers customers, routes tickets, and keeps the human touch when you need it. Support at scale without hiring a team. Vzero by Versal. Describe what you want to build in plain English. It generates full stack web apps. Design, iterate, deploy. That's the game now. Gen store. Create and launch a new store in minutes. AI agents handle everything from setup to design to marketing automation. You focus on selling, they handle the rest. Basel, upload messy data, get beautiful slides. Their AI analyst cleans, crunches, and charts everything, then builds the presentation for you. Rerun on new data instantly. Same insights, zero effort. Relay.app. Build a team of AI agents that work across Gmail, Notion, HubSpot, and hundreds of other apps. They work proactively day and night and get better over time. All links in the description. Anthropic just dropped a model so good it crashed the stock market. Not crypto, not a meme stock. Actual software companies lost $285 billion in market cap because of what this thing can do. It's called Claude Opus 4.6. And here's why Wall Street panicked. This isn't just a smarter chatbot. Anthropic built something that handles real work across finance, legal, marketing, coding, and it does it better than specialized software that companies pay thousands of dollars a month for. The numbers back it up. On a benchmark that tests real knowledge work across finance and legal, Opus 4.6 beat OpenAI's GPT 5.2 by 144",
        "start": 676.72,
        "duration": 1675.8429999999998
    },
    {
        "text": "handles real work across finance, legal, marketing, coding, and it does it better than specialized software that companies pay thousands of dollars a month for. The numbers back it up. On a benchmark that tests real knowledge work across finance and legal, Opus 4.6 beat OpenAI's GPT 5.2 by 144 65.4% on Terminal Bench 2.0. the highest in the industry. And for the first time ever, an Opus model gets a 1 million token context window. That means you can feed it an entire codebase, an entire legal contract, an entire project spec in one go. And here's what's cool. Pricing didn't change. Still $5 per million input tokens. If you're on Claude Pro or Max, you already have access. But here's the thing. The model is only half the story. What actually scared Wall Street is what Anthropic built on top of it. They launched something called co-work plugins and I want to show you exactly how it works because this changes how you use claude for actual work. So co-work is basically claude's workspace mode. Instead of chatting back and forth, you give it a goal and it goes and does the work, makes presentations, runs analysis, writes campaigns, finished outputs, not just suggestions. Now they added plugins. Think of them like specialist modes. You install one and Claude gets the skills, the tools, the shortcuts for that specific job. There are 11 at launch. Marketing, sales, legal, finance, productivity, data, and more. Let me walk you through how this actually works. I'm going to install the marketing plug-in. One click. That's it. Now, look at what just opened up. You've got shortcuts for brand reviews, campaign planning, competitive briefs, SEO audits, content drafts, and on the connector side, it can plug into Slack, Canva, Figma, HubSpot, Notion, RFS, and more. But let me show you the real power here. I'm going to run the campaign planning command. Claude starts asking me questions. What's the campaign for? Brand awareness. Who's the audience? B2B professionals. Format PowerPoint deck. Brand name I type in outskill/growthchool school timeline 4 weeks budget under 10,000 channels LinkedIn and content marketing. Now watch what happens. Claude doesn't just write a plan. It reads your brand guidelines, researches your company, builds a full strategy, creates a content calendar, and then designs a 12 slide PowerPoint deck from scratch. It even checks the slides for problems, catches overlap issues, fixes text overflow, and delivers a clean final file. Look at this. A fully branded 12 slide campaign deck, executive summary, audience segments, messaging strategy, channel mix, budget allocation, KPIs, a 4-week sprint plan, all with our brand colors and formatting. This took Claude about 3 minutes. That's a deliverable that would take a marketing team half a day minimum. See the difference? This isn't Claude giving you bullet points in a chat window. This is Claude doing the work, making decisions, handling the formatting, and handing you a file you can actually present. And marketing is",
        "start": 857.92,
        "duration": 2011.840999999999
    },
    {
        "text": "That's a deliverable that would take a marketing team half a day minimum. See the difference? This isn't Claude giving you bullet points in a chat window. This is Claude doing the work, making decisions, handling the formatting, and handing you a file you can actually present. And marketing is prep and prospect research, legal for contract review, finance for spreadsheets and reconciliation, data for queries and dashboards. Each one turns Claude into a specialist for that function. I've been testing all 11 plugins. If you want me to do a deep dive on sales, legal or finance, drop a comment and tell me which one. That's this week. I share stuff daily on WhatsApp. Quick tips, tool drops, things that don't make it into these videos. Links below. I do this every",
        "start": 1029.679,
        "duration": 2069.6819999999993
    }
]