[
    {
        "text": " Cursor charges 1,700 rupees a month. Lovable wants 2,200 rupees. Emergent v 0ero. All of them want your money before you [music] can build anything. Google just dropped a vibe coding tool that's completely free. And [music] honestly, it's better than all of them. I'm not a developer. I can't write a single line of code. [music] But in the last week, I built a portfolio website worth 70,000 rupees, an invoice system for my freelance work, [music] and actual playable games. I didn't even expect the last one to work, but we'll get there. If you're a freelancer, a marketer, a student, or just someone with ideas, but no coding skills, this video is for you. All right, number one. This one's for every Indian freelancer who's ever lost money because writing invoices feels like homework. Watch this. I'm just telling it exactly what I need. take my messy project notes, turn them into clean line items, and give me a professional invoice I can download as a PDF, and now it's thinking. You can actually see its brain working here, defining what needs to be built, figuring out the structure. It's like watching someone sketch out a blueprint in fastforward. See that checklist on the right? That's every feature it's about to build. Input interface, parsing logic, email templates. It basically turned my one paragraph into a full project plan. Now, here's where it gets interesting. It shows me exactly how it's going to build this. And I just click proceed. That's it. Okay. So, something cool is happening here. It ran into a problem. It couldn't find a certain tool it needed. But instead of crashing or giving me some error message, I don't understand. Watch what it does. It figures out what is available and changes the plan. It found Python on my computer and just adapted. This is what makes this feel different. It problem solves as a person would. Now, it's actually writing the code. And there it is, my invoice generator running and working. Look at that. If you're sending 10 invoices a month, this tool just took that entire stress away from you. No code, no templates, just a real tool built from a simple prompt. Okay, now number two. And honestly, this one kind of blew my mind. I'm typing in everything I want. Hero section with animations, about section with stats, a portfolio grid with filters and hover effects, testimonials, contact form, dark mode toggle, and make it mobile responsive. Color scheme, deep navy, and gold. And then I added this. Make it look like I paid $5,000 for this. Now in India, for a website like this, agencies easily charge 50 to 70,000 rupees. Let's see what happens. It's processing everything I asked for. You can see it thinking through the requirements, figuring out how to structure this. It even caught a small issue and fixed it before moving forward. Here's the plan.",
        "start": 0.08,
        "duration": 329.759
    },
    {
        "text": "a website like this, agencies easily charge 50 to 70,000 rupees. Let's see what happens. It's processing everything I asked for. You can see it thinking through the requirements, figuring out how to structure this. It even caught a small issue and fixed it before moving forward. Here's the plan. JavaScript file. Simple, clean. [music] It tells me exactly what it's about to create. And I just hit proceed. Now watch the checklist on the left. Hero section done. About section done. Portfolio grid done. Every feature I asked for just getting checked off one by one while the code writes itself on the right. This part still gets me. I'm literally watching my website being built in real time. It's writing actual code based on what I described. Finished. Let's see what we got. Okay. Wow. Everything I asked for is here. This is huge for freelancers, designers, developers, coaches, anyone selling services. When a client sees a website like this, your perceived value increases five times in their mind. And if you're a student or fresher, this is how you can make your portfolio for placements, internships, or remote jobs with global clients. I've got a WhatsApp community where I drop everything I discover. Tools, workflows, updates, all in one place before they go mainstream. If you want access, links in the description. All right. Now, number three, and the reason I made this video, I wanted to test how far this thing can go. So, I asked it to build actual games, not simple quizzes. Real playable games with graphics, logic, and everything. Let me show you three of them. Game one, French Revolution Survival. What if you could turn boring history chapters into games where you actually want to learn? I asked it to build a text adventure game based on the French Revolution. I play as a peasant baker in Paris, 1793, trying to survive the reign of terror. 10 or more decision points where my choices actually matter. And I want it immersive. And look at what it's building. It's creating an actual game engine, [music] an inventory system, a reputation tracker that measures your revolutionary fervor versus royalist sympathy. This thing is going to remember every choice I make. Now, it's coding. I'll speed through this part, but I want you to understand what's happening. It's building the entire game from scratch. The structure, the styling, the logic, every single scenario, all those decision points I asked for, it's writing all of them. And here we go. It's opening the browser to test it. Look at that. Paris 1793. A baker's tale of the reign of terror. Let's play. First scenario. A neighbor is watching me. Do I wear the revolutionary cockade or not? I'll pin it but avoid eye contact. Next. A wealthy merchant wants me to bake illegal white bread. Risky, but I need the money. I'll do it secretly. I'm being ordered to attend a public",
        "start": 168.48,
        "duration": 615.52
    },
    {
        "text": "First scenario. A neighbor is watching me. Do I wear the revolutionary cockade or not? I'll pin it but avoid eye contact. Next. A wealthy merchant wants me to bake illegal white bread. Risky, but I need the money. I'll do it secretly. I'm being ordered to attend a public I need to tend my ovens and I'm dead. Summoned before the revolutionary tribunal. But look at the bottom. It even gives me a historical fact about why that choice was dangerous. This isn't just a game. It's a history lesson that I actually want to take. Now imagine this for the Indian syllabus. 1857 revolt, non-ooperation movement, quit India or GE physics concepts, neat biology chapters. If this AI can build such a deep historically accurate game on the French Revolution, imagine what it could do for your exams. Okay, so that was educational. But what about just pure fun? I asked it to build a match three puzzle game. You know, like Candy Crush but with fruit emojis. The AI starts processing. [music] You can see it generating the code in real time. It's writing the HTML structure, the [music] CSS styling for the grid and animations and all the JavaScript logic for the game mechanics. In about a minute, it says it's done. Created a file called index.html with everything inside. I open it in my browser and there it is. Fruit Crush, purple background, score counter at the top, and a full grid of fruit emojis. Apples, grapes, watermelons, all of it. Now, let's see if it actually works. And look, it actually works. I'm playing this thing just like Candy Crush, swapping fruits, making matches. The score keeps climbing. This is a fully functional puzzle game built in under 2 minutes and built from one simple [music] prompt. All right, let's end with something that really shows off what this thing can do. I asked it to build an arcade racing game. I called it turbo lane. A vertical road with three lanes, a player car at the bottom, enemy cars coming down, arrow keys to dodge, collision detection, and a score that increases as you survive. The AI has started working and it's done. Let's open the file. There's the game. Let's play. Wow, this is amazing. Three games built in minutes without any coding or game engines. If this helped, like and subscribe. Drop a comment telling me what you'd build with this. And if you liked anti-gravity, then Google has six more free AI tools that are just as insane.",
        "start": 313.68,
        "duration": 859.6780000000002
    }
]