[
    {
        "text": " Claude just beat every single human engineer at Anthropic's own test. Open AAI and Perplexity are at war over your wallet this Black Friday and an Indian startup just built the India's first AI drone killer. I filtered through 40 plus updates so you don't have to. These 10 made the cut. Stay till the end for our AI tool section. Tool number seven is the one we've all been waiting for. Let's get into it. But before we dive in, I share updates like these daily on my free WhatsApp community. links in the description. Big thanks to Multi for sponsoring this video. More on them later. And heads up, there's a free Microsoft AI tool hidden somewhere in this video, but it expires tonight. So yeah, don't skip. All right, let's get into it. Anthropic just dropped Claude Opus 4.5 and it's doing something no AI has done before. It beat every single human applicant on Anthropic's own engineering test. This is the same test they give to prospective engineers at Anthropic. Two hours of intense face off and the AI crushed it. But that's not even the craziest part. They pitted Opus 4.5 against Sonnet in a puzzle room challenge with seven locked doors. And here's what'll blow your mind. Sonnet took 6 minutes and [music] cost $422. Opus finished faster and cost 95. This is surprising because Sonnet is cheaper than Opus. You must be thinking how? Well, Opus writes actual code to solve problems instead of forcing guesses. It thinks before it acts. It also hit 80.9% on SWE Bench. That's the real world coding test that [music] matters. And it's the first model ever to go over 80%. Okay, that's pretty impressive, but I want to see for myself how good it is. This is where our sponsor for today steps in. Multi lets you run multiple AI models side by side and compare their outputs in real time. Let me show you. So we have Multi here and I've selected three models to pit against each other. Claude Opus 4.5, Claude Sonnet 4, and Gemini 3 Pro. First test, I'm going to give them a simple creative challenge. Write a sixword story where each word starts with these letters in order. S T A R Ts. Let's hit send. Okay. Claude Opus 4.5 has already given its answer. Claude Sonet 4 was just one step behind and Gemini 3 Pro was the slowest of them all. So yeah, Opus 4.5 is definitely faster. But you know what? Let's take it a step further with something harder. I'm going to give them a probability puzzle. There's my prompt and I'll hit send. Okay, Sonnet has already started. Opus has started as well. Gemini 3 Pro has not even begun yet. And Sonnet 4 is done with its answer. Opus 4.5 just took a second more than Sonnet, but look at this. Opus went way more in depth with proof of optimality, exact probability",
        "start": 0.24,
        "duration": 330.799
    },
    {
        "text": "Sonnet has already started. Opus has started as well. Gemini 3 Pro has not even begun yet. And Sonnet 4 is done with its answer. Opus 4.5 just took a second more than Sonnet, but look at this. Opus went way more in depth with proof of optimality, exact probability Gemini's answer is the shortest one. Meanwhile, Opus 4.5 has gone into serious detail. So, they're both definitely faster than Gemini 3 Pro. Sonnet 4 and Opus 4.5 are close to each other in speed, but Oppus gave away more detailed answer. So technically Claude Opus 4.5 is the fastest of them all. If you want to run tests like this yourself, compare models, find what actually works for your use case, check out multi at getmulti.ai. Link in the description. Claude Oppus 4.5 is available right now on every major cloud platform. We're watching AI models become actual engineers. What do you think comes next? Open AAI just turned chat GPT into your personal shopping assistant. And the timing is insane. They dropped this right before Black Friday. So, what exactly is Shopping Research? It's basically a personal shopping assistant built right into Chat GPT. Here's how it works. You tell ChatGpt what you want, like best TV for a bright room. Then, it searches the web, reads reviews, checks prices, asks you a few more questions, and shows you personalized options in minutes. [music] Here's what's running under the hood. OpenAI built a special version of their GPT5 mini model just for shopping. They trained it specifically to prioritize real user reviews from places like Reddit over paid marketing and fake product page reviews. And this connects [music] to instant checkout. They launched that in September. So you can buy stuff from Etsy and Shopify stores directly [music] inside ChatGpt. The timing isn't random. Adobe predicts AI shopping will [music] jump 520% this holiday season. OpenAI is trying to own that wave. It's free for everyone and they are giving nearly unlimited access through the holidays. Just type a shopping question in chat GPT and it pops up. Or tap the plus menu and select shopping research. And after pulling that move, Open Air went further. They gave Chat GPT voice a major upgrade. You can now use voice mode right inside your chat. No separate screen needed. And here's what's cool. You get a live transcript as you talk. Every word appears on screen in real time. This makes switching between typing and talking super smooth. You don't lose your place anymore. And if you like the old odd mode, you can still turn it back on in settings. [music] It's rolling out to everyone right now on mobile and web. Just update your app and it will be right there. But if you think OpenAI is the only one who has their eyes set on the AI shopping demand increase, you are wrong. Perplexity just dropped something insane. You can now virtual try on",
        "start": 173.84,
        "duration": 633.8370000000001
    },
    {
        "text": "right now on mobile and web. Just update your app and it will be right there. But if you think OpenAI is the only one who has their eyes set on the AI shopping demand increase, you are wrong. Perplexity just dropped something insane. You can now virtual try on You upload a photo and create a digital avatar of yourself. Now you are ready to shop. You search for something like Buckme men's jacket. [music] Find something you like, tap on it, and there you will see a try it on button right there. hit that button and the [music] AI starts generating. And then you're literally looking at yourself wearing that jacket. It looks pretty realistic. If you don't like it, you just go back, pick another jacket, and try that one on instead. And from there, you can share it or just start shopping. Now, this is only for Pro and Max subscribers right now, and it's US only, but they will roll it out to everyone soon. And while they were at it, Perplexity also just added Grock 4.1 to their model lineup. If you're a Pro or Mac subscriber, you can now use XAI's latest model right inside Perplexity. You just click the model picker, select Gro 4.1, and you can even turn on this reasoning mode if you wanted to think harder. And Grock 4.1 is currently ranked number two on LM Arena. So yeah, pretty solid addition. Perplexity has been busy and we are not complaining. An Indian startup just built the world's first anti- drone patrol vehicle. It's called the Indrajal Ranger. A 4 into four combat vehicle built by hydrobat based green robotics. Its AI brain skyos spots drones 10 km out decides how to kill them and executes. It does this on its own without human help and within seconds. It can patrol's border, hunt smuggler drones trying to cross and protect military vehicles on the move. Let that sink in. This isn't imported from USA or China. This is homegrown tech for the Indians by the Indians. China also dropped two updates this week. First, Alibaba just open sourced their image generation model Z image. It's super lightweight, but still crushing the competition. It's currently number four on the global image leaderboard. Only three models beat it, and they're all from Google and closed source. Photorealistic photos, text that doesn't look like garbage. It can even edit your existing images, [music] and there's a built-in prompt enhancer that makes your basic prompts way better. Zimage is easily one of the best open-source image gen models in the world right now. You can try it out right now for free on GitHub. Second update, Tencent dropped Hanuan OCR. OCR is the tech that reads text from photos, receipts, documents, screenshots, stuff like that. Built on just 1 billion parameters, this tiny model is outperforming models [music] that are 235 times bigger. It won first place at",
        "start": 333.52,
        "duration": 945.1980000000001
    },
    {
        "text": "right now for free on GitHub. Second update, Tencent dropped Hanuan OCR. OCR is the tech that reads text from photos, receipts, documents, screenshots, stuff like that. Built on just 1 billion parameters, this tiny model is outperforming models [music] that are 235 times bigger. It won first place at Hanuan OCR can read handwriting, pull subtitles from videos, and translates into 14 languages. Both models are free on GitHub right now. So yeah, China is not stopping in [music] this AI race anytime soon. This AI image generator just beat every other open- source model out there. Flux.2 just dropped and you can try it right now for free. Here's why everyone's talking about it. You can feed it up to 10 pictures of the same person, product or style and it actually keeps them looking the same in every new image. [music] You can change outfit and location while keeping the character and features consistent. People online have been saying Flux.2 is the best image gen model right now. So, we tested it. We put Flux.2 Pro against Nano Banana Pro, the supposedly best image gen model so far. First test, fantasy characters, five heroes standing together. We gave both models the same prompts and both did fine, but Flux Point2 added way more detail. Nano Banana Pro's output looked kind of basic. Now onto our second test, an illustration for a realistic landing page for a company. This is where it got interesting. Flux point 2 gave us something that actually looked like a real landing page. However, our prompt clearly says we need an illustration for a landing page. [music] So Nano Banana's output was accurate to the prompt. It gave us the illustration of a realistic landing page. So yeah, Flux Point.2 beats Nano Banana Pro when it comes to details, but [music] not when it comes to accuracy. Flux point 2 might not be the best image gen model out there yet, but it's definitely a strong contender for the role. Go try it yourself and see if it is really the best. It's free to use. Just go to Black Forest Labs Playground and try it out. Elon Musk just dropped a major update to Grock and [music] it's wild. They have added text to video feature on Grock Imagine. Now, just type in your prompt and it will generate the video. The updates rolling out right now on web, iOS, and Android. Elon Musk announced in an X post that upgraded audio and 10-second videos are coming this weekend. Clips are about 6 seconds. They are using XAI's Aurora engine to make this feature possible. That's their in-house AI that handles text, images, and audio all at once. Users are already making crazy stuff. Their biggest selling point is speed. Grock generates videos in under 15 seconds. Competitors like Sora take one to [music] two minutes. But here's what most people are missing. This isn't just about speed.",
        "start": 495.759,
        "duration": 1244.0780000000007
    },
    {
        "text": "AI that handles text, images, and audio all at once. Users are already making crazy stuff. Their biggest selling point is speed. Grock generates videos in under 15 seconds. Competitors like Sora take one to [music] two minutes. But here's what most people are missing. This isn't just about speed. You make a video and post it in the same place. No exporting, no switching apps. XI [music] is betting that most creators want good enough result in 15 seconds over perfect result in 3 minutes. And honestly, for social media, they might be right. What do you think? Is speed or quality more important? LTX Studio just solved one of the biggest problems in film making. Earlier, even the slightest mistake in a take meant re-shooting the whole thing. But now, LTX's new tool, Retake, lets you select any part of your video and just redo that part. You can change dialogues, [music] camera angles, and emotions. All that, while keeping the character and the surrounding consistent. It's available for everyone to try and test on the LTX website while most companies were focusing on image and video gen. LTX identified a gap in the market and acted upon it. Now that's a smart business move. Lavad just dropped a new feature called touchedit. And this thing is wild. Here's how it works. You've got three completely different images. One has a banana, another has a skier, and the third has a penguin. You tap on the banana. the skis and the penguin and each one becomes a little reusable token. Now, here's the magic. Our prompt is banana turn into sky, girl skiing with penguin. But instead of writing this whole thing, we replace banana, sky, and penguin with their tokens. Lova takes all three elements and fuses them together as per our prompt. And look at that, we have a girl skiing on banana skies and a penguin skiing beside her. This is crazy. You can also use this feature to visualize a design. You can make tokens out of various outfits and accessories and watch a professional model wear it on a runway. It works on text, too. See some words in your image that you want to change. Tap them, type the new word, and it swaps it out perfectly. Touch Edit is live right now on Love Art. Go try it out for yourself. After that historic last week, Google is enjoying a quiet week, but they did make some additions in Gemini app. Gemini can now turn boring diagrams into something you can actually click on and explore. You ask it to explain something visual, like the parts of a cell, and instead of just giving you a picture with labels, you can actually tap on each part. A side panel pops up with definitions, explanations, and you can keep asking follow-up questions about that specific thing. Google saw the positive response Nano Banana Pros infographics got online",
        "start": 650.48,
        "duration": 1534.4720000000007
    },
    {
        "text": "of a cell, and instead of just giving you a picture with labels, you can actually tap on each part. A side panel pops up with definitions, explanations, and you can keep asking follow-up questions about that specific thing. Google saw the positive response Nano Banana Pros infographics got online visual learning. It's nothing groundbreaking on its own, but a solid quality of life upgrade for anyone using Gemini to study. The European Union is making big change to its privacy laws. Those cookie pop-ups you click through without reading, they might actually go away. But this is not a good news. Privacy groups say the EU is giving up on protecting your data. Here's the deal. Europeans spend 575 million hours a year clicking cookie banners. So EU released the digital omnibus. the biggest update to the rules since GDPR in 2018. Here's what's changing. First, if a company has your data but can't figure out who you are from it, they don't have to protect it like personal data anymore. Second, companies can use your data to train AI without [music] asking you first. They just need a legitimate reason. You can say no, but most people won't even know it's happening. Third, companies can ignore your data access requests if they think you're misusing them, and they can use more cookies without asking. Business groups love it. They say it'll save5 billion by 2029. Privacy advocate Max Shrems called it the biggest attack on Europeans digital rights in years. And the AI act they passed last year is already getting delayed. Rules for risky AI were supposed to start August 2026. Now, it could be late 2027 or 2028. Bottom line, if you run a business in Europe, compliance gets easier. If you're a regular person, your data might train AI without you knowing. This still needs to pass Parliament, and it's expected to happen in late 2026. [music] But what do you think? Is this a good idea or a bad one? Now, for our top 10 coolest AI tools that launched this week's segment, where we look at the most fun and underrated tools. Let's go. Number one, Inside Tube pulls out the key points from YouTube videos so you don't have to watch the whole thing. You can finally skip the fluff and get straight to the good stuff. Number two, Elder Care Check helps senior citizens fact check health info they find online using [music] AI. Number three, Inbox agents puts all your emails and messages from different apps into one place. Number four, Radian lets you build web apps just by chatting. You describe what you want and it builds it. Number five, Inter Chat is a messaging app with AI built-in. You can ask it to summarize chats or search your conversations. Number six, Interview Flow AI handles firstround interviews for you. It reads résumés and does phone screenings so you don't have to. Number seven, Microsoft",
        "start": 806.314,
        "duration": 1839.1910000000007
    },
    {
        "text": "it builds it. Number five, Inter Chat is a messaging app with AI built-in. You can ask it to summarize chats or search your conversations. Number six, Interview Flow AI handles firstround interviews for you. It reads résumés and does phone screenings so you don't have to. Number seven, Microsoft full year. That's C-pilot built into Word, Excel, PowerPoint, all of it. But this offer ends at midnight today. So grab it now. links in the description. Number eight, Cat Does builds mobile apps for you. Just describe your idea and it does everything, even publishing to the app store. Number nine, Quest lets you create interactive stories with AI images and videos. [music] Number 10, Clarico sets up an AI voice assistant for your business in 3 minutes. Handles calls, books appointments, answers questions. That was our top picks of this week. Which one are you excited to try? If you know any cool AI tools that we missed, share it in the comments for everyone. AI is now beating human engineers. Europe is rewriting privacy rules. And China keeps dropping free models that rival the best in the world. This race isn't slowing down. Drop a comment with your thoughts and subscribe for next week's AI news. See you then.",
        "start": 959.92,
        "duration": 1949.670000000001
    }
]