[
    {
        "text": " Open AAI just declared a code red. Nvidia [music] lost $600 billion in a single day. The biggest single day loss in stock market [music] history. And Google, they just released a model that's beating GPT5 on almost every benchmark. [music] But here's what most people don't realize. Google isn't just winning the chatbot race. They're competing with Nvidia on chips, with Microsoft and Oracle on cloud, with OpenAI on models, with Meta on hardware. They're playing on every level of the AI stack. And right now, nobody else can do that. And the craziest part, a group of researchers predicted this exact shift. One of them left OpenAI, gave up $2 million in equity just to publish this report. I covered it 6 months ago. 70% of their predictions already came true. So today, this is your complete AI report card for 2025. Not just who's winning, [music] but the 10 moments that actually mattered, the tools you should be using, and what's coming in 2026. Here's what we're covering. First, I'm grading those AI 2027 predictions. What hit? What missed? [music] What's still cooking? Second, my ranked countdown of the 10 biggest AI moments. [music] Google's rise is just one of them. Number one, literally crashed the global market. Third, my actual tool rankings, number one in each category, including one surprise pick nobody's talking about. Fourth, five predictions for 2026, including one that most AI creators are getting completely wrong. And finally, the three skills that separate people who thrive from people who get left behind. Let's get into it. [music] All right, quick context. [music] The AI 2027 report was written by Daniel Kokotilo, the guy who left OpenAI and gave up millions to warn people about what's coming. He's on Times 100 AI [music] list. The report also includes the number one ranked forecaster on Rance leaderboard. These aren't random Twitter accounts. These are people with actual track records. So let's check the receipts. Five predictions. How many came true? Prediction one, AI agents enter the workforce. They predicted AI agents would start handling real tasks in 2025. Not demos, actual work. Did it happen? Yes. Chat GPT operator launched. Perplexity built an agentic browser. Google integrated agents directly into Chrome. Goldman Sachs started piloting AI agents for internal research. Prediction two, coding gets automated. In January 2024, the best AI scored 4.4% on SWE bench. By December 2025, [music] Claude scored 80.9%. That's not a typo. 4% to 80% in under two years. Cursor hit a $9 billion valuation. Claude Code is doing over 500 million in run rate. Prediction three, China maintains competitiveness. January 2025, Deepseek releases a model matching OpenAI's best trained for $6 million. OpenAI allegedly spent over $100 million. Mark Andre called it AI's butnik moment. Nvidia lost $600 billion in a single day. And by the way, this is why everyone's now talking about Google winning. Deepseek proved you don't need Nvidia chips.",
        "start": 0.08,
        "duration": 366.659
    },
    {
        "text": "a model matching OpenAI's best trained for $6 million. OpenAI allegedly spent over $100 million. Mark Andre called it AI's butnik moment. Nvidia lost $600 billion in a single day. And by the way, this is why everyone's now talking about Google winning. Deepseek proved you don't need Nvidia chips. dependent on anyone. They just sold a million of them to Anthropic. Prediction four, job displacement begins. TCS announced layoffs of over 12,000 employees, largest in Indian IT history. But was [music] this purely AI or also economic factors? Probably a mix. Prediction five, super intelligence by 2027. Too early to judge. AI is improving faster than expected, but we're not at superhuman general intelligence yet. So, I've got a WhatsApp community where I drop everything I discover, tools, workflows, updates, all in one place before they go mainstream. If you want access, links in the description. Number 10, the AI hardware graveyard. Remember the humane pin, the rabbit R1, all the dedicated AI hardware that was supposed to replace your phone? Yeah, they all failed. The lesson, AI works best when it's integrated into what you already use, not when it tries to replace everything. Number nine, synth ID goes mainstream. Google's invisible watermarking technology hit 20 billion plus pieces of AI content. This is the foundation for how we're going to trust or not trust synthetic media going forward. Number eight, image generation goes mainstream. GPT40 launched native image generation in March and it went absolutely viral. The Gibli trend that was GP to 4, over 700 million images generated in a single week. AI image generation went from tech demo to my cousin is using this. Number seven, self-driving becomes a real business. Whimo hit 450,000 autonomous rides per week. That's not a pilot program. That's a real business. FDA approved 950 AI powered medical devices. AI is now in hospitals on roads making actual decisions. Number six, the browser wars restart. Open eyes atlas. Perplexities comet. Google integrating Gemini directly into Chrome. Whoever controls how you access the internet controls the most valuable real estate in tech. And now everyone's fighting for it. Number five, the coding agent explosion. Cursor $9 billion valuation. Claude Code $500 million plus run rate. And then there's the Windsurf saga. Open AAI tried to acquire them for $3 billion. Microsoft blocked it. Google hired the entire team for $2.4 billion. launched it as anti-gravity all within 72 hours. That's how hot the coding agent market is right now. Number four, reasoning models changed everything. 01 Claude's extended thinking. Gemini's reasoning mode. These models don't just respond, they think. AI won gold at the International Math Olympiad started deriving new mathematical results humans hadn't discovered. Here's the wildest part. Google's reasoning model helped train the next version of Gemini. AI is now improving AI. Number three, the humanoid robot race ignites. This isn't just Tesla anymore. The entire humanoid robotics industry exploded in 2025.",
        "start": 189.44,
        "duration": 720.8990000000001
    },
    {
        "text": "International Math Olympiad started deriving new mathematical results humans hadn't discovered. Here's the wildest part. Google's reasoning model helped train the next version of Gemini. AI is now improving AI. Number three, the humanoid robot race ignites. This isn't just Tesla anymore. The entire humanoid robotics industry exploded in 2025. bodysuit to a robot that's actually running. The December 2025 demo showed it running autonomously. Unitry Chinese company planning a $7 billion IPO. Their G1 robot cost $16,000 and it's already working in BYD and Gile factories. Morgan Stanley says it's probably the most used humanoid robot globally. Figure AI I backed by OpenAI and Nvidia. Their figure 02 is already deployed at BMW's South Carolina factory. Boston Dynamics retired their famous hydraulic atlas and launched an allect electric version. The global humanoid robot market $2.4 billion today projected to hit $113 billion by 2033. That's 40% annual growth. Number two, Indian IT gets its wakeup call. IT giant TCS has decided to lay off over 12,000 job roles altogether, which means essentially slashing the global workforce by 2% in FI26. Now, the jobs that are going to be impacted are the ones in the middle and senior management is what is being told at the moment. The largest layoff in Indian IT history and it wasn't just entry- level, mid-level and senior roles got hit hardest. Industry analysts are now warning that 400,000 to 500,000 IT jobs in India are at risk in the next two to three years. India has 5.6 million IT workers. That's over 7% of GDP. If you're in tech, especially in India, staying static is not an option. Number one, deepseek shakes the world. A Chinese company called Deepseek releases R1, a reasoning model that matches OpenAI's best. The training cost $6 million. OpenAI allegedly spent over $100 million for comparable performance. Mark Andre called it AI's Sputnik moment. Sam Alman acknowledged they had underestimated Chinese competition. This single release reshaped the geopolitical and economic landscape of AI. All right. Now, let's talk tools. Not just these are good. I'm giving you actual rankings. Number one in each category. Let's go. Coding tools. Number one, Cursor. The IDE that made developers switch overnight. $9 billion valuation for a reason. If you write code professionally, this should be your default. Number two, Claude Code terminal first coding agent. If you live in the command line, this is for you. Number three, Lovable/Bolt. Best no code AI builders. If you're not a developer, but want to build apps, start here. Number four, GitHub Copilot. Still solid, still useful, but honestly the others have passed it. General AI assistance number one, Claude, best for nuanced writing and complex reasoning. The context window is unmatched. Number two, Chat GPT, most versatile. Best ecosystem with plugins. GPT's operator, the default for a reason. Number three, Gemini, strongest if you're in the Google ecosystem. And with Gemini 3 outperforming GPT 5 on benchmarks, the [music] gap is closing fast. Number",
        "start": 372.0,
        "duration": 1078.5799999999997
    },
    {
        "text": "complex reasoning. The context window is unmatched. Number two, Chat GPT, most versatile. Best ecosystem with plugins. GPT's operator, the default for a reason. Number three, Gemini, strongest if you're in the Google ecosystem. And with Gemini 3 outperforming GPT 5 on benchmarks, the [music] gap is closing fast. Number show sources, provide citations. [music] If accuracy matters more than creativity, this is it. Video generation. Number one, VO 3.1. Google's video model. Best for professional quality output right now. Number two, Sora 2. Open eyes latest. Beautiful photo realism, but VO edges it for consistency. Number three, Runway Gen 4, best for professional workflow integration. If you're in video production, this plugs in smoothly. Learning and research. Number one, Notebook LM, Google Sleeper Hit. Upload any documents, get AI powered summaries, and even podcast style audio overviews. 74% of university educators recommend it to students. Number two, perplexity research with web sources and citations builtin. Number three, consensus. Best for academic research. Searches actual scientific papers. Image generation. Number one, chat GPT [music] images. This is the one that changed everything. OpenAI launched native image generation in GPT4 in March and it went absolutely viral. The Gibli trend that was this over 700 million images generated in a single week. Then in December they dropped GPT image 1.5. Four times faster better instruction following and it finally handles text properly. If you're already using Chat GPT you don't need another tool. Number two, Nano Banana Pro Google's model, the hug your younger self trend, the figurine maker, the meet your heroes edits. This is Google proving they can compete on viral creative tools. Number three, Flux best for photo realism. If you need images that look like actual photographs, this is it. Number four, idiogram best for textheavy images, logos, posters, anything where spelling matters. Number five, midjourney. Still great for artistic styles, but honestly, the others have caught up and passed it for most use cases. Surprise pick. Claude computer use. Here's one most people aren't talking about yet. Claude can now control your computer, mouse, keyboard applications. It's currently in [music] API and developer tools, but this is heading to consumer products fast. This is the bridge between AI assistant and AI agent. A tier right now heading to S tier. All right, prediction time. Five predictions for 2026. I'm being specific so you can actually check these next year. Prediction one, agentic browsers become default by mid 2026. AI native browsing becomes how most knowledge workers access [music] the internet. Not here's a search result, but I'll book that flight compare the options handle the payment. Atlas, comet, Chrome with Gemini. One of these becomes your default browser by the end of 2026. Prediction two, coding agent market consolidates. Cursor and cloud code dominate for professional developers. Lovable or bolt becomes the standard for non-developers. Most of the smaller players either get acquired or fade away. Prediction three, AI search gets monetized. Google search became Google",
        "start": 558.64,
        "duration": 1433.059999999999
    },
    {
        "text": "default browser by the end of 2026. Prediction two, coding agent market consolidates. Cursor and cloud code dominate for professional developers. Lovable or bolt becomes the standard for non-developers. Most of the smaller players either get acquired or fade away. Prediction three, AI search gets monetized. Google search became Google 2026, Perplexity, [music] Chat GPT, and others introduce sponsored responses and paid placements. The free lunch ends when the user base gets big enough. Prediction four, entry-level digital work gets automated by December 2026. The majority of entry-level digital tasks, data entry, basic research, simple writing, scheduling will be handled by AI agents. Companies won't announce this. It'll just happen. You'll notice when the junior roles stop getting posted. Prediction five, the highest paid won't be AI experts. Here's my contrarian take. The highest [music] paid people in 2026 won't be the ones who are best at using AI. They'll be the ones who are best at human skills, [music] sales, leadership, negotiation, strategic thinking, who also use AI. Most AI creators are telling you to learn prompting. I think that's backwards. The leverage is in the human skills that AI amplifies. So, what should you actually focus on? Here are the three skills I think will matter most. Skill one, AI orchestration, not prompt engineering. That's [music] table stakes. Now I'm talking about knowing which tool for which task, chaining tools together, building workflows. Think of it like this. Prompt engineering is playing one [music] instrument. AI orchestration is conducting the orchestra. Skill two, systems thinking, [music] AI can execute. What it can't do is tell you which problems are worth solving. Understanding [music] how things connect, why this initiative matters more than that one, what second order effects will result from this decision. That's systems thinking. And that's where [music] the highest value moves. Skill three, human skills. When AI handles the routine, human [music] connection becomes premium. Sales, negotiation, leadership, communication, emotional intelligence. These aren't soft skills anymore. These are the skills AI can't replicate and that get multiplied by AI. 2025 was the year AI stopped being theoretical. It entered workplaces, factories, creative studios, daily life. 2026 will accelerate that. Whether Google dominates, OpenAI bounces [music] back, or China surprises everyone again. The change is coming regardless. The gap between AI literate [music] and AI illiterate is now a canyon. If you've watched this entire video, you've already crossed it. Subscribe for realtime AI coverage in 2026. Drop a comment with your prediction for the biggest AI moment of next year. Stay ahead.",
        "start": 742.0,
        "duration": 1720.103
    }
]