[
    {
        "text": " Nvidia just spent $20 billion to kill the competition. Their largest deal in history. While everyone was distracted, China dropped not one but two AI models this week [music] that are beating Claude and Gemini, both free and open source. They're not slowing down anytime soon. And Palmer Lucky, the guy who sold Oculus to Facebook for $2 billion, just demoed a military headset that gives soldiers X-ray vision and it looks straight out of a video game. 2025 is almost over and this week felt like the finale. Welcome back to our weekly AI updates. Here are the top stories you can't afford to miss. Nvidia just acquired Grock for $20 billion, the largest deal ever. That's three times what Grock was worth just 3 months ago. You'd think this was a rash decision, but this was a strategic killshot. Let me tell you how. Jonathan Ross, Grock's founder, is the guy who built Google's TPU, the chip powering more than half of Google's infrastructure. That single chip proved to the entire industry that Nvidia isn't the only way to run AI. Then he left Google and found it broke. This time, he targeted inference instead of training. Let me break it down for you. Training is teaching AI once, while inference is AI responding to you [music] every time you prompt and chat with it. Training is a one-time cost, whereas inference happens every single time. Grock built a chip that runs inference 10 times faster on one/tenth the energy. Scale that up and every cloud provider in the world comes knocking to you. Jensen already had Google's TPUs breathing down his neck and Grock was becoming his next [music] threat. So, he simply bought them out. Now Nvidia owns both the standard and the best alternative. GPUs for training and LPUS for inference. When you can't kill the competition, just acquire it. This is just how monopolies operate in Silicon Valley. But wait, this isn't even the craziest update of the week. YouTube just turned into a game engine. Check this out. YouTube Gaming dropped playables builder, which is powered by Gemini 3. It lets creators build actual playable games using just text. No coding required at all. You describe your game idea. Gemini builds it for you and your audience plays it directly inside YouTube. Creators like Sambucha already made Booker Blocks. I Christine built Sugar Cube. Gohar's Guide created Study Zone. The beta's open for creators in select markets. You can apply and start building. [music] YouTubers could turn their content into interactive experiences and gaming channels where you don't just watch, you play what they've built. YouTube's not just for watching anymore. It's becoming a place where you play, you interact, [music] you're part of the content. YouTube's making it easy to build games. But Nvidia just did the same thing for video production. With how fast AI is moving, it's almost impossible to stay updated. So, I've got a WhatsApp community where",
        "start": 0.16,
        "duration": 335.12000000000006
    },
    {
        "text": "becoming a place where you play, you interact, [music] you're part of the content. YouTube's making it easy to build games. But Nvidia just did the same thing for video production. With how fast AI is moving, it's almost impossible to stay updated. So, I've got a WhatsApp community where workflows, updates, all in one place before they go mainstream. If you want access, links in the description. China just dropped an AI model that beats Google, Anthropic, and OpenAI at their own game. Zitai just dropped GLM 4.7, and it is currently number six on the global webdev leaderboard. Right now, it's sitting right behind Gemini 3 Pro and is already ahead of GPT5. Here's what makes this different. You can download the entire thing for free. The full model weights are public, which means you're not stuck paying for API calls and can run this on your own hardware. On real coding benchmarks, it scores 73.8% [music] which is as good as matching claudit 4.5. And developers are already plugging it into tools like cloud code and client. But I wanted to test if it actually lives up to the hype. So I'm asking it to build a realtime stock ticker dashboard in a single HTML file. dark theme, neon accents, [music] fake stock symbols updating every two seconds, sparkline mini charts, and here's the catch, only vanilla JavaScript, no external libraries. Why this specific test? Because this is exactly what the webdev arena evaluates. Complex multicomponent web builds, front-end [music] logic, realtime updates, and data visualization all in one prompt. Most models mess up the real-time updates or the spark line charts. Let's see if it nails this on the first try. And there it is. Real-time updates. The exact UI I asked for. Spark lines working perfectly. [music] It nailed it on the first try. There's a new AI coding model out. It's free, open- source, and it's already beating Claude and Gemini. Miniax just dropped M2.1. Most AI models are really only good at Python. This one actually handles the languages dev teams use every day. JavaScript, Swift, Cotlin, Rust, Go, all of it. You can ask it to build you a full app and it doesn't come out looking like a prototype. The UI [music] is clean, the animations are smooth, it actually looks like a finished product. Devs online are saying it feels like clawed, but at a fraction of the cost, and it's nearly twice as fast, and because it's open source, you can just download it and run it yourself. No fees, no limits. China is working hard, but Open AI is working harder. OpenAI's Codeex just got a big update. It now supports skills. Skills are basically saved instructions. You set them up once and Codeex remembers exactly how you want things done. So let's say you want all your code notes formatted a [music] specific way. Or your team has a review checklist",
        "start": 178.879,
        "duration": 641.1999999999999
    },
    {
        "text": "Codeex just got a big update. It now supports skills. Skills are basically saved instructions. You set them up once and Codeex remembers exactly how you want things done. So let's say you want all your code notes formatted a [music] specific way. Or your team has a review checklist skill once and codeex just handles it from there. Using them is dead simple. type dollar sign then the skill name or just describe what you need and CEX figures out which skill to use. There's also a bunch of pre-built ones ready to go. And if your whole team shares the same skills, everyone's code stays consistent. No more back and forth. The agent just knows how your team works. Skills are live now in Codeex CLI [music] and the IDE extension. While OpenAI was making coding easier, someone just made video production insanely simple. Nvidia just launched vision with four insane features. Here's what you can do with each one. Boards lets you generate a complete 3x3 story board with nine different shots all from a single prompt. This is perfect for previsualizing entire [music] scenes before you shoot. Looks takes your concept and creates multiple visual styles like cinematic, anime, [music] noir, fantasy. Same scene but with different aesthetics. It is great to find the exact vibe you're imagining. Angles gives you every camera perspective like low angle, high angle, close-up, wide shot. It's like having a cinematographer plan your coverage instantly. Extract shot lets you pull any single frame from your storyboard to refine, expand, or animate further. Lets you turn your best shot into the final asset. What used to cost tens of thousands and take weeks now takes seconds. And right now, Vision is completely free. Go try it yourself on Invido. Alibaba just dropped two open-source AI models in one week and they're both free. First one is Quen Image Edit 2511. It nails character consistency. You can throw in a group photo with multiple people and it keeps everyone's face looking right. They also built in lighting controls and camera angle switches. And if you're doing product design, you can easily swap materials. carbon fiber to resin to gold, whatever you want. E-commerce teams can batch edit product shots. And if you're editing multiple images, the faces and text stay consistent, which is where other tools like Cream and Nano Banana tend to mess up. Now, the second drop is a voice model called fun audio chat. What makes this different from other voice AIs is it actually understands emotions. It picks up on your tone, tries to decode the emotion and mood behind it instead of just picking up words. So like if you whisper that you're scared walking home alone, [music] it responds gently and offers to stay on the line with you. But if you say the exact same sentence in a happy voice versus a sad voice, it completely changes how it responds. It's actually",
        "start": 341.68,
        "duration": 959.936
    },
    {
        "text": "up words. So like if you whisper that you're scared walking home alone, [music] it responds gently and offers to stay on the line with you. But if you say the exact same sentence in a happy voice versus a sad voice, it completely changes how it responds. It's actually technically crazy. Most voice AI runs at 25 frames per second. This thing runs at five. That cuts your GPU cost in half while still sounding just as [music] good. It's topping open audiobench, the main test for how well voice AI handles real spoken questions, beating every other 8B [music] model out there. You can use it for voice assistants, customer service bots, or just hook it up to function calls so people can book stuff, set navigation, run commands, all by [music] talking. Both models are up on Hugging Face and Model Scope right now if you want to try them. But if you think China owned the week, there is another player in the game stealing the limelight. Nvidia just built an AI that taught itself to play over a thousand video games just by watching people play on YouTube and Twitch. They launched Nitrogen and are giving it away for free. But here's the clever part. They only used videos where streamers had controller overlays on screen. So the AI could literally watch what buttons people pressed and learn from it. They basically turned millions of hours of streaming into the world's largest gaming tutorial. One single AI plays RPGs, battle royals, 3D action games, 2D sidescrollers. Throw it into a game it's never seen before and it figures out what to do. Here's why this actually matters beyond gaming. Nitrogen runs on the same brain Nvidia uses for their robots. So, every skill this AI picks up in a video game, the reflexes, the timing, the awareness that can transfer to machines in the real world. Nvidia just proved you can train a robot's brain using Twitch streams. They're releasing everything, the [music] data set, model, code. We went from AIs that master one game to an AI that learns how to play any game. Gaming is just the proof of concept, and robotics is the real endgame. While Nvidia turned millions of hours of streaming into training data, someone just took a page out from China's free AI strategy. Vinsurf just gave you their best coding AI model for free. SWE [music] 1.5 is their flagship model specifically built for coding. It's right behind Cloudset [music] in coding benchmarks and now it's free for 3 months. But here's what's actually crazy. You can now run multiple AI agents at the same time. So, picture this. One agent's fixing your bugs, another one's building a new feature, and a third one's writing your tests, all running together. No more waiting for one thing to finish before you start the next. And you can watch all of them side by side, like a",
        "start": 519.919,
        "duration": 1252.9750000000001
    },
    {
        "text": "time. So, picture this. One agent's fixing your bugs, another one's building a new feature, and a third one's writing your tests, all running together. No more waiting for one thing to finish before you start the next. And you can watch all of them side by side, like a finally fixed that annoying thing where terminal commands just randomly break. So, yeah, free prolevel AI, parallel agents, and a terminal that actually works. Cursor doesn't do the parallel thing yet. Neither does Copilot, but Windsurf can, and that too for free. Links in the description if you want to try it. All right, enough about coding. This is the last update of the week, and it sounds like science fiction, but it's not. The guy who made VR mainstream just showed what the future of warfare looks like, and honestly, it's straight out of a video game. Palmer Lucky recently demoed Anderil's new military headset, Eagle-Eye, [music] on Japanese TV. And what this thing can do is insane. We're talking X-ray vision, realtime translation, enemy tracking, all packed into one single headset. But here's where it gets wild. You put on these glasses, and if you spot an enemy, every other soldier wearing eagle-eye sees [music] them, too. Even if they're in a completely different room or even behind a wall, doesn't matter. Palmer called it X-ray vision, and he's not exaggerating. And if a drone overhead spots enemies hiding behind buildings, it all gets projected straight into your headset. You know where they are before you turn the corner. Oh, and it comes with real-time translation. But the wild part is that all of this runs on a bulletproof plate. The same plate that stops bullets is also the computer running the [music] AI. This is what combat looks like in a few years. But China is just shipping models after models. First Z dropped GLM 4.7 [music] and now MiniAX released M21. Now for our top 10 coolest AI tools that launched this week's segment where we look at the most fun and underrated tools. Let's go. Number one, Redu turns messy PDFs and documents into clean data for AI apps. Drop in contracts, invoices, even handwritten notes, and it pulls out the info you need. Number two, Agent S2 from Similar AI is an open-source agent that controls your computer for you. Tell it to edit a spreadsheet or resize images and it clicks through the steps like a real person. Number three, Noise AI clones any voice from just 3 seconds of audio. Record yourself once, then generate voiceovers in your voice for videos, podcasts, anything. Number four, Loki Build makes landing pages using AI. Describe your product and it builds a polished professional site in seconds. Number five, Many API turns any website into an API. [music] Point it at a page, define what data you want, and it gives you structured info you can use anywhere. Number six, Agent",
        "start": 672.56,
        "duration": 1554.4130000000007
    },
    {
        "text": "landing pages using AI. Describe your product and it builds a polished professional site in seconds. Number five, Many API turns any website into an API. [music] Point it at a page, define what data you want, and it gives you structured info you can use anywhere. Number six, Agent describing what you want in plain English. No drag [music] and drop, no code, just tell it your workflow. Number seven, Firecrawl just dropped a new agent endpoint. Give it a prompt and it searches the web, clicks through pages, and gathers info from sites other scrapers can't touch. [music] Number eight, ClickUp. Super agents are AI teammates inside ClickUp. Assign them tasks, tag them in comments, and they handle things like drafting emails or scheduling meetings. Number [music] nine, Enbot lets you build AI curators that track any topic across the web. Just describe what you care about, and it [music] scans news, blogs, and social media for you. It even turns your feed into a daily podcast. Number [music] 10. Typeless is AI voice dictation that actually works. You speak naturally with all the ums and pauses and it [music] outputs clean, polished text. It works in every app on your computer and it's four times faster than typing. 10 new tools. Drop a comment and tell me which one you're trying first. $20 billion acquisition. Two free Chinese models beating the paid ones. X-ray vision for soldiers all in one week. The line between sci-fi and reality is fading at an insane rate. All thanks to AI. Drop a comment with which update surprised you most and subscribe for next week. See you then.",
        "start": 831.44,
        "duration": 1708.7340000000006
    }
]