[
    {
        "text": " There is one feature in AI right now that will save you more time than anything else. It's not prompting. It's not agents. And 99% of people have never even heard of it. Think about it. Every time you open chat GPT or Claude, you start from zero. Be concise. Use this tone. Format it like this. Don't be too formal. The same instructions again and again and again. Like training a new intern every single morning who forgets everything by evening. I know it's annoying. But here's the thing. I found the fix. Watch this. One sentence, no designing, no formatting, fully branded presentation from a raw transcript every single time. It's called Claude Skills. You teach AI once. It remembers forever. I've built three startups, raised $5 million, and I use AI 8 to 10 hours a day to run my business. I make these videos to teach you exactly what I'm learning, the stuff that's actually helping me build 100 times faster, right? So, here's exactly what we're going to do together. Step one, what claude skills are. You'll get that in the next 2 minutes. Step two, I'm building one live right in front of you. No coding. I know that sounds intimidating. It's not. You'll see every single click. Step three, how to use this completely free even inside chat GPT and Gemini. Even if you never pay for Claude, by the end of this video, you'll have your own Claude skill trained on how you work runs forever without you repeating yourself again. Sounds good. Let's build one. Quick thing. If you're finding this useful, I have a WhatsApp community where I share stuff like this before it hits YouTube. New AI tools, features, workflows, good conversations happening there. Links in the description. It's free. All right, let me show you a real example to make this concrete. Okay, picture this. You have a prompt that works. Maybe it's for meeting notes. Maybe it's for LinkedIn posts. It's long, like 200 words of specific instructions. The formatting, the tone, the structure, everything dialed in exactly how you want it. And every single time you want to use it, you dig through your notes, find the prompt, paste it in, tweak it, hope you didn't forget something. I know, I know it's annoying, but that's how 99% of people are using AI right now. Every conversation starts from zero. Like the AI has amnesia and you have to reexplain yourself every single time. But what if you could save that prompt as a permanent tool? Something you just call by name and it runs. That's Claude skills. You build it once, you use it forever. So, let me break this down properly because I see a lot of confusion around this. Think of skills as a recipe, right? You have a set of steps you follow every time you to make a dish. The ingredients, the measurements, the order you do things.",
        "start": 0.08,
        "duration": 328.15999999999997
    },
    {
        "text": "use it forever. So, let me break this down properly because I see a lot of confusion around this. Think of skills as a recipe, right? You have a set of steps you follow every time you to make a dish. The ingredients, the measurements, the order you do things. you cook. Skills work the same way. You define your process once all the instructions, all the formatting rules, everything. And then you just feed it new ingredients each time. New content in, same structured output out. The skill contains your complete repeatable process. And once it's saved, it becomes a tool you can call anytime. Now, where can you actually use these? Three places. Regular chat, claude projects, and claude code. If you're technical for most of you watching this chat or projects, this is it. Don't overthink it. Say you work somewhere that has weekly meetings. And every week you need to turn those meeting notes into a presentation without a skill. Here's what you're typing every week. Convert these notes into a presentation. Start with attendees, then summary, then action items with owners, then deliverables with deadlines. professional tone. Use bullet points. Make it leadership ready. Sometimes you forget the formatting. Sometimes you phrase it differently and get inconsistent results. It's death by a thousand copy paste. With a skill, you just say, \"Use my meeting notes skill and paste the notes.\" See the difference? That's what we're building today. And this isn't just for meeting notes. Think about any knowledge work you do repeatedly. LinkedIn posts, you probably have a structure you like. Hook, story, lesson, call to action. Same skeleton, different content, that's a skill. Real scripts, punchy, 60 seconds, specific opening style, that's a skill. Weekly reports, client emails, project proposals. Here's the simple test. If you're doing the same type of task with different content each time, that's a skill waiting to be built. Now, some of you might be wondering, isn't this what MCP does? I keep hearing about MCP servers. Let me clear this up because I get this question all the time. Consider a carpenter building a table. skills equals the process to make the table, the measurements, the design, the exact steps. Cut this piece here, attach it at this angle. It's the instruction manual. MCP equals the tools, the saw, the hammer, the drill, the things you use to execute the process. In plain English, skills tell Claude how to do something. MCP gives Claude access to external tools and connections it couldn't otherwise reach. You can absolutely use skills without MCP. They're different things. Today, we're focused purely on skills. One thing before we build, I don't want you frustrated later. Skills are currently on Claude's paid plans, pro or max. If you're on free, don't click away. That workound I mentioned, it's real. It works. And I'm showing you at the end. Stick with me. All right. Here's where it gets good. Let's actually build one",
        "start": 165.599,
        "duration": 639.5199999999999
    },
    {
        "text": "want you frustrated later. Skills are currently on Claude's paid plans, pro or max. If you're on free, don't click away. That workound I mentioned, it's real. It works. And I'm showing you at the end. Stick with me. All right. Here's where it gets good. Let's actually build one cool. You don't need to write code. I know some of you just felt relief. Good. Anthropic built something called the skill creator. You describe what you want in plain English and Claude builds the skill for you. It writes all the technical stuff. Let me show you where to find it. Settings, capabilities. You'll see a toggle for skill creator. Toggle that on. What you're doing is giving Claude access to its own skill building tool. It's like Claude has an internal blueprint for how skills work. And now it can use that blueprint to make custom ones based on what you describe. Now I need raw material. I want to build a skill that takes video transcripts and turns them into presentations. Here's what I'm telling Claude. Build a transcript to PPT skill. When I give it a transcript, extract the key points. Create 12 to 15 slides. Keep it minimalist. Now watch what happens. See this? Claude isn't just giving me a response. It's actually architecting the entire skill step by step. 10 steps is building the whole system piece by piece. Skill.mmd, that's the core instructions. Brand.m MD, my colors and fonts locked in. Slide- structure.m MD, how the slides should be organized. I didn't write any of this code. I just described what I wanted in plain English. Claude did the rest. This is what I mean when I say you don't need to be technical. You just need to know what you want. And here's the magic moment. One button, copy to your skills. Click. Done. Permanently saved. I can use this from any chat anytime I need it. You just built your first AI tool. Seriously, that's it. Okay, we built it. But the real question, does it actually work? Let's find out. New chat, fresh transcript. This one's from my Clawude Code video. Content the skill has never seen before. Use my transcript to PPTX skill. Paste the transcript. Go. Wait. Look at this. It's asking me who's the target audience. What's the one key message? I didn't program it to do that. Claude figured out on its own that getting this context would produce better presentations. That's the skill creator being smart. It built in the questions that actually matter. Target audience, people looking to upskill in AI. Key message, become an AI generalist. Now it's working. Watch what's happening. Extracting key points from the transcript. Architecting the slide structure. And this validating brand consistency before it shows me anything. Quality control built right in. It's checking its own work. And there it is. Dark green, cream text, my exact brand colors. 15 slides, clean structure,",
        "start": 323.52,
        "duration": 946.8789999999999
    },
    {
        "text": "working. Watch what's happening. Extracting key points from the transcript. Architecting the slide structure. And this validating brand consistency before it shows me anything. Quality control built right in. It's checking its own work. And there it is. Dark green, cream text, my exact brand colors. 15 slides, clean structure, to build the skill, seconds to run it, and now every transcript I have can become a branded presentation just like this. Night and day from copy pasting prompts every time. Now, for the part I've been teasing, the free workaround. Here's what Anthropic did that I think is really smart. They open- sourced their entire skills library. These are just text files, markdown. All the instructions are right there for anyone to see. You can open any skill, read how it's built, and copy the entire content and paste it directly into Chat GPT as your starting prompt. Is it as clean as Claude's one-click system? No. But does it work? Yes. You can even export the skill I just built and use it anywhere. Skills are just structured prompts at the end of the day. A different way of thinking about prompt engineering. 80% of the benefit 100% free. Before we wrap, five quick tips for building good skills. One, be specific. Vague instructions give you unpredictable results. Two, include examples like this beats make it professional every time. Three, build in the questions. What changes each time? Make the skill. Ask for that context up front. Four, start simple. Test it. See what's missing. Improve. Iterate. Five. Name it clearly. Transcript dash to-ash pptx tells you what it does. My cool-skll tells you nothing. Now, one more thing before I let you go. A lot of you keep asking in comments and DMs. How do you make these AI videos? What tools do you use? What's your process? Here's the deal. When I hit 500,000 subscribers, I'm going to reveal the entire system, the tools, the workflow, the process from idea to final edit, everything. So, if you want to see that breakdown, hit subscribe. Seriously, let's get there together. So, that's Claude skills. Build once, use forever. That's the game. Now, drop a comment. What skill would you build first? Meeting notes, social posts. I'll help you think through it. Now, if you want to take this even further, I made a full video on cloud code that pairs perfectly with what you just learned. Skills are powerful, but claude code, that's where you run Claude directly from your terminal. You combine skills with claude code, and you're basically building your own AI employee. That video will take everything you learned today to the next level. It's right here. Go watch it. And remember, WhatsApp community link in the description. That's where I drop the stuff",
        "start": 479.199,
        "duration": 1243.1970000000001
    }
]