[
    {
        "text": " [music] [music] 50 plus insane updates dropped this week. Here are the top eight that matter. Welcome to week 31 of AI updates of the week. Let's dive in. One, Photoshop now inside ChatGpt. Adobe just gave Photoshop, Express, and Acrobat to Chat GPT users free. No $20 subscription, no overwhelming menus. Just type make the people pop done. Comic effects, PDF merges, party invites, all in chat GPT desktop, web, iOS, [music] live now. Two, Chat GPT 5.2 launched. Google and anthropic crushed benchmarks, OpenAI went code red. GPT 5.2 dropped. Instant [music] for speed, thinking for coding, pro for the hard stuff. Makes 38% fewer mistakes, auto switches modes for you. Already an M365, GitHub, Azure Code Red, answered. Three, Mistral's laptop coding model. Mistral just dropped Devstral Small to an open source coding model. Small enough to run on your laptop. Performs competitively with way bigger models. They also launched Mistral Vibe CLI free tool that uses their larger devstral tool for Vibe coding with full privacy. Big model performance laptop sized completely free. Four, Microsoft's 17.5 billion India bet. Satya flew to Bengaluru, coded an AI app live on stage dropped 17.5 billion Microsoft's biggest Asia bet ever. Deep users chain of debate made AIs argue India's greatest cricket team for the demo. But just hours later, Amazon dropped a tweet. Five. China's robot army. China's not prototyping, they're [music] shipping. Agibot made 5,000 robots doing security and logistics right now. Engine's T800 flying kicks full kung fu. People called it fake CEO. Let it kick him across the room. Robot boxing match December 24th. No games here. Six. Pentagon prepares for AGI. The Pentagon just started prepping for super intelligent AI. Defense bill mandates AI future steering committee run by the deputy defense secretary and vice chairman of joint chiefs. April 2026 launch January 2027 report to Congress when the military preps for AGI were closed. Seven. N8N goes 10 times faster. N8N 2.0 beta. No flashy features, just pure speed. They held improvements for 2 years to avoid breaking workflows. Built migration report to fix that. Now it's 10 times faster. More secure, stable. Plus, publish button changes don't go live till you say so. December 15th, full release. 8. World's first space LLM. First LLM trained in space. We just made history. Nvidia H100 orbited on StarCloud 1. Trained Kapati's nano GPT on Shakespeare in space. Ran Google's Gemma 2. Why? Instant Wi-Fi detection. 10 times cheaper energy. Unlimited solar. Space just became a data center. Nine. Notion triple drop. Three updates hit. Mobile agent went native. Blazing fast. Now agent sees what you're looking at. Highlight ask answered. GPT 5.2 integrated handles messy complex tasks. Every app racing to add AI this fast. Bubbles not popping. 10. Google update roundup. Stitch ship mask 5 days straight. Redesign agent exports code now. Command pallet. Predictive heat maps. Gemini 3 pro default. Prototypes connect screens. Export to cursor instantly. Plus Dopples fashion feed.",
        "start": 1.309,
        "duration": 316.92
    },
    {
        "text": "handles messy complex tasks. Every app racing to add AI this fast. Bubbles not popping. 10. Google update roundup. Stitch ship mask 5 days straight. Redesign agent exports code now. Command pallet. Predictive heat maps. Gemini 3 pro default. Prototypes connect screens. Export to cursor instantly. Plus Dopples fashion feed. smart glasses revealed. packed week. Free Photoshop in chat GBT. Kung Fu robots mass-produced. Pentagon prepping for AGI. Not demos. Not coming soon. Live right now. Follow for week 32.",
        "start": 167.44,
        "duration": 338.28000000000003
    }
]