[
    {
        "text": " Meta just bought a Chinese AI company, then immediately said, \"We want nothing to do with China.\" That's weird, right? Why buy something and then run from where it came from? But here's [music] what makes this week even stranger. China just rolled out their 1,000th humanoid robot with 10,000 more coming. And at CES next week, 20 out of 34 robot companies are Chinese. The US, just five. And while everyone's watching that, the biggest names in [music] AI, Gates, the heads of Anthropic, Deep Mind, Nvidia, are quietly booking flights to India. Something's shifting. And by the end of this video, you'll see the pattern no one's talking about. Meta just made a move that has half the industry confused. But let me tell you why it makes sense. They paid over $2 billion for Manus, which is an AI agent. In benchmarks, Manus [music] outperformed OpenAI by over 10 points. That got Meta's attention. Here's the thing, though. Manus started in China in 2022, but they moved to Singapore this year, and now they're cutting all ties to China. Meta confirmed they don't want any Chinese ownership. They said no Chinese operations after the deal closes. This tech is going straight into Instagram, WhatsApp, and Facebook. So if you use any of those, this affects you. So that's Meta trying to distance itself from China. But good luck with that because China just released something that has the whole industry watching. With how fast AI is moving, it's almost impossible to stay updated. So I've got a WhatsApp community where I drop everything I discover. Tools, workflows, updates, all in one place before they go mainstream. If you want access, [music] links in the description. A Chinese investment firm just dropped a new open-source AI model, iquest Coder, that's currently ranking number one. On the main benchmark that tests whether AI can actually fix real bugs, iquest scored 81.4% while Claude hit 77% and GPT5 came in around 75%. So, it's beating both by a pretty solid margin. And if this all sounds familiar, it's because we've seen this exact story before. Deepseek came from another Chinese trading firm and shocked the entire world. Now a different company just did the same thing. Two trading firms, two world-class AI models, same exact playbook. China keeps building frontier AI as side projects. But China is not the only one making moves. Back in the US, Adobe just made a deal that has everyone talking. Adobe just partnered with one of their biggest rivals, Runway. But why would they shake hands with a competitor? Well, Runway's Gen 4.5 is currently the number one ranked AI video model. And Adobe knows if people are going to use AI video anyway, it's better they do it inside their ecosystem than outside it. That's always been their game plan. Keep you in the ecosystem and make switching painful. So now you can generate AI video clips directly [music] in Firefly,",
        "start": 0.16,
        "duration": 336.79999999999995
    },
    {
        "text": "And Adobe knows if people are going to use AI video anyway, it's better they do it inside their ecosystem than outside it. That's always been their game plan. Keep you in the ecosystem and make switching painful. So now you can generate AI video clips directly [music] in Firefly, Pro or After Effects. On top of that, Adobe is now Runway's preferred partner, so Firefly users get access to new AI models before anyone else. This is a massive win for Adobe users. Adobe's locking down their ecosystem. But while everyone's focused on software, China's going allin on robots. China isn't just building robots anymore. They're building a robot nation. From factory floors to concert stages, the country is going allin on humanoid robots. Chinese company UB just rolled their 1,000 Walker S2 robot off the assembly line in Lujo. They've already shipped 500 humanoid robots to real factories in just 1 year, and they're scaling to 10,000 robots by 2026. [music] But UB isn't doing this alone. The Chinese government is backing this hard. Last month, China's Ministry of Industry and Information Technology set up a brand new standardization [music] committee for humanoid robots. They're writing the rulebook for humanoid robots, safety standards, data formats, hardware specs before anyone else [music] does. And China isn't just building these robots, they're getting people used to them. Last month, Unitary's G1 robot stands back up [music] at a Wang Lehom concert in Changdu doing synchronized front flips on stage [music] and a few days ago on Duian New Year's Eve Gala, a troop of Lingy X2 bots joined singer Vinida for a high energy performance. Now, here's where it gets real. CES 2026 kicks off in 4 days. For those who don't know, CES stands for is an annual trade show organized by the Consumer Technology Association. This is where companies from all over the world hold presentations of new products and technologies. It's the biggest [music] tech event of the year. And guess who's dominating the humanoid robot exhibitor list? Out of 34 humanoid robot companies exhibiting 20 are from China. That's [music] nearly 60%. Untitree, Agibot, Forier, Limx Dynamics, Deep Robotics, Beijing Humanoid Robot Innovation Center, Engine AI, [music] the list goes on. The US only has five companies, same as South Korea. Everyone else combined is [music] getting outnumbered by China alone. This isn't hype. This is a coordinated national effort. Government backing, mass production, public integration, global showcase. China [music] is playing a different game. And right now, they're winning the robotics race. And while doing all this, they're also keeping their open-source AI agenda alive. Two Chinese companies just dropped some serious open-source tools. First up, Tencent open- sourced a translation model called HighMT 1.5. It works in 33 languages, runs completely offline on your phone, and it's faster than mainstream commercial translation APIs. So, if you are building an app that needs translation, this is free and it's yours. They also dropped Hyotion",
        "start": 181.599,
        "duration": 681.441
    },
    {
        "text": "First up, Tencent open- sourced a translation model called HighMT 1.5. It works in 33 languages, runs completely offline on your phone, and it's faster than mainstream commercial translation APIs. So, if you are building an app that needs translation, this is free and it's yours. They also dropped Hyotion animators. You type a guy swings a sword and dodges left and it builds the whole animation for you. And [music] then there's Alibaba. The Tongi Lab just released M AI UI. This is an AI agent that can actually use your phone for you. You tell it book me a movie ticket for tonight and it opens the app, picks the seats, and checks [music] out. It handles the tapping, scrolling, all of it. Right now, it beats every other phone agent out there. All three are free and open source. China is on a roll. On the last day of 2025, while everyone was busy partying, Deepseek just dropped a banger. CEO Leang Wenfang along with other Chinese researchers published a full research paper on something called manifold constrained hyperconnections. I know that sounds super scary and technical. So, let me break it down for you right now. AI thinks through a single lane, one thing at a time, which is super slow. Researchers tried adding more lanes so AI could think in parallel. But every time they scaled it up, the whole thing just crashed. Deepseek just figured out how to make it work without crashing. They tested it on 3 billion parameters, 9 billion all the way up to 27 billion and it stayed stable the whole way. Cost went up just 7% but thinking power jumped four times. Now here's the thing. Last time Wenfang dropped a paper, Deepseek R1 came right after. Speculations are something new is coming around Chinese New Year. That's midFebruary, barely a month away. Deep Seeks optimizing how AI thinks. But there's another breakthrough that's changing [music] which AI you should even use in the first place. Stop overpaying for AI. LLM router just dropped and it's open source. It automatically sends easy [music] queries to cheap models and hard ones to powerful models. The research shows this kind of smart routing can cut your inference cost by 30 to 50%. If you're building AI apps or agents, this plugs right into your setup. There's also a personalized router that learns from your usage history. How much are you spending on AI [music] right now? Think and give this LM router a try. Maybe that's one tool for developers. But zoom out and the entire AI world is about to gather in one place. India is hosting the AI impact summit from February 15th to 20th [music] and the guest list is crazy. Bill Gates, Demi Hassabis from Google Deep Mind, Dario Amade from Anthropic, plus Jensen Huang from Nvidia is expected too. PM Modi is inaugurating the whole thing and over 100 countries are sending",
        "start": 361.52,
        "duration": 985.4440000000002
    },
    {
        "text": "hosting the AI impact summit from February 15th to 20th [music] and the guest list is crazy. Bill Gates, Demi Hassabis from Google Deep Mind, Dario Amade from Anthropic, plus Jensen Huang from Nvidia is expected too. PM Modi is inaugurating the whole thing and over 100 countries are sending The goal is making AI available for developing nations, not just rich ones. If this works, India becomes a major player in the global AI race this year. Talking of predictions, some of the biggest tech names have shared their predictions for this new year. And and honestly, it's pretty blunt. [music] Instagram's head, Adam Mossery, just dropped a 20 slide post about how AI is going to change Instagram. He said, \"By 2026, authenticity is going to be infinitely reproducible. deep fakes, [music] AI photos, AI videos, all of it's going to look real, polished, and perfect is going to become the new cheap copy. And raw, messy, imperfect content is going to become luxury good. Imperfection is going to become the only [music] proof that something's real. And he says instead of trying to detect AI content, Instagram might just start verifying real content instead, like a stamp that says this was actually captured by a camera. And speaking of 2026, Satya Nadella also posted his predictions. He said, \"We're in a model overhang right now.\" Meaning AI models are way more capable than our ability to actually use them. So 2026 is going to be the year AI moves from shiny demos to real systems that actually do stuff. The world has seen enough of how cool AI is. [music] Now they want to know how useful it can be. Two very different takes, but both saying the same thing. 2026 is when things [music] get real. And speaking of proof, check out what just dropped this week. The last time MKBHD reviewed an AI hardware device, the company literally shut down. And now everyone's saying, \"Wait for his review on this one.\" So, a Y Combinator startup called Pickle just launched their new AR glasses, taking on [music] giants like Meta, Google, and Apple. Now, here's what actually caught my attention. With other AI glasses, you have to talk to them, command them, and wait. But these ones are way more interactive. They talk to you first. You're at a restaurant, and it already knows your food preferences and suggests a dish before you even open the menu. This isn't just another voice assistant sitting in your glasses. This is more like a second brain that's actually paying attention to your life. Piccolo powers all of this, which is basically a memory system that's constantly learning who you are connecting with, your conversations, your preferences, moments from months ago, and surfacing them exactly when you need it. Now, we've seen impressive demos before that completely fell apart in real life. But if it actually works the way they're showing it, they might be the first AI",
        "start": 525.2,
        "duration": 1288.9660000000003
    },
    {
        "text": "who you are connecting with, your conversations, your preferences, moments from months ago, and surfacing them exactly when you need it. Now, we've seen impressive demos before that completely fell apart in real life. But if it actually works the way they're showing it, they might be the first AI know you. What do you think? Game changer or just another overhyped gadget? Now for our top 10 coolest AI tools that I found this week segment where we look at the most fun and underrated tools. Let's go. Number one, Jetty is an AI health companion for people with chronic illness. It calls you daily, you just talk and tracks your symptoms and finds your triggers automatically. Number two, Lip Dub creates Hollywood quality lip sync for any video. Translate or change dialogue in any language and the lips [music] match perfectly. Number three, Keep Mind turns your notes and documents into flashcards, quizzes, and mind maps instantly. It uses smart spaced repetition so you study less but remember more. Number four, Starkly is like lovable but gives you 100,000 free tokens every month. Describe an app, it builds it with database and login ready to deploy. Number five, heap tracks how your brand shows up in chat GPT Claude and other AI answers. One API call tells you if you're being mentioned and what AI is saying about you. Number six, Samira bundles multiple AI models into one subscription. Text, image, video, audio, all in one place instead of paying for five different tools. Number seven, Crash validates your business idea with AI. [music] Paste your concept, get a report with 33 metrics on market fit, financial risk, and what to fix. Number [music] eight, Vogant lets you build AI voice agents that actually sound human. Drag and drop, no code, and they can navigate phone menus to reach a real person. Number nine, Migma creates onbrand emails from a simple prompt. It pulls your brand colors from your website and tests the email across 50 email clients automatically. Number 10, Audioscribe turns any audio recording into clean text with summaries and speaker labels. Upload a meeting, interview, or voice note and get a full transcript in minutes. Perfect for students, journalists, or anyone tired of rewinding. Drop a comment and tell me which one you're [music] trying first. So, yeah, Meta is doing everything it can to distance itself from China. Meanwhile, [music] China is on a roll with humanoid robots and open-source LLMs, and India is keeping up with both by playing the long game. [music] The AI race is going full throttle. Drop a comment with which update surprised you most and subscribe for next week.",
        "start": 684.88,
        "duration": 1570.246
    }
]