[
    {
        "text": " Nano Banana just came out and the industry is reacting strongly. We have brand new incredible examples of how to use it as well as some people saying that this is a Photoshop killer. Let me show you everything right now. Billow Sidu first. Since Nana Banana has Gemini's world knowledge, you can just upload screenshots of the real world and ask it to annotate stuff for you. So here's the prompt. You are a location-based AR experience generator. Highlight point of interest in this image and annotate relevant information about it. So, here's a picture of San Francisco. Here is the Transame pyramid. It highlighted it as you could see here. Just beautiful. And then on top of the image, placed this nice little tool tip thing and gave some information about it. Floors completed, height. It says more info, but obviously since it's an image that's not clickable. Here's another example from the San Francisco Ferry Building. Highlighted pretty well. It definitely missed a little bit over here, but still pretty good. and San Francisco, although that is misspelled. Year built, opened, etc. Here's another one, the Palace of Fine Arts. They called it Palace B. Fine Arts. Close, but definitely not it, but still highlighted it. Very cool. Plus, it is really good at extracting buildings and making them into isometric 3D objects. Look at this prompt. Make image daytime and isometric temple only. All right, here's the original. And there is the isometric 3D asset. Someone also did it for this photo. As you can see, the building which is obstructed by these street lights, by trees, by bushes, by everything. And then there we go. 3D isometric representation of that building. Nothing obstructing it, just brilliant. And then someone said, \"Add an insanely cool roller coaster.\" And there you go. So, you can have a lot of fun with this. Then Fociety said, \"Now combine it with Hunan 3D.\" And there we go, the original image. And now you can actually rotate it in 3D. So pretty incredible. Game developers are going to have essentially infinite assets to work with going forward because of AI. Now, here's another incredible example. So we have two anime characters plus a handdrawn stick figure action scene and Nano Banana Gemini 2.5 Flash image. I rather say Nano Banana puts it all together in a really cool and accurate scene featuring the two characters. It's also incredibly good at photo restoration. Apparently, this is the first photo ever taken. And as you can see, it was restored to its full glory. So, just from this rough, very rough, low pixel black and white image. It was able to recreate the scene. Obviously, it took a lot of liberties on what on what the building might look like, but still very cool. And of course, Ply the Liberator jailbroke it. Google pond Gemini 2.5 flash image preview liberated and here is the prompt. So if you want",
        "start": 0.08,
        "duration": 349.83799999999997
    },
    {
        "text": "able to recreate the scene. Obviously, it took a lot of liberties on what on what the building might look like, but still very cool. And of course, Ply the Liberator jailbroke it. Google pond Gemini 2.5 flash image preview liberated and here is the prompt. So if you want himself and I'm not going to show these images but they are explicit and of course that is against Google's terms of use from DD Nano Banana from Google just dropped today. You can take objects out of pictures creating 3D models from them just like we showed before. Let's see it again. Here's a scene where this 3D object was already created, but you can extract it and now you have it in isolation, load it into another model. You get a 3D object from it. It's a creator's dream. Bilawidu, another AI content creator, loves what he's seeing and compares it to essentially entire comfy UI workflows and Photoshop all collapsed down into a single prompt. So, closest thing we have to an image editor as an API. No control nets, Laura's IP adapters needed. You get a graphic designer's mind, an expert compositor with world knowledge. So, as you can see here, he's taking his photo and putting himself in the image. You can also get 3D mesh representations as you're seeing here. Here's the original photo and here is a 3D mesh on top. And you can also use Nano Banana to generate the initial image and then use V3 to make it into a video. So, here we go. Never start my day without my Gruns Cubs. They're packed with superfoods, greens, and vitamins, all in one tasty gummy. Who knew your greens could taste this good? These little gummies are loaded with superfoods and vitamins. And honestly, they taste like candy. Getting your daily nutrients doesn't have to be complicated. Greens Cubs give you superfoods, greens, and essential vitamins in one simple gummy. Healthy routines should be this easy. Phenomenal. Really, just very impressive. And remember, this is the worst it will ever be. And if you like connecting all of these different tools and automating things, you should check out the sponsor of today's video, Zapier. Zapier is the best AI orchestration platform out there. And so, let me tell you why I personally chose Zapier over N8N. First, Zapier empowers everyone from marketing to sales, support, HR, finance, any team, technical or not, Zapier can work for you. Whereas their competitors require technical expertise to get all of it set up. Zapier agents and workflows can also be deployed in minutes versus weeks sometimes. And Zapier has by far the most integrations with over 8,000 as compared to just 1,000. Plus, again, talking about Zapier's ease, it is fully hosted for you. So, it's super easy to get going. No servers, no patching, no scaling, no outages. So, I didn't want to have to self-host. I didn't want to",
        "start": 174.879,
        "duration": 636.4790000000005
    },
    {
        "text": "the most integrations with over 8,000 as compared to just 1,000. Plus, again, talking about Zapier's ease, it is fully hosted for you. So, it's super easy to get going. No servers, no patching, no scaling, no outages. So, I didn't want to have to self-host. I didn't want to just time away from what I really want to focus on, creating great AI content. And Zapier is of course enterprise ready with sock 2 compliance SSO audit trails role-based access versus again if you're self-hosting you have to do all of that yourself. Plus the pricing is predictable and consistent and I don't have to think about infrastructure costs with a self-hosted solution. Again I've been using Zapier for so many years. I'm so happy with it. I'm excited that they've decided to partner with me on this video. So go check them out. Tell them I sent you. Links down below. Now back to the video. Lionus Ekinstam, another fellow content creator, using it for trying on clothing, which seems to be a very popular use case for this model. Check this out. Here's the original photo. Here's the furry jacket he wants to put on. And there it is on him. And it looks flawless. I would not be able to tell it was an AI generated coat unless I knew or I can see the little watermark in the bottom. And style transfer seems to be really good as well. I had a little bit of luck with it when I was testing it, but look at this. We have the famous Muhammad Ali knockout photo. And what if we transferred it to be Simpsons? And there we go. The head is a little off. I can see that the head is kind of tilted to the left a little bit. But overall, it's really good. We have Go Homer in the background, Custy the Clown, we have Marge right here. And yeah, everyone else looks good. It also excels at color enhancement. According to Call on Twitter, we have the original photo. This photo is boring and flat. Enhance it. Increase contrast. Boost coloring. make it richer. There we go. Just like that. So easy. And the same guy call also put together a list of all the things that Nano Banana is especially good at and some of the things that it kind of falls short on. So the good style transfer, object references, minor and major corrections, changing colors, adding color, basic Photoshop enhancements like contrast and brightness, relighting the scene, changing facial expressions, text removal, character positions, the bad, it struggles with fonts. Now, I haven't found that. I've actually found it's quite good with fonts. Smooths images too much. Cannot add detail. Transparency is made up. Cannot do. Cannot refocus. remove depth of field, adds a watermark, can't defog, struggles with realistic looking sci-fi backgrounds, don't mention race, ethnicity, or gender, or else it spits",
        "start": 320.4,
        "duration": 921.8390000000007
    },
    {
        "text": "found that. I've actually found it's quite good with fonts. Smooths images too much. Cannot add detail. Transparency is made up. Cannot do. Cannot refocus. remove depth of field, adds a watermark, can't defog, struggles with realistic looking sci-fi backgrounds, don't mention race, ethnicity, or gender, or else it spits noticed it fails at consistently is face replacement. If I want to put my face on the Mona Lisa, for example, obviously I don't want it to just cut my face out and place it there. I wanted to blend the two styles together and make it look realistic. It doesn't do that. It won't even try. It's the weirdest thing. It just spits out the original image and nothing more. Here's another example of what you can do with Nanobanana and other tools. Here is Nano Banana plus Seed Dance 1.0. Create an insane AI anime with Nano Banana and Cedance 1.0. It takes less than 2 hours. And so where Nano Banana comes in with these other tools is it allows you to do jump cuts as you're seeing here. Here's a shot, then a cut, another cut, another cut. And the consistency between cuts is what Nano Banana excels at. So, you take a frame from the original and you say, \"Okay, make it this character, but have him doing this other thing or riding a bike or anything you want and then you continue to animate it using seed dance.\" I'll drop the link down below if you want to follow his guide directly. And it's also really good at shifting the camera perspective. Look at this. We have a nice drawing right here. Here's the input image and here's the output image. A completely different angle, but the style stays incredibly consistent. And last, Elon Musk of course had to say Grock is better. So we have Techdev Notes saying Nano Banana versus Gro imagine. Here's Nano Banana. Two cats in front of the Eiffel Tower. And here's Gro imagine. Honestly, they are basically both the same. I don't see any difference in quality. Of course, Elon says Imagine turns out better in this case. I don't understand what he's referencing in better. They both look the same quality. He says that said upcoming versions of Imagine will be radically better. Now Elon Musk is known for his puffery, but it's exciting to think what might be coming nonetheless. So that's it. I wanted to show you some of the quick reactions from the industry, some of the awesome examples. If you enjoyed this video, please consider giving a like and subscribe.",
        "start": 464.96,
        "duration": 1156.559000000001
    }
]