[
    {
        "text": " That short film, no camera crew, no equipment rentals, no VFX team. I made that using an AI tool called Higsfield Cinema Studio. Now, I'm not going to pretend you can make that exact film in 10 minutes. [music] That took hours, lots of experimenting, lots of that's not quite right. Let [music] me try again. But what I am going to show you is the workflow. How I picked cameras, how I chose lenses, how I directed camera movements, the actual decisions that make the difference between AI slop and this actually looks like a movie. By the end of this video, you'll stop typing cinematic into your prompts and start actually directing. There's [music] eight steps. Let me walk you through each one of them. All right, step one, get into the tool. Head over to higsfield.ai. Once you're in, click on Cinema Studio in the top navigation. Click new project. And this is your workspace. Now you've got two modes at the bottom, image and video. Here's the thing most people miss. You want to start with image mode first. Get your look locked in, then move to video. Let's set up our shot. Step two, set up your canvas before you touch the prompt. Batch size, aspect ratio, resolution. Before we write the prompt, let's configure a few things. [music] Batch size. I set this to four. That means it generates four images at once. So, you have [music] options to choose from. Aspect ratio. I'm going with 16 to9 cinematic. Same ratio as movies. Resolution 2K balanced is good [music] for testing. You can bump to 4K for final exports. These are small choices, but they save you time later. Now, describe what you want to see. Most people write prompts like they're texting a friend. Cool cinematic shot of a guy. That's not going to work. The AI has no idea what cool means to you. [music] Here's how we actually write prompts. A Roman emperor in battleworn golden armor scrolls through a phone in a neon lit [music] soul PC gaming cafe at 3:00 a.m. Energy drinks on the table. See the [music] difference? We're telling it who a Roman emperor. what he's doing scrolling through a phone where soul PC gaming cafe when 3:00 a.m. [music] details, energy drinks, neon lights, battle worn armor. The more specific you are, the better your results. Step four is where this tool becomes completely different from everything else. Click this camera icon. Now you've got four controls. Camera, lens, focal length, aperture. Let me break these down simply. Camera body. This is the flavor of your image. Ariel Alexa 35 Hollywood standard. Clean, beautiful colors. Red V Raptor, sharper, punchier, great for action. Sony Venice, softer, more natural skin [music] tones. IMAX film camera, big, epic, grand scale lens changes background blur and image texture. Cook S4 soft, creamy background blur. Hawk Vite, anamorphic, those horizontal flares. Re Signature Prime, clean,",
        "start": 15.2,
        "duration": 350.16099999999994
    },
    {
        "text": "standard. Clean, beautiful colors. Red V Raptor, sharper, punchier, great for action. Sony Venice, softer, more natural skin [music] tones. IMAX film camera, big, epic, grand scale lens changes background blur and image texture. Cook S4 soft, creamy background blur. Hawk Vite, anamorphic, those horizontal flares. Re Signature Prime, clean, close-ups. Focal length 8 to 50 mm. Lower equals wider shot. Higher equals tighter shot. Aperture f1.4 to f11. F1.4 equals blurry background. F11 equals everything sharp. And here's the cheat code. If this sounds overwhelming, just click recommended. Cinema Studio autopick settings for you. Step five, hit generate. Cinema Studio generates a batch of four images. Same prompt, same settings, but each one is slightly different. This is where you become the director. You're choosing the one that feels right. Take your time here. This image is going to be the foundation for everything. [music] Quick thing before we get into video mode. If you want to stay ahead in this AI world, I have a WhatsApp community where I share all the latest AI updates, tools, workflows, what's actually working, link [music] in the description, and it's completely free. And by the way, a lot of you keep asking in comments how I make my videos. At 500,000 subscribers, I'm revealing my complete AI workflow. So, if you're not subscribed yet, now's the time. All right, [music] back to Cinema Studio. Step six, animate your image. Select your winner. Click animate. Now, we're in video mode. Your image is loaded as the start frame. You can add an end frame for precise control. Duration, I go 5 seconds per clip. Audio, toggle on if you want generate sound effects. Step seven is where this tool really shines. [music] Click movements. You've got static, handheld, zoom out, zoom in, pan left, pan right, tilt up, tilt down, dolly in, dolly out, and there's a few more. I'll let you explore those yourself. These aren't random AI movements. These are the same moves real directors use. I'm going with handheld. It adds that raw documentary energy. And look at that. The armor catches the neon light. The handheld shake makes it feel real. That's a cinematic shot. From a single prompt and a few clicks. Step eight, [music] and this is the one most people don't know about. Right click on your image. You'll see what's next generates the next frame in sequence. Multi-shot generates eight different angles of the same subject. Same Roman emperor, same gaming cafe, eight different compositions. This is how you build a scene. Wide, medium, close-up, different angles to cut between. This is how you make movies with AI. Now, that was the workflow, but let me show you what it looks like when you put it all together. I made a short film using everything I just showed you. Same tool, same process. Let's watch it first, then I'll break down exactly how I made it.",
        "start": 192.72,
        "duration": 671.0409999999998
    },
    {
        "text": "with AI. Now, that was the workflow, but let me show you what it looks like when you put it all together. I made a short film using everything I just showed you. Same tool, same process. Let's watch it first, then I'll break down exactly how I made it. this. This opening shot, the high security building. The prompt was super basic. High security building in a wide shot. That's it. [music] But the camera setup, RedVraptor JDC XL Express lens. That's anamorphic. 8 mm focal length for that ultra wide look and f1.4 aperture. That combination gives you the flood lights flaring into the lens. Instant cinematic feel. And here's the key, multi-shot. Once I figured out the villain's look, I hit multi-shot and got eight different angles instantly. Top angle, side view, front, close-up, all from one image. That's how you build coverage for editing. Now, I'm not going to lie, this took multiple iterations. You don't get perfect output on the first try. You generate, review, adjust, generate again. That's the process. And if you are ever stuck on camera settings, just hit recommended. It picks the best setup for you. Once I had all my clips, I imported everything into Premiere Pro, added sound [music] effects, compiled it together, and that's how you get from this tool to a short film. So, here's the thing. A year ago, none of this was possible. AI video was morphing faces and melting backgrounds. Now, you can pick a camera body that cost $60,000. Choose a lens that cinematographers fight over. Direct camera movements that would normally require a full crew. You don't need film school to think like a director. You just need to understand the workflow. And now you do. That's the workflow. Eight steps from idea to cinematic shot. I've got more videos on crazy AI tools and workflows. You can find them right here. I'll see you in the next",
        "start": 434.319,
        "duration": 858.7220000000002
    }
]