[
    {
        "text": " OpenAI just dropped their web browser and it is incredibly impressive. They have completely reimagined what the web browser should be from the search and URL bar all the way to what an actual assistant controlling your browser will be like. So in this video I'm going to break it all down for you. Let's get started. So this is Chat GPT Atlas, an AI native browser from Open AI. They just finished the live stream. It was Sam Alman and a bunch of the folks who were responsible for creating Atlas and they showed off a number of different use cases. Now, of course, a lot of this should feel somewhat familiar if you've ever used the Perplexity Comet browser, but in terms of fit and finish, OpenAI's design is really just unmatched. So, this is what Atlas looks like. It should feel very familiar. It is like the home screen of what you would see in the Google Chrome browser. And on the left side, which is kind of new, you have all of your chat history from Chat GPT. Now, in the main search bar, you have two options. You can either put in a URL and it will navigate you to that website, or of course, you can put in a prompt or a query. Then down below, you also get a few suggested actions, including agent mode, which is when Chat GPT fully controls the browser on your behalf. And I'm going to get more into that in a moment. But really, what sets Chat GPT apart from any of the other frontier models and really will set Atlas apart is its memory feature. Chat GPT by far has the best memory feature. The more you use it, the more it gets to know you, the better it actually performs. and they've taken that and put it now into your browser. So, as you can see here is complete Air France booking reviews today's calendar review travel planning history. All of these things are suggested based on what you've already done with the browser. So, the more you use it, the smarter it gets. So, here you can see they're typing in hackernews.com and of course it's suggesting the URL. You just start typing it. This is all table stakes for any browser at this point. So good to see it here. But of course you can also use it like chatbt. You can give it instructions. You can give it a task. You can give it a query and it will go and do that. And so in this next example, they're actually going to query the search history of the browser to find something when you don't remember exactly where it came from or what it was called. And you can kind of just describe what it is. And that's what they're about to show. I have actually been using this technique in my email system. I use superhuman and much more",
        "start": 0.08,
        "duration": 325.68000000000006
    },
    {
        "text": "find something when you don't remember exactly where it came from or what it was called. And you can kind of just describe what it is. And that's what they're about to show. I have actually been using this technique in my email system. I use superhuman and much more their AI search and it is so much easier to find what I need when I have millions of emails that I need to search through and I kind of remember what the email was about but I don't remember who it was from. I don't remember any keywords. That's the best way to do it. And now you can search through your browser history. So watch this. search web history for a doc about Atlas core design. And here are the results. Now, this page should actually feel quite new because I've never seen anything like this in another browser. So, the first thing you're going to get is an actual chat GPT response. It used tools. It figured out what you were asking for and it's actually providing you with that specific page that it found in your history. Now, these tabs at the top are incredibly important. Keep an eye on those. I'm going to come back to that in a minute and explain what they are. And of course, if you love Chat GPT but hate paying for multiple AI subscriptions, check out the sponsor of today's video, Abacus. There are so many AI tools out there, it becomes incredibly expensive to get access to them all. Trust me, I know. And there's a better way. With Chat LLM by Abacus AI, you get access to Chat GPT5, 03 Pro, Gemini 2.5 Pro, Claude 4.1, Gro 4, Deep Seek, and many others. And with Route LLM, it automatically picks the best model for whatever prompt you give it. And you get the latest image generation models like Seeddream, Nano Banana, AOG, Flux, and more. And you can even generate video, cling, runway, Helio with just a simple prompt. and their humanized feature turns obviously AI written text into something that looks more human. So it goes from boring AI generated to something unique and compelling. And last they also have deep agent which is a powerful general agent that can build websites, apps, AI agents, chat bots, presentations and complete research reports. And all of this is just $10 per month. Visit their website by clicking the link down below that lets them know I sent you. And thanks again to Abacus. Now back to the video. Next, of course, you have the chatbt assistant with you in every single web page. Wherever you are on the internet, it will be there. You can ask questions to it. You can assign a task. You can even invoke agent mode with the full context of whatever web page or all of your tabs that you're looking at at any given time. So, in",
        "start": 162.72,
        "duration": 611.3600000000001
    },
    {
        "text": "Wherever you are on the internet, it will be there. You can ask questions to it. You can assign a task. You can even invoke agent mode with the full context of whatever web page or all of your tabs that you're looking at at any given time. So, in GitHub poll request, and they're trying to figure out if it's lowrisk enough to just merge before they actually release Atlas to the public. And so, watch what he types. So, first he says, \"Summarize this task and its acceptance criteria.\" And of course, pretty straightforward for chat GPT to do. But now, it actually has access to that repo directly from the context of that tab. So, it does so really well, easily. But then he goes on to ask, is this safe to cherrypick into the RC release client launching today? And so it has to not only understand the context of what's on the page, but it's actually going to try to figure out is this code lowrisk enough to cherrypick or not. So based on the diff, this commit is mostly visual and non-destructive. So it determined it is lowrisk enough. Next, they're going to do a search for the new PTA Paul Thomas Anderson movie. Watch this. So, new PTA movie news and reviews. Hits enter. And now coming back to those tabs at the top. This is where it really gets interesting. So, the first tab, what you're seeing here is a more traditional chat GPT summary. You get links at the top. You get images right here. You get a breakdown of the film. You get what reviewers are saying. Again, all of this is synthesized from Chat GPT's web browsing ability, which you can do directly in Chat GPT. But here's where it gets really interesting. So the first tab at the top, it's like a worldwide web icon. And what this is is a more traditional search engine result. And I actually believe Google is powering it cuz look at this. They have the little Google link at the top right. Plus, it is lightning fast. And of course, to do search really well, it is incredibly difficult. There's really only one company in the entire world that's doing it at scale and that impressively, and that's Google. And so this is likely powered by Google. At least that's what I can tell. Then you can click over to images, again, powered by Google. You can click over to videos, again, powered by Google. And you can kind of tell it's powered by Google cuz every single video is from YouTube. But this is really cool. You have all the different options. If you want a more traditional search experience, if what you're asking requires a more direct path and you already know where you want to go, this is actually a really good option. And so I'd say nine times out of 10 I'm using",
        "start": 308.56,
        "duration": 890.7210000000001
    },
    {
        "text": "You have all the different options. If you want a more traditional search experience, if what you're asking requires a more direct path and you already know where you want to go, this is actually a really good option. And so I'd say nine times out of 10 I'm using search queries at this point. But for that one time out of 10 where I know where I want to go, but I just don't remember how to get there, Google is still better. It's faster, it's more direct, and it's more accurate. And of course, you get the news tab as well. So all of those other tabs powered by Google, the first tab powered by Chat GBT. Now throughout the result, the Chat GBT results, you can actually click on any of these links. the chat GPT result slides over. It's actually a really clean animation. And then the web page loads up. And then of course you can continue querying against that web page. Watch this. So here he clicks the link and there's roger debert.com with the full review of the movie and then the chatbt response slides over to the right and you can continue the conversation there. So here he asks, can you summarize this review in five words or less? And after reading the page, it says PTA Paul Thomas Anderson's best thrilling political masterpiece. And next, they're going to show off invoking Chachi PT even more deeply in the web page and specifically Gmail. So check this out. So they go to Gmail. Here we go. He already has a draft written up. He clicks into the draft. There's the draft. And then right from inside the web page, you can invoke chat GPT. So he highlights it and right there you click it. describe your change. It already knows it's text. It already knows what it can do with text and you simply write, you know, clean it up and it will do that right there. So, there is the updated text. You click update. You can edit it right here or you can click cancel. There it is. But where AI native browsers really get powerful is when they can actually control your browser on your behalf. So, watch this. So this is a Google doc and then of course on the right side we have chat GPT. So we have some instructions on the right. First add comments in the name column right here tagging everyone using their email who didn't fill in their task. Then go to active issues in the haunted house linear tracker in my history. So referencing not an active tab but a tab from the history. And for each current week task already in the doc issue in the linear tracker and assign the relevant person. So really referencing multiple web pages, multiple applications, and then actually having chatbt accomplish a task on your behalf. Let's watch. All right, so we kick it",
        "start": 449.919,
        "duration": 1186.5610000000001
    },
    {
        "text": "from the history. And for each current week task already in the doc issue in the linear tracker and assign the relevant person. So really referencing multiple web pages, multiple applications, and then actually having chatbt accomplish a task on your behalf. Let's watch. All right, so we kick it looks like when chatbt takes over your browser. It's actually kind of a beautiful design, and it's very obvious. So we have the little hovering mouse, and you can actually see what chatbt is doing the entire time. And that is a very intentional design decision. They want you to have trust in Chat GPT. They want you to be able to see what it's doing at each step along the way so you can build that trust. And let me just briefly tell you about the sponsor of this segment, Dell Technologies. And a quick thank you to Dell Technologies for sponsoring this part of the video. Dell Technologies has a family of laptops and desktop PCs featuring Nvidia RTX Pro Blackwell chips, which are absolute beasts for AI workloads. Check out the family of products linked down below. So they've kicked off that task and now they've switched to another task because remember in this agentic browsing world, you don't have to sit there and watch the agent do your task. If it takes 10 minutes, go ahead and kick it off and move on to the next task and then it'll alert you when it's ready. Here they're going to show off another example of a recipe and an ingredients purchasing example. So here he said, \"What ingredients do I need to cook this recipe for eight people?\" And here we go. He then decides, okay, I only need the meat and produce, so go order that for me. So here he says, can you order the meat and produce for me? And it already knows it's time to take control of the browser. So you can say continue, no thanks. And you have this nice little drop- down option of logged in, logged out. So you can select on every single query whether chat GPT is automatically logged in or not. And this is why OpenAI launched their own browser. This is why Perplexity Comet was so good and why operator, their really first iteration of controlling the web browser really fell short. Having to input your authentication information, your login and your password every single time was a nuisance. And not only that, Operator would spin up a private environment in the cloud every single time. Now you can just give it control of your local browser. So it has access to all of your loginins, of course, with approval. It has access to all of your history and everything else that you're doing locally. You don't need to spin up a private environment for this. So, here it goes. You can see starting process for order and it's thinking opening",
        "start": 599.68,
        "duration": 1476.241
    },
    {
        "text": "to all of your loginins, of course, with approval. It has access to all of your history and everything else that you're doing locally. You don't need to spin up a private environment for this. So, here it goes. You can see starting process for order and it's thinking opening opening that web page and you can take control at any time. You can stop it at any time. And of course, you really want to be careful when you're giving AI full control of your browser, full control of your credentials. Just be careful. But when it's finally ready to purchase, you're going to see what happens. It won't actually purchase it for you. It's going to let you review it, which is really the best way to go. So, here you can see the mouse is moving around. It typed orange bell pepper. It's adding it to the cart. You can see it's actually interacting with the website directly, adjusting item quality, searching for green onions, garlic, and ground beef. And so, let's skip forward a bit to see it complete. So, here we go. It put together a full Instacart order from Safeway for the user and it waited when it was finally done for the actual purchase to be completed by the human user. Now going back to the previous example, it worked for 3 minutes. It put together all of the tasks in linear. It updated the Google doc. Let's take a look. So this is linear now. Here we go. We can actually see comments with the tasks that the users need to complete. So, Chat GPT Atlas is available today for Mac users. So, hopefully you have a Mac and they're going to be releasing Windows as soon as they can. It is available for free to every single type of chatpt user. Now, if you want to use agent mode, that's only available in the plus and pro plans for now. So, go to chatpt.com/atlas. You can see in the top right it has download for MacOSS right there. I'm going to be testing it, so be sure to stick around for the next video coming soon. If you enjoyed this video, please consider giving a like and subscribe.",
        "start": 747.6,
        "duration": 1688.3999999999992
    }
]