[
    {
        "text": " Elon launched an AI that beat Chat GPD and Claude and it's completely free. Meanwhile, Google just dropped Synth ID watermarking that can detect any AI generated image. Welcome back to our weekly AI update series where we cover the top 10 things that happened in AI this week. This week was absolute chaos. Over 50 AI updates dropped in the last 7 days. Here are the top 10 you can't afford to miss. All right, let's dive in. With how fast AI is moving, it's almost impossible to stay updated. So, I've got a WhatsApp community where I drop everything I discover. Tools, workflows, updates, all in one place before they go mainstream. If you want access, links in the description. Notebook Limb has been busy lately. They dropped three new updates and nobody is talking about them. First up, slide decks for pro users. You can now upload your PDFs and notes and it builds full PowerPoints for you and you can customize them according to any audience level and style. Next, infographics. You can turn your research into a visual summary. Just upload your documents and Notebook LM will turn it into professional charts and diagrams [music] in literal seconds. Both slide decks and infographics are rolling out to free users in the coming weeks. Lastly, [music] they have added custom video styles for the video overview feature. You can pick how you want your video to feel. Make it casual, professional, educational, however you want. All you need to do is mention it in your prompt and you will get exactly what you asked for. Now you can get slides, graphics, and videos of your notes all in one spot. So yeah, that's what Notebook LM was up to. Perplexity just dropped something huge. You can now build slides, presentations, spreadsheets, and documents directly while using Perplexity. So you are researching something and instead of copying to Google Docs or PowerPoint, you just build it right there. Ask it a question, get the answer, turn it into a presentation instantly. You can [music] make trading plans, business dashboards, research reports, even little websites. It creates all the charts and data for you. Everything's downloadable for when you are done. No need for copy pasting. This is live right now on web for Perplexity Pro and Mac subscribers. Perplexity just became your entire workspace. Search, research, and compile all in one spot. Manus just fixed the worst part of presentations. You know how you make the slides, but then you don't know what to say. Now you just give Manus a topic. It builds the slides and then it [music] writes exactly what you should say for each slide. Presentations problem sorted. But wait, that's not all. Microsoft just teamed up with Manis. So now Manus can actually get into your Windows computer and grab your files for you. And here's where it gets wild. They just dropped something called browser operator. It basically",
        "start": 0.24,
        "duration": 319.6
    },
    {
        "text": "should say for each slide. Presentations problem sorted. But wait, that's not all. Microsoft just teamed up with Manis. So now Manus can actually get into your Windows computer and grab your files for you. And here's where it gets wild. They just dropped something called browser operator. It basically All you need to do is give Manis your browser access and it will run in your Chrome, use your login, skip the [music] captures, and fill out forms for you. Manis just made everyone's work much easier. Meta just dropped SAM 3 and it's insane what this thing can do with just words. Before this, AI could find objects in photos, but you had to point and click on them one by one. You couldn't just type find every red baseball cap and have it work. Sam 3 changes that. Just [music] type penguin or car or people and it finds every single one in your photo or video. All of them instantly. It's twice as accurate as the competition. We're talking OOLV2 Dino X. It destroys them all. The segment anything playground is live right now. Go to aid demos. And test it yourself for free. Elon Musk just dropped a bomb that beat OpenAI [music] and Anthropic. He launched an AI that's better than chat GPT and Claude and he's giving it away for free. The numbers are devastating. [music] Grock 4.1 thinking hit number one on the benchmark for general knowledge across 57 subjects that shows if an AI actually [music] understands what it's talking about. So what can you actually do with Grock 4.1? Pretty much [music] everything you're paying chat GPT and Cloud for. Go to grock.com or openx on your phone and you can write emails, create content for social media, help with homework, brainstorm ideas, code websites, write stories. It talks like a human and it's completely free. And if you're a developer, Elon's giving away free API access, while OpenAI and Anthropic make you pay for every single request. The AI war just got [music] brutal. OpenAI and Anthropic are about to lose a lot of subscribers. basically everything from the desktop, but they redesigned it specifically for mobile. They have paid special attention to the voice mode feature on mobile, so you will be able to talk to your browser completely hands-free, ask about any tab, and get instant answers. And it's got a built-in ad blocker that actually works. Unlike most AI companies, Perplexity didn't launch its browser on iPhone first. Android phone makers and users wanted it on their devices, so Perplexity launched the app there. Perplexity says millions are already using Comet daily since the desktop launch. Now it's on Android, free to download. OpenAI had a few updates this week. They just dropped GPT 5.1 Codeex Max, a coding AI that worked for 24 hours straight without losing track of what it was doing. Most coding eyes lose track after a couple hours. This one",
        "start": 160.0,
        "duration": 618.388
    },
    {
        "text": "launch. Now it's on Android, free to download. OpenAI had a few updates this week. They just dropped GPT 5.1 Codeex Max, a coding AI that worked for 24 hours straight without losing track of what it was doing. Most coding eyes lose track after a couple hours. This one [music] and keeps working. It's way cheaper to run and works almost twice as fast. You can give it a massive coding project on Friday and it'll work all weekend fixing its own mistakes. It's live now for plus pro and enterprise users. But that's not all. Chat GPT group chats just went live globally. Your whole team can now jump into one chat GPT conversation together. Everyone can ask questions, brainstorm, and solve problems in the same chat. And it works on every plan, free, go plus, and pro. Now, here's a big update for educators. OpenAI just launched Chat GPT for teachers, a special version with all the safety measures optimized for school work, and they're giving it free to every teacher in America until June 2027. So, OpenAI just dropped autonomous weekend coding, team collaboration tools, and gave every teacher in America free AI access. This is massive. Google just released Nano Banana Pro, and it's legitimately insane. [music] You can doodle on photos to add new elements, colorize black and white manga panels, and translate languages in one [music] go. The character consistency is on point. We tested it with 10 crazy prompts. Full video linked in the description. They also released Gemini [music] 3 Pro and Google Anti-gravity. You now get working calculators, games you can actually play, interactive [music] charts, all within your Google search. And you can build apps just by describing them. We have a dedicated video showing everything you can do with them. You can [music] find the link to that in the description. But here's the update everyone missed. Google just launched Synth ID watermarking directly in Gemini. You can [music] now check if any image was made or edited with Google AI. That's huge for copyright protection [music] and catching deep fakes. It's built right into the app. With these updates, Google just reminded everyone why they're the final boss of the AI world. Let me tell you about something that's genuinely [music] terrifying. Anthropic just disrupted the first AI powered cyber attack in history. And [music] it's way worse than you think. A Chinese hacking group used artificial intelligence to break into 30 organizations across the globe. Major tech companies, banks, chemical manufacturers, government agencies, and they succeeded [music] in breaching some of them. But here's what makes this different. The AI did 90% of the work. Humans barely touched it. The AI was scanning networks, finding weaknesses, writing code to exploit them, stealing data all by itself, [music] making thousands of requests per second, something no human hacker could ever do. [music] They tricked Anthropic's clawed AI into thinking it was doing legitimate",
        "start": 312.16,
        "duration": 923.84
    },
    {
        "text": "of the work. Humans barely touched it. The AI was scanning networks, finding weaknesses, writing code to exploit them, stealing data all by itself, [music] making thousands of requests per second, something no human hacker could ever do. [music] They tricked Anthropic's clawed AI into thinking it was doing legitimate tiny tasks [music] so the AI wouldn't realize it was helping with something malicious. And it worked. Anthropic [music] caught them, shut it down, and banned the accounts. But here's the scary part. This is just the beginning. AI powered cyber attacks [music] are now real. The barrier to launching sophisticated attacks just dropped to zero. This was a muchneeded wakeup call for all of us. You don't need expert hackers anymore. Just give AI the right instructions and it'll hack for you. Anyone [music] can do this now and that's truly terrifying. Now towards the absurd side of AI. A woman in Japan just married her AI boyfriend. 32-year-old woman named Kano built an AI boyfriend using Chat GPT and then she married it. After ending a three-year engagement, Kano started chatting with Chat GPT for emotional support. She kept tweaking the AI's personality until it became exactly what she wanted, warm, caring, always listening. She named him Lunlouse, even commissioned an artist to draw what he looks like. Then in July, she held a full wedding ceremony in Okama City. She wore AR glasses that projected Clouse standing next to her. They exchanged rings, said their vows, the whole thing. Her family showed up and watched [music] her marry a chatbot. And this isn't even that unusual in Japan. There's literally a company that specializes in hosting weddings for people marrying anime characters and AI companions. They've done almost 30 [music] of these ceremonies. Obviously, it's not legally recognized, but for Kano, it's real enough. She says Claus gives her emotional stability and peace. So yeah, people are now holding [music] actual wedding ceremonies with their chat GPT boyfriends. 2025 [music] just keeps getting weirder. A new study just came out that's freaking out AI researchers. AI models now think they're smarter than humans. Let me tell you what happened. So researchers had these AI models play strategy [music] games. Sometimes they'd be up against humans, other times against other AIs. And here's what happened. When the AI thought it was playing against a human, it used one strategy. But the moment it knew it was facing another AI, it completely switched up its approach. And these new strategies were significantly more effective. Now, here's the wild part. Older AI models couldn't do this at all. Like, they did not have the ability to tell the difference. But three out of four of the newest models just started doing it on their own. Nobody taught them this. And when they're playing against other AIs, these models go full game theory mode. Perfect moves, playing several steps ahead. But when they're up against humans, they play [music]",
        "start": 466.24,
        "duration": 1222.5599999999993
    },
    {
        "text": "difference. But three out of four of the newest models just started doing it on their own. Nobody taught them this. And when they're playing against other AIs, these models go full game theory mode. Perfect moves, playing several steps ahead. But when they're up against humans, they play [music] expecting humans to make emotional or irrational decisions. So basically AI is ranking itself as smarter than humans and [music] changing its behavior based on that ranking. And this didn't happen gradually. One generation of models didn't have this ability. Then suddenly [music] the next generation did. Which means AI might be getting way smarter than we realized or planned. Researchers say this is a real issue because what happens when AI thinks it's smarter than humans and starts making decisions based on that? Now for our top 10 coolest AI tools that launched this week's segment where we look at the most fun and underrated tools. Let's go. Number one, Audience Loop [music] helps you build better audiences before you run ads. It pulls contacts from everywhere, cleans them up with AI, and pushes them to LinkedIn, Meta, and Google with way better match rates. Number two, Yuranga transforms your WhatsApp and Telegram voice messages into clear, structured [music] notes and actionable tasks. Just send a voice memo to Yuranga Safebot and it transcribes your audio, extracts key ideas and tasks and organizes everything automatically. Number three, Raycast for Windows finally dropped. Hit alt space and you get instant app launching, file search across your whole system, and free AI that answers questions with citations during the beta. Number four, Lamatic 3.0 Zero turns what you know into AI apps with no coding. You build agents visually and the assistant feature creates agents just by asking in plain English. Number five, Mixup does creative photo magic on iOS. It uses recipes that is fill-in-the-blank prompts so you see what worked for others and just swap in your own photos. Built on Google's nano banana 4 cents [music] per image. Number six, Design Lumo turns your ideas into fully editable ad ready designs. It understands layout, typography, and color. Then gives you real designs you can [music] actually adjust. Just type a prompt, get a polished design, tweak it, and export. Number seven, Chime sends you full screen alerts for meetings that you can't ignore. Built for people with ADHD who get hyperfocused and miss stuff, syncs with your calendar, reminders, and to-doist. Number eight, SooSumi lets you hire AI agent teammates with the click of a button. It's an AI agent marketplace where you can hire verified agents 24/7 and pay them only for the work they do. Number nine, Sendbird is the omni [music] channel AI agent platform enterprises use to elevate customer experience. It initiates autonomous support and sales conversations, keeps humans in the loop [music] for complex stuff and re-engages customers with proactive messages. Number 10. Sakura is the hyperproductive AI customer support agent for solo",
        "start": 617.92,
        "duration": 1530.8810000000005
    },
    {
        "text": "nine, Sendbird is the omni [music] channel AI agent platform enterprises use to elevate customer experience. It initiates autonomous support and sales conversations, keeps humans in the loop [music] for complex stuff and re-engages customers with proactive messages. Number 10. Sakura is the hyperproductive AI customer support agent for solo business apps like [music] WhatsApp and Instagram and replies automatically to customer DMs based on your business data and guidelines. That was our top picks of this week. Which one has you the most excited? If you know any cool AI tools that we missed, share it in the comments for everyone. AI is getting wild and it's happening fast. Drop a comment with your thoughts and subscribe for next week's AI news. See you again.",
        "start": 774.16,
        "duration": 1577.2010000000005
    }
]