[
    {
        "text": " This video is brought to you by Spotter. More on them later. I'm up in San Francisco, so different background, got the bird behind me, but there's tons of AI news. Let's get into it. First, seemingly from the future, we have a near telepathic wearable that allows you to effectively think and it will know what you're thinking. According to the post, this enables silent communication at the speed of thought. So, here's how it works. You put on this little device and you kind of almost mimic talking, but you don't actually talk. And it's somehow able to determine what you meant to say. Here's how it works. Alter Ego passively detects the downstream subtle signals your brain sends to your speech system before words are spoken aloud. It captures only what you intend to say. It never reads your thoughts, only picks up what you want to communicate. Now, I've been lately talking a lot about voice AI as the main interaction layer between humans and AI, but I didn't know this is going to be coming right around the corner. I'm going to assume it's not going to work great right out of the box, but assuming this kind of tech can work, this would be an even better replacement for typing. I still think voice is really important, but if this works, this would be great for if you're in public spaces. This technology is normally called silent speech, but we've made a breakthrough called silent sense. Silent Sense picks up the entire spectrum of speech from the mouththing of words all the way to motionless intent to speak. I cannot wait to try this. Stay tuned. As soon as I do, I'm dropping a review next. Do you remember Oasis 1.0 from Deck Art? That was a system to use Diffusion to transform games into different styles. Now we have Oasis 2.0. So, here's Minecraft in the Swiss Alps or Burning Man. And you can swap these game worlds by using the game mod. This looks really cool. Try it out. Let me know what you think. Next, Chinese models are taking over, and you're going to see that even more in a moment. Alibaba has released Quen 3 Max, the second most intelligent non-reasoning model over a trillion parameters. It's Alibaba's largest model to date, but it is not open source, and it is not open weights. Here's where it falls on the artificial analysis leaderboards. So number one still GBT 5 high all the way down here quen 3 max preview right below gro code fast one right above quen 3 235 billion so it is a pretty good model but it is closed source and it is a relatively inexpensive model as well so congratulations to Alibaba on that release next apparently openai might be dropping a competitor to Nano Banana very soon has found GPT image0721 won mini alpha that is strawberry verse banana battle of the fruits and of",
        "start": 0.08,
        "duration": 335.27900000000005
    },
    {
        "text": "is closed source and it is a relatively inexpensive model as well so congratulations to Alibaba on that release next apparently openai might be dropping a competitor to Nano Banana very soon has found GPT image0721 won mini alpha that is strawberry verse banana battle of the fruits and of but we shall see and of course the kind of rule of artificial intelligence is as soon as you see one company do something just a few weeks later you're going to get a really highquality competitor next apparently Apple is building out a perplexity competitor this is an AI powered search engine now I haven't seen a single AI powered anything from Apple that makes me think they're going to be successful with this. But again, they're Apple. They have all the devices. They have billions of users. They have all the cash that they can ever dream of. And don't think Apple is down for the count. They're definitely behind, but they have enough cash to make it work. We'll see what happens there. I actually think maybe a better plan would be just to acquire Perplexity. Han has released a new image model. We've officially released and open- source Hunan 2.1, our latest textto image model. New in 2.1, advanced semantics supports ultraong and complex prompts of up to a,000 tokens and precisely controls the generation of multiple subjects in a single image. Precise Chinese and English text rendering, rich styles, and high aesthetic, high quality generations at 2K. But that's not it. Bite Dance released Seeddream, which apparently we've been doing some internal testing on my team, is quite comparable to Nano Banana, which is really kind of the gold standard of image models right now. I'm going to be testing it out. Let me know if you want to see a full testing video. And if you like creative AI endeavors, check out the sponsor of today's video, Spotter. I frequently get asked what my process for creating videos is, and I want to share something I've been exploring. So, this is Spotter Studio, and I want to show you how I've been testing it out. So, the process starts from Spotter Studio. And if I'm feeling stuck on an idea, I can use the ideas for you feed to give me inspiration and it is tailored to my channel. And even if I have a half-baked idea, I can use the AI brainstorm within Spotter Studio to help me ideulate through it. Once I have a strong contender for an idea, I put it in the idea bank. From there, it helps me prioritize by showing me keywords that are trending for my specific topics and ones that historically have performed well specifically for my channel. And it even gives my draft titles a title score to help me figure out which one is going to work best. From there, the winning idea moves into projects and I can use AI to",
        "start": 167.76,
        "duration": 613.1989999999997
    },
    {
        "text": "my specific topics and ones that historically have performed well specifically for my channel. And it even gives my draft titles a title score to help me figure out which one is going to work best. From there, the winning idea moves into projects and I can use AI to it's incredibly important to really focus on the packaging. That's the title and the thumbnail for a video. And so that's why Spotter really comes in handy to help me visualize the idea before I commit to it. And right now, Spotter is running a limited time summer deal. You can get a yearly membership for just $99 to Spotter Studio, which is 80% off the original price. I'll drop the links in the description below. Check it out. Let me know what you think. Now, back to my video. Next, OpenAI is still having trouble converting to a for-profit company. I thought they stopped doing that. They actually put out a blog post a little while ago saying they dropped their plans to do that, but here we are again. According to the Wall Street Journal, OpenAI executives rattled by campaigns to derail for-profit restructuring. They have been talking about leaving California, which would be insane because they have such a massive office and so many people in the San Francisco area in a single building. And if they leave, they would have to move all of them. Open AAI executives are growing concerned that mounting political scrutiny in California could styy their efforts to become a for-profit company and have discussed a lastditch option of moving out of the state. Some of California's biggest philanthropies, nonprofits, and labor groups are joining forces to push back on the startup's highstakes restructuring plan. And remember, for those of you who are not familiar, OpenAI started as a nonprofit and then became one of the most important companies in the entire world. And then, of course, they want to become a for-profit to pay back investors to incentivize employees to work hard, work long for them. And because OpenAI is controlled by a nonprofit, they are asking the state's attorney general to ensure the new company it creates doesn't violate the state's charitable trust law. Failing to restructure could be catastrophic for the world's most valuable startup, imperiling its future fundraising efforts and a potential public listing. Open AAI's financial backers have conditioned roughly $19 billion in funding, almost half of the startup's total in the past year, on receiving shares in the new for-profit company. So, a lot of moving pieces, a lot of constituents, very complex. They're trying to find a way to be forprofit, and we're just going to have to follow along and see what happens. And in more OpenAI business news, according to the information, OpenAI says its business will burn $115 billion through 2029. And if any of you are saying, well, that's surely the signal of a bubble, no, it's not. This",
        "start": 308.639,
        "duration": 907.439
    },
    {
        "text": "just going to have to follow along and see what happens. And in more OpenAI business news, according to the information, OpenAI says its business will burn $115 billion through 2029. And if any of you are saying, well, that's surely the signal of a bubble, no, it's not. This Valley. companies burn a ton of money until they find profitable economics and then they become insanely profitable. Look at Amazon. Look at Meta. Look at all of these companies Uber that have just burned tons of VC dollars in the path to dominance. Revenue growth for OpenAI is accelerating faster than they predicted at the same time. But computing costs are also accelerating. OpenAI projected its cash burn this year through 2029 will rise even higher than previously thought to a total of $115 billion. That's about $80 billion higher than the company previously expected. A massive jump. But look, ChachiPT is still the gold standard in terms of artificial intelligence for consumers. Everybody knows Chachi PT that is the verb. Go Chachi PT it. So I have a lot of hope for the company and I'm pretty sure they will be all right. Next in kind of news out of left field, the company ASML now is Mistral's biggest external owner. So according to ASML themselves today, leading semiconductor equipment manufacturer ASML, one of the most important companies in the entire world for semiconductor GPU chip manufacturing, says them and Mistrol will be having a strategic partnership based on a long-term collaboration agreement. In addition, ASML is investing€ 1.3 billion euros in Mistral AI series C funding round as lead investor. And you know what? I am glad there's competition because the more competition, the more consumers benefit from the AI race both in terms of overall intelligence and cost. We want cost to go down. We want intelligence to go up. Competition does both of those things. Next, Google released Embedding Gemma, a brand new state-of-the-art embedding model that is designed for ondevice artificial intelligence. And if you're not familiar with what an embedding model means, it basically just means converting data like natural language, unstructured data into an embedding which goes into usually a vector database. Then it's easily searchable by artificial intelligence. This entire process is also known as rag retrieval augmented generation. Embedding Gemma can work together with models like Gemma 3N to power advanced generative AI experiences and rag pipelines. The model is the highest ranking open multilingual text embedding model under 500 million parameters on the MTEB leaderboard offline first by design. I love companies pushing the compute to the edge. So here are the MTEB leaderboards. You can see embedding Gemma right here. I'll drop a link down below so you can see this benchmark in more detail yourself. Next, two new stealth mode models made its way onto Open Router. Soma Dusk Alpha and Soma Sky Alpha. Context: 2 million tokens, which makes me think maybe it's a Google",
        "start": 458.24,
        "duration": 1243.9199999999992
    },
    {
        "text": "Gemma right here. I'll drop a link down below so you can see this benchmark in more detail yourself. Next, two new stealth mode models made its way onto Open Router. Soma Dusk Alpha and Soma Sky Alpha. Context: 2 million tokens, which makes me think maybe it's a Google haven't actually tested it myself. I've heard other people test it and say it's just okay. But with 2 million tokens, there's a lot you can do. And it is completely free. Go try it. Let me know what you think. How does it perform? Drop a comment below if you've already used it. Next, Cognition, the company behind Devon and acquired Windsurf a month or so ago, has just announced a massive new fundraising round. We have raised over $400 million at a $10.2 billion post money valuation to advance the frontier of AI coding agents and social media personality and boxer Jake Paul is actually in the round and had an interesting post about it. an AI content creator and engineer and he puts on a fantastic AI conference. Swix is also joining Cognition full-time. So, great for them. Congratulations on that big raise. All right. And remember, I said Chinese models are starting to enter the leaderboards. Check this out. This is Ella Marina and we have at number six, Quen 3 Max Preview under GPT5 chat. And according to Ella Marina, Gemini 2.5 Pro is still number one. Here's GPT5 High. Here's 03, which is surprisingly still up in the top. Claude Opus 4.1. But look at this. Just a few spots below, we have Kimmy K2, which is an openw weightights model. And I am just so happy to see all of these open- source models in the leaderboard. So really appreciative of these Chinese companies putting out these open- source models. We need open- source, and it's fine to have closed source, but it's good to have open source as competition as well. Next, Unitry is eyeing a $7 billion IPO. If you're not familiar, Unitry is the Chinese company behind incredible humanoid and dog form robots that are really on the cutting edge of robotics. Now, you look at companies like Tesla with Optimus. You look at Boston Robotics and Figure Robot, and these are all American companies building robots. This is a Chinese company building a far cheaper robot. I don't know how they compare. I don't really have a benchmark to compare them against, but again, competition is good. Hopefully, they raise some money. And in news that probably everyone saw coming, Microsoft is going to start buying AI from Anthropic. The great decoupling of Microsoft and OpenAI continues. Microsoft just about a week ago released their own in-house baked model, and now they're also going to be buying from Anthropic. This has really been Microsoft strategy from almost the beginning of their company. partner with everybody, buy from everybody, build with everybody, and provide the platform",
        "start": 628.32,
        "duration": 1544.72
    },
    {
        "text": "OpenAI continues. Microsoft just about a week ago released their own in-house baked model, and now they're also going to be buying from Anthropic. This has really been Microsoft strategy from almost the beginning of their company. partner with everybody, buy from everybody, build with everybody, and provide the platform They have no allegiances greater than the dollar. So, according to the information, Microsoft is taking its biggest step to lessen reliance on OpenAI's artificial intelligence by embracing the startup's bitter rival, Anthropic, to power its most important software business. Microsoft will pay to use Anthropics technology for some AI features in Office 365 apps. According to two people involved in the effort, the move will blend anthropic and open AI technology in the apps after years in which Microsoft primarily used OpenAI for the new features in Word, Excel, Outlook, and PowerPoint. This is a great decision. Why have platform risk? Especially when you're one of the biggest companies on the planet. It also can be seen as a negotiation tactic. Again, remember Microsoft owns, I think, 49% of Open AAI, and Open AAI needs Microsoft to sign off on the conversion of forprofit. Of course, why would they do that? Because then they're going to start cutting Microsoft out. So, all of this is just insane negotiation tactics and business strategy, and it's a lot of fun to watch. So, I'm going to keep reporting on it. Stay tuned for more. All right, next quick story. The Claude app on your phone can now connect to different apps. So, according to Claude's blog post, with your permission, Claude can find nearby spots, check your calendar, and schedule events, all without leaving the app. So, here it is. You give it location access, and now it can use maps. It can also dig into your calendar and so on. As I mentioned, cool little feature update. Very nice. And also, Claude can now create and edit files. So, this is on your computer, but turn conversations into Excel spreadsheets, documents, PowerPoint, slide decks, and PDFs directly. The more that these AI applications are able to put their tentacles into your computer, the more valuable they're going to become. And of course, the more of the primary application that you go to all day, every day they become. So, another quick update from Claude. All right, Apple had their big event this week. They announced the new iPhone, iPhone 17 Air, iPhone 17 Max, and they have new AirPods. I've been saying for a little while, I think AirPods are probably Apple's best chance to dominate artificial intelligence. They are highly personal. They excel at voice AI. Obviously, they need to update Siri or get someone else in there like chatbt voice, but it's the perfect form factor. You put them in your ears. You can wear them for hours on end, no problem. They last all day. And now they also come with real time voice translation. So,",
        "start": 780.88,
        "duration": 1830.3990000000006
    },
    {
        "text": "need to update Siri or get someone else in there like chatbt voice, but it's the perfect form factor. You put them in your ears. You can wear them for hours on end, no problem. They last all day. And now they also come with real time voice translation. So, language and you hear it back in your native language instantly. It's super impressive. And it's kind of a weird time we're in where I think a lot of people look at this and say, \"Okay, that's cool.\" and don't realize how insane this technology truly is to be able to get live translation. So, it's a cool update from Apple. That's about all they announced that was AI related, though. And then Nvidia made a big announcement. So, Nvidia unveils Reuben CPX, a new class of GPU designed for massive context inference. This is a GPU made for large context windows, which is incredibly important. So, Nvidia Ruben CPXGPU is purpose-built to handle million token coding and generative video applications. It packs eight exoflops of AI performance and 100 terabytes of fast memory in a single rack. And they even talk about the ROI of the model, so companies can monetize at an unprecedented scale with $5 billion in token revenue for every 100 million invested. It's kind of insane that they're promoting it like that. And next, Oracle shares have surged. I didn't have this on my bingo card. Apparently, Oracle is powering a ton of AI inference. I think they came out of left field on this one, or at least I wasn't aware of it. Oracle Corp shares gained the most since 1992, a very old company, after the company gave an aggressive outlook for its cloud business, cementing the software makers place in the race to support demand for artificial intelligence computing. The stock surged as much as 43%, bringing its market valuation to nearly a trillion. Again, where did Oracle come from? And it made Larry Ellison, the founder, the world's richest person. And Salesforce released their own model. And apparently, it's really good. Check this out. Meet SFR Deep Research, our reinforcement learning trained autonomous agents that can reason, search, and code their way through deep research tasks. They have SFRD 20B achieves 28.7 on humanity's last exam text only, which is really good. SFRD agents are trained to operate independently without predefined multi-agent workflows. They're trained with end-to-end reinforcement learning and they're trained to manage their own memory. So, here it is. Look at that. Outperforming Kimmy Researcher 04 Mini and Deep Research with 03 on humanity's last exam. Again, another surprise story cuz I did not have Salesforce dropping a cutting edge frontier model. And once again, thank you to Spotter for sponsoring this video. Check them out. I'll drop all the links down in the description below. Let them know I sent you. So that's it for today. If you enjoyed the video, please consider",
        "start": 926.16,
        "duration": 2138.3190000000013
    },
    {
        "text": "have Salesforce dropping a cutting edge frontier model. And once again, thank you to Spotter for sponsoring this video. Check them out. I'll drop all the links down in the description below. Let them know I sent you. So that's it for today. If you enjoyed the video, please consider see you in the next",
        "start": 1082.08,
        "duration": 2140.8000000000015
    }
]