[
    {
        "text": " Every week, 230 million people open Chad GPT and ask health questions. Chad GPT saved a person from dying. Quite literally, Google just pulled off a master stroke. They quietly integrated Gemini AI into Gmail. 3 billion inboxes updated overnight. And most of you didn't even notice. You just woke up and AI was already sitting in your inbox. While Nvidia made AI 10 times cheaper, Elon Musk raised $20 billion to destroy all competition. These two are basically in a race to make AI almost free for everyone. And humanoid robots have already started working in real factories. 2026 just started and we are already witnessing massive shifts. By the end of this video, you'll see the pattern. AI isn't coming to your daily life. It's already there. Let me break down everything for you. Chad GPD saved this woman's life. Last year, Fiji Simo, who's the CEO of Applications Open AIS, was in a hospital bed due to a kidney stone infection and was prescribed a standard antibiotic. But just to double check, she asked Chad GPT to check it against her medical history, and it immediately flagged that this drug could reactivate a serious infection she had a few years ago. That's the brutal reality of healthcare today. Doctors only have a few minutes with patients, and your records are scattered across a dozen portals and apps, so no one actually sees the full picture. Over 230 million people ask Chad GPT health questions every week, but it could only give generic answers because it didn't actually know your health history. That just changed. OpenAI launched Chat GPT Health, a private space where you connect your actual medical records. Now, when you ask about your lab results or prep for a doctor's visit, it actually knows your situation and gives you real answers. These conversations get their own isolated memory with separate encryption and won't be used to train models. OpenAI worked with 260 doctors from 60 countries for 2 years to build this. It's not replacing your doctor, but it's a health assistant who finally has your complete picture and is available 24/7. Open AI just made Chat GPT your health assistant, but Google just rewired your entire inbox while you were sleeping. Google just dropped the biggest Gmail update in 22 years. And most of you won't even notice it happened. Starting this month, 3 [music] billion Gmail users are getting AI features turned on by default. You wake up, open your inbox, and AI is already there. Here's what all changed. Open a long email thread, and the summary is waiting for you. Gmail reads the whole conversation, pulls out key points, and keeps it ready for you. Suggested replies got a massive upgrade. This isn't the old thanks but button anymore. Gmail now learns how you write your tone, your style, your word choices, and generates replies that sound just like you. Help me write lets you draft entire emails from a rough",
        "start": 0.96,
        "duration": 354.4000000000001
    },
    {
        "text": "it ready for you. Suggested replies got a massive upgrade. This isn't the old thanks but button anymore. Gmail now learns how you write your tone, your style, your word choices, and generates replies that sound just like you. Help me write lets you draft entire emails from a rough of seeing emails in order, Gmail now shows you a briefing. If you have any bills due tomorrow, it gets [music] highlighted. Got a flight next week? It groups it with your hotel booking. Now, here's why this matters beyond features. Google surveyed users. 85% want AI that uses their personal content and 92% of workers under 40 want personalized assistance. So, Google made it the default. This is distribution at scale. Google just updated your inbox while you were sleeping. AI isn't coming to your daily life. It's already there and you probably won't even notice. Nvidia just showed us a glimpse of the future at CES 2026. [music] New chips that/ AI costs an open-source brain for self-driving cars and AI video that's already running on their nextG hardware. Let's talk about each one in detail. The cost of running and training AI is insanely high. Nvidia has just solved that with their latest release called Rubin. These are like six chips designed to work together. GPU, CPU, networking, all talking to each other perfectly. As a result, the cost of running AI becomes 10 times cheaper and five times more powerful than Blackwell. You need four times fewer GPUs to train the same models. That means faster tools, fewer limits, and AI apps become affordable to use. And it's already being put to work. Nvidia just partnered with Runway Gen 4.5, and it is now the first video AI running on Reuben. Now, that's the infrastructure. But Nvidia didn't stop there. For the longest time, self-driving cars have had a problem. They can see the road fine, but when you throw them a weird situation, like if a traffic light goes out or construction pops up, they freeze. [music] They can't think through new problems. Enter Alpameo. It's an AI that doesn't just see, it reasons, works through situations step by step like a human driver would. And the wild part, they're open sourcing the whole thing. the model, the simulation tools, 1,700 hours of driving data, all for free. Mercedes is already shipping this in their new CLA this year. We're a week into 2026, and Nvidia is dropping updates like crazy. That's why they're a trillion dollar AI monopoly. Nvidia is building the infrastructure. But Elon Musk just destroyed them all with a single move. Elon Musk's X AI just raised $20 billion at a whopping $230 billion valuation to crush Open AI and Google. He's primarily going to use that money for compute. XAI is rapidly scaling the world's largest AI supercomputers, Colossus 1 and 2 in Memphis, which now run over 1 million H100 GPUs. That's more firepower than",
        "start": 189.84,
        "duration": 669.6799999999998
    },
    {
        "text": "$20 billion at a whopping $230 billion valuation to crush Open AI and Google. He's primarily going to use that money for compute. XAI is rapidly scaling the world's largest AI supercomputers, Colossus 1 and 2 in Memphis, which now run over 1 million H100 GPUs. That's more firepower than 5 is already in training. Soon they're launching their own vibe coding platform called Grock Build. But XAI and Elon aren't just building another AI model. They're building a full AI ecosystem. X gives him real-time data from over 600 million users. Tesla feeds physical world data from millions of vehicles. Colossus gives him massive computing power. And now with Grock build, he'll have all the software data, too. Data, compute, models, and distribution all under one roof. Whimo just revealed something that [music] could change how you get around forever. Meet Oji, the brand new robo taxi van launching to the public this year. This thing is loaded with Whimo sixth generation hardware. We're talking 13 cameras, six [music] radars, four LARs, plus heaters, wipers, and sprayers to keep every sensor crystal clear. See, Whimo has already completed over 10 million rides with a 93% satisfaction rate. And compared to human drivers, their autonomous system has 90% fewer serious injury crashes. That's not a small improvement. That's a completely different safety tier. Whimos also adding Hyundai Ionic five robo taxes to the fleet and expanding to 12 new cities this year, including Denver, Las Vegas, and even London. The driverless future is soon going to be the new normal. Self-driving cars are going mainstream, and AI is also showing up in places you'd never expect, like your gaming desk. Razer, the gaming company, just dropped something straight out of a sci-fi movie. A tiny AI character that lives on your desk, watches your screen, and coaches you while you're gaming. They're calling it Project Ava, which is a 5.5 in holographic companion. And unlike Siri or Alexa, this one has eyes, an HD camera that tracks you, and dual mics that listen to you. And the wild part is that it can see your screen in real time and gives you gaming tips as you're [music] playing. Android Authority tested it during a Battlefield demo and asked it questions like, \"Which site should I use for medium-range combat?\" It analyzed the game menu and gave instant recommendations. But the craziest part is that AA runs on Grock. Yes, Elon's AI from X. This isn't just another gaming accessory. It is a part of Razer's massive $600 million AI bet. They're going allin and are hiring hundreds of AI scientists and researchers to build an entire ecosystem. Razer put AI on your desk and LEGO has just put a computer inside their blocks. Your favorite childhood toy company just built a computer inside a tiny 2x4 brick. LEGO revealed their smart brick and what all it can do is just crazy. LEGO designed their own chip from",
        "start": 359.039,
        "duration": 989.336
    },
    {
        "text": "Razer put AI on your desk and LEGO has just put a computer inside their blocks. Your favorite childhood toy company just built a computer inside a tiny 2x4 brick. LEGO revealed their smart brick and what all it can do is just crazy. LEGO designed their own chip from stud. Snap on a special minifigure or tile and your build comes alive. Lightsabers hum, TIE fighters roar, X-wing engines fire up. No more making sound effects with your mouth. But here's where it gets wild. These bricks talk to each other. How does it do that? Wow. Build two race cars, crash them together, and they make impact sounds. And parents, you don't have to worry about privacy or safety. LEGO is keeping it completely private. No cameras, recording, or listening. This is LEGO's biggest update since they invented the minifigure back in 1978. First smart brick sets drop in March. Star Wars X-Wing and Tie Fighter. The inner child inside me is super excited to give it a try. From toys to tools, 11 Labs just dropped something that solves transcription forever. 11 Labs dropped Scribe V2 to solve transcription forever. So they've got two versions now. First one, real time, which is built for speed. We're talking 150 milliseconds. So before you finish saying a word, it's already typed out. Perfect for live calls, voice agents, realtime captions. Second one, Batch, which is built for scale. Perfect for long podcasts, hour-long meetings, entire video libraries. They tested it against all the big players and it crushed them. Has the lowest error rate and it works across 90 languages where most models completely fall apart. Here's the cool part. You can teach it up to 100 custom words, your brand name, technical jargon, weird pronunciations. It learns [music] them and never messes up again. It also figures out who's speaking automatically. spot sensitive info like credit cards and if someone switches languages mid-con conversation it handles it like a pro. All these tools, all these updates, but here's the thing nobody's talking about that will actually decide who wins in 2026. 2025 was all about AI agents. 2026 is going to be about the AI harness. Let me explain it to you very simply. An AI model is a powerful car engine and the agent is the car itself. But the things keeping the car on the road, the driver, steering wheel, dashboard, that's the harness. Without it, the agent drifts off track. It starts forgetting instructions and loses control. An agent harness manages the AI's memory. It keeps it focused during long tasks and stops it from going off track. Claude Code is already doing this. In 2026, the smartest model isn't going to win. The best harness model will, and that's what everyone building in AI needs to prioritize. Now, for our top 10 coolest AI tools that I found this week's segment, where we look at the most fun and underrated tools. Let's go. Number",
        "start": 532.24,
        "duration": 1305.0149999999992
    },
    {
        "text": "2026, the smartest model isn't going to win. The best harness model will, and that's what everyone building in AI needs to prioritize. Now, for our top 10 coolest AI tools that I found this week's segment, where we look at the most fun and underrated tools. Let's go. Number full songs with vocals from a text prompt. Pick any genre, describe what you want, and get studio quality music in [music] minutes. Number two, Gatsby writes entire research papers for you. Give it a topic and it creates a full draft with citations, figures, equations, and tables. Number three, Vibe Coder is a dating app that lives inside your code editor. Swipe and chat without ever leaving VS Code or Cursor. Number four, Optab shows you how your brand appears in AI search engines like ChatGpt, Claude, and Perplexity. Track your visibility and improve your ranking. Number five, 2B.AI turns any text you highlight in your browser into a task. The AI breaks it down into steps and helps you finish it. Number six, Instruct [music] connects to your apps like Gmail and Slack, then does the work for you. Just type what you need done in plain English. Number seven, Komos lets you record yourself doing a browser task while talking through it. The AI watches and turns it into an automation. No code needed. Number eight, Mintly turns your product photos into video ads. Upload an image, pick a [music] style, and get UGC content ready for Tik Tok or Instagram. Number nine, Ampliff combines social listening, influencer search, and AI visibility tracking in one place. Built for marketers who want to stop jumping between tools. Number 10, Okara is a private AI chat with over 20 open- source models like DeepSeek, Llama, and Quen. Switch between them without losing your conversation, and your data stays encrypted and never [music] trains the AI. Drop a comment and tell me which one you're trying first. Tons of updates and news. I know it's a lot to take in, so let's just zoom out for a second. Chat GPT caught what doctors missed, and now your medical records can live inside AI. [music] Gmail directly integrated AI without even telling anyone. Nvidia made AI cheaper to run, which means more tools, faster everywhere, and Elon raised $20 billion to dominate. Humanoid robots are no longer in demo phase. They've already started working. your health, your inbox, your workplace. [music]",
        "start": 703.279,
        "duration": 1556.3929999999987
    }
]