[
    {
        "text": " Chad, GPT, Claude, Gemini, Grock, Kimik 2. Five AI models one winner I put every major AI model through 10 different tests from writing emails to building apes to finally answering the question everyone's asking Which one is actually worth your money I'm not just testing one thing We're going full spectrum Everyday tasks content creation coding challenges and learning 10 ultimate tests to tell which model is better And in the last three tests we will push the boundaries to see which model keeps standing and which ones give up But do not miss the with test It will truly shock you By the end of this video you will know based on your use cases exactly which ones you need to pay for Let's start with what you actually use AI for every day By the way I'm dropping all 10 prompts from this video in my free WhatsApp community Almost every day I drop the latest AI updates tools workflows. Everything I find goes there first So seriously don't miss out Links in the description This video is sponsored by Multi. More on them later All right so the first test we're doing is writing an email Can these AI models actually write like a human We're testing tone clarity and professionalism across all five models I've got my prompt ready Same exact prompt going into all five models to keep this fair Here's the test Write a LinkedIn message to a hiring manager at Google. I'm a marketing pro with 5 years of experience trying to break into techs Make it personal not sales In chat GPT, I'm using GPT 5.1. For Claude, I'm using Claude Sonet 4.5, which is their smartest for everyday music tasks In Gemini, I'm using Thinking with 3 Pro. That's their Gemini 3 Pro model with extended reasoning For Grock, I'm using Gro 4.1, which is their latest model And in Kimmy, I'm using Kimmy K2. That's their flagship model Kimy's ready Let me paste the prompt and hit enter on all five at once Let's start the first test and see who wins Everyone's got their output Let's break it down Chat GPT first Chat GPT's output is pretty concise It's aligned with how I'd actually write Not bad Now, let's check Claude. Okay, Claude gave us a subject line which is music nice but it starts with \"I hope this message finds you well Way too generic We said \"Make it personal not salesy.\" music and Claude went the traditional corporate route All right let's see Gemini. Gemini gave us three different options This is nice music We don't have to prompt Gemini for multiple options It just gave us variety right out the gate And music check this out It explains why each option works Option one is the super user approach Option two is common ground Option three is direct and humble Each one comes with strategy notes Plus, it gave",
        "start": 0.08,
        "duration": 324.237
    },
    {
        "text": "for multiple options It just gave us variety right out the gate And music check this out It explains why each option works Option one is the super user approach Option two is common ground Option three is direct and humble Each one comes with strategy notes Plus, it gave far this is the best output I've seen Let me read option one Hi, I've been following the recent updates Yeah, this actually sounds like something a real person would write All three options look really solid All right now let's look at Grock. Grock gave us a massive paragraph This is a lot of text Nobody wants to read a message this long in 2025. This is definitely not winning on length or readability Last one Kimmy. Okay, Kimmy missed the subject line and it went pretty traditional too But wait it's asking \"Why would an HR manager lead a marketing effort Kimmy totally misunderstood the prompt We said \"I'm a marketing professional trying to get into music techs not that I'm an HR person doing marketing So, this round the clear winner is Gemini. Gemini wins on tone accuracy 100%. Length, not too long not too short Perfect. And the big music question would I actually send this Yes, 100%. I'd use Gemini's email because I've got three solid options to pick from One test down four more sections to got Let's see if Gemini can keep this lead Okay, let's start another test Can it improve your writing without losing your voice Did it actually improve the text Did it preserve the original intent And did it overdid it or just right I have my prompt ready I'm going to be pasting it in all these models music Let's hit enter Cool. Charge GPT is running so fast it has already given us the answer Gemini is way ahead too Let's analyze the answers Chpt shortened it and added extra annoying Claude also tightened it kept it casual but more neutral I'm not sure if anyone has won here yet Let's check Gemini. Oh, it has again given us two options And the best part music it's asking us do you want me to make it more formal The two options just music makes one prompt effort better Grock hasn't given any reasoning and it says my damn wallet and pissed me off Wait, I don't think it has shortened it It just rephrased and added words music I never said Kimmy has given us concise answer but no reasoning This test is very hard to define which one has won but definitely Grock hasn't won because Gemini has given us two outputs and explained what changes it made Gemini 3 Pro is clearly standing out here I won't say the winner but standing out Okay, so now we are doing the daily task test I'll paste the prompt in all five models Suggest five side hustle ideas I'm a content writer Have 10 hours per",
        "start": 165.36,
        "duration": 605.1969999999998
    },
    {
        "text": "changes it made Gemini 3 Pro is clearly standing out here I won't say the winner but standing out Okay, so now we are doing the daily task test I'll paste the prompt in all five models Suggest five side hustle ideas I'm a content writer Have 10 hours per how original the idea is how actionable and variety music chat GPT is really fast GPT has organized it very properly Part-wise, music five parts Claude is very textheavy, hard to ready But Claude has a little more depth It has recommended which tools you might need like convert kit Cool. Both stand on same format Now let's music check Gemini. The hero of our last two experiments The best part it has focused on the time schedule which we clearly mentioned 10 hours per week It has focused on my available time So that is where it is standing out The AI humanizer music and content polisher If you have observed the last two outputs they haven't even mentioned AI anywhere The concept companies are flooding with AI content music But it sounds robotic Your service is humanizing their AI drafts Actually true This side hustle is very much aligned to today's market condition not based on old data Cool. The SAS case study specialist Software companies are desperate for social proof You interview their clients and write success stories Why it works One case study can be worth thousands and I music have seen this Real reviews from happy customers has driven me crew of business This advice clearly makes sense Fourth, ghostwriter for boring industries Everyone tries to be ghostwriter for teach CEOs. I get tons of DMs every music day so I know the pain The real money with less competition is logistics manufacturing These founders have money but zero time Clearly makes sense music Now rock LinkedIn ghost writing for teach founders which Gemini clearly said this market is crowded It hasn't given music any detail just this is the thing you can do do it I am not very impressed music Now Kimmy social media hook factory Now this is something which is crazy In social media the thing which drives reach is hook If you specialize only in writing attention-grabbing music opening hooks creators will hire you because you're driving huge growth and it music has given how to start Analyze our viral content create swipe file of 100 winning hooks offer free rewrites to build testimonials That is a good way So definitely Gemini comes on top Okay. So now we are ready for the next test Learning something new We are testing the teaching ability Can they make complex ideas simple We're looking for clear accurate and engaging explanations Here's my prompt Explain how AI like Chat GPT actually works I'm not technical Use analogies I want to understand what happens when I type a question Chad GPT says imagine you're talking to a very fast very well read",
        "start": 310.4,
        "duration": 907.720999999999
    },
    {
        "text": "ideas simple We're looking for clear accurate and engaging explanations Here's my prompt Explain how AI like Chat GPT actually works I'm not technical Use analogies I want to understand what happens when I type a question Chad GPT says imagine you're talking to a very fast very well read music It learned by reading millions of books but instead of memorizing them it learned patterns When you ask a question it predicts the next word one word at a time Next when we come to Gemini our allative king as of now it has given us really good analogies It says AI is essentially a massive prediction machine The education the library approach the answer superpowers autocomplete like your phone suggests next word and the chef analogy chat GPT as a master chef The ingredients are the words you type The recipe is the patterns it learned The meal is the answer it creates It's time for Grock to shine Imagine you walk into a gigantic library with a magical librarian who has memorized everything Your sentence gets broken into tokens Think of them as Lego bricks of language Here's the weird part The AI has amnesia It has no persistent memory of what it said a second ago Kimmy as well has given music us a lot of big paragraphs Your question gets chopped into Lego bricks The frozen stew of patterns The attention spotlight Actually to be honest Kimmy has broken down the complete process a lot which was the standing part from every other model Cool. So for teaching ability Gemini music wins with the best analogies Library, autocomplete, chef really made it clicks Grock had good stuff too with the amnesia part but the winner is Gemini 3 Pro. Now, if you're still confused after all these tests like which model is actually best music for your specific use case and you want to compare them side by side yourself that's where today's sponsor Multi, comes in Once you're in music you can choose from tons of different models Okay, so let's do a LinkedIn post test I'll load up the same models we've been using GPT 5.1, Gemini 3 Pro, Claude music Sonet, but let's try Opus this time and Grock 4.1 fast Here's our prompt Write a LinkedIn post with a controversial but defensible opinion Let's see music what happens So, Multi is running all four simultaneously And look Claude Opus 4.5 finished first then Grock, then Gemini 3 Pro, and GPT 5.1 music came in last Let's look at the outputs Claude, unpopular opinion Remote work doesn't kill culture bad managers do Grock, bold take Remote work is a productivity trap disguised as freedom Gemini, fully remote work creates a massive career ceiling for entry-level employees All three understand what works on LinkedIn. GPT 5.1 hot take remote work is great for companies but bad for most ethical professionals It's concise but feels a bit robotic probably",
        "start": 464.319,
        "duration": 1209.5959999999989
    },
    {
        "text": "is a productivity trap disguised as freedom Gemini, fully remote work creates a massive career ceiling for entry-level employees All three understand what works on LinkedIn. GPT 5.1 hot take remote work is great for companies but bad for most ethical professionals It's concise but feels a bit robotic probably Claude Opus 4.5 won this one Gemini 3 Pro second GPT 5.13rd, Grock 4.14. But yeah as you could see using Multi was a great experience It is so easy to used It's very fast music It's beautiful So, if you want to run tests like this yourself check out Multi atmulti.ai. music link in description Now, let's see their image generation capabilities Claude doesn't have image generation music nor does Kimmy, but Gemini has Nano Banana Pro. Chat GPT music has its image generation and Grock has Aurora. So, let's test the prompt Create an Instagram worthy ideographic about five morning habits of successful people Use dark theme with neon music accents Modern, clean sharable Okay, so Gemini has given up It's saying something went wrong while Grock was very fast and it has given us a ton of outputs to use from and these outputs are crazy good Just see the graphic design It's actually standing out Now let's look at chat GPD's results Although the text is good but it's pretty basic Cool. Now let's get back to Gemini once more with Nano music Banana Pro. And this time Gemini has given us an output Although the text are good but it's very basic Let me retry Okay. I was thinking that Grock's output must be the best but Gemini has actually surprised me As you can see it music has added all the billionaires pictures Jeff Bezos, Mark Zuckerberg, and it has also added icons music text and some explanation as well Gemini has made it Instagram worthy I still think we will have to do some improvement but yeah this is a good output music It's definitely usable So, Chad GPT gave us a good but generic results Grock gave tons of options and crazy good design But Gemini's final output with the billionaire pictures and explanations that's actually usable Winner, Gemini's Nano Banana Pro. Okay, enough with the small experiments Now it's time to build something Here is where it gets interesting Can these AI actually build things for people who don't know how to code This is not for developers This is for people from marketing background or some other background who have music like literally zero context of how to code but they have some ideas which they want to build What we are testing is can a non-coder get a working tool with zero coding experience So let's make a pomodoro timer I have my prompt ready and I'm going to be pasting them directly here So everyone is creating uh cloud has already created it GPT just started creating it Gemini has also created it Grock has created it",
        "start": 616.88,
        "duration": 1512.0769999999986
    },
    {
        "text": "working tool with zero coding experience So let's make a pomodoro timer I have my prompt ready and I'm going to be pasting them directly here So everyone is creating uh cloud has already created it GPT just started creating it Gemini has also created it Grock has created it so GPT finally delivered the code after keeping me waiting But here's the catch I can't actually preview it So I ran a few more prompts asking GPT to give me a preview And you know what It actually delivered Design-wise, GPT has killed it The UX is solid too Focus print working pause button skip button that transitions between focus and break This is genuinely well done But Claude has given us although Claude is very biased for this purple color Okay. The best thing I think Gemini has given us one of the best output Work mode has a different color Brake mode has a different chill vibe You can start it will start focusing You can reset it Cool. So I I definitely love the Gemini's output at the same time Actually surprised with the Gro's output as well It's very clean minimal Although Gro's output is pretty basic but at least you are getting the preview which GPT was not providing Kimmy everything is completely messed up The orientation is messed up Alignment is messed up Visually, it's bad but it's working Cool. So, this was the builder test So, next test resume red flag scanner We are testing real world professional utility and attention to details In this test we are uploading a resume with intentional red flags employment gaps job hopping vague descriptions typos Let's give a prompt Review this resume as if you're a hiring manager Find every red flag be brutally honest So, let's do it Chat GPT has given brutally honest hiring manager style review It has actually found the major red flags It's a professional summary February typos and headers are an instant deal breaker for many hiring managers Extremely unrealistic claims increased revenue by 300%. music Built revolutionary AI algorithms Claude has also given us really good found the critical typos such as professional summary opportunity fib Gemini has also given us a really good output It's given us strength and depth that honestly Gemini just can't match but it has given us what's actually required Grock has also given us really good output and it's really really in-depth. Kimmy has also given us really good output but it's not that great It is good I think these four models have actually stand out Chat GPT, Claude, Grock, music Gemini. But like all these four models has given really good output neck to neck Hard to choose who to go with Let's start with testing their visual intelligence as in image analysis and attention to details Here's the prompt I gave Compare these two thumbnails and analyze the differences in design colors text layout Highlight what",
        "start": 771.12,
        "duration": 1827.036999999999
    },
    {
        "text": "has given really good output neck to neck Hard to choose who to go with Let's start with testing their visual intelligence as in image analysis and attention to details Here's the prompt I gave Compare these two thumbnails and analyze the differences in design colors text layout Highlight what completely different YouTube thumbnails One is super clean the other is a bit chaotic Let's see if they can actually tell us which one gets more clicks Pasting the prompt Let's got Chat GPT first It's breaking down layout colors Strong center focused for thumbnail one More complex structure Three faces Bold headline for thumbnail two Nice. It gave us a sideby-side summary table Final verdict Thumbnail two is better for emotional pull Thumbnail one is better for professional clarity It even suggests improvements Solid. Let's try Claude next According to Claude, overall winner is image music one Claude's going with the cleaner look Professional polish clean design brand consistency Okay, Claude played it safe here Now Gemini music are king so far Highlevel overview first then detailed analysis layout colors text strategy This is interesting Provocative statement Google just one is clickbait in a strategic way And the verdict for click-through rate and broad appeal Thumbnail two it captures FOMO, but for search and utility thumbnail one This is a very nuanced take music Gemini actually understands the intent behind each thumbnail This is smart It's time for Grock. It shows the images at the top with a table comparison Verdict: Thumbnail music 2 wins decisively Extreme emotional contrast Visual proof It tells a complete dramatic story in one image Grock is very confident music No hesitation And then Kimmy comparative analysis by elements What may not work Thumbnail two music the logo looks sloppy Okay, Kim is being critical of the design elements Fair points but nothing groundbreaking So, here's my take Gemini gave the best strategic advice differentiating between broad appeal CTR versus utility That's actually music useful Chad GPT was solid with the table format Grock had a strong opinion on storytelling music Claude played it safe Kimmy was just okay All right we've done the everyday stuff Now, let's see which AI can handle the hard stuff It's time for the final challenge Here's the prompt Create a futuristic voice first Android OS for computer Completely optimized for audio interaction This is complex Let's see who survives Pasting it Let's got Okay. Wow. Gemini has already created it Android 3.0. Let me initialize the system Wow, it's speaking It actually added audio and it's waiting for me to respond That's crazy Let me test it Everything is working The voice commands aren't triggering audio responses yet but the UI is responding music Impressive start Grock has also created something Vera OS. Let's see what it does now Claude, this is clean Time display calendar music email summary building Let me try open notepad It works Claude's giving us a really polished UI",
        "start": 930.72,
        "duration": 2139.915999999999
    },
    {
        "text": "triggering audio responses yet but the UI is responding music Impressive start Grock has also created something Vera OS. Let's see what it does now Claude, this is clean Time display calendar music email summary building Let me try open notepad It works Claude's giving us a really polished UI wait it ran into a syntax error Let me ask it to fix Okay, it's back Echo OS voice first Android. Let's see if it actually works now Now the real test audio listening Let me ask them to add a visualizer Gemini implemented a fallback mechanism If microphone permission is denied it switches to simulation model That's actually smart music Thinking ahead Claude, I clicked the mic button but I don't think it's actually working No response So, here's where we stand Gemini gave us the best UI clean functional Actually thought about edge cases All right let's count down the final rankings In last place Kimmy K2. Coming in fourth we've got Grock 4.1. Third place goes to Chat GPT 5.1. In second it's Claude Sonic 3.5. music And taking the crown once again at number one Gemini 3 Pro. So after 10 tests Gemini 3 Pro is the clear winner Claude is solid for coding Grock surprised me with images Chad GPT needs more prompting but delivers And Kimmy, skip it But honestly try them yourself That's why I showed you mufti earlier All 10 prompts are in my WhatsApp community link in description Join it If this helped subscribe See you in the next one",
        "start": 1088.88,
        "duration": 2271.9969999999985
    }
]