[
    {
        "text": " you're probably not getting the most out of Chat GPT and other AI tools. And today I'm going to show you a bunch of new use cases that you can use right now. First, let's go over some creativity and design use cases. This one is incredible. You can look at what your room, your house, your apartment is going to look like with different types of furniture, different types of designs, and it is dead simple. Check this out. So, here's a picture of a room and I simply used MS Paint to outline in different colors different areas of the room that I might want to add furniture or pictures or a television and so on. And so, you could see that here. Then, using Nano Banana inside of Gemini, I simply said, \"Please edit this photo of my empty room based on my color annotation. Blue L-shaped couch, that's right here. Yellow birch color coffee table. Purple fuzzy yellow rug. Red flat screen TV as you can see here. Green tree plant in the corner. Pink some wall art and black there's a ceiling light. And let's look what it output. There it is. So there's the TV, there's the plant, some pictures, an L-shaped couch, and it looks incredible. The stylistic consistency of Nano Banana is unreal. So, this is a fantastic use case if you want to see what your room or any room looks like with a certain style or certain furniture before you go get that done. Now, of course, you could do this with fashion as well. Take a picture of yourself, upload it, and say, \"Show me with purple hair. Show me with glasses. I want a red sweater on.\" Any of these things are possible, and you can imagine what something's going to look like before actually committing to it. Next, you can also reconstruct historic places. Here's a modern photo of Jupiter Temple. Reimagine the attached photo. Create a photorealistic 4K reconstruction of the Jupiter Temple complex in Balbeck, Lebanon, as it appeared upon its completion under Roman rule in the 2n century AD. Now, you can use Chad GBT. You can use Gemini to help you craft these prompts. You don't need to write all of this out. The scene should be bustling with Roman citizens, priests, and soldiers engaged in a grand religious festival or procession. And there it is. Now, I can see one little issue in the back is it still has all of the modern buildings, but this part looks fantastic. Here's another example. Reimagine the attached photo. Create a photorealistic 4K reconstruction of the Treasury in Petra as it appeared at the height of the Nabatien, hopefully I'm pronouncing that right, kingdom in the 1st century AD. And here we go. We can see some camels, some people walking around in what looks like historic clothing. And so, yeah, you can take any image and do that. Next, you can even",
        "start": 0.08,
        "duration": 330.8
    },
    {
        "text": "the height of the Nabatien, hopefully I'm pronouncing that right, kingdom in the 1st century AD. And here we go. We can see some camels, some people walking around in what looks like historic clothing. And so, yeah, you can take any image and do that. Next, you can even committing to them. And it's so easy. No longer do you have to learn Blender immediately. With this, you can start to visualize your product ideas just from a simple drawing on a piece of paper. So, we drew this. There's a ring. It has an O2 sensor, haptics, a button with a twist crown, and then a holographic display with AR. And that's it. This very simple image. And we said, \"Please create a 3D design of this ring. Simple design, easy to render.\" And here it is. There's the ring, the crown, just like an Apple Watch. And then we have the holographic render at the top. Then I said, \"Now show the exact same product being worn on someone's finger.\" There it is. Now, one problem is this hologram is kind of facing the wrong way. The orientation is off. So, we simply said, \"Good, but make the hologram angled up to the top left corner so it is more in the direction of someone offscreen looking at it.\" And there it is. So, very easy to take your ideas and put them into visual form to show them off. All right. Next, you know those very visually appealing 3D animations that a lot of DJs and concerts have in the background like this? Well, those are dead simple to create. Now, here's an example we created. So, you can see robots kind of overlaid on top of the galaxy. We have a bunch of mini robots dancing in the middle. And yeah, you can imagine this playing in the background of some DJ. Very, very easy to create visually stunning videos. So, how do we do it? Well, for this we're using V2, which is free. We use Nano Banana to create the initial image and create a psychedelic ethereal and abstract screens saver visual for playing behind a DJ on a big screen at a concert. It should show robots overlooking a crowd of people. The clip must loop perfectly so that it can be repeated over and over without any jarring cuts and then it just generates it. So very easy. And another incredible use case that you should probably be using is vibe coding. And that's why I want to tell you about the sponsor of today's video, Warp. AI coding is changing quickly. People were using idees, now they're using CLI based workflows. But you may not have heard of Warp yet, and I'm excited to tell you about them. Warp is a leading AI coding agent, topping benchmarks like Terminal Bench, which tests its ability to use the terminal. They ranked number one ahead of Cloud Code and Gemini CLI, and",
        "start": 165.12,
        "duration": 612.8000000000002
    },
    {
        "text": "workflows. But you may not have heard of Warp yet, and I'm excited to tell you about them. Warp is a leading AI coding agent, topping benchmarks like Terminal Bench, which tests its ability to use the terminal. They ranked number one ahead of Cloud Code and Gemini CLI, and verified. With Warp, you get just the parts of the IDE that you actually need. Edit files in app, review code diffs, and ship productionready code. And it is designed for multi- aent control. You can manage and dispatch agents in parallel easily, all from a modern UX. Warp supports codebased indexing, MCP, and rule support, all the modern LLMs that you want to try. And if you use code Burman, you get your first month of Warp Pro for just $3. So check them out. Let me know what you think. All the links down below. Now, back to the video. Next, again, Nano Banana. Let's keep going because it is free. You can use it out. It's on Gemini. Here's our astronaut logo from Forward Future. And by the way, if you're not subscribed to the Forward Future newsletter, it's forwardf.ai. The best way to stay on top of all the news coming out of the AI industry. So here we uploaded just this image. Create a sleek modern business card design using the astronaut logo as the central element. Maintain the same colors and line work style from the logo. Place the astronaut in the top left corner with clean topography for name, title, and contact info in a matching color palette. Minimalist, futuristic aesthetic, balanced, whites space, brand consistent. And here's what it looks like. This is fantastic. We have the color looking exactly right. We have the font looking good. And of course, the very consistent astronaut logo. Here it says, \"Transform the astronaut logo into a horizontal social media banner background.\" There we go. Very nice. Reimagine it as a bold t-shirt design. That is so cool. So again, taking your ideas, making them reality. So easy. And last for this category, let's use chatbt to convert images into different format. It is so easy. So I uploaded this picture of the CEO of Nvidia and I said convert to SVG. It is currently a JPEG. It wrote code to do that. And then you can download the SVG right here. So you can convert different files into different formats very easily. Next, let's get into business use cases. First is detecting fishing and scams. So we have this email that we received. Is this a real offer to be a speaker at a conference or is it fishing? Hello doctor. Hope you're great. It is our honor to invite. Please accept our invitation to speak as plenary speaker at the World General Medicine. Okay. And so on. And so we pasted the entire email in here. It does say this exclusive offer in-person speaker registration just $575. And thought for 46 seconds.",
        "start": 308.8,
        "duration": 923.2800000000002
    },
    {
        "text": "great. It is our honor to invite. Please accept our invitation to speak as plenary speaker at the World General Medicine. Okay. And so on. And so we pasted the entire email in here. It does say this exclusive offer in-person speaker registration just $575. And thought for 46 seconds. predatory payto present conference invite. So you can imagine if you're on the IT team or even if you're an employee at a company and you get an email and you're just not sure if it's a scam or not, throw it in a chat GPT and get another opinion. So it does say I treated as fishing adjacent and skip it. Now you're probably thinking, okay, that was easy. What if it got a real email that kind of looked like this? Well, let's try it. I have a very similar invite to speak email. So dear is and community following the opening of registration we now further pave the way for okay blah blah blah and register book accommodation check program and so this is a legit email short answer it looks legit why I think it's real there was an official joint meeting in Atlanta so it is actually referencing a real thing the member alerts reference early bird closing May 14th one oddity your footer lists Toronto for is the current site listed as a different address. So very cool. It actually went out and did research, looked at the address, looked at the company who sent it to me. And so this is a really good way to make sure an email you received that you're not sure about is not spam and not fishing. But how about voicemail? What if you get a call and a scammer leaves you a voicemail and you're trying to figure out, is that a scam or is this legit? Well, you can simply take a screenshot of your voicemail app. You don't even need to upload the audio. Check this out. Hey, it's Claudia with filing resolution division of rapid relief tax LLC calling about the file number. Okay. And so on and so anything with tax relief. If they're calling you, it's almost always a scam. So, I got this voicemail. Is it fishing or a scam? Should I respond? Short answer, it's a scam. Don't call back. Don't text. And don't give them anything. Why? I'm confident. Unsolicited tax relief calls and voicemails are a common scam pattern. They ask you to call a different call back number than the caller ID. Real IRS debt collection doesn't start with a random sales pitch. The IRS also warns about tax relief. OIC mills that overpromise elimination of tax debt. So, it detected it very easily. Again, this is something maybe you can show your parents and say, \"Hey, if you get an email or a call and you're not sure about it, ask chat GBT.\" And then how about a text message? Well, we",
        "start": 466.72,
        "duration": 1197.681
    },
    {
        "text": "overpromise elimination of tax debt. So, it detected it very easily. Again, this is something maybe you can show your parents and say, \"Hey, if you get an email or a call and you're not sure about it, ask chat GBT.\" And then how about a text message? Well, we is very obviously a scam. So, thought for 19 seconds, short answer, it's a scam. Don't respond. And it gave all the reasons. Once again, great use case. All right, here's another very specific use case that might actually be useful to you. Here we have a Google Maps image of a house. Right there, you can see it. And what we're going to do is determine if solar can be installed on here and what kind of performance we can get and what kind of costs we can expect. So, check this out. Please do feasibility research on the ability to install solar at this address. Please estimate what the cost would be to install solar panels on the roof. How much can I save on my annual energy bill? There is so much research that goes into this. Figuring out where they live, figuring out what the roof line looks like, what direction it faces, how much sun will potentially hit the solar panels, what solar companies are available in the area, what prices they're offering, what the energy company is in the area, what prices they're offering. There is so many different things that need to happen here. So, it worked for 6 minutes and here's what we got. Overview, Oakland's electricity prices are among the highest in the United States. So, figured it out. Price per kilowatt hour. It is also trying to figure out the increase in pricing over the last few years. So, that's something to consider. If you're buying long-term solar, let's say 20 years, you want to know, hey, has electricity prices in my area been increasing significantly? Because if you commit to solar, you're kind of locked into a price. Here, roof orientation and shading. You can see approximately 1,400 square ft, long axis, roughly east west, and a front yard tree on the east side. So, it really is digging into the photo trying to figure out how much sun is actually going to be hitting this roof. Here we can actually see an estimated kilowatt hour per day given different seasons. It did a bunch of different research. And then finally, in summary, the report concludes that the high PG&E electricity rates in Oakland and the city's strong solar resource make rooftop solar a financially sound investment for the home at there's the address. A 56.7 kwatt system could offset most or all of the household's electricity consumption, delivering annual savings of $2 to $3,000 and achieve payback in around 5 years. This is so very cool. So, if you're thinking about solar, great way to get an initial estimate on what you could be saving.",
        "start": 605.44,
        "duration": 1479.2009999999996
    },
    {
        "text": "kwatt system could offset most or all of the household's electricity consumption, delivering annual savings of $2 to $3,000 and achieve payback in around 5 years. This is so very cool. So, if you're thinking about solar, great way to get an initial estimate on what you could be saving. tasks? Well, I didn't until recently, and here's a great use case for it. This is Chat GPT. Please create a scheduled task for each morning at 9:00 a.m. where you use the agent to tell me the top three new headlines for each of these news outlets: Reuters, BBC, NPR. include AI summaries of each headline in your digest. You should email me the results. So, here it is. I can set it up. Here's what it's going to look like. And tell me what email address. Jonah forwardfuture.ai. That is a colleague from my team. Then each morning at 9:00 a.m. I'll put the top three headlines. Great. But what does it actually look like? Here's what that email actually looks like. So, Reuters, top three headlines. There it is with links, summaries, etc. Perfect. And it's really easy to set up. You literally just tell ChatBT in the chat interface to set up a recurring task for you. And then when you want to manage it, you go into settings, schedules, and all of your schedules will be right here. Next, you can use Chat GBT as a workforce. So let's say you have a bunch of people that need to meet and they have different schedules. You can simply copy paste all of their schedules right into Chad GBT and simply have it find you a time. So here you go. I have a bunch of Slack messages from my team regarding their availability. When can we schedule something that overlaps with my schedule? Check my Google calendar. Just give me windows that look free. Now, this does require you using the Google calendar connector in Chat GPT. And to do that, you go down to the bottom left, click settings, connectors, and then right here, you click enable sync. And then once you do that, you can basically have it schedule all your meetings for you. So, here we go. Here's how Friday looks. We have our live show. By the way, tune in every Friday to our Forward Future Live live show 10:00 a.m. to 12:00 p.m. Pacific. We interview the coolest guests. We talk about the latest news. Join us every Friday. Here we go. Team constraints overlap Windows and so on. And then it asks, do you want me to draft a quick note back to the group? And so you can essentially have it as your AI meeting assistant. Next, let's say you have a team meeting and you write a bunch of notes on a whiteboard or you scribble notes on your notepad and you need them transcribed and even expanded on in detail. Check this out.",
        "start": 749.2,
        "duration": 1749.3599999999994
    },
    {
        "text": "so you can essentially have it as your AI meeting assistant. Next, let's say you have a team meeting and you write a bunch of notes on a whiteboard or you scribble notes on your notepad and you need them transcribed and even expanded on in detail. Check this out. complicated chemical structures here. And then we say, \"Please write me a reference sheet from everything on this board. Ideally, please link to chemical structures for each.\" Now, we did use GPT5 Pro, but you don't need to. Reasoned for 11 minutes. And look at this. We have all of the different chemicals listed. We have links to their different structures in Pub Chem. We have their key side chain features, the one letter, and yeah, just everything perfect. So, if you need automatic digitization of your notes and not only transcription, but really expanding on it and giving it so much more depth and information, this is a great way to do that. Next, you can have Chacht write you SQL queries instantly. It is so fast and so easy. SQL was the bane of my existence when I was a developer and now it is so easy. So if you're a data scientist or even if you're a developer and you wanted to write SQL for you, this is the way to do it. So simply upload any data set. I have this data. I need to filter it. Can you make a list of columns with data types so I can determine how I want to filter query it? So first it just listed the columns and the type. So you can see float 64 integer 64. And then please write a SQL query that will filter labels to those containing the word ranch including similars like rancho PM25 particular matter 25 greater than the median temperature less than the mean pressure above the 90th percentile. So this is all really relevant to this data set but you can use any data set and it wrote you a SQL query just like that and you can go run it in whatever your favorite database is. Next you can do deep sentiment analysis on your customer calls. So, let's say you get a very long customer call between a customer and a customer service agent on your team. Here's an example of that. Here's the agent. Here's the customer. And they go back and forth. This is all fake, but you can see a bunch of different back and forths. And we load it up into Chat GPT and say, \"Please conduct sentiment analysis on these customer success call transcripts. Please give me an analysis and summary. Please include a graph to describe the results of your sentiment analysis. Make sure we describe variation in the results. So here it is. It created this beautiful candlestick chart right here. On the x-axis we have the call number. On the y- axis we have",
        "start": 885.839,
        "duration": 2018.9609999999996
    },
    {
        "text": "an analysis and summary. Please include a graph to describe the results of your sentiment analysis. Make sure we describe variation in the results. So here it is. It created this beautiful candlestick chart right here. On the x-axis we have the call number. On the y- axis we have picture and it gives us just a bunch of information including more natural language explanation of what's going on. So negative drivers triage by intensity lock in momentum reduce overwhelm language matters. So yeah this is a great way to give feedback to your team or for yourself to learn. Next, let's get into professional and financial use cases. Now, here's something I use chatbt for all the time. I am constantly reading research papers. I don't always understand them easily. It sometimes takes a couple of passes and I use chatpt to help me. So, I will upload a research paper and say things like, create a summary of this research explaining to me like I'm an eighth grader. What did the researchers do? What makes it novel? What did they find? Why is it important? reference specific pages and lines of the publication and give me the PDF back with the correctly referenced lines highlighted so that I can follow along with your summary explanation. And yes, I have done this. You can load up a PDF and say, \"Give it to me back highlighted based on what you think is most important.\" Check this out. First, here's the summary. What did the researchers do? What makes it novel? What did they find? Why is it important? And you can download the highlighted PDF right here. And so here it is. Here is the PDF highlighted by Chad GPT. And so you can see all of the most important lines were highlighted right there. Very easy way to help you understand research papers. Another use case that I have used when buying a house, when looking to rent an apartment, you can actually ask Chad GPT to give you a deep analysis of the financial picture of whatever you're looking to do. So I'm looking to buy a house in Alama County. Give me a clear up-to-date picture. So, this is for Alama County as a whole, but you can give it a specific address and say, \"Give me a breakdown. Is this property worth buying? What are the upsides? What are the downsides? What are the risks?\" But for Alama as a whole, it says, \"Give me a clear, up-to-date picture with home prices now by city, neighborhood, how fast they've been changing, how competitive the market is, real cost of owning, upfront costs, risks and rules, financial help, and so on.\" And so, here we go. Prices now by neighborhood. We can see a deep analysis of Oakland, its competition, so months of supply, days on market, bidding, real costs of owning, upfront cost, and it just did a fantastic deep analysis of potentially",
        "start": 1023.36,
        "duration": 2310.161999999999
    },
    {
        "text": "and rules, financial help, and so on.\" And so, here we go. Prices now by neighborhood. We can see a deep analysis of Oakland, its competition, so months of supply, days on market, bidding, real costs of owning, upfront cost, and it just did a fantastic deep analysis of potentially here's something that actually someone on my team did with me, salary negotiation. If you're not good at negotiating or if you just don't like it and you need help, Chad GBPT can be your negotiation assistant. So let's say I got an offer to join a company. Here it is. I received the following salary offer. We are pleased to extend you an offer for the position. So I want you to research compensation benchmarks for similar roles. Analyze three different counter offer strategies. For each strategy, evaluate. You don't have to get this detailed with the prompt, but you can. So it gave me a breakdown of what people with the same title are getting for their compensation. And it is a really deep breakdown. And at the very end, we can say write up a counter email. So, here we go. Dear Jonah, thank you again for extending the offer for the senior research program manager role. I'm excited. As I consider this offer, I wanted to share a perspective on compensation and we counter at 125,000 per year, but it sounds very bland. It sounds like it was AI written. So, I said, make it sound more human, more friendly, but still professional. Thank you so much for the offer. I'm really thrilled. and so on. And so it's very easy now to not only negotiate, but to know what to negotiate and to also write up a counter email for negotiation. Here's another thing I use chat GPT for all the time. Let's say you're writing an email to somebody and you want to make it more professional or in certain times I don't want to sound so angry at somebody I'm writing an email to. I will simply load up the email and say write it in a nicer way. So here we have an email. Help me respond in a professional way. I don't think these issues were my fault, but I want to make sure I am not just blaming someone else. Jonah, who I think actually made the mistake of not filling out the column of the budget. So, there was a mistake and you're writing an email and you just don't know how to say it in a professional way. So, here's the polished draft. There we go. And so, if you read Chad GBT's recommendation and you don't like it or you want to change it slightly, you could just continue to follow up like this. I want to subtly make it clear that it was Jonah who dropped the ball without blaming him or getting him in trouble. And here's another version of it. And then I said,",
        "start": 1171.2,
        "duration": 2566.962
    },
    {
        "text": "it or you want to change it slightly, you could just continue to follow up like this. I want to subtly make it clear that it was Jonah who dropped the ball without blaming him or getting him in trouble. And here's another version of it. And then I said, There it is. Good, but still a tiny bit too much. Throwing Jonah under the bus. So, you can really craft the perfect email using Chat GPT. Next, you know what I hate more than anything? Reviewing insurance information. When I get a new insurance doc and it's like 30 pages long of the most complicated insurance language. Now, here's what you do. load it into Chad GPT and tell it to give you a summary, a human summary of what your benefits are. So, check this out. I uploaded the document. I'm just starting a new job. Help me understand my benefits. What do I need to know? What are my options? What is my coverage? What decisions and deadlines do I need to be aware of? So, here we go. Key decisions and deadlines within 30 days of higher within 45 each May. 403b plan, retirement plan. Tells me everything that I need to know and when. Then if we scroll down, we can actually get into the different decisions and it breaks everything down. So here's vividity, HMO, Blue Cross, Blue Cross. Here's dental, vision, other health benefits, financial protection. So it breaks down everything I need to know about my benefit options. But what if I'm just not sure what to do? Another thing you can do is simply say based on everything you know about me and feel free to ask me questions figure out which plan is right for me and ChachiPT will actually walk you through it. Now of course this is what the HR department is for as well but it's nice to at least go into those meetings with HR being more knowledgeable about it. And if your HR department is unhelpful this is great also. And next you can use chat GPT to get detailed deep research into financial analysis of different companies. Check this out. So here I'm comparing JP Morgan Chase, Tesla, Fizer, Walmart, Cisco Systems. And this is a very sophisticated prompt. Of course, you can ask Chad GPT to come up with it for you. You don't have to write all of this yourself. But this is a very complex financial analysis. And of course, it does it. So here we go. And you can run this against any company that you're maybe thinking about investing in or just interested in. All right, next. Have you ever used LM Studio? It is incredible. And what you can do with it is create a really nice hands-on study guide from any document that you upload to LM Studio. So, here we go. I uploaded a bunch of different documents about autonomous vehicles. And",
        "start": 1301.919,
        "duration": 2855.202000000002
    },
    {
        "text": "right, next. Have you ever used LM Studio? It is incredible. And what you can do with it is create a really nice hands-on study guide from any document that you upload to LM Studio. So, here we go. I uploaded a bunch of different documents about autonomous vehicles. And create a mind map. But here you can create flashc cards. Here's what that looks like. So, here is a study guide with flash cards that it created for me right from LM Studio. So, autonomous flashcards. What novel safety concern has emerged with the increasing complexity and use of AI in autonomous vehicles? And you can see all of the different flash cards right here. You can get a video overview, you can get a report, you can take quizzes. LM Studio is still being slept on by so many people, so definitely check it out if you're trying to learn anything. You can have it create a podcast for you about any subject. Load up any document you want and listen to it while you drive. Then have it quiz you on it and create a video guide on it. And really, it's just so incredible. So definitely check it out. All right. Next, if you want to win geogesser every single time, this is how you can do it. So here we have open guessesser.com and it dropped me on this random part of the world in street view. Let's find out where we are. And today we're going to do that with Google AI Studio Live. So here under AI Studio, click stream and then share screen, open Geogesser. And you can actually choose the screen you want to share. Here you go. So you can see my screen's being shared right here. And you can say where in the world is this? Based on the storefronts and the script used on the signs, this location looks like it could be in India. So here I zoomed into India. Let's keep going. And I say, okay, I zoomed into India. Now where given the arid appearance and the types of buildings a good place to click in northern India would be somewhere in the state of Rajasthan. You could try clicking around the city of Jodapur. Okay, Rajasthan. Let's go find that. So here's Jodapore. We'll scroll in and we'll just put it there. Guess. And look how close we were right there. So very easy to cheat at Geogesser using Gemini Live. All right. So that's it. Those are all the new use cases I wanted to show you today. If you enjoyed this video, please consider giving a like and subscribe.",
        "start": 1448.32,
        "duration": 3106.6420000000003
    }
]