[
    {
        "text": " Chad GPT is quickly becoming the de facto internet. More and more of the functionality from apps that you know and love is ending up in Chad GPT natively. Just a few months ago at OpenAI's dev day, they launched apps for Chad GPT. That means native feeling applications directly in Chad GPT. And best of all, you can prompt them with natural language. And now one of the biggest names in professional applications is offering their biggest products directly in Chad GPT. and that is Adobe, Photoshop, Express, and Acrobat. All three of these massive applications are now available natively in Chad GPT. And you can just so easily prompt them to get what you want. And Adobe is partnering with me on this video to tell you about it. First, you can simply with natural language, with a prompt, edit and uplevel your images with Adobe Photoshop directly in Chat GPT. That means you can adjust a specific part of the image such as fine-tuning the brightness or the color, the contrast, the exposure, and apply creative effects like glitch and glow. All while preserving the quality of the image and all natively in Chad GPT done with natural language. Next, with Adobe Express, you can easily create and personalize designs. Browse Adobe Express's extensive library of professional designs for the right design at the right moment. Simply fill in the text, replace the images, animate the designs, and iterate on the edits, all directly within the chat and without needing to switch to another app, and again, all with natural language. And then last, of course, the ubiquitous Adobe Acrobat. Edit PDFs directly in chat, extract text and tables, organize and merge multiple files, compress files, convert them to PDF. All of this is just made dead simple through Chat GPT. plus Adobe Acrobat. So check it out. Go to Chad GBT. Try out the three Adobe products natively in Chad GBT. Adobe Photoshop, Adobe Express, and Adobe Acrobat. Try it out today. link down below.",
        "start": 0.08,
        "duration": 248.9609999999999
    }
]