[
    {
        "text": " Elon Musk and XAI are suing a former employee for allegedly taking secrets and going to OpenAI. According to Reuters, Musk's company said in the complaint filed on Thursday in California federal court that Shuchin Lee stole confidential information related to cutting edge AI technologies with features superior to those offered by Chad GPT to bring to his new job at OpenAI earlier this month. This is just one of a number of lawsuits between Musk and OpenAI/Sam Alman. Obviously, given the history between Sam Alman and Elon Musk, Elon is very sensitive about leaking any secrets to OpenAI and really anything OpenAI is doing. Here, the article continues, \"The new lawsuit said Lee began working as an engineer for XAI last year, where he helped train and develop Grock. The company said Lee took its trade secrets in July shortly after accepting a job from OpenAI and selling $7 million in XAI stock. And Elon even replied with he accepted an offer at OpenAI and then uploaded our entire codebase. That is crazy. If true, this is going to be a big problem for Lee and Open AAI. All right. Next, Microsoft is getting into the foundation model game. If you thought they were already in it, they weren't. They own a large percentage of OpenAI and they're close partners with them. But of course, the CEO of Microsoft, Satia Nadella, playing 4D chess, realized how platform dependent Microsoft is on OpenAI. And OpenAI has grander plans to essentially compete with a lot of what Microsoft does today. So what do they do? They need to create their own model. Mustafa Sulleman, the CEO of AI at Microsoft said, \"Excited to share our first Microsoft AI in-house models. MAI Voice 1 and Mi1 preview.\" Let me give you some more details. MAI Voice One, most expressive natural voice generation model I've ever used. Might be biased. Super efficient. Generating a minute of audio in less than a second on a single GPU. Live now in Copilot daily and podcasts. Then MAI1 preview. This is the textbased foundation model. Our first foundation model trained end to end inhouse. In public testing on LM Marina and if you want to try it out, you can right now. And according to LM Marina, Microsoft has entered the top 15. It debuted MAI1 preview at number 13. That is right below Gro 3 Preview. So definitely far from the top, but at least they put something out. At least they're starting to get the ball rolling. Here's an example of MAI voice. On a sunny afternoon, a spirited four-year-old named Jamie approached a grizzled pirate. And another one. Under a sprawling Texas sky, a skeptical cowboy and an enthusiastic techie met outside a diner. All right, both of those sound very good. I do still need to do extensive testing. Right now, ChachiPT advanced voice mode is still the most realistic voice I've ever used, but I need to give",
        "start": 0.08,
        "duration": 360.07799999999986
    },
    {
        "text": "sprawling Texas sky, a skeptical cowboy and an enthusiastic techie met outside a diner. All right, both of those sound very good. I do still need to do extensive testing. Right now, ChachiPT advanced voice mode is still the most realistic voice I've ever used, but I need to give model is a mixture of experts model pre-trained and post-trained on 15,000 Nvidia H100 GPUs. They don't really give much information beyond that. So, we're just going to have to wait and find out more. We don't know the size of the model. We don't know how it was trained, anything else besides its mixture of experts. And if you're using the new Microsoft AI model, you definitely should give it a try with Zapier, the sponsor of today's video. Check it out. With all of the models getting so insanely good, saturating all of the benchmarks, it probably feels like we can't get much better than we are getting right now. But as I've said, the key to unlocking the true value of AI lies in the tooling. That's why I'm excited to tell you about Zapier Agents. Zapier Agents gives you the best of everything. Frontier models, plus over 8,000 different apps, aka tools, that can easily be plugged into your agents. This is true AI orchestration. Plus, with a tight integration into Claude, Cursor, and Windsor via MCP, you can take your tools and agents anywhere you want. Gmail, Slack, Calendar, Notion, Docs, anything. It is dead simple to connect them to your agents and give them access to the tools they need. Try Zapier's AI orchestration platform for free today. The link is in the description below. They've been a fantastic partner. I've been using Zapier for years and I love it. Thanks again to Zapier. And now back to the video. All right, next. Anthropic has raised an enormous round, $13 billion. Series F valuing them at $183 billion. This is still much smaller than what OpenAI is valued at, but it is a massive amount of money and a massive valuation. I believe it makes them the fourth or fifth biggest private company in the entire world. Series Funding has been led by Iconic and co-led by Fidelity Management and Research Company and Lightseed Venture Partners. Also participating, Altimter, Bailey Gford, Black Rockck, Blackstone, CO2, D1 Capital Partners, General Atlantic, General Catalyst, Growth Equity. Basically, everybody who's not invested directly in OpenAI. Anthropic has seen rapid growth since the launch of Claude in March 2023. At the beginning of 2025, less than 2 years after launch, Anthropics run rate revenue had grown to approximately a billion dollars. That is absolutely crazy growth. Then by August, just 8 months later, our run rate revenue reached 5 billion. That is 5x growth from just eight months ago. But it's not 5x on a small number. It is 5x on a billion dollars. Now they're at 5 billion. Congratulations to Anthropic",
        "start": 180.879,
        "duration": 686.4789999999999
    },
    {
        "text": "is absolutely crazy growth. Then by August, just 8 months later, our run rate revenue reached 5 billion. That is 5x growth from just eight months ago. But it's not 5x on a small number. It is 5x on a billion dollars. Now they're at 5 billion. Congratulations to Anthropic Enthropic. Apparently, they're going to start training their models on user chat transcripts. Now, they are forcing users to opt out of training on their chat transcripts. And they're also extending their data retention policy to 5 years. So, not only are they going to train on your data, they're going to keep it for longer just in case they want to train on it in the future. But according to The Verge, you should be able to opt out of it. All users will have to make a decision by September 28th. So, if you don't want them training on your data, go ahead and opt out. All right. Next, my dream has come true. The figure robot can now do dishes. Just a few weeks ago, we saw it doing laundry. And now, look at this video. It is doing dishes. My most hated chore, much more so than doing laundry. And anybody who thinks that laundry is worse than dishes, you're wrong. So, here it is. Obviously, still moving very slow. Still lots of little mistakes here and there, but overall incredibly impressive and such an improvement from just a year ago. Look how delicate the hands need to be with the dishes. Putting it exactly in the right place. I'm just so so impressed by this. Next, Google avoided being broken up in their antitrust case and their stock went up 9%. So, Alphabet does not have to divest its Chrome browser or Android operating system as part of the Department of Justice antitrust case against the company. Now, both the Chrome browser and Android are incredibly important to Google's AI future. Being able to control the browser with an agent similar to what Perplexity Comet does and being able to control the operating system on the phone with AI with an agent is going to be so important in the coming years because you will actually be able to get realworld things done when AI can actually control your browser and control your phone. Next, a new model from Hunan, the Chinese company that has been releasing incredible open source models. Listen to this. Today we're announcing the open source release of Hunan Video Folly, our new end-to-end text video to audio framework for generating highfidelity audio. Essentially, load up text, load up a video, and you're going to get audio from that. So, this tool empowers creators in video production, filmmaking, and game development to generate professional-grade audio that precisely aligns with the visual dynamics and semantic context, addressing key challenges in videoto generation. So key innovations, exceptional generalization trained on a massive 100,000hour multimodal data set, balanced multimodal response. So here",
        "start": 345.919,
        "duration": 983.4799999999993
    },
    {
        "text": "So, this tool empowers creators in video production, filmmaking, and game development to generate professional-grade audio that precisely aligns with the visual dynamics and semantic context, addressing key challenges in videoto generation. So key innovations, exceptional generalization trained on a massive 100,000hour multimodal data set, balanced multimodal response. So here Sounds good. Let's hear what snowboarding sounds like. Okay, pretty good. Of course, let's hear what the lion sounds like. decent skateboarding. Okay, very good. And it even aligns with the physics. So when the skateboard hits the concrete, you can actually hear the kind of crack of the skateboard wheels hitting the concrete. And that is very accurate. So give it a try. It's open source. Open Weights. Download it now. Let me know what you think. Next, Artificial Analysis is updating their benchmark index to V3, which now includes a Gentic evaluations for different models. That is terminal bench hard and bench telecom. Artificial analysis is one of my favorite ways to see how a model is performing against the benchmarks because it is an independent index of the different benchmarks, meaning they run it themselves and it is an index of multiple different benchmarks. So as you can see here, here is the current scoring. GPT5 high number one, Gro 4 number two, 03 number three. Next, Microsoft is on a roll. They published a paper RSR 2 agent, which is a 14 billion parameter model that beat a 671 billion parameter model on math reasoning. So it is incredible at math. And look at this. This is Amy 2024 accuracy on the Yaxis and then training steps on the Xaxis. As you can see in this kind of green color right here, our star just accelerates to 80% on Amy 2024 accuracy with a fraction of the training steps. And on the purple line, we see DeepSeek R10. So, if you want to learn more about it, I'll drop the link down below. Next, Korea AI releases something new with AI video. This is a real-time video generation model. So, here's an example of what it actually looks like. you have a fish, you can move the fish. Then it generates the realistic version of it using AI. And so you can move it around in real time as it's moving and adjust what it's doing. That's pretty crazy. Here's another example. So you can see it moving the flower in real time as you're adjusting what looks like Microsoft Paint on the left side. It's weight list only right now. So go ahead, join the weight list and let me know what you think when it is released. Next, in a play that I actually agree with strongly, Chinese social media companies have started rolling out labels for AI content. I have been a proponent of this for a while. If something is AI, it should be labeled as such. According to Ingadget, major social media platforms in China have started rolling out labels",
        "start": 495.84,
        "duration": 1282.3969999999986
    },
    {
        "text": "actually agree with strongly, Chinese social media companies have started rolling out labels for AI content. I have been a proponent of this for a while. If something is AI, it should be labeled as such. According to Ingadget, major social media platforms in China have started rolling out labels a law that took effect on Monday. WeChat has told users they must proactively apply labels to their AI generated content. But it's not only WeChat, it's Doyen, Waybo, Rednote that all are required to label AI content. I think US-based social media companies should be doing this as well. Next, in nature.com, they published a fascinating article in which AI was able to detect covert voluntary facial responses in coma patients before doctors. So, a little bit more information, many brain injury patients who appear unresponsive retain subtle purposeful motor behavior signaling capacity for recovery. And so all of these tiny movements can now be read by AI to see, hey, are they actually trying to communicate something? It's called see me and it detects eye opening in comeomaosse patients 4.1 days earlier than clinicians. And it detects it more often than clinicians. We should be using AI in all health. There is no reason not to. There is no downside to it. As long as it's led by a human medical practitioner, there is no reason they should not be augmented by AI. Next, Elon Musk posts this graph showing that Grocode increased in usage 60% higher than Claude Sonnet. Now, here's the thing. This graph is from Open Router. And Open Router measures the total usage of each of these coding models or really any model. But what Elon forgot to mention is they're essentially giving away Grock code for free. And of course, if you're giving something away for free, granted it is very good, but if you're giving it away for free, everybody's going to try it. Everybody's going to use it. So there's two factors going on here. One, it's for free. Two, it just got released, so everybody wanted to try it. So this graph plus his context is a bit misleading. Still, Grocode is fantastic and it's fast and it's cheap. So definitely give it a try and compare it to all the other models you're probably using for coding. Next, Chat GPT is rolling out two new features that are meant to help both people in need and parents. So, if you're in a mental health crisis and you're turning to Chad GBT for help, which by the way, I think is actually a pretty good idea within reason, then they're launching four initiatives. One, they're expanding interventions to more people in crisis. They're making it easier to reach emergency services to get help from experts. They're enabling connections to trusted contacts and strengthening protections for teens. They're also going to be partnering with experts. that includes the expert council on well-being and AI and their global",
        "start": 661.519,
        "duration": 1577.6769999999985
    },
    {
        "text": "interventions to more people in crisis. They're making it easier to reach emergency services to get help from experts. They're enabling connections to trusted contacts and strengthening protections for teens. They're also going to be partnering with experts. that includes the expert council on well-being and AI and their global be leveraging reasoning models for sensitive moments. We'll soon begin to route some sensitive conversations like when our system detects signs of acute distress to a reasoning model like GPT5 thinking so it can provide more helpful and beneficial responses regardless of which model a person first selected. They're also adding parental controls which will control how Chat GBT responds to their teen with age appropriate model behavior rules which are on by default. Manage which features to disable including memory and chat history and receive notifications when the system detects their teen is in a moment of acute distress. I like these features especially as a parent between AI psychosis sick fancy because of acute distress plus exacerbated by conversations with AI. So, I'm happy with any of these controls that parents can get. And next, continuing on OpenAI, they just acquired a new company. It is called Stats Sig, and they acquired them for $1.1 billion. It is in an all stock deal, and it is one of the largest acquisitions OpenAI has done to date. According to Bloomberg, Statsig, founded in 2021, builds tools to help software developers test and flag potential new features. Its services have been used by employees at OpenAI, Eventbrite, SoundCloud, and other tech firms. It raised $100 million in a funding round earlier this year, valuing it at 1.1 billion. Statsig CEO will join OpenAI as CTO of applications. And last, Whimo is expanding to more cities. Next up, Seattle, which I just got back from, and Denver, too. So, two new cities for Whimo. I love Whimo. I love riding in it. I trust it. It is an awesome experience. If you've never done it, try to get into one at least once. It's just such a unique experience to have. That's it for today. If you enjoyed this video, please consider giving a like and subscribe.",
        "start": 811.44,
        "duration": 1801.8349999999978
    }
]