[
    {
        "text": " There's something happening inside the world of programming right now, right before our eyes, and it has to do with Claude code. Everyone seems to be talking about it over this past week and obviously over the past few months, but especially over this past week. It all started with a post by Andre Karpathy talking about how he feels so behind as a programmer because things are changing so quickly. The way that programming has been done traditionally over the last multiple decades is changing. Less and less code is being written by humans. Less and less code is being reviewed by humans. Yet, we still are able to craft incredible applications. Let's start with Andre's post. It has over 15 million views already. I've never felt this much behind as a programmer. The profession is being dramatically refactored as the bits contributed by the programmer are increasingly sparse and between. I have a sense that I could be 10x more powerful if I just properly string together what has become available over the last year. And a failure to claim the boost feels decidedly like a skill issue. Meaning these tools have progressed so much that if you're doing traditional programming, you are missing out. And I know I started this video talking about claude code and so just bear with me as I tie it all together. There's a new programmable layer of abstraction to master in addition to the usual layers below involving agents, sub aents, prompts, contexts, memory, modes, permissions, tools, plugins, skills, hooks, MCPLSPs, SLC commands, workflows, IDE integrations, and a need to build an all-encompassing mental model for strengths and pitfalls of fundamentally stochastic, fallible, unintelligible, and changing entities, the models themselves, suddenly intermingled with what used to be good old-fashioned engineering. So what he's really saying is the model capabilities are more than enough. And now what we're seeing is the scaffolding catching up. We are seeing the tools built around the models become increasingly powerful. Clearly some powerful alien tool was handed around except it comes with no manual and everyone has to figure out how to hold it and operate it. while the resulting magnitude 9 earthquake is rocking the profession. Roll up your sleeves to not fall behind. That is the key sentence, the key takeaway. If you are a programmer or if you want to get into programming, don't be afraid. Just try the tools, tinker with them, experiment, find out what works, find out where those edges are, and that is the way to be successful. Boris Churnney, one of the leads on the Claude Code team, replied to that post with, \"I feel this way most weeks to be honest.\" So again, keep in mind Boris is not only an incredible programmer, but one of the leads on the team that is building the tools that is causing this fundamental shift in how programming works and even he feels left behind. Sometimes I start",
        "start": 0.08,
        "duration": 371.279
    },
    {
        "text": "way most weeks to be honest.\" So again, keep in mind Boris is not only an incredible programmer, but one of the leads on the team that is building the tools that is causing this fundamental shift in how programming works and even he feels left behind. Sometimes I start to remind myself Claude can probably do this. Recently, we were debugging a memory leak in Cloud Code, and I started approaching it the oldfashioned way, connecting a profiler, using the app, pausing the profiler, manually looking through heap allocations. Then his coworker looked at the same issue, but used Claude code and just said, \"Go look.\" And Claude Codees one-shotted a PR with a fix. Igor Babushkin also replied to that same original post by Andre Karpathy. Igor is one of the founders of XAI, so not even on the anthropic team. and he says, \"Oopus 4.5 is pretty good.\" Andre replies, \"It's very good. People who aren't keeping up, even over the last 30 days, already have a deprecated worldview on this topic.\" This is where I'm going. There is something special happening with the cloud family of models and wrapping it with cloud code, actually coding within the cloud code environment. Something magical is happening. And it's not really reflected anywhere, but there's this feeling and a lot of people are talking about it. And so I want to continue to show you some examples of this. Here's Toby Lkey who is the CEO of Shopify. Also very prominent in the AI community. Vibe codes quite a bit. Here's what he said just a couple days ago. December 26. Opus 4.5 feels very different for coding than anything else that came before. It's pricey, but it's kind of stunning what it can do. And by the way, if you want to test all of the latest models, including Opus, give it a try on the sponsor of today's video, Abacus. There are so many AI tools out there, it becomes incredibly expensive to get access to them all. Trust me, I know. And there's a better way. With Chat LLM by Abacus AI, you get access to Chat GPT5, 03 Pro, Gemini 3 Pro, Claude 4.5, Gro 4, Deepseek, and many others. And with route LLM, it automatically picks the best model for whatever prompt you give it. And you get the latest image generation models like seedream, nano banana, ideoggram, flux, and more. And you can even generate video, cling, runway, helio with just a simple prompt. And now you can access the latest Opus 4.5 and Nano Banana Pro easily in one place with Chat LLM. and their humanized feature turns obviously AI written text into something that looks more human. So it goes from boring AI generated to something unique and compelling. And last they also have deep agent which is a powerful general agent that can build websites, apps, AI agents, chat bots, presentations and complete research",
        "start": 185.519,
        "duration": 687.0389999999998
    },
    {
        "text": "feature turns obviously AI written text into something that looks more human. So it goes from boring AI generated to something unique and compelling. And last they also have deep agent which is a powerful general agent that can build websites, apps, AI agents, chat bots, presentations and complete research month. Visit their website by clicking the link down below that lets them know I sent you. And thanks again to Abacus. Now, back to the video. Now, here is one of the most incredible posts that I've seen lately. This is by Boris Churnney, again, one of the creators of Claude Code, who basically says 100% of Claude Code's code in the last 30 days was written by Claude Code. That really is self-improvement. It is being orchestrated by humans, yes, but ultimately it is essentially just improving itself. Listen to what he says. When I created Claude Code as a side project back in September 2024, I had no idea it would grow to be what it is today. And by the way, for those of you not familiar with what Claude Code is, it is a command line interface that gives you all of these incredible tools to use the Cloud family of models specifically for coding. And it's incredibly powerful. A lot of people are switching from idees like Cursor and Windsurf to Claude code directly. A year ago, Claude struggled to generate bash commands without escaping issues. It worked for seconds or minutes at a time. We saw early signs that it may become broadly useful for coding one day. Fast forward to today. Listen to this. In the last 30 days, I landed 259 PRs, 497 commits, 40,000 lines of code added, 38,000 lines of code removed. Every line was written by Claude code plus Opus 4.5. Absolutely insane. Claude consistently runs for minutes, hours, and days at a time using stop hooks. Software engineering is changing and we are entering a new period in coding history. And we're still just getting started. So we have this incredible model with Opus. We have this incredible framework, the scaffolding with cloud code and it allows the model to run autonomously for days at a time. And it's even improving itself, the claude code codebase. And it's not just Boris that is coding very differently than how traditional programming teams have coded over the last few decades. Here's another prominent coding leader talked with the Cloud Code team on how they build Claude code. It feels like I get a peek into the future and I get why Daario, the CEO of Enthropic, said six months ago that 90% of code will be written by AI. This team works so differently than any team I saw. Here's one example. The first code review is always done by claude code. So when you write a PR, the code is immediately reviewed by claude code. The test suite is almost 100% written by",
        "start": 344.72,
        "duration": 1012.8779999999997
    },
    {
        "text": "will be written by AI. This team works so differently than any team I saw. Here's one example. The first code review is always done by claude code. So when you write a PR, the code is immediately reviewed by claude code. The test suite is almost 100% written by to be a human somewhere in the test suite because when you have specifications the human is the one specifying the specifications. The spec defines how the app works and that's where the human taste comes in. He released a full review of how the Claude code team codes and here are a few other snippets from this article. I'll drop a link down below. They do about five releases per engineer per day. That is insane velocity for an engineering team. Even the best engineering teams even a few years ago couldn't achieve that kind of speed. Prototyping is done surprisingly quickly. They go through 10 plus actual prototypes for a new feature. They use AI for code reviews and tests for TDD for automating incident response and cautious use of feature flags. They also are using sub agents quite a bit. It's not just a single agent going to do something and one human overseeing that agent. It's the human overseeing the agent overseeing a team of sub agents. And the Claude code team is not alone. Here's Peter Steinberger, who is another very well-known coder, admitting that he ships code that he never reviews himself. Confession. I ship code I never read. Here's my 2025 workflow. These days, I don't read much code anymore. I watch the stream and sometimes look at key parts, but I got to be honest, most code I don't read. I do know where which components are and how things are structured and how the overall system is designed and that's usually all that's needed. So, those of you who have been pessimistic about Vibe coding, it seems the best in the world are now adopting it. It is more than okay to ship code that you haven't read line by line. Now, specifically for Peter, he is actually a big fan of codecs, but a lot of people seem to be gravitating towards Claude code. And the broader point is that coding is changing so rapidly right before our eyes. Here's Google's ex CEO, Eric Schmidt, talking about how incredibly powerful anybody can be right now with coding. Everything that I did in my 20s, which got me to where I am, has now been completely automated. Every aspect of the programming that I did, every aspect of the design is now done by computers. I [snorts] recently had it write a whole program for me and I'm sitting there watching it to find the classes and the detail of the interactions and so forth as it's generating go like holy crap, you know, the end of me and I think watching I've been doing programming for",
        "start": 511.199,
        "duration": 1315.3579999999997
    },
    {
        "text": "recently had it write a whole program for me and I'm sitting there watching it to find the classes and the detail of the interactions and so forth as it's generating go like holy crap, you know, the end of me and I think watching I've been doing programming for then end in front of your own life and you're still alive is really profound I might say. Now now computer science is not going away. the computer scientist will be at least until the computer scientist gets replaced will be supervising this but the ability to generate code at the power that these systems can do is revolutionary. It means that each and every one of you has a supercomputer and a super programmer in your pocket. And last I want to show you this post by McKay Wriggley. He does a lot of vibe coding. He teaches AI coding. So listen to this. The more I code with Opus 4.5, the more I think we're 6 to 12 months away from solving software. The model is pretty much there. I'll build like three versions of an app in a few hours just to explore options that would have taken me one to two weeks, less than a year ago. It's getting weird. This is the world we're in right now. Coding is vastly different than it was just a year ago, just a couple years ago. And imagine what it's going to be like a year from now, two, five years from now. It's going to be completely different. And what I've been saying for a while now is it's going to ultimately come down to human taste. If intelligence and the creation of software is essentially free and infinite, the only thing that's going to matter is the experience. What does the application look like? How does it feel? How does it interact with the user? How does the user interact with it? These are all of the things that are decided by human taste. And I truly believe human taste is going to become not only much more valuable but potentially the biggest bottleneck. As the signal to noise ratio becomes flooded with noise, all of a sudden the ability to pick out the signal from the noise becomes the only skill that matters. If you enjoyed this video, please consider giving a like and subscribe.",
        "start": 663.44,
        "duration": 1542.1589999999994
    }
]