[
    {
        "text": " Just last week, Google dropped Gemini 3 and the whole world is seeing them for who they really are, the best positioned company to win artificial intelligence. And at the same time, there was a leaked memo from Sam Alman that he sent to open AAI saying, \"Yes, Google caught up and there will be some rough vibes ahead.\" And don't forget, just 18 months ago, people were calling for Sundar, the CEO of Google, to step down because seemingly they were so far behind and couldn't get their act together to catch up and dominate artificial intelligence. Now, we're here and they are incredibly well positioned to win. I'm going to break it all down for you. Let's start with that leaked memo first. In this memo that was leaked to the information, he specifically says, \"Google will create some temporary economic headwinds for our company.\" but he still believes open AI will emerge ahead. I expect the vibes out there to be rough for a bit and that's basically because for the last few years, basically since Chad GPT first came out, OpenAI has had a significant lead in terms of model performance against every other AI and major tech company on the planet. But now that gap in performance has basically been reduced to zero and in some cases Google and even Anthropic are exceeding Chat GPT's performance. But benchmarks only matter so much. I actually believe the argument and the reason why Google's stock price has been going up so much lately is because as a holistic AI strategy, Google is incredibly well positioned to win. They have everything. And I'm going to get to that in a moment. Now, also in that memo, Sam Alman says something that is still very true to this day. Chat GPT is AI to most people and I expect that to continue. Just like Google is synonymous with searching. It is a verb. You say, \"Hey, go Google that.\" People say, \"Hey, I'm going to go chatt that.\" That is AI. Chad GPT is the verb. But that might not last forever, especially when other companies start deeply integrating their artificial intelligence into the competitive advantages that they have. And then finally, he says, I don't want this note to be a downer. We are doing remarkably well as a company and I expect that to continue. Then he ends with basically painting the picture of the competitive landscape and why Open AI has such a difficult journey ahead of them. He ended by saying, \"It sucks that we have to do so many hard things at the same time. The best research lab, the best AI infrastructure company, and the best AI platform product company, but such is our lot in life, and I wouldn't trade positions with any other company. I love the positive attitude. I love the competitive nature of Sam Alman, but that last line really speaks volumes.",
        "start": 0.16,
        "duration": 357.76000000000005
    },
    {
        "text": "research lab, the best AI infrastructure company, and the best AI platform product company, but such is our lot in life, and I wouldn't trade positions with any other company. I love the positive attitude. I love the competitive nature of Sam Alman, but that last line really speaks volumes. what every major AI company today looks like through that lens of all the incredible things they have to do. And you're going to see how each of them ranks in the total strategic advantages in their race to artificial intelligence dominance. But first, let's talk about benchmarks. Gemini 3 Pro was released last week, and yes, it is an incredible model. Google showed up, they went hard, and they developed an absolute monster of a model. Look at all of these benchmarks and nearly across the board, Gemini 3 Pro is beating GPT 5.1. But again, benchmarks only mean so much. That's only one piece of the puzzle. And in fact, it's table stakes at this point. Google's stock price is up over 22% in the last month alone. And keep in mind, Google is already a $3 trillion company. So, a 22% increase in market capitalization where it's already at 3 trillion is insane to think about. And all of that is because people are realizing, well, now they have Gemini 3. It's an incredibly good model, but they have everything else required to win. So, what is that everything else? I created this little chart to show you. So, in column A, I put all of the major AI companies. Google, Microsoft, Meta, Apple, AWS, XAI, Open AI, and Anthropic. And for those of you saying Apple's not an AI company, just wait. Then across row one, we have all of the attributes of a successful holistic AI strategy. We have frontier model. Does the company actually have one of the best models on the planet? AI infrastructure. Do they have the infrastructure needed to serve those models? Do they have diversified models? Meaning, are they only serving their models or are they able to serve many models, including the ones of their perceived competitors? Do they have custom silicon? Are they producing their own GPUs, TPUs, which I'll explain why that's a competitive advantage in a moment? Do they have existing revenue? Can they fund all of the AI infrastructure investment without having to raise more financing? Do they have top researchers? Do they have consumer hardware which ultimately is going to be the interface between humans and artificial intelligence? Whether you believe it's going to be glasses, AirPods, the phone, or something completely different. Does the company actually have a hardware strategy? Do they have a large user base, which is a complete competitive advantage? Do they have data? Do they have proprietary data? And then finally, how well are they integrating with the things that consumers use every day, all day? And again, I'm going to explain each one of",
        "start": 179.84,
        "duration": 687.2799999999997
    },
    {
        "text": "strategy? Do they have a large user base, which is a complete competitive advantage? Do they have data? Do they have proprietary data? And then finally, how well are they integrating with the things that consumers use every day, all day? And again, I'm going to explain each one of mean. So, if it's an X, it's in green, that means a company has it. If there's an O and it's yellow, that means the company is working towards it. And then if it's a dash and it's in red, that means they don't have it. And at least I'm not aware of them working towards it. So, first, frontier models. This is absolute table stakes. A company must have one of the best models. They don't need to have the best model, but it needs to be good enough to serve all of the needs of the different use cases for their users. So, Google Gemini 3 Pro, absolutely the best or at least top three models on the planet. Microsoft, I know they're working on it, but I'm not familiar with the details. I know they have their Microsoft AI division where they're building their own custom models under the leadership of Mustafa Sullean, but for now we don't have many details and Microsoft is certainly nowhere near the top on their own models. Meta used to have a frontier model, but they have since fallen way behind. Now they have hired some of the best researchers on the planet and they are pouring capital into developing the best models on the planet, but right now they don't have it. So I gave them an O. They're working on it. Apple does not have their own models. They have seemingly no strategy to build frontier models and they are depending on companies like Google to power their artificial intelligence in the future. Then we have AWS. AWS does not have a Frontier model. I know they have the Nova family of models which is great for a lot of use cases, but it's not competing with Gemini 3 Pro. It's not competing with GPT5. So they have their own models but mostly they're serving other companies models. Then XAI, OpenAI and Anthropic all have frontier level models. Next, AI infrastructure. Google, Microsoft, Meta, Apple, AWS, and XAI all have their own AI infrastructure. Now, you're probably thinking, \"Hey, Matt, Apple doesn't have their own AI infrastructure.\" But they kind of do. Their Apple silicon is incredibly good at running models locally. They also are putting that Apple silicon in their own private AI clouds. I think that's what they call their product. And so their chips, their custom silicon is really good at serving inference. And so I'm going to say yes, they do have their own AI infrastructure. However, OpenAI is still building out their AI infrastructure with projects like Stargate and Anthropic is going to be building out their own AI infrastructure. But for",
        "start": 346.88,
        "duration": 985.5209999999995
    },
    {
        "text": "their custom silicon is really good at serving inference. And so I'm going to say yes, they do have their own AI infrastructure. However, OpenAI is still building out their AI infrastructure with projects like Stargate and Anthropic is going to be building out their own AI infrastructure. But for have it. And AI infrastructure is incredibly important because it is so capital intensive to get into that game. This is the reason why having existing revenue, which you're seeing in column F right here, and I'll get to that in a moment, is so important. Every time Open AI or Anthropic wants to build out a data center, they have to go out and raise financing, and that is a huge risk to them. Whereas companies like Google, Microsoft, Meta, Apple, AWS, they have diversified revenue streams, a ton of cash on hand, and can make these big bets without the potential for that to completely bankrupt their company. And Mark Zuckerberg actually said two interesting things related to this. one, he said that Meta is willing to misspend potentially hundreds of billions of dollars because the risk of losing the AI race is actually greater than the risk of misspending hundreds of billions of dollars. Then he recently said in an earnings call, even if we're wrong about our AI investments, we're not going to go bankrupt. And that's the key. Open AI and anthropic might go bankrupt if they're not able to one become profitable and or if they just make a completely wrong bet about the direction AI is headed because they don't have existing product lines. They don't have existing revenue streams like those other companies I mentioned. And a quick thank you to Dell Technologies for sponsoring this portion of the video. Check out the new Dell Promax workstation with Nvidia RTX Pro Blackwells built in. This thing is an absolute beast for AI workloads. With NVIDIA RTX Pro, you now have a supercomput sitting on your desk, and it can do more with local AI than ever before. So, learn more about Dell Pro Max. Click the link in the description below to let them know I sent you. Next, something that I thought to be incredibly important as a strategic advantage is serving other companies models. Not just serving your own models, but serving other companies models. Why is this so important? Well, I do believe model choice is going to become increasingly important in the future. Companies who are building on top of these models don't want the platform risk of building on top of a single company only having access to whatever their top model is and potentially missing out on another company developing something incredibly good and maybe cheaper, more efficient, better for their specific use cases. And so it's interesting if you look at the two companies that have diversified models, Microsoft and AWS, they serve essentially everybody's model, especially Microsoft. Microsoft is working with everybody. And funnily",
        "start": 498.16,
        "duration": 1311.0419999999995
    },
    {
        "text": "on another company developing something incredibly good and maybe cheaper, more efficient, better for their specific use cases. And so it's interesting if you look at the two companies that have diversified models, Microsoft and AWS, they serve essentially everybody's model, especially Microsoft. Microsoft is working with everybody. And funnily their own frontier models. And so they have seemingly chosen rather than investing a tremendous amount of capital into developing their own frontier models, they are instead investing in partnerships, growing their AI infrastructure, and serving other companies models. All right. Next, custom silicon. This is so important and increasingly important. Everybody has access or at least can have access to Nvidia GPUs. And of course, that is where the majority of capital is going today from these AI infrastructure providers. But if you have your own silicon, you are able to control the production process. You are potentially able to increase efficiency because you have this close relationship between the model pre-training, post-training, RL, and the actual hardware. You're able to reduce cost because again, you control the whole thing. And so verticalizing on custom chips is so so important. And let's look at the companies that have it. Of course, Google with their TPU is probably in the lead on this front. The TPU has been around for a long time. They've been powering AI workloads for a long time. It is a proven chip and they have produced a ton of them already. Microsoft and Meta are both creating their own custom silicon, but they don't have it at production scale today. Apple has had their own custom silicon. They moved away from the Intel chipset a long time ago and so they're in a really good position to deploy this custom silicon to again increase efficiency, decrease cost, decrease latency. So I really like Apple in this sense. AWS has their own custom silicon with tranium and other chips that they are making. XAI is currently working on their own chips. OpenAI is currently working on their own chips and I don't think Anthropic is, but correct me if I'm wrong in the comments. Next is existing revenue. Can the company survive assuming they make no profit on AI for the foreseeable future? And can they make these big bets, be wrong about the bet, and then make other big bets and not go bankrupt? This is what we were talking about earlier. So Google, Microsoft, Meta, Apple, and AWS all have incredible businesses. They are multi-t trillion dollar companies that have diversified revenue streams and a lot of cash on hand. And all of that cash, all of that revenue can help fund the big bets into artificial intelligence. Now, here is the flip side. We have XAI, we have Open AI, and we have Anthropic. All of which do not have diversified revenue streams. They are raising financing. They are raising money from investors to fund their AI infrastructure buildout. And",
        "start": 662.64,
        "duration": 1642.2429999999995
    },
    {
        "text": "fund the big bets into artificial intelligence. Now, here is the flip side. We have XAI, we have Open AI, and we have Anthropic. All of which do not have diversified revenue streams. They are raising financing. They are raising money from investors to fund their AI infrastructure buildout. And big companies that have diversified revenue streams to make multiple bets and not be as much at risk as a company. Next, top researchers. Complete table stakes. You have to have them. And seemingly Apple might be the only one without top AI researchers, but it's hard to tell because they're such a secretive company. AWS, I think, does have top AI researchers, but they don't seem to be actively developing their own frontier models. So, what are they doing? Next, consumer hardware. This is incredibly important as well. The main interaction layer between humans and artificial intelligence is going to be some kind of device. Whether you believe it's glasses like what Meta is betting big on, AirPods like what Apple already dominates, or phones, which Apple and Google both dominate, that interaction layer is a strategic advantage. And right now, Google has Android. Microsoft has obviously Windows and other Microsoft laptops and desktop devices. Meta has glasses and VR with Oculus. Apple has well obviously all the Apple products. AWS and more broadly Amazon has the Echo family of devices. They have the Kindle. They have a million different products that they sell. XAI has nothing. And I've not heard of any device that they are building. OpenAI recently acquired Johnny Ives company to help build the next generation of consumer artificial intelligence devices. So, they are currently working on that. And Anthropic, they have nothing nothing that I've heard of. But keep in mind, Anthropic is taking a very different approach. Anthropic is going after enterprise. Seemingly they're going after the enterprise use cases. They are targeting being profitable pretty soon. So very different approach, but they aren't currently developing their own hardware. Now large user base incredibly important because when you develop an AI product or service, you need to serve it. And if you already have a built-in user base, you get distribution, you get usage immediately. All of the companies on the list have that with the exception of Enthropic. But keep in mind, Anthropic's going after a very different strategy. They're going after enterprise. Now, Google obviously has Google search. Microsoft has Windows, Office, and a thousand other products that they sell that they have usage for. Meta has Facebook, Instagram, WhatsApp. So, they have a ginormous built-in user base. Apple has everybody who's on iCloud, and all of the other Apple devices. AWS has Amazon and everybody that shops there. XAI has X, Twitter, OpenAI was the first mover. Chat GBT has 800 million plus weekly active users, I believe. And I already mentioned Anthropic. Now, next is data and not just any data, not just public",
        "start": 830.8,
        "duration": 1981.2829999999997
    },
    {
        "text": "of the other Apple devices. AWS has Amazon and everybody that shops there. XAI has X, Twitter, OpenAI was the first mover. Chat GBT has 800 million plus weekly active users, I believe. And I already mentioned Anthropic. Now, next is data and not just any data, not just public Google. Google is so well positioned here. And if I were to give the crown to any of these companies in terms of how powerful their data set is, Google takes the crown by far. They have Google search, they have YouTube, they have all of your Gmails, all of your work products with the Google Workplace suite, they have Android, they have maps, they just have so much data. They've been a data company from day one. Microsoft has a ton of really good data as well. More skewing towards enterprise. Meta obviously has a ton of data with Facebook and Instagram and WhatsApp. As I mentioned before, Apple has a ton of data, but they're probably the most reluctant to actually use that data to train models. AWS has shopping data, which is, you know, importantish. XAI has an incredibly good data set with Twitter, although I'm sure some of you would argue against that point. And then OpenAI and Anthropic both have data, but it's public data that they've used to train these models. And now the usage of these models is their data. Now, in my mind, Google is just by far the winner here. They have the best, most proprietary data. They haven't even really started to touch their YouTube data set, which is massive. And then the last category is integration. So, the ability for these companies to take AI, the raw models, and actually serve them in useful products that allow consumers and enterprises to gain value. So, Google's going to be able to do this while putting AI into Gmail and Calendar and all of their work products and YouTube and Android and everything. Microsoft is going to be able to distribute it in their suite of products. Meta, they're really only going to be able to serve artificial intelligence into social products, which just in my opinion only goes so far. It's not something that I'm gaining a lot of value from every day. It's not something that's going to be able to accomplish things on my behalf. Apple could do it, but they're not. Imagine AI being deeply integrated with your iPhone or with iCloud. The potential is so big, but they just haven't done it yet. AWS and XAI both don't really have mechanisms in which to serve AI features and existing product lines. And then OpenAI and Enthropic both do this really well, but it's still early. And it requires both of these companies to plug into existing suites of products, not their own. OpenAI is certainly trying to challenge that. They're trying to compete with everybody. They probably want to build their own Excel, own Word,",
        "start": 1002.079,
        "duration": 2282.4019999999987
    },
    {
        "text": "Enthropic both do this really well, but it's still early. And it requires both of these companies to plug into existing suites of products, not their own. OpenAI is certainly trying to challenge that. They're trying to compete with everybody. They probably want to build their own Excel, own Word, social network. And so they're trying to do that right now. So hopefully you found this chart useful. I'll drop it down below. And so looking at this chart, what do you think? Which company has the best overall AI strategy? If I'm looking at it and I'm just thinking about it, Google seems to be the winner. Google has everything and they do all of it incredibly well. The only category they're missing is serving other companies models. Quick update after I finish recording, I did a little bit more research and it does turn out Google Cloud serves anthropic models. So, I have upgraded them from a dash and red to an O in yellow. And that even more bolsters my opinion of Google's overall AI strategy. So with one of the best models, if not the best model on the planet with Gemini 3 Pro, incredible infrastructure, custom silicon with TPUs, an incredible existing business, existing revenue to fund it all, top researchers, a plethora of consumer hardware devices with Android, an insanely large user base of billions of users, a unique and proprietary data set across all of their different products, and the ability to deeply integrate AI into all of those products. Google has been winning and they are well poised to win the AI race and that's what everybody's been talking about lately. That is why their stock price has been skyrocketing lately and that's why I've been so impressed by Google's performance over the last 18 months. Their evolution from kind of laughing stock of the AI industry to one of the best competitors in the world. Now number two is Microsoft. Microsoft has everything going for it except they don't have a frontier model. They're serving everybody else's models which is great and maybe that's their strategy. I mean that has been the Microsoft strategy over the many decades they've been around. Allow everybody else to build on top of our platform. Meta's well positioned. Even Apple is well positioned if they could just get their act together when it comes to actually developing and deploying artificial intelligence into their ecosystem. And you're probably thinking, Matt, you're missing a major company. You haven't even mentioned them once, and that is Nvidia. And it turns out, just reported at the time of recording this video, Meta is in latestage talks to buy billions of dollars of TPUs from Google. And so, does this mean Google is now competing with Nvidia? Well, kind of. I see it more as meta hedging against being dependent on one chip provider. And Nvidia works with absolutely everybody. We've spoken with people at",
        "start": 1155.039,
        "duration": 2611.5209999999997
    },
    {
        "text": "latestage talks to buy billions of dollars of TPUs from Google. And so, does this mean Google is now competing with Nvidia? Well, kind of. I see it more as meta hedging against being dependent on one chip provider. And Nvidia works with absolutely everybody. We've spoken with people at competing with everybody cuz they work with everybody. But now we have Google who not only is creating TPUs for their own use, for their own inference, for their own AI use cases, but now they're going to be selling those TPUs to other major hyperscalers. And so once again, Google is in an incredible position from the top to the bottom of the AI stack, from the application layer all the way down to the kernel layer to compete and to compete strongly. So hopefully this video gave you a good idea of what the competitive landscape looks like and why OpenAI is seemingly a little bit nervous right now. If you enjoyed this video, please consider giving a like and subscribe.",
        "start": 1321.76,
        "duration": 2699.0419999999995
    }
]