[
    {
        "text": " Disney just handed its most iconic character, Mickey Mouse to AI. I'm not even kidding. They just signed a billion dollar deal with OpenAI. China dropped a free open-source video model that generates video and audio together. Where are my nuts? I must have left them somewhere. India launched its first ever homegrown microprocessor. And Nvidia released a free AI that runs on your gaming PC and beats [music] the paid ones. This week was absolutely wild. Here are the top 10 you can't afford to miss. All right, let's dive right in. Manos 1.6 just dropped and it actually builds stuff for you. Earlier, Manus needed constant supervision at complex tasks. Version 1.6 changes that. The new Max Agent scored up to 83% on data analysis benchmarks. That's how well it handles spreadsheets, research, and number crunching without you watching over it. But here's what's actually wild. You can now build mobile apps with just a prompt. Describe what you want. Manus handles the entire development and design view lets you edit images with point and click. Change colors, swap elements, combine images on a live canvas. People are already testing it. One person typed, \"Build me an appointment booking app and got a working app with calendar, customer management, everything in minutes.\" Another asked for a flappy bird style game with scoring and restart. Manus built the whole thing. Graphics included, ready to play on Android. No coding, no debugging, just describe and done. This is it. This is Manos saying they can handle your complex work without you holding their hand. Do you think this upgrade is helpful? So, I've got a WhatsApp community where I drop everything I discover. Tools, workflows, updates, all in one place before they go mainstream. If you want access, links in the description. Just when everyone thought OpenA was catching up to Google, they dropped Gemini 3 Flash. It's three times faster than Gemini 2.5 Pro and beats it on most benchmarks. And the best part, it's four times cheaper than GPT 5.2 high and faster than any other model out there. Now, let's quickly see what you can actually do with it and if it lives up to the hype. You can literally build apps from scratch by just using your voice. If you want to get better, learn a new skill, or pick up a hobby, just record a video of yourself, upload it to Gemini, and ask, \"How do I improve?\" It breaks everything down for you step by step. Here's one I really like. Let's say you're struggling with a topic. Just record yourself explaining it. Gemini listens, finds exactly where you're going wrong, creates a quiz for you, and actually helps you learn it. We all know the pain of messy spreadsheets. They take forever to clean up and make sense of. Gemini takes those messy spreadsheets and converts them into beautiful websites. People are using it for really cool things. This guy literally built an",
        "start": 0.16,
        "duration": 331.0380000000002
    },
    {
        "text": "for you, and actually helps you learn it. We all know the pain of messy spreadsheets. They take forever to clean up and make sense of. Gemini takes those messy spreadsheets and converts them into beautiful websites. People are using it for really cool things. This guy literally built an For years, real time translation has been one of the biggest struggles. We've got close, but there's always that awkward pause, delay. Google just fixed that with real-time speech to speech translation powered by Gemini. The best part, it preserves your pitch, pacing, emphasis, so it sounds exactly how you speak and not robotic. It supports 70 plus languages and the beta version has already started rolling out. And the final update from Google this week. If you're a content creator, you're going to love it. YouTube just launched an app called YouTube Create, which is basically an AI video editor powered by VO3. You can generate videos, add captions, remove background noise, cut trim, all from your phone. Google's message is clear. They're not here to take part in the AI race anymore. They're here to take over. Despite being late to the image gen party, OpenAI just threatened every competitor with this one move. They dropped GPT image 1.5 and it's four times faster than before. But speed isn't the big deal here. It's precision. You can now edit specific parts of an image without the AI destroying everything else. The lighting remains the same. Facial features remain consistent. And if you swap the background, everything else is untouched. Chat GPT also got a brand new images tab with preset filters, trending prompts, and more. It's basically a creative studio built-in. GPT image 1.5 is live now for all chat GPT users. And the timing of this drop is exceptional given the recent deal Openai cracked with Disney. Five days before this upgrade, Disney gave a billion dollar investment and 200 of their most iconic characters to OpenAI. Mickey Mouse, Darth Vader, Iron Man, all the characters that people were dying to use but couldn't because of Disney's copyright are now coming to OpenAI's video generator, Sora. This is a three-year deal. You'll be able to create short videos with these characters starting early 2026. And on top of that, Disney Plus subscribers will get curated fan-made Sora videos on the platform. If you ask me about it, I think this is a genius move. Let me know which character are you creating first. Meta just dropped something wild for anyone who edits audio. It's called Sam audio and it's crazy what it can do. You type guitar and it pulls just the guitar out of your video. Click on a person talking and it isolates their voice. Earlier you needed different tools for voice isolation, noise removal and music separation. But now SAM audio does all of it and is multimodal. You can give it text prompts, visual prompts and span",
        "start": 168.959,
        "duration": 631.1170000000003
    },
    {
        "text": "the guitar out of your video. Click on a person talking and it isolates their voice. Earlier you needed different tools for voice isolation, noise removal and music separation. But now SAM audio does all of it and is multimodal. You can give it text prompts, visual prompts and span on the source, highlight a time range and make the changes you want. But here's what most people are missing. Meta's already partnering with Starki, the hearing aid company, to explore accessibility features. This could end up in hearing aids, isolating voices in noisy rooms. For podcasters, musicians, video creators, it's free to try right now on the segment anything playground. It's fully open source on hugging face. Links in the description. What would you use this for? Claude is making big moves in the year end. Anthropic just made Claude in Chrome available to all paid users. This Chrome extension runs in a side panel that stays open while you browse. It works with your existing login, your bookmarks, everything. Here's what makes it insane. You can ask Claude to pull data from multiple tabs at once. Say you need a weekly report. Claude will grab revenue from one dashboard, user data from another, analytics from a third, and turn it all into a formatted doc right in your Google doc. Now, let's say you have a presentation with feedback comments all over it. Claude can now go through each one, make the edits, and resolve them when it's done. Now, here's the real kicker for developers. They shipped a Cloud Code integration. Claude can now test your code directly in the browser while you're coding in your terminal. It reads console errors, checks the DOM state, and debugs with you in real time. Now, I have some tea. The internet is buzzing with the news that Anthropic is going to drop something called tasks mode. It showed up in testing a few days ago. You get five modes: research, analyze, write, build, and do more. Each one has granular controls. Research mode lets you pick web or peer-reviewed sources. Build mode lets you choose themes and layouts. Plus, there's a new sidebar to track your tasks and manage Claude's context. We don't have an official drop date yet. However, several people have received early access, so it can drop any time now. Anthropic is planning the year end with a bang. Do you think this will blow everyone's minds? China just dropped an open-source video model that makes every other tool look outdated. Alibaba released Juan 2.6 and here are the top five crazy features. Number one, it generates video and audio at the same time. This means lip sync, dialogue, sound effects all in one go. Where are my nuts? I must have left them somewhere. Number two, you can generate 15-second clips at 1080p resolution. Other models give you less than 10 seconds. This helps you build a full scene, not just",
        "start": 321.919,
        "duration": 939.9969999999998
    },
    {
        "text": "same time. This means lip sync, dialogue, sound effects all in one go. Where are my nuts? I must have left them somewhere. Number two, you can generate 15-second clips at 1080p resolution. Other models give you less than 10 seconds. This helps you build a full scene, not just just give audio as an input and it generates an entire video for you. Number four, multi-shot storytelling from a single prompt. You describe a scene. It gives you multiple camera angles and your characters stay consistent between cuts. Number five, the starring feature. You can upload a reference video of yourself or any character and one keeps that exact look and voice across completely new scenes. It's like having a digital actor that never changes. Now, let's put it to a real head-to-head test with Veo 3.1 and Cling 2.6. Here's my final conclusion. One is the best director. It understood the story and the emotions better than the others. Veo is the best cinematographer. It created the most believable footage that could pass for real life. Cling is the best VFX artist. It created the most visually stunning and high energy sequence. So, which video model are you going with? Let me know in the comments. Nvidia just dropped a free AI that beats the paid ones. They just released their Neotron 3 Nano model. It's trained on 30 billion parameters and runs on your gaming PC. It outperformed OpenAI's open model and Alibaba's Quen. But here's the crazy part. It runs two to three times faster. So you get better answers way quicker for $0. You don't need cloud or API fees. Just download it from HuggingFace, run it through Ola or LM Studio, and you've got your own personal AI. And Nvidia didn't just drop the model. They released the training recipe and the data sets. So developers can actually build on this top tier AI on your own hardware completely free. Nvidia played this well. India buys one out of every five microprocessors made on this planet. That's around 20%. America has Intel. Taiwan has TSMC and India having over a billion people and a $4 trillion economy was still importing nearly every chip that powers our daily lives until now. India just launched Droo 64 first ever 1 ghahertz 64bit dualcore microprocessor completely built from scratch by Cedark on an open-source architecture giving complete control and autonomy. Now India has built chips before. Shakti from IIT Madras for defense and space. Ajit from IIIT Bombay for robotics. Vikram from ISRO built to survive extreme space conditions. They for industrial automation. But Duv 64 is different. Specifically designed for mass comical use, 5G networks, EVS, hospital equipment, factory equipment. And this is just the start. With Droop 64 success, the next generation Danush and Danush plus processors are already under development. The government has committed 1.6 lakh cr rupees to the India semiconductor mission. 10 projects across six states. On top of that, over",
        "start": 478.0,
        "duration": 1275.356000000001
    },
    {
        "text": "EVS, hospital equipment, factory equipment. And this is just the start. With Droop 64 success, the next generation Danush and Danush plus processors are already under development. The government has committed 1.6 lakh cr rupees to the India semiconductor mission. 10 projects across six states. On top of that, over trained. India already has 20% of the world's best chip design engineers. We already have the talent and now we're building the infrastructure. For decades, India depended on the world for chips. Droo 64 finally changes that. India can now design, develop and deliver its own microprocessor, fully indigenous. The dependency era is over. The rise of India's semiconductor industry is already here and we're witnessing it. N8 version 2.0 just went live. And there's one change that's going to save you from a lot of frustration. N8N lets you connect your apps and build automations visually. Last week, we covered this update while it was still in beta mode. And now they finally released the full stable version. Before V2, when you edited a live workflow and hit save, it instantly went live, even if you accidentally broke something. Now you can save and publish separately. You can edit, test, even break things. And your live workflow keeps running perfectly. Nothing changes until you actually hit publish. So, if you've got automations running for clients or workflows your team depends on, you can finally update them without the fear of accidentally breaking everything. And if you're building AI agents that need human approval, here's one big update. Earlier in V1, your agent would send the message, wait for approval, and then have no clue what they actually clicked. That's fixed now. Your agent actually gets the response back, approved, denied, whatever it was. And lastly, autosave is coming in January. This is N8N's biggest update in over two years. They've gone from 6,000 community members to over 115,000. This isn't just an update. It's N8N becoming the go-to platform for workflow automation. If you've been on the fence about trying it, now is the time. Two insane research reports just dropped on where AI is actually headed. One from Stanford and other from a company called Grapile that breaks down data from thousands of software teams building with AI every single day. And when you put these two together, you start seeing patterns that most people are completely missing. So I went through both of them and here's everything you need to know about the future of AI. Here's the big shift that happened this year. 78% of companies are now using AI in some or the other form. Last year that number was only 55%. There's this benchmark called S.WE bench where they give real coding problems to AI. Last year it was only able to solve around 4% of them. But this year it was able to solve 72% of the problems. Let that sink in for a moment. That is a",
        "start": 648.079,
        "duration": 1567.5950000000012
    },
    {
        "text": "only 55%. There's this benchmark called S.WE bench where they give real coding problems to AI. Last year it was only able to solve around 4% of them. But this year it was able to solve 72% of the problems. Let that sink in for a moment. That is a year. No other technology in history has evolved at this speed. We are literally watching decades of innovation happen in weeks. So this isn't some far off future anymore. We're talking about it's happening right now. And 2026 is just when most people are going to start noticing it in their everyday lives. The question isn't whether AI is going to change things. It's whether you're going to learn to use it or get left behind by people who did. Now for our top 10 coolest AI tools that launched recently segment where we look at the most fun and underrated tools. Let's go. Number one, Spatial AI Echo turns a single image or text prompt into a full 3D world you can walk through in your browser. No fancy setup needed. Number two, Mocha is a new app builder for non-technical people that sets up your backend, database, and login in one conversation. You can hook in payments with Stripe or PayPal. Number three, Chatterbox Turbo from Resemble AI is a super fast open-source voice AI with built-in emotion control. You can clone a voice with just a few seconds of audio. Number four, Sticker Box is an AI printer for kids. They say what they want out loud and it prints a black and white sticker they can color in it available just for 99 bucks. Number five, Stitch by Google just got Gemini 3. So now you can generate screens from prompts and stitch them into a clickable prototype on one canvas. Number six, CC from Google Labs censor your day ahead email that pulls from your Gmail, calendar, drive, and the web to summarize your day. It's currently in limited early testing. Number seven, Hyperbook LM is an open-source version of Notebook LM. Drop in URLs, PDFs, or notes and ask questions across all your sources. Number eight, CrossI is a conversion tool that lets teams run AB tests and personalize websites without bugging developers. Built for next.js and React. Number nine, Canvi gives you an infinite canvas to sketch ideas, then uses AI to turn those rough drawings into polished art. Number 10. Plan Eat AI turns your health goals into a full week of meals and a grocery list. Set your preferences once and it does the rest every week. Which one of these tools are you trying first? Let me know in the comments. Just think about what we covered today. Countries making power moves, free tools beating the paid ones, billiondoll deals completely reshaping entertainment. Honestly, we're really lucky to be in this generation witnessing all of this unfold with our own eyes. Drop a comment with your",
        "start": 796.56,
        "duration": 1868.474000000002
    },
    {
        "text": "me know in the comments. Just think about what we covered today. Countries making power moves, free tools beating the paid ones, billiondoll deals completely reshaping entertainment. Honestly, we're really lucky to be in this generation witnessing all of this unfold with our own eyes. Drop a comment with your AI news.",
        "start": 949.759,
        "duration": 1871.195000000002
    }
]