[
    {
        "text": " Google just launched something called anti-gravity. And no, it's not a physics experiment. It's Gemini 3 Pro building actual working apps from a single sentence. But that's just the beginning. They also released generative UI where AI doesn't give you text anymore. It builds entire interactive interfaces that adapt to your choices. They integrated Gemini 3 Pro directly into Google search with AI mode, turning every search into an intelligent conversation. And the new Gemini app can execute task across all your Google apps autonomously. These four features fundamentally change what Gemini can actually do for you. But here's what nobody's covering. One of these four isn't just a flashy demo. It's actually making paid productivity apps obsolete. And it's not the one getting all the attention. All right, first test. Landing pages. And let me type this in. Create a landing page for an edtech startup named Growth School. Make it playful. Neo brutalism style colors neon green, gray, white. Use the logo attached. The brand represents growth. Use upward arrows frequently. There we go. Sending this now. And it's done. Let's see what we got. So, the logo didn't come through properly. Probably wasn't clear enough in the image, but look at this hero section. Scale your future and stay hungry. Learn by doing. That's our actual tagline. I didn't put that in the prompt. It went out and found real information about what my startup Growth School does. Scrolling down, top 1% mentors from Google, Amazon, Cred, Spotify. Yeah, that's what we actually say on our website. It clearly pulled this from somewhere online. [music] But the rest of this is surprisingly accurate. The layout looks good, too. The neo brutalism style is there. The neon green is working. Upward arrows as branding elements. Yeah, it followed the brief pretty well. Next up, presentations. I want to see how Gemini 3 Pro handles building a full pitch deck compared to Gamma. I'm starting with Gemini. Here's my prompt. Create a premium pitch presentation on why Gemini 3 Pro is the most powerful AI model ever built. Structure it into seven slides with technical specifications, benchmark comparisons, [music] and real world use cases. Sending that through now. This should take a minute to [music] generate. All right, it's done. Let me click through these slides. First slide is the title. Clean. Then we've got cognitive supremacy as slide two. It's saying Gemini 3 Pro can solve complex unstructured problems with near human intuition at a 0.56% character error rate. That's incredibly specific. I have no idea if that stat is accurate, but it sounds legit. Next slide. 99.8% MMLU score. Architect level coding beyond copilot. It's calling this an autopilot system because it needs minimal intervention. says it operates at a software engineer level, five equivalent, and outperforms GPT5 codecs by 40% in complex system design. Wait, let me keep going. Native omniscience, 4K video upscaling and analysis performed natively, 100 milliseconds latency on crossmodal reasoning, complex",
        "start": 0.24,
        "duration": 377.0409999999999
    },
    {
        "text": "this an autopilot system because it needs minimal intervention. says it operates at a software engineer level, five equivalent, and outperforms GPT5 codecs by 40% in complex system design. Wait, let me keep going. Native omniscience, 4K video upscaling and analysis performed natively, 100 milliseconds latency on crossmodal reasoning, complex token window stats, recall accuracy, zero loss context [music] metrics. Then there's a slide on autonomous features, Chrome integration, self-correction, enterprise actions, and another on efficiency, highest performance at lowest cost per token, powered by Google's [music] TPU v6 infrastructure. Here's what's wild. It attached sources to all these claims. [music] Images have citations. This isn't just making stuff up. It actually went and researched this for a first draft with zero context from [music] me. This is really solid. I didn't feed it any data dumps. It did its own deep research and built this out. Now let's talk about agent mode. So agent mode connects directly to your Google workspace. That [music] means it has access to your Gmail, your calendar, your drive, basically your entire work environment [music] and it can actually do things with that access. You can simply ask it organize my inbox and it will search through your unread emails, draft replies for the ones that require a response and create reminders for [music] action items. You can also tell it to find all meeting requests from your emails and add them to your calendar with proper titles and time slots or have it search through your drive, pull specific documents, and compile key information [music] into a report. Agent mode will go into your workspace, accesses your actual data, and completes tasks end to end. Now, let's see what Gamma does with the same prompt. Pasting it in, waiting for it to generate. Here's what Gamma gave me. The slides are there. It's decent, but it looks super templated. Like, I've seen this design a hundred times before. The information is generic, too. Nothing as specific as what Gemini pulled together. If I had to rate these, Gemini [music] is easily a 7 out of 10. Gamma's maybe a 4.5. Gemini clearly put in more work here. So, for pitch decks, Gemini not only designed better slides, but actually researched the topic and pulled specific data. [music] Gamma gave me a template with surface level content. Pretty clear difference. All right, now let's talk about AI search mode with generative UI. [music] This is a gamecher. So say you want to understand something complex like the physics of the threebody problem. You can ask it why the system is unpredictable and if there are any exceptions and it will give you an interactive simulation to understand [music] both a stable predictable orbit and a chaotic one along with a detailed explanation. You can actually see the physics playing out in real time instead of just reading about it. Now, let's say you need something practical like comparing loan options. You can ask it",
        "start": 189.68,
        "duration": 678.5609999999999
    },
    {
        "text": "simulation to understand [music] both a stable predictable orbit and a chaotic one along with a detailed explanation. You can actually see the physics playing out in real time instead of just reading about it. Now, let's say you need something practical like comparing loan options. You can ask it a 6.5% interest rate and no down [music] payment versus a loan with a 5.5% interest rate with a 20% down payment. [music] And it will generate a full interactive comparison table for you. Monthly payments, total interest paid, overall cost, everything [music] laid out side by side. Plus, it creates interactive scenario tables where you can adjust the loan amount, change [music] the terms, and it recalculates everything instantly. So whether it's understanding [music] complex concepts with live simulations or comparing financial options with interactive tables, AI search mode builds the exact [music] interface you need for whatever you're asking. Now, let me tell you about the update that got me the most excited. Google Anti-gravity. It's basically a text to app builder. So you can describe an app you want [music] and it will actually code it and build it for you. Fully functional, ready to use. Say you want a flight lookup web app. You give it a prompt and it will immediately build you a working flight tracker. The input fields there. The search button works and the results show up properly. You can type in a flight number, hit search and it pulls data straight from the API. [music] Now the flight number here wasn't real, so obviously it couldn't track anything but the app itself is completely functional. The interface is running, the API is connected, and everything works. For something that went from text prompt to a functioning web app in seconds, it's pretty impressive. That's Google anti-gravity. I would love to hear your thoughts on",
        "start": 343.12,
        "duration": 853.6010000000001
    }
]