[
    {
        "text": " Everyone has been talking about claude code recently and as of today Anthropic launched claude co-work but for all knowledge work. It is not specifically for coding and it looks incredible. Before I get into the details, let me show you the Claude co-work demo video. It's insane. Watch this. Heat. Heat. N. Heat. Heat. Heat. Heat. So, here's Boris, the creator of Claude Code, with some information about the reasons why they created it and some details about it. Since we launched Claude Code, we saw people using it for all sorts of non-coding work, doing vacation research, building slide decks, cleaning up your email, cancelling subscriptions, recovering wedding photos from a hard drive, monitoring plant growth, controlling your oven. These use cases are diverse and surprising. And it's surprising because Claude Code was built for coding. They built it specifically with programmers in mind. So you prompt Claude Code. It has access to a folder on your computer. It can create code files, an entire directory for your codebase. And then you iterate like normal with your codebase. But people realize, oh, it doesn't just need to be code. It can be anything. I can literally do any of those use cases that he just described and more. And so they built a much more easytouse product for non-developers to do those other use cases. So today we're excited to introduce Co-work our first step towards making Cloud Code work for all your non-coding work. It's early, it's raw, similar to what Cloud Code felt like when it first launched. Co-work includes a number of novel UX and safety features that we think make the product really special. a built-in VM for isolation. That is a virtual machine, which is really nice to know, especially if you're not a very sophisticated computer user or if you're not a developer and you want to give Cloud Co-work access to your computer, you really want to make sure it's on guardrail. So, a custom VM is very welcome. out-of-the-box support for browser automation, which is fantastic. Support for all of your cloud AI data connectors, asking you for clarification when it's unsure. So, very exciting to see. Now, it is only available for Mac OS right now, and you need the Claude Max plan to use it. So, certainly not for everyone quite yet. But again, this is just day one. They coded it over the last week and a half. It's only going to get better. It's only going to become more widely available. So definitely if you aren't able to test it today, be patient. It is coming. All right. So check this out. This is Cloud Co-work. It feels native. It is native. If you have a Mac and look at this, we have a cluttered desktop. Here's Claude Co-work Opus 4.5. Let's see what it can do to help us clean it up. So we come down here. We type, \"Please help me",
        "start": 0.08,
        "duration": 342.3609999999998
    },
    {
        "text": "is Cloud Co-work. It feels native. It is native. If you have a Mac and look at this, we have a cluttered desktop. Here's Claude Co-work Opus 4.5. Let's see what it can do to help us clean it up. So we come down here. We type, \"Please help me gave it access to the desktop. And so here we go. It can read what's on your desktop. It's asking you follow-up questions in a really nice way. And there we can see it is nearly instantaneously cleaning up your desktop into five well-catategorized folders. So, just like Claude Code, when you give it a task, it creates a plan. It goes step by step and executes that plan, verifies each step. It should feel very familiar to Claude Code if you've ever used it. And a special thank you to Dell Technologies for sponsoring this portion of the video. Dell's ProMax family of PCs are incredibly powerful for AI workloads using the new Grace Blackwell series of Nvidia GPUs, including GB300 and GB10. These are absolute monster GPUs in your desktop. Learn more about DellPro Max GB10 and GB300 and the Dell Pro Max lineup of workstations with Nvidia RTX Pro GPUs. Click the link in the description below. let them know I sent you. Check it out. So, here's the blog post for it. Let me just tell you a few more details. Claude co-work can use your existing connectors. And Claude connectors are when you want to connect Claude to external services like Google Drive or Box or whatever else there is. And it also, as I mentioned, comes with browser control built in. So, you can give it a task in your browser. It can browse on your behalf. it can control and navigate through different websites and then come back when it's complete. You also don't have to wait for Claude to finish what it's doing to give it the next instructions. You can ceue up instructions, which is really one of my favorite features of any coding agent is the ability to give it a task and then give it more tasks and then it'll complete those tasks as a queue. You give it specific folders so it's not just going to have full access to your computer unless you explicitly give it to it. And that gives you kind of a level of fine grain control which is really nice. It will also ask your permission before taking any significant action probably like deleting folders or major changes to your computer probably anything to do with privacy security authentication. So all of these things kind of help the less technical users. But you should still know Claude can take destructive action on your behalf. So you of course have to be careful while using it. And there is always a risk of prompt injections. Listen to this. You should be aware of the risk of prompt injections. Attempts by attackers",
        "start": 233.04,
        "duration": 644.4419999999999
    },
    {
        "text": "users. But you should still know Claude can take destructive action on your behalf. So you of course have to be careful while using it. And there is always a risk of prompt injections. Listen to this. You should be aware of the risk of prompt injections. Attempts by attackers it might encounter on the internet. They have built sophisticated defenses against prompt injections. But again, these are non-deterministic systems and thus they're never going to be fully protected. Lots of people commenting on this. Lots of people saying it's already extremely good from their initial tests. I haven't had a chance to test it out yet. I will definitely do so and I will report back.",
        "start": 387.12,
        "duration": 686.7619999999998
    }
]