[
    {
        "text": " So, Ant Groupoup dropped this new multimodal assistant called Ling Wuang and within a few days it basically exploded in China and then started spreading worldwide. And the funny part is that Ant Groupoup themselves didn't expect this level of hype. They pushed the app out last Tuesday thinking it would just be another step in their AI rollout and suddenly the whole thing was under so much traffic that one of its main features actually crashed. The numbers were wild. It hit 1 million downloads in 4 days and by Monday it was sitting at over 2 million. Ant Group basically said it reached the first million faster than Chat GPT and even Sora, which is crazy when you think about how fast those blew up. On Apple's mainland China app store, Linguang ended up ranking first for all free utility apps and sixth overall across every category. People were downloading it non-stop, testing it, stress testing it, and one feature in particular got hammered. the flash program tool. So, this flash program thing is the part that really caught everyone's attention. You type a natural language prompt, something as simple as make me a calorie tracker or give me a kid activity generator. And within 30 seconds, it builds a working interactive mini app right inside the conversation. And because so many people were trying it at once, the whole system buckled under the load. Ant Group confirmed the Flash program builder actually collapsed for a short period because the traffic was way higher than they predicted. They restored it pretty quickly, but that's when it became clear that this wasn't just another trendy AI toy. People genuinely wanted to use it. The thing that makes Linguang different is that it isn't just a text assistant and it isn't just a code generator. Ant Group is pitching it as China's first multimodal AI assistant built specifically around coddriven outputs. So instead of only giving text, it responds with 3D models, audio clips, clean animations, interactive maps, charts, or full mini programs depending on what you ask for. And it does all of that in this kind of minimalist, almost polished tool style instead of the usual AI generated mess we're used to with some models. One example they kept giving is explaining something like quantum entanglement. Normally, you'd get a paragraph or maybe a diagram, but Linguang analyzes your question, decomposes it into tasks, and turns it into a short animation that actually shows the concept step by step. If you ask about economic principles, it can do the same thing. Turn the idea into a dynamic visual. If you want to plan a trip, it can build interactive maps that show routes, places, or whatever you need. It doesn't rely on static 2D outputs. It actually generates 3D objects you can rotate or explore. And that's been a key selling point because people love seeing something that feels more tactile and direct.",
        "start": 2.56,
        "duration": 328.24000000000007
    },
    {
        "text": "a trip, it can build interactive maps that show routes, places, or whatever you need. It doesn't rely on static 2D outputs. It actually generates 3D objects you can rotate or explore. And that's been a key selling point because people love seeing something that feels more tactile and direct. about is the AGI camera. It's basically a real-time scene understanding system built into the app. So when you open your camera and point it at something, Linguang processes what it sees in real time and gives you explanations, insights, or editing commands instantly. You could point it at a crowded street, a cooking setup, a mechanical part, anything, and it'll analyze it and tell you what's happening or help you modify it on the fly. Ant group is treating this part almost as a bridge towards something closer to agentic behavior, where the system can understand the world visually without you having to explain every detail manually. Under the hood, Linguang does something very similar to what the top tier models are doing right now. When you give it a query, it breaks the request into a modular task framework, processes each part in parallel, and then blends the outputs together. That's how it manages to produce those structured responses without falling apart. And the coding part is native. It isn't just generating text code. It generates runnable programs immediately in the chat and executes them inside the environment. That's why the Flash program concept is so fast. It isn't scaffolding or spinning up a dummy interface. It's actually building a functional little app. Antroup CTO Hi Jang Yu put it pretty directly saying that the goal is to make AGI something that everyone can use, not just engineers or experts. His exact phrasing was that Linguang gives every user their own personal AI developer in their pocket. Someone who can code, create visuals, build programs, and simplify complex ideas instantly. And when you look at how fast the downloads moved, it's clear people resonated with that. The international rollout also happened immediately. It's available globally on the Apple App Store, on major Android stores, and through the web at linguang.com. So, Ant Group didn't try to keep it locked inside China. They pushed it out worldwide because they wanted to be seen as one of the major players in this new wave of multimmodal agents. This didn't come out of nowhere either. Ant Group has been aggressively moving into AI all year. They already launched their AI healthcare app, AQ, which grabbed over 140 million users and connected to thousands of hospitals and hundreds of thousands of doctors. They also unveiled their R1 humanoid robot earlier this year, meant to compete with Tesla's Optimus. And the Ling series of AI models has been scaling aggressively, even hitting trillion parameter systems. Linguang is basically their moment to step into the global conversation about agentic AI apps. Especially since Alibaba, Bite Dance, Tencent, and Deepseek are all pushing their own",
        "start": 166.56,
        "duration": 632.3979999999999
    },
    {
        "text": "meant to compete with Tesla's Optimus. And the Ling series of AI models has been scaling aggressively, even hitting trillion parameter systems. Linguang is basically their moment to step into the global conversation about agentic AI apps. Especially since Alibaba, Bite Dance, Tencent, and Deepseek are all pushing their own Bite Dance has Duba, Tencent has Yuan Bao, and Deepseek is doing its own agentic rollout. Ant clearly didn't want to be left behind, and while all of this was happening, the Western AI scene had its own momentum building in the background. Anthropic is gearing up for what might be one of its biggest updates in months. There are strong signs that Claude Opus 4.5 is basically ready to go with some leaks pointing to Monday as a possible release day. People have been spotting references like Claude Kayak in benchmark entries, which is apparently an internal or pre-release build that got tested early. Whenever that happens, it almost always means the launch is close. Claude Opus is usually their top tier model for enterprise users, people who need advanced reasoning and code understanding. So a 4.5 update would be a direct response to the pressure from Gemini 3 and GPT 5.1. Enthropic is also working on a big skills update. The idea is to let people generate new skills entirely inside the chat. You say what you want, Claude builds the skill, and you can enable it or export it right there. It removes all the friction of going into dashboards and setting them up manually. And they're also preparing a referral program for Claude Code where users get three invite codes in QR link form. It sounds like an early access roll out to grow usage but keep it controlled. There's also a mysterious feature called Meabrain mentioned in the back end. Nobody knows what it does yet and Anthropic hasn't said a word. It could be part of a model upgrade, a reasoning layer, or something completely different. The timing makes it look like Anthropic is stacking announcements together and preparing a pretty big week. Perplexity has its own thing going on, too. People noticed a new entry in their internal model selector labeled testing model C. Officially, they say it's for debugging. But here's where it gets interesting. In the underlying code, there are conditions showing that choosing model C might route to Sonnet 4.5, which would line up with the Clawed Opus 4.5 rumors and the fact that it's named with a C raised eyebrows because of the Clawed connection. Perplexity has integrated anthropic models before, so the timing looks suspicious. Some updates suggest it might just be Perplexity's internal model, so it isn't confirmed. But with how fast Perplexity integrates new Frontier models, a link to Claude 4.5 wouldn't surprise anyone. And while all this AI model drama is unfolding, the developer tooling space also got a big upgrade from Warp. They released agents 3, which is basically",
        "start": 320.479,
        "duration": 908.7189999999997
    },
    {
        "text": "internal model, so it isn't confirmed. But with how fast Perplexity integrates new Frontier models, a link to Claude 4.5 wouldn't surprise anyone. And while all this AI model drama is unfolding, the developer tooling space also got a big upgrade from Warp. They released agents 3, which is basically terminal workflows at a deeper level than anyone else has right now. The main thing they added is full terminal use. So the agent can actually interact with complex terminal apps like debuggers, ripples or system monitors, not just run simple commands. It behaves almost like a real developer controlling the terminal. That's something no other terminal assistant is doing. They also added a plan command that lets users and agents co-create implementation plans, revise them, and version them. It feels more collaborative than just asking the agent to write code. Interactive code review is another addition, letting you give feedback and have the agent adjust things inside a proper review workflow. On top of that, Warp integrated Slack, Linear, and GitHub actions, so you can summon the agent from the tools your team already uses and track everything cleanly in a sandboxed environment. Warp already had a reputation for building one of the most modern terminals, and this update is their push to become the main workspace for AIdriven software development. Early testers said the depth of integration makes other assistance look limited, especially when it comes to real terminal automation. And yeah, that's the whole wave right now. Linguang blowing up in China, Anthropic preparing a major jump, Perplexity testing mysterious models, and Warp trying to pull AI deeper into the developer workflow. Thanks for watching and catch you in the next one.",
        "start": 461.68,
        "duration": 1061.2799999999997
    }
]