[
    {
        "text": " All right, here is what is actually new and worth your time today. There is a fresh all-in-one AI workspace called GenSpark that chains top models together, pushes agents into your workflow, and ships finished stuff you can hand to a client or plug into your daily ops. I am talking slides built from briefs, websites stood up from a prompt, brand assets from a single reference image, even calls made on your behalf with transcripts waiting in your inbox. It is a product story first, though the backdrop is wild. A 30 person team hit a billion dollar valuation in roughly 6 months, raised over $200 million led by LG Technology Ventures with Japan's SBI Investment in the round, and expanded into Singapore and Japan for a global push. The reason people are paying attention is what the thing actually does. The core idea is simple. One workspace that orchestrates multiple AI models and the tools wrapped around them so you finish work in one place instead of tab hopping across chat GPT Claude Gemini VO3.1 Nano Banana for images and the usual design and slide apps. The stack leans on a multi- aent flow that runs models in parallel, autoprompts when your first ask is vague, reflects across outputs, picks a best path, and then executes with the right tool. It feels like going from give me ideas to deliver the file without babysitting. Pricing lands on a premium model with free credits upfront and then a single subscription around $19.99 a month that unlocks the full feature set and all models which matters if you are sick of paying for four different AI tools that overlap. Two brand new features sit at the center of the launch. The first is AI inbox. It takes your chaotic email pile and does the unglamorous work fast. Threads get summarized. Suggested replies show up already in your tone, and long exchanges can be converted straight into slides when you need to present what was decided rather than rewrite the same bullet points again. There is natural language control in text or real-time voice. And you can schedule agents to run automatically. So, the system checks for updates, compiles changes, nudges you on deadlines, and ships a draft without you poking it. The flow is clean because the inbox hands off to slides and docs without export dance. When you are underwater, that handoff is the difference between a plan and a promise. The second is teams. Shared projects live in one place with co-editing across slides, sheets, docs, design, even video editing and an AI chat living right inside the file. That last piece is the important one. Most tools throw a chatbot next to your project and call it a day. This bakes the assistant into the canvas. So when someone drops a brief on slide six, the model rewrites slide seven in context while you adjust layout. Real-time presence, permissions, versions, the usual modern collaboration",
        "start": 1.6,
        "duration": 337.76
    },
    {
        "text": "one. Most tools throw a chatbot next to your project and call it a day. This bakes the assistant into the canvas. So when someone drops a brief on slide six, the model rewrites slide seven in context while you adjust layout. Real-time presence, permissions, versions, the usual modern collaboration actually take action rather than suggest a paragraph and vanish. Once those two are set, the rest of the suite starts to click. AI Slides is the one people feel immediately. You feed it a file or two, a short outline, or even an ugly PDF, and it drafts a structured deck using one of more than a hundred templates. You get proper sectioning, consistent typography, smart placement for visuals, and a first pass on charts that does not look like a random export from a spreadsheet. Importing PPTX or PDF is supported, and exporting goes right back to Google Slides, PPTX, or PDF. So, teams that standardize on Google or PowerPoint are not stuck. If you are picky, the editor lets you select an area, describe the change, and let the model implement it. That covers the last mile rework no one wants to do. There is also a quick fact check pass for the slides that pull stats from the web because hallucinated numbers in a client deck burn trust fast. The best way to think about it is a wireframe to first draft machine for decks with a clean handoff to your preferred editor for polish. AI developer handles the zero code side. You describe a site or app in plain language and it scaffolds a working build you can ship. The prompt can point at a URL for design inspiration and the agent will learn the layout structure, spacing, navigation patterns, color rhythm, and core feature set before it generates your version. If you have images or screenshots, you upload those to anchor the look. The goal here is speed from idea to live. So landing pages for lead magnets and dashboards for internal reporting are basically a couple of prompts then minimal touch-ups. The team positions it as a lower barrier than pure code copilots. And in practice that holds since you are not writing functions to render a testimonial grid or fighting CSS spacing for a hero section. You say what you want. The agent drafts it. You tweak copy. You publish. AI designer is where the brand kits and visuals live. Drop a single sentence or a reference image and it generates brand assets across logo, packaging, posters, social, illustrations, even photoreal product composits with model shots. It always pushes multiple variations up front, which is the right move with generative design, and then you work on the one you like directly on the canvas with textg guided edits. If you are doing a fast rebrand sprint for a small product, you can get a complete visual language in an afternoon. Not because it magically nails your taste on the first try, but",
        "start": 170.239,
        "duration": 631.3600000000005
    },
    {
        "text": "then you work on the one you like directly on the canvas with textg guided edits. If you are doing a fast rebrand sprint for a small product, you can get a complete visual language in an afternoon. Not because it magically nails your taste on the first try, but and aligned to your references. There is a handy block of specialized agents that tap into real world tasks. Call forme does outbound calls on your behalf, logs the transcript, and sends the summary by email when it is done. You hand it a business and a purpose like a reservation or a quick stock check or you point it at a personal contact and give it a script. Voices are selectable. The pacing is improving and the fact it declares itself as your AI assistant by default keeps it on the right side of ethics. Download for me handles bulk file grabs when you are collecting a set of assets from scattered sources. AIPOD spins up custom podcast style audio content when you need serialized pieces pulled from a topic and delivered in a consistent template. AI image and video tap the top model lineup so you can switch engines for style or motion quality. The point is not that any single one of these beats a specialized vertical app on raw knobs. It is that they all live next to your documents and slides and handoff cleanly. One more piece matters for people building repeatable workflows. In mid-occtober, GenSpark introduced custom super agent and the super agent store that gives you one prompt agent creation. You describe the behavior once, like a weekly industry report, a daily stock analyst, a research helper, or even a meme generator, and it assembles the agent architecture, selects the models, slots the tools, and configures the routine. You can reuse it across your workspace, call it by name with an appmention, and publish it to the store so others can run it. It reduces the time it takes to go from an idea to a dependable assistant that actually ships a deliverable on a schedule. That is a big deal if your team lives on repeatable reports and you want consistency without building from scratch every Monday. Now, the pricing makes sense, too. One sub covers everything. GPT, Claude, Gemini, VO for video, Nano Banana for images, all under 20 bucks a month. And sure, it is not flawless. The slide drafts still need a human touch, and the AI calls can lag a second or two, but that is normal for early voice agents. Just be smart about what data you link through email or drive and you will be fine. The speed boost alone is worth it. It is launching November 20th in San Francisco. Fresh off a $200 million raise and a 1 billion valuation with barely 30 people on staff. They have already expanded to Singapore and Japan. And this event",
        "start": 319.6,
        "duration": 917.3600000000006
    },
    {
        "text": "or drive and you will be fine. The speed boost alone is worth it. It is launching November 20th in San Francisco. Fresh off a $200 million raise and a 1 billion valuation with barely 30 people on staff. They have already expanded to Singapore and Japan. And this event headline. That is the direction AI workspaces are heading anyway. Models, agents, and teamwork in one place. If you live in decks, docs, or quick launches, this setup just makes sense. Inbox clears your chaos. Slides structures the story, designer fills the visuals, developer builds the page, and your agent keeps everything moving. It is not flashy. It is just the kind of practical automation that saves hours. Try Inbox and Teams first, then play with the rest. It is fast, light, and you feel the difference right away. So, what do you think? Is this the future of how we will actually work with AI? Let me know down in the comments. Do not forget to subscribe and drop a like if you enjoyed the video. Thanks for watching and catch you in the next one.",
        "start": 464.16,
        "duration": 1007.8410000000005
    }
]