[
    {
        "text": " In Shenzhen, researchers at Southern University of Science and Technology just revealed Grow HR, a soft humanoid that triples its size, crawls, swims, floats, and even walks on water. Meanwhile, Limx Dynamics 18 Ali robot stepped out of crates and marched in formation using their KOSA operating system. In Denmark, the humanoid artist IDA designed a pod house for humans and robots. In space, engine AI's PM01 is being prepped as the first robot astronaut and exhumanoids Tien Kung linked directly to a LEO satellite to complete a real task. Back on Earth, China just opened a massive humanoid joint factory and companies like Unitry Robotics are shipping thousands of units. This is happening right now, so let's talk about it. All right. So, one of the most unusual developments comes from researchers at the Southern University of Science and Technology in Shenzhen. They unveiled a soft humanoid robot called Grow HR, and it's basically built around a totally different idea of what a humanoid skeleton should be. Most humanoids today still rely on rigid column-like frames. They're strong in a straightforward way, and they're predictable, which engineers like. Yet, the trade-off is that they don't adapt well. Human bodies adapt constantly and a lot of that comes down to how bones work. Bones are not just hard sticks. They combine different functions at the same time. Growth through epiial plates, stiffness through compact bone, impact absorption through cancellous bone, and then these multiscale internal cavities that keep everything light while still strong. Grow HR is basically an attempt to bring that bone logic into robotics. Instead of building a standard rigid skeleton, the team designed bone inspired growable linkages. Each linkage mixes soft expandable chambers with tensioned cables and rigid adapters that keep the structure stable. There's also a nonstretchable textile layer that adds axial stiffness so the linkage doesn't just balloon randomly. Then a synchronous cable system runs through the linkage, helping the extension happen smoothly and uniformly. So the robot can deform on purpose while still holding shape like it has internal structure, not like a floppy inflatable. Now the numbers are honestly the part that makes you take it seriously. The linked structures can extend up to 315%. The robot can extend its height by 278%, meaning it can nearly triple in height at full stretch. Grow HR reaches about 1.36 m. Then it can shrink again in ways rigid humanoids simply can't. It can reduce its height by 36% and its width by 61% specifically to navigate narrow and low spaces. That matters because in real environments, especially rescue environments, the bottleneck is rarely raw strength. The bottleneck is getting through debris, through gaps, through doors, under collapsed beams, and doing it without getting stuck. and Grow HR stays light while doing all of this. The whole robot weighs about 9.9 lbs, so 4.5 kg. Each linkage is around 350 g. That lightweight design is a big part of why",
        "start": 1.839,
        "duration": 388.63899999999984
    },
    {
        "text": "through debris, through gaps, through doors, under collapsed beams, and doing it without getting stuck. and Grow HR stays light while doing all of this. The whole robot weighs about 9.9 lbs, so 4.5 kg. Each linkage is around 350 g. That lightweight design is a big part of why moves is also not what people expect. It can crawl efficiently, and the team reports crawling at about 112.2 mm per minute. That speed is already decent for a soft humanoid. Yet, the real kicker is how much faster it gets when the growable linkages and the joint motors work together. Coordinated actuation of linkages plus motors enables crawling at a pace 1,122 times faster than either mechanism alone. They also describe it as over 1,000 times faster than motoronly locomotion, which tells you something important. Growth style structural change is not just a gimmick, it's an amplifier. You pair it with motors and suddenly the robot moves in a way that neither method can produce alone. Then you get into the multiode part which is where Grow HR starts sounding almost unreal. Yet it's described as demonstrated capability. Because the robot is so light, it can float and swim. It can walk on water at around 16 mm/s. And with ducted fans or quadrotors, it can fly over distances up to several meters. That last part is important because they're not claiming it has built-in jet propulsion. They're saying the platform is light enough that adding ducted fans or a quadrotor system gives you an aerial mode, meaning the same humanoid body can switch between ground movement, water movement, and short range flight depending on what you attach. It also demonstrates strength in a way soft robots usually struggle with. Grow HR can deliver powerful kicks, and the researchers talk about energy storage beyond rigid robots. In other words, the system can store energy in its compliant structures and then release it quickly like a spring instead of relying purely on motor torque at the instant of impact. Stability and balance get managed through active control and also by adding carbon fiber telescopic linkages, which implies they're mixing materials to get stiffness when they need it. One of the researchers, a PhD student at SUST named Wong Ting, specifically explained that this growable bioinspired structure could be applied in field rescue missions, especially navigating narrow gaps, and that multiple locomotion modes let it adapt to complex terrain. The research was published in science advances, which is a key detail because it signals the work is being positioned as a serious new structural direction, not a one-off prototype story. Now, while Grow HR is about reshaping a single humanoid body, another big push is happening around scaling humanoids as coordinated teams because one robot is one thing, but deploying a whole fleet is the real industrial test. That's where Limx Dynamics comes in. Also based in Shenzhen, they released a video showing 18 of their Ali humanoid robots",
        "start": 196.239,
        "duration": 712.9589999999996
    },
    {
        "text": "humanoid body, another big push is happening around scaling humanoids as coordinated teams because one robot is one thing, but deploying a whole fleet is the real industrial test. That's where Limx Dynamics comes in. Also based in Shenzhen, they released a video showing 18 of their Ali humanoid robots crates, standing up, walking information, and performing a coordinated routine without human intervention. The company describes it as the world's first practical autonomous deployment of humanoid robots. Whether that specific claim holds long-term is open for debate, yet the demo still signals a major step in coordination. The scenario itself is practical. 18 OLE units are placed inside standard shipping containers. The doors open and each robot stands, reaches full height, and begins walking on two legs. Inside tight spaces, they avoid collisions, exit the containers, and move forward together before completing a synchronized routine. The emphasis is on realistic deployment conditions rather than staged lab spacing. Limx ties this to its operating system called KOSA, short for cognitive OS of agents. KOSA enables shared decision-making, movement planning, and collective control. In simple terms, it lets multiple humanoids behave like a coordinated group rather than independent machines sharing space. The company says KOSA mirrors aspects of the human brain by integrating cognition and physical action within one framework. Instead of separating thinking and motion into delayed stages, planning and movement happen almost simultaneously. KOSA also includes memory. Robots store information about environments and objects they've seen before and use it to anticipate what might happen next. During tasks like stair climbing, onboard sensors feed realtime data into KOSA, which immediately adjusts balance, posture, and gate. Limx describes it as unifying perception, learned skills, memory, and even internal emotional states that influence behavior over time. In practical terms, this is about long-term internal variables shaping how robots respond to complex environments. This demo builds on earlier Ali showcases where individual robots navigated uneven terrain, climbed rubble, and balanced on one leg using reinforcement learning. The difference now is scale, coordinated multi-root behavior instead of single robot stunts. The company's vision is clear. Teams of humanoids working together in manufacturing and industrial environments. Beyond movement and labor, humanoids are entering creative fields. In Denmark, at the Utan Center, a concept building designed by a humanoid robot is on display. The robot ID was completed in 2019 and features a human-like face, camera eyes, and a robotic arm for drawing. Its previous work has appeared at the V and A Museum, the Venice Bianale, and the Great Pyramid of Giza. for the exhibition I'm not a robot architecture and design between human and machine. Ida produced what's described as the first building concept designed by a humanoid robot. The design is a retrofuturistic pod house inspired by 1950s and60s space age architecture with rounded forms and large port hole windows. It's intended for human and robot cohabitation and is framed as usable on Earth or even on the",
        "start": 361.039,
        "duration": 1087.3589999999997
    },
    {
        "text": "as the first building concept designed by a humanoid robot. The design is a retrofuturistic pod house inspired by 1950s and60s space age architecture with rounded forms and large port hole windows. It's intended for human and robot cohabitation and is framed as usable on Earth or even on the sketches, painted artworks made with the robot arm, and digital renders of the interior and exterior. The layout shows two living rooms, a spiral staircase, a kitchenet or bathroom, and a smaller pod within the main structure for the robot. Aiden Miller, who works with IDA, openly discusses the blurred line between human prompting and AI agency, describing a team of studio technicians supporting the work. He presents IDA as having rising creative agency while still responding to commissions similar to human artists. IDA itself describes architecture as a natural extension of its purpose, exploring how humans and technology share living spaces. The exhibition runs until October 18th, 2026 with future showings planned in London. Meanwhile, humanoid robots were a major presence at CES. Yet, AI adoption in architecture remains limited with only about 8% of US studios using AI tools by early 2025. The most ambitious direction though is space. Shenzhen based engine AI has launched efforts to send a humanoid robot into orbit, partnering with Beijing interstellar human spaceflight technology. Their chosen platform is the PM01 humanoid, which they aim to develop into a robotic astronaut. Space presents extreme conditions, vacuum, microgravity, radiation, and massive temperature swings. Engine AI says PM01 integrates high precision environmental sensing, millisecond level motion response, and autonomous decision-making to handle these demands. The idea is for humanoid robots to perform risky tasks like station repairs. hazardous exploration and long-term monitoring, reducing risk to human crews. PM01 also has a commercial version on Earth. A model called PM01 JD Joy inside launched for about $27,000 offering natural conversations, coordinated behavior, persona customization, and personalized voices. The robot stands 1.38 m tall, weighs 40 kg, and uses an aluminum alloy exoskeleton. Its waist rotates up to 320°. It relies on an Intel Real Sense Depth camera for perception and runs on Nvidia Jetson Orurin plus an Intel N97 CPU for real-time control. Engine AI compares PM01 to its larger SE01 humanoid, noting PM01 is 27 cm shorter and 8 kg lighter. Meanwhile, Interstellar, the space partner, has its own road map, aiming for suborbital flights around 2028 at 100 km altitude and orbital tourism missions around 2032, reaching 400 km. Another space link development focuses on communications. Exhumoid's embodied Tien Kong robot reportedly became the first humanoid to connect directly to a low Earth orbit satellite without ground network support. At a Beijing event, it linked with a Galaxy Space phased array satellite and transmitted live visual and movement data. During the demo, the robot retrieved a certificate from a driverless vehicle and delivered it to a building while its actions were streamed via satellite to a control center almost instantly. Phones and computers were",
        "start": 549.6,
        "duration": 1488.8779999999992
    },
    {
        "text": "linked with a Galaxy Space phased array satellite and transmitted live visual and movement data. During the demo, the robot retrieved a certificate from a driverless vehicle and delivered it to a building while its actions were streamed via satellite to a control center almost instantly. Phones and computers were link. This proves humanoids can operate in remote areas, disaster zones, and low signal environments where traditional networks fail. Back on Earth, manufacturing capacity is scaling fast. EU Robot Technology opened what it calls the world's first factory dedicated to humanoid robot joints in Shanghai. The facility can produce 100,000 joints per year with plans to triple output. These joints make up about 50% of a humanoid's cost, making them strategically critical. Shipment data shows rapid market growth. Unitry Robotics reported shipping 5,500 pure humanoid robots in 2025 with 6,500 units produced. IDC estimates global humanoid shipments hit 18,000 units in 2025 with $440 million in sales and 58% year-over-year growth. Chinese companies dominate more than 80% of installations. Even Elon Musk now describes China as Tesla's biggest humanoid competitor, highlighting China's strength in scaling, manufacturing, and AI. Analysts point to China's complete supply chain and cost advantages, pushing humanoid prices into the tens of thousands of dollars. Broader industry data shows China had 451,700 intelligent robotics enterprises by the end of 2024 with total registered capital of 6.44 trillion yuan. Now the question is which country do you think will dominate the humanoid robot industry 5 years from now? Drop your thoughts in the comments. I really want to hear your take on this. If you enjoyed this video, make sure to like and subscribe so you don't miss what's coming next. Thanks for watching and catch you in the next one.",
        "start": 753.279,
        "duration": 1699.0389999999989
    }
]