[
    {
        "text": " All right, humanoid robots are getting way too real. And this new one out of China kind of proves we're entering a different phase now. In Shanghai, a robotics company called Droidup just revealed a humanoid named Moya. And they're calling it the world's first fully biomimetic embodied intelligent robot. That's a mouthful. Yet, the idea behind it is simple. This thing isn't built to look like a machine that happens to walk. It's built to move, react, and exist in a way that feels human on a very subtle level, both physically and socially. Moya sits right in that zone people have argued about for years. The space where robots stop looking like tools and start feeling like artificial people. It's not industrial, it's not cartoonish, and it's not trying to be cute or exaggerated. The whole design direction is realism without going full sci-fi android. In videos that blew up on Chinese social media and were later covered by the South China Morning Post, you see Moya making steady eye contact, smiling slightly, nodding as if it's actually following a conversation and walking with a gate that honestly makes you do a double take. Droidup says the robot can reproduce human micro expressions, and that's a big deal because those tiny facial movements around the eyes, cheeks, and mouth are exactly what make interactions feel natural instead of robotic and stiff. It's not just about moving lips. It's about subtle timing and small muscle-like shifts that humans read almost subconsciously. Physically, Moya is built almost like an average adult. And the proportions are very intentional. It stands 1.65 m tall, about 5'5, and weighs roughly 32 kg or 70 lb. That weight is surprisingly low for a full humanoid, which suggests a lightweight internal structure and probably careful material choices to keep the mass down while still supporting smooth motion. Visually though, it still carries human proportions in the torso, limb length, and overall posture, which helps avoid the toy-like or mechanical look a lot of other humanoids still have. Another detail that really shows how far they're pushing realism is body temperature. Droid up says Moya maintains a surface temperature between 32 and 36° C, which is 89.6 to 96.8 degrees F. So, when you're close to it, or potentially interacting physically, it doesn't feel like cold metal or plastic. It feels warm, closer to a living person than a machine, which can really change how comfortable people feel around it over longer interactions. The company also claims Moya's walking posture has a 92% accuracy compared to human gate. That number is about how natural the motion looks and flows, not just whether it can stay upright or avoid falling. A lot of humanoids can technically walk from point A to point B. Very few can do it in a way where your brain stops tracking the mechanics and starts reacting socially, almost like you're watching another person move through the room.",
        "start": 2.639,
        "duration": 352.88199999999995
    },
    {
        "text": "whether it can stay upright or avoid falling. A lot of humanoids can technically walk from point A to point B. Very few can do it in a way where your brain stops tracking the mechanics and starts reacting socially, almost like you're watching another person move through the room. Online reactions in China were mixed, and that's putting it lightly. Some people were fascinated, saying, \"This is the future of companions, assistants, and service robots in everyday environments.\" Others said it gave them chills, which is classic uncanny valley territory, where something looks almost human yet just off enough to feel unsettling. That tension is basically built into this kind of design. Technically, Droidup hasn't released a full deep dive into the hardware stack, which only adds to the mystery and speculation. Quick pause here because while companies like Droidup build the future in labs, regular people are already cashing in on AI in ways that sounded impossible not long ago. Someone just won $1 million with an AI film made using V3 on stage at the 1 billion followers summit hosted by the UAE government. A 19-year-old runs an AI automated agency making $100,000 a month. Forb says employees using AI earn 40% more. The AI job shift is here and the early adopter phase is over. That's why outskill is getting attention. They're hosting a live 2-day AI mastermind training this weekend, 10:00 a.m. to 700 p.m. EST both days, and you can join free for the next 48 hours. This 16-hour training has helped build over a million AI first professionals worldwide and holds a 4.9 out of five rating on Trustpilot. You'll learn to build AI agents, automate workflows, connect tools, save hours every week, and turn these skills into real income. Attend both days, and you also unlock premium bonuses, and the 2026 AI survival hackbook. Links in the description. All right, now back to the video. There are reports from a robotics site called Robo Horizon that Moya is built on something referred to as a Walker 3 chassis. That name raised eyebrows because Walker is usually linked with UB Tech, a more established humanoid robotics company known for its Walker series. So far, neither Droidup nor UB has confirmed any direct connection, licensing deal, or shared platform. It could be coincidence in naming or there could be supply chain or platform overlap that just hasn't been publicly detailed. What is known is that Moya appears to use a modular design, meaning the outer appearance, including the face and surface features, can be changed or customized without redesigning the internal mechanical platform. That's important for commercial use since different industries might want different visual styles and levels of realism from healthcare to education to high-end hospitality. And that's exactly where Droidup says Moya is headed. They're not marketing it as a warehouse robot, a factory arm replacement, or some extreme sports machine doing back flips for viral clips. The focus is",
        "start": 179.04,
        "duration": 692.0029999999997
    },
    {
        "text": "want different visual styles and levels of realism from healthcare to education to high-end hospitality. And that's exactly where Droidup says Moya is headed. They're not marketing it as a warehouse robot, a factory arm replacement, or some extreme sports machine doing back flips for viral clips. The focus is long-term human interaction and social presence. According to figures mentioned in SCMP's video coverage, Moya is expected to enter the market by late 2026 with a starting price around 1.2 million Japanese yen. Final pricing and availability haven't been formally announced yet. Yet, that price point already makes it clear this is positioned as a premium human-facing system aimed at institutions and businesses, not a cheap consumer gadget you'd order online. Now, while Moya is all about human realism and social interaction, another humanoid from China has been busy proving it can survive where most electronics would just give up. Unitry Robotics recently showed its G1 humanoid robot completing a massive autonomous trek in extreme cold conditions in Shinj Jang's Alt region. We're talking temperatures dropping to -47.4° C, which is -53° F. In those conditions, batteries struggle, lubricants thicken, plastics get brittle, and most robots are not designed to operate. Yet, the G1 walked more than 130,000 steps across a snow field while tracing the shape of a Winter Olympics emblem that measured about 186 m long and 100 m wide. That's not just a straight line walk. That's precise path following in brutal weather. To survive that environment, engineers modified the robot from its standard setup. They dressed it in an orange insulated puffer jacket and added improvised plastic covers around its lower limbs to protect joints, actuators, and battery systems from freezing. Positioning relied on China's Bato satellite navigation system, giving centimeter level accuracy. Onboard adaptive path planning algorithms helped the robot maintain stable movement across uneven, icy terrain. The G1 itself is relatively compact for a humanoid. It stands about 127 cm tall, around 4.2 2 feet and weighs roughly 35 kg or 77 lb. Depending on configuration, it uses between 23 and 43 joint motors with maximum joint torque reaching 120 newm. Sensor- wise, it carries 3D lidar and Intel Real Sense Depth camera and a noiseancelling microphone array for voice interaction. Power comes from a 9,000 milliamp hour quick release battery that delivers up to 2 hours of operation and supports fast battery swapping. An 8 core processor controls the joints, allowing walking speeds of about 6.5 feet per second, which is roughly 4.5 miles per hour. The robot runs on Unit's Unifo LM model, a unified large model for robotics, and uses reinforcement learning for motion control and task execution. Originally introduced in May 2024 as an entry-level humanoid, the G1 starts at RMB9,000, around $14,240. Unit Tree also reported shipping more than 5,500 humanoid robots in 2025, which shows serious scale. Then over in Shenzhen, another humanoid grabbed headlines for a very different reason. Chinese EV maker Xpunk brought its Iron",
        "start": 350.88,
        "duration": 1055.1229999999996
    },
    {
        "text": "in May 2024 as an entry-level humanoid, the G1 starts at RMB9,000, around $14,240. Unit Tree also reported shipping more than 5,500 humanoid robots in 2025, which shows serious scale. Then over in Shenzhen, another humanoid grabbed headlines for a very different reason. Chinese EV maker Xpunk brought its Iron show off progress ahead of a planned 2026 mass rollout. The demo started strong. Iron performed a choreographed catwalk, interacted with spectators, and stood on stage next to a child designed to look friendly and approachable. The robot's motion system includes a fivederee of freedom human-like spine and a sophisticated hip structure that improves balance and fluidity. Under its outer suit is a 3D printed lattice fascia layer that mimics human musculature. This layer helps dampen vibrations and smooth out jerky motion that's common in bipedal robots. The goal is to make iron feel less like an industrial machine and more like something that belongs in public, even retail environments. Then after completing a smooth walk, Iron lost balance while standing still and fell backward. A staff member partially broke the fall and the robot ended up face down on the stage. Staff quickly removed it, made adjustments, and later brought it back to interact with children, asking trivia questions. The next day, it stayed strapped to a support frame and focused on educational interactions instead of walking. Despite many earlier flawless demos, the fall dominated online discussion and became a trending topic across Chinese platforms. Technically, iron is built to match adult human scale. It stands 178 cm tall, about 5'10, and weighs 70 kg or 154 lbs. It has 62 active joints, and each hand offers 22° of freedom, allowing it to handle both delicate and bulky objects. A curved display wrapped around its head acts as a dynamic face, changing expressions as it communicates. Power comes from a lightweight all solid-state battery for longer operation and improved safety. processing is handled by three Turing AI chips, delivering 2,250 trillion operations per second. Xpang's vision language action system links perception directly to movement, and the robot was trained on thousands of hours of human motion data. It can walk at speeds up to 2 m/s while absorbing shock through its feet to maintain balance. Behind all these humanoids, researchers are also rethinking the mechanics that make movement possible in the first place. At Harvard SE's engineers developed a new robotic joint design inspired by the human knee using rolling contact joints. These joints use pairs of curved surfaces that roll and slide against each other connected by flexible elements. The team created a method to mathematically optimize the shapes of these surfaces based on the forces and tasks the joint needs to perform. This means the joint itself helps direct energy efficiently, reducing the need for oversized actuators and complex control. In testing, a knee-ike joint designed this way corrected misalignment by 99% compared to a standard joint. A two-finger robotic gripper built using",
        "start": 534.8,
        "duration": 1382.3239999999996
    },
    {
        "text": "the forces and tasks the joint needs to perform. This means the joint itself helps direct energy efficiently, reducing the need for oversized actuators and complex control. In testing, a knee-ike joint designed this way corrected misalignment by 99% compared to a standard joint. A two-finger robotic gripper built using three times the weight of a conventional design using the same actuator input. applications range from exoskeletons and assisted devices to more natural humanoid robots and even biomechanical studies of animals. And finally, in the US, Westwood Robotics is tackling another big challenge, getting humanoids to work while they walk. Their Theis Gen 2.5 robot runs on an AI augmented humanoid operating system called AOS, which tightly integrates perception, planning, and control. Most humanoids today stop moving before they manipulate objects. Themis is designed to do both at once. Its whole body location controller uses sensor fusion state estimation to maintain balance while the arms handle objects. A navigation system built on multi-layer mapping and semantic understanding helps it plan paths while recognizing its surroundings. The interaction system is powered by an object- ccentric vision action model or OC VAM which links visual perception directly to physical actions in a compute efficient way. Hardware also got serious upgrades. The structure is redesigned for about 40% greater impact resistance. Each arm now has 7° of freedom and can handle payloads of more than 5 kg. In the hips, new Mountain Beer actuators deliver over 120% more torque while producing around 80% less heat. The earlier The Femis 52 stood 5' 3 in tall with 40° of freedom, arms with six° of freedom, and hands moving in seven directions using back drivable BR actuators for smooth, safe motion. All right, that's it for this one. Thanks for watching, and I'll catch you in the next one.",
        "start": 700.56,
        "duration": 1590.1640000000002
    }
]