[
    {
        "text": " Forget everything you knew. CES 2026 just proved the robot revolution is officially here. Realics unveiled a humanoid so lifelike it actually solves the uncanny valley. Engine AI's T800 proved that robots can now jump and [music] sprint like pro athletes. Tombot introduced Jenny, the robotic pup designed for pure emotional comfort. From rollable laptops to AI powered sneaker cleaners and L'Oreal AI face masks, it was a wild show. Hey guys, Alfie here. Welcome to the AI Nexus. Let's get into it. Real [music] introduced David Bot, a male humanoid designed to push realism far beyond previous demos. Davidbot uses advanced facial animation systems [music] that sync speech with micro expressions. When the robot smiles, muscles around the eyes react naturally. When it pauses, the face settles [music] instead of freezing. This solves one of robotics's biggest problems, the uncanny valley. Built on the Ask Arya platform, [music] the system adjusts tone and expression based on detected emotion. It is positioned for entertainment, hospitality, and customer-f facing roles. The result feels less like a machine responding and more like a presence reacting in real time. If realism was one extreme, raw physical ability was the other. Engine AI showcased two humanoids that focus entirely on motion and strength. The PM01 is a lightweight embodied agent designed for realworld environments like malls, stations, [music] and guided tours. Movement is smooth, controlled, and practical. Then comes the T800. This full scale humanoid delivers up to 450 new meter of torque per joint and 14,000 watts of instantaneous [music] power. That level of force allows sprinting, jumping, and combat style movement. Instead of slow mechanical steps, the T800 moves like a trained athlete. This shift marks a move away from staged concepts and toward robots built for factories, [music] emergency response, and physical labor. Not every robot at CES was built for [music] power or speed. Some were designed for comfort. Tombot presented Jenny, a robotic companion created for seniors with dementia and individuals dealing with anxiety. Jenny uses nine servo motors to control subtle movements, ears, head tilt, eyebrows, and tail. The design was developed with Jim Henson's Creature Shop, giving it lifelike motion instead of rigid animation. Capacitive touch sensors allow the robot to respond when petted or held. When interaction stops, Jenny reacts with gentle movement to re-engage. Priced around $1,500, it replaces neither therapy nor care, but offers emotional presence for people unable to maintain a real pet. Displays took a major leap forward with Lenovo's ThinkPad Rollable XD. At first glance, [music] it looks like a standard 13.3 in laptop. Then the screen expands upward into a full 16in vertical workspace. [music] The rollable panel is powered by dual motors and steel cable support to keep the display flat and rigid. Unlike earlier concepts, there's no warping or distortion. Part of the screen wraps around the exterior when closed, enabling a world-facing display for notifications or schedules. This design removes the need for external monitors",
        "start": 4.48,
        "duration": 443.2789999999999
    },
    {
        "text": "is powered by dual motors and steel cable support to keep the display flat and rigid. Unlike earlier concepts, there's no warping or distortion. Part of the screen wraps around the exterior when closed, enabling a world-facing display for notifications or schedules. This design removes the need for external monitors friendly. It's a practical evolution of foldables focused on productivity rather than spectacle. CES always delivers unexpected products. One of the most talked about was the Brolon Clear X, an AI powered shoe cleaning system. Shoes are scanned internally to identify material types like leather, suede or mesh. Based on that data, the system selects a cleaning and drying cycle automatically. The core technology uses micro nano bubbles which penetrate fabric without soaking it. This removes dirt while preserving structure and [music] glue. With an estimated price between $500 and $800, it targets collectors rather than casual users. for sneaker preservation. It may solve a problem most didn't know could be automated. Behind many of these machines is one key player, Qualcomm at CES. The company unveiled the Dragon Wing IQ10 chip built specifically for physical AI systems. The chip features an 18 core Orion CPU [music] and delivers 700 tops of AI performance. That's more than 10 times the power of most AI laptops. It supports up to 20 simultaneous [music] camera inputs, allowing robots to see, reason, and act in real time. Qualcomm pairs this with a visual language action model, meaning robots understand what objects are and how they should be handled. This architecture is designed to move robotics out of labs and into everyday environments. Personal flight returned in a serious way with the air EV. Unlike air taxi concepts, this electric vertical takeoff and landing is designed for private ownership. The aircraft uses a flybywire system where onboard computers manage stability while the pilot controls direction. It reaches speeds of 155 mph with a range of 110 mi. For the 2026 version, Blade geometry was redesigned to reduce noise, one of the biggest barriers to personal aircraft adoption. Instead of futuristic visuals, Air1 focuses on usability and garage scale storage. It positions personal flight as a lifestyle tool, not a science experiment. If Air1 is a flying car, the RTOR X4 is closer to a flying [music] dirt bike built for solo pilots. It uses a multi-rotor design with an open field of view. The standout feature is autonomous obstacle avoidance. Using LAR and ultrasonic sensors, the system detects trees, cables, and terrain in real time. Takeoff and landing are fully AI assisted, lowering the barrier for new pilots. Battery density improvements pushed flight time to 30 minutes, a notable jump from earlier versions. The X4 represents a shift from proving flight is possible to proving it can be safe and accessible. Minimalism took an extreme form with the HP Elite [music] Board G1A. There is no separate PC. The keyboard is the computer. Inside its 0.7in chassis sits an AMD Ryzen AI 300",
        "start": 227.2,
        "duration": 834.48
    },
    {
        "text": "The X4 represents a shift from proving flight is possible to proving it can be safe and accessible. Minimalism took an extreme form with the HP Elite [music] Board G1A. There is no separate PC. The keyboard is the computer. Inside its 0.7in chassis sits an AMD Ryzen AI 300 system, speakers, and microphones. It qualifies as a co-pilot plus PC with a dedicated NPU for AI workloads. Weighing under 1.5 lbs, it connects [music] to any display via USBC. The internal design is modular, allowing RAM and storage upgrades. This concept [music] brings back the spirit of early home computers, updated for cloud workflows [music] and AIdriven productivity. Wearables also received a major AI upgrade. Lenovo previewed Caira, lightweight AI powered glasses weighing just 45 gram. The system delivers near instant live translation and contextual summaries of missed notifications, all without heavy hardware. For younger users, the Luca AI cube targets Gen Alpha. The cube uses multimodal AI to identify objects and explain them through stories [music] and facts. Instead of screenbased interaction, it encourages realworld exploration. These devices show AI moving away from apps [music] and toward ambient everyday assistance. Beauty technology took a scientific turn with L'Oreal's [music] LED face mask prototype. The flexible silicone mask uses 630 nmters red light and 830 nanmters near infrared light wavelengths known to support collagen production and skin repair. An integrated microcircuit controls exposure time and intensity to prevent overuse. Unlike rigid masks, this design conforms to facial contours for even treatment. Set for a 2027 launch, it represents skincare moving into regulated datadriven wellness rather than cosmetic experimentation. Displays reached another milestone with the Samsung Z trifold. Fully unfolded, it becomes a 10in tablet-sized [music] screen. Despite the size, the device is just 12.9 mm thick when folded. A dual hinge system allows three apps to run side by side with no performance drop. Powered by the Snapdragon 8 Elite and paired with a 200MP camera, the device focuses on productivity rather than novelty. This design shows foldables maturing into serious computing tools instead of [music] experimental form factors. The show closed on a softer note with Echovax Lil Milo, an emotional companion robot designed like a small animatronic dog. Lil Milo uses facial recognition and voice detection to interact naturally. Its charging station is shaped like a dog bed. When battery runs low, the robot crawls in and sleeps while charging wirelessly. This design avoids mechanical reminders of power and maintenance. Lil Milo highlights a growing trend at CES. Robots not just [music] as tools, but as quiet, emotional fixtures in everyday spaces. The floor is filled with big announcements, [music] robots around every corner, and AI woven into nearly every booth. Boston Dynamics unveiled the new Atlas at CES 2026. [music] And for the first time, this version of Atlas is built for work, not stunts. There were no backflips on stage. Instead, Boston Dynamics introduced a productionready humanoid designed for reliable everyday tasks in real",
        "start": 424.88,
        "duration": 1256.3999999999999
    },
    {
        "text": "woven into nearly every booth. Boston Dynamics unveiled the new Atlas at CES 2026. [music] And for the first time, this version of Atlas is built for work, not stunts. There were no backflips on stage. Instead, Boston Dynamics introduced a productionready humanoid designed for reliable everyday tasks in real Hyundai Motor Group's long-term AI and robotic strategy with early deployments planned inside Hyundai manufacturing facilities. [music] The robot is fully sealed, waterresistant, and built to survive factory conditions. Operating across a wide temperature range from cold storage areas to hot industrial floors. Atlas uses a swappable battery system that allows up to 4 hours of continuous operation. And when power runs low, the robot can navigate to a station and replace its own battery, reducing downtime and human supervision. A major shift with Atlas is intelligence. Through a new partnership with [music] Google Deep Mind, Boston Dynamics is integrating advanced AI models built on Google's Gemini robotics work directly into Atlas, bringing advanced perception, decision-m, and learning into the robot. LG took the CES 2026 stage to introduce Celoid, the robot at the center of LG's zero labor home vision. LG calls CLID a home specialized AI agent designed to physically take over daily chores inside real homes. Clid has a humanoid inspired design with a screen that shows expressions, a torso that can stretch and tilt, and two highly dextrous arms, but no legs. Instead, LG chose a wheeled base with a very low center of gravity that makes CLD faster, safer, and far more stable than walking robots. What truly sets CLI apart is intelligence. LG uses a combination of vision language models and vision language action models, [music] enabling CLI to understand what it sees and turn instructions into real physical actions. On stage, CLOD loaded laundry, folded towels, cleared obstacles for a robot vacuum, and prepared breakfast using connected LG appliances. This wasn't AI talking, it was AI working. Samsung delivered one of the biggest display moments at CES 2026 with its 130in microorgb 95H, which won a best of innovation award. Standing in front of it doesn't feel like watching a screen. It feels like looking through a window. This is Samsung's most advanced consumer display to date. Unlike traditional TVs that use white LEDs and color filters, MicroRGB uses ultra small red, green, and blue dodes that emit pure light directly. Each color is controlled independently, allowing far higher brightness, deeper contrast, and color accuracy that conventional panels simply can't match. Powering this is Samsung's new micro RGB AI engine pro, which dynamically adjusts color and light at the [music] pixel level in real time. Samsung paired the panel with a timeless frame design, making the display look more like a floating architectural window than a television. With the R95H, Samsung isn't just improving picture quality. It's redefining what a large format display can feel like inside a living space. This one caught everyone offguard. LEGO unveiled smart bricks.",
        "start": 638.0,
        "duration": 1660.8800000000003
    },
    {
        "text": "with a timeless frame design, making the display look more like a floating architectural window than a television. With the R95H, Samsung isn't just improving picture quality. It's redefining what a large format display can feel like inside a living space. This one caught everyone offguard. LEGO unveiled smart bricks. and copper coils. They use something called bricknet, a wireless layer that lets the bricks talk to each other. If you build a spaceship, the bricks know it's a spaceship and play engine sounds from a tiny built-in speaker. If you change it into a house, the sounds change. It's basically turning physical toys into a living video game. It's a massive jump from the simple power functions we've had for years. Robok revealed the SOS rover at CES 2026. And what makes it important isn't raw power, it's mobility. For years, robot vacuums have failed at one simple thing. Moving through real homes, rugs, door thresholds, uneven floors, and small obstacles have always been the point where these robots stop and give up. Saras changes that by rethinking how a robot vacuum moves. Instead of relying only on small wheels, it uses a hybrid legend and wheel system that allows the body to lift, adjust, and climb over obstacles that traditional designs simply can't handle. This lets Saras move between rooms, across raised surfaces, and into spaces that were previously offlimits to robot cleaners. For the gamers, the Asus ROG Zephorus Duo got a massive refresh. It's now running on the new Intel Core Ultra Series 3. We'll get to that later. The dual screen setup is now seamless with a new hinge that makes it look like one giant curved display when open. It's the first laptop that feels like a true desktop replacement without weighing 20 lb. Mercedes showed off the new CLA, but the car wasn't the headline. The brain was. It's the first car to run Nvidia's Alpameo system. This car doesn't just follow lanes. It reasons. If it sees a ball bounce into the street, it knows a kid might follow it. That causal reasoning is the holy grail of self-driving. And Mercedes is putting it on the road this year. Switchbot made one of the most surprising jumps at CES 2026. Switchbot unveiled Honoro H1, its first generalpurpose humanoid robot and the centerpiece [music] of Smartome 2.0. Honoro H1 isn't a vacuum or a single task robot. It's designed as a mobile helper for everyday home tasks. What sets H1 apart is its upper body. With highly articulated arms, the robot can reach, grasp, and manipulate objects in a way that feels closer to a human assistant than a gadget. The key shift is intelligence. Honor H1 uses ondevice vision and reasoning, meaning it understands objects, space, and actions without relying on the cloud. Zel brought their latest AR glasses. They finally solved the bulk problem. These look like regular thick rimmed glasses, but can project a 200in virtual screen.",
        "start": 842.639,
        "duration": 2017.0390000000018
    },
    {
        "text": "The key shift is intelligence. Honor H1 uses ondevice vision and reasoning, meaning it understands objects, space, and actions without relying on the cloud. Zel brought their latest AR glasses. They finally solved the bulk problem. These look like regular thick rimmed glasses, but can project a 200in virtual screen. view. It's 30% wider than last year, so the edges of your virtual monitor don't disappear when you move your head. And for the weird but cool find, the Glide Smart Hair Clipper. It uses AI sensors to detect the density of your hair and adjust the motor speed in real time, so it never pulls. It even maps your head and tells you if you've missed a spot on the back. It's a bit overengineered, sure, but after seeing it, you'll never want a dumb clipper again. At CES 2026, three companies made it clear that the smart home is no longer about gadgets. [music] It's about AI that lives with you. And each company is approaching that future very differently. Samsung framed its entire strategy around your companion to AI living. Samsung's idea of home AI is an invisible system that quietly manages daily life in the background. Inside its bespoke AI ecosystem, appliances share context with each other. The fridge doesn't just recognize food. It understands expiration timelines and [music] suggests meals to reduce waste. If laundry finishes, the TV can notify you. The goal isn't personality or emotion. It's coordination. Samsung wants the home to feel like a perfectly synchronized control system that anticipates needs before you ask. LG is taking a very different route with what it calls affectionate intelligence. LG's vision focuses on emotional awareness rather than pure [music] efficiency. Its AI systems are designed to respond to mood, routine, and presence, lighting, sound, and environment adapt automatically, while CLI acts as a physical companion that can assist when needed. LG isn't trying to optimize your schedule. It's trying to make the home feel supportive, calm, and human. Then there's Switchbot, which is positioning itself as the most accessible entry into this future. With Smartome 2.0 and the Nico AI pet, Switchbot brings embodied AI into homes at a smaller, more affordable scale. It's not about perfection, it's about practicality. Together, these three visions show where home AI is heading. Not just smarter homes, but homes that understand how you live. Everything we've talked about so far, robots, smart homes, [music] cars, massive displays, only exist because of three companies. This is the brain of CES 2026. Nvidia opened the show with a clear message. AI is no longer just software. [music] It's becoming physical. Jinsen Huang confirmed that the new Vera Rubin architecture is now in production, setting the foundation for the next wave of AI systems. But the real shift came with Alpameo, an open AI platform designed specifically for autonomous driving. Nvidia isn't just building chips for cars. It's building intelligence that any automaker can plug",
        "start": 1023.199,
        "duration": 2384.7190000000023
    },
    {
        "text": "the new Vera Rubin architecture is now in production, setting the foundation for the next wave of AI systems. But the real shift came with Alpameo, an open AI platform designed specifically for autonomous driving. Nvidia isn't just building chips for cars. It's building intelligence that any automaker can plug flagship GPU, but DLSS 4.5 quietly stole attention by using advanced frame generation to dramatically smooth gameplay without needing new hardware. And then there's Project GR0000T, Nvidia's humanoid robot intelligence stack. Robots can now learn tasks by watching a human once instead of being programmed line by line. This is the closest thing yet to a chat GPT moment for physical robots. AMD followed with one of its strongest CES keynotes ever. Lisa Sue positioned AMD as a company operating across laptops, data centers, and even space. New Ryzen AI chips push powerful AI processing directly onto personal devices, making fully offline AI assistance practical. The biggest moment came when Greg Brockman joined her on stage to announce a massive infrastructure partnership with Open AAI planning to deploy gigawatts of AMD power compute. AMD also revealed its chips are now flying aboard Blue Origin lunar missions while new Helios data center systems target Nvidia head-on. Then there's Intel quietly staging a comeback. Intel unveiled Core Ultra Series 3, built on its advanced 18A manufacturing process, bringing serious AI performance to everyday PCs. New Battlem Graphics aimed squarely at the mid-range GPU market. But the surprise was RO, a humanoid robot running entirely on Intel Edge processors. Intel isn't just powering screens and spreadsheets. It's putting AI into motion. All right, let's talk about AI wearables. OMI showed one of the most interesting AI wearables at CES 2026 with its open mind interface. Unlike earlier AI pendants that felt invasive or cloud dependent, OMI is designed to act as a private ondevice AI coach that understands context, not just voice commands. The key shift is where the intelligence lives. OMI runs ondevice small language models, meaning conversations are processed directly on the wearable instead of being sent to remote servers. This improves privacy and cuts response time to near zero. In real use, OMI doesn't just record meetings. It understands them, tags important moments, and recalls details instantly when asked. It's subtle, fast, and genuinely useful, turning AI memory into something you'd actually wear. Next, let's talk about your eyes. TCL's Reineo division turned heads at CES 2026 with the Reine Air 4 Pro AR glasses. Unlike earlier AR glasses that felt good only for casual viewing, the Air4 Pro is the world's first HDR10 enabled AR display, delivering brighter highlights and richer colors that finally feel premium. Dual micro OLED screens push high brightness while staying ultra light, making long viewing sessions comfortable. Raino also solved one of AR's biggest pain points with built-in vision adjustment dials, eliminating the need for custom prescription lenses at a fraction of the weight and rumored cost of high-end",
        "start": 1209.919,
        "duration": 2794.0780000000022
    },
    {
        "text": "feel premium. Dual micro OLED screens push high brightness while staying ultra light, making long viewing sessions comfortable. Raino also solved one of AR's biggest pain points with built-in vision adjustment dials, eliminating the need for custom prescription lenses at a fraction of the weight and rumored cost of high-end displays feel practical, wearable, and ready for everyday use. Okay, this next one is genuinely adorable. Taei unveiled Vcar at CES 2026, an AI powered pocket pet that feels like a modern take on Tamagotchis, only far smarter. Unlike last year's AI companions that lived on phone screens, Svcar is a physical egg-shaped device with a face, haptic ears, [music] and a personality that actually grows. It starts as an egg, evolves through interaction, and slowly adapts to how you talk and behave. Over time, it develops its own character and even goes on virtual adventures, sharing stories and creations with you. It's not just an AI toy. It feels like a tiny evolving companion you carry in your pocket. Birdfi raised the bar at CES 2026 with two standout reveals, the BirdFy Feeder Vista and Humblam. The Vista rethinks smart feeders with a 360° camera system, giving a full panoramic view instead of a single fixed angle. A clever bottom-up feeding design keeps seeds out of the way so the camera never misses a moment. For hummingbird fans, Huml Bloom captures ultra slow motion footage, revealing wing movement the human eye can't see. Paired with upgraded AI that explains bird behavior, BirdFi turns backyard watching into a living nature documentary. If you hate cooking, this one matters. N'SH introduced a countertop robot chef at CES 2026 that's finally built for everyday kitchens. Unlike past cooking robots that felt industrial and unreachable, NSH actually cooks meals from raw ingredients. You load the food, pick a recipe, and the robot handles stirring, heat control, and timing automatically. With hundreds of dishes supported and even a live camera to monitor cooking remotely, Nosh feels like a real step beyond smart appliances and closer to automated home cooking. We can't talk about CES without talking about cars. Sony Honda Mobility showed the Aphila pre-production model at CES 2026 and it feels less like a car and more like a rolling entertainment and AI platform. The front media bar display and deep PlayStation integration turn charging time into gaming time. Underneath Ailera runs on Qualcomm's AIdriven digital chassis using advanced sensors and vision language models to understand road situations before they fully unfold. It's not just transportation. It's a mobile AI agent aimed squarely at premium electric cars. The biggest moment at CES 2026 came when Uber revealed its return to hardware, partnering with Lucid and Neuro. The result is a fully driverless luxury robot taxi with no steering wheel built for real city use. Powered by Nvidia's automotive AI platform, it combines autonomy, comfort, and scale. With pilot launches planned for late 2026, this finally makes the driverless dream feel real, not theoretical.",
        "start": 1418.159,
        "duration": 3192.718000000004
    }
]