[
    {
        "text": " AI robots are going crazy right now. Every week, something appears that looks like it came straight out of a sci-fi fever dream. There are robots doing kung fu, robots running full marathons. But while everyone chases flashy robot stunts, something far more real just dropped. Sunday Robotics just unveiled their new home robot named Memo. Memo isn't trying to break world records or jump over obstacles. It's designed for the place where real life actually happens. The home. Hey guys, Alfie here. Welcome to AI Nexus. Sunday Robotics didn't just show Memo. They showed what a real household robot should look like. Calm, useful, and built with intention. Memo walks up to a fully messy dinner table and clears the entire thing, not just plates and forks. It handles delicate wine glasses, picks up bowls, balances objects, separates food waste, loads everything into a dishwasher, and even starts the cycle. And it doesn't do it with jerky robotic motions. This thing moves with careful, thoughtful precision, almost humanlike in the way it senses weight and adjusts its grip. Then, as if that wasn't enough, it turns around and folds socks from a chaotic pile like it's the most normal thing in the world. It pairs socks, stretches them, rolls them into perfect little balls, and drops them in a basket. And yeah, I know there are humanoid robots that can lift weights or climb stairs or do a backflip, but socks, soft fabric, random clutter, that's a whole different difficulty level. But here's the crazy part. Memo also pulls a real espresso shot. Not from a robot friendly machine, from a standard consumer espresso maker. It actually locks the PA filter into place. Something that takes [music] real torque, runs the shot, and serves it. That's when I realized this startup isn't playing around. They're going after real chores. The stuff normal people deal with every day. And they're doing it with a kind of confidence you rarely see in a company this young. Now, usually when we see demos like this, there's a hidden trick. It's either teleyoperated, heavily choreographed, or filmed 100 times to get one good take. But Sunday Robotics keeps repeating something bold. Memo is fully autonomous in these demos. No puppeteer behind the scenes. No human secretly driving the arms like a video game character. And if that's true, this is a bigger deal than most people realize. Let me tell you why. Most robotics companies rely on something called teley operation. A human wears a VR headset or uses special controllers and basically drives the robot. The robot records all of that motion and learns from it. It's powerful but brutally expensive. You need a big robot sitting in a lab. You need a teley operator. You need a full rig with sensors and screens. And every time you want more training data, you repeat the whole process. It doesn't scale. You can't put 500 robots in 500 homes just",
        "start": 4.24,
        "duration": 364.481
    },
    {
        "text": "brutally expensive. You need a big robot sitting in a lab. You need a teley operator. You need a full rig with sensors and screens. And every time you want more training data, you repeat the whole process. It doesn't scale. You can't put 500 robots in 500 homes just Robotics flipped the script. Instead of trying to bring robots into homes to collect data, they asked a smarter question. What if you could bring the data collection to the humans without the robot ever being there? This is where their skill glove idea blew my mind. They built a special glove that mimics Memo's robotic hand. Same shape, same joint structure, same sensor layout. So when a person wears this glove and does something, whether it's washing dishes, folding laundry, or organizing a messy cabinet, the glove captures every tiny motion, every pinch, every twist, every force signal. And because the glove is designed to match the robot's own hand, the robot can take that data and say, \"Oh, this is exactly how I would have done it.\" Suddenly, Sunday can send hundreds of these gloves to real people in real homes. You want data from a cramped kitchen in Tokyo, a bright Airbnb in Los Angeles, a messy studio apartment in Mumbai? Just ship a glove, let the person do their daily chores, and now you've got clean, [music] extremely detailed robot ready data for cheap. They claim it's 100 times more capital efficient than telly operation. But here's the even crazier twist. When a human uses the glove, the cameras obviously see a human arm, a human wrist, a human body. That's messy data for a robot. So Sunday built a system called Skill Transform that basically rewrites all that footage as if Memo itself performed the action. Same geometry, same reach, same joint angles. It converts human motion into robot motion with something like a 90% success rate. that solves a problem robotics teams have struggled with for [music] years. All of this feeds into their robot foundation model called ACT1. And this is where Sunday takes a huge swing. A CT-1 is trained on zero robot teleop data. None. It's all based on thousands of human demonstrations collected from glove wearers across more than 500 homes. That means the model isn't learning how to move like a stiff machine. It's learning from the fluid, intuitive way humans interact with everyday objects. A CT1 controls everything Memo does. Navigation, arm movements, finger level precision, long horizon planning. It decides when to walk across a room and when to slow down and carefully slide a glass between two dishwasher prongs. In one full run, Memo walked 130 ft, handled 21 different objects, and performed 68 total interactions. That is not a scripted sequence. That's act one, planning in real time. If Memo is dropped into a brand new home, it builds a 3D map, figures out what objects are where, and tries to solve",
        "start": 186.8,
        "duration": 711.1200000000005
    },
    {
        "text": "Memo walked 130 ft, handled 21 different objects, and performed 68 total interactions. That is not a scripted sequence. That's act one, planning in real time. If Memo is dropped into a brand new home, it builds a 3D map, figures out what objects are where, and tries to solve That's the part that keeps sticking in my head. This is not the typical lab environment. This is real, chaotic, unpredictable life. And now Sunday says they plan to put memo into 50 real households by late 2026. That's bolder than most big robotics companies. They want real people testing this robot, giving feedback, shaping what skills it learns next. Yes, Memo is still slow. Yes, it will definitely fail at times. And no, they haven't announced the price yet. But the vision is unmistakable. A robot trained on the collective hands of thousands of people. You teach it by doing your own chores. The robot learns your style, your preferences, your rhythm. That's such a human first way of thinking about robotics. And honestly, I find it brilliant. If you think that's crazy, wait until you hear this. While Tesla's Optimus Gen 3 is making headlines with its new hand upgrade, and [music] Unitry G1 is going viral with those insane kung fu moves, there's one company that's been unusually silent lately, but has made bigger headlines than both of them combined. Boston Dynamics. This is Boston Dynamic that went from hydraulic humanoids doing parkour to electric humanoids twisting their joints like superheroes. From robot dogs saving lives in rescue missions to four-legged speed demons sprinting like wild animals. In just a few years, they've built everything. The fastest robots, the strongest humanoids, machines that run like animals, climb like athletes, and AI systems that learn entirely on the move. This isn't [music] robotics anymore. It's evolution in metal. And today, we're diving into Boston Dynamic that doesn't just build robots. They build machines that move like they're alive. What started as military-funded experiments turned into the most jaw-dropping robotic legacy on the planet. Boston Dynamics doesn't just build robots. They build machines that move like they're alive. And what started as wild science experiments funded by the military has turned into the most jaw-dropping robotics company on the planet. Let's start with the legend. HD Atlas. This hydraulic beast was the most agile humanoid robot ever made until it retired in 2024. We're talking backflips parkour running dancing to do you love me in perfect sink. This thing could lift heavy engine covers, balance on one foot, and if you pushed it, it would stumble and catch itself [music] like a drunk friend at a party. The secret. 28 hydraulic joints pumping fluid at insane pressure, [music] giving it strength and speed that made it look super human. When Atlas did that 540°ree twisting backflip they called the sick [music] trick, engineers said every joint was pushing at nearly 100% power at the same time.",
        "start": 362.56,
        "duration": 1057.9200000000005
    },
    {
        "text": "party. The secret. 28 hydraulic joints pumping fluid at insane pressure, [music] giving it strength and speed that made it look super human. When Atlas did that 540°ree twisting backflip they called the sick [music] trick, engineers said every joint was pushing at nearly 100% power at the same time. engineering on the edge of what's physically possible. And the craziest part, it wasn't just playing back recorded moves Atlas was calculating in real time. how to jump, how hard to push, how to land without face planting. It [snorts] was like watching a metal gymnast with a PhD in physics. But just when everyone thought Atlas had peaked, Boston Dynamics pulled the ultimate plot twist. Electric Atlas. Same robot, totally different guts. This new version weighs about 89 kg, roughly the same as a person, but it's packed with electric motors instead of hydraulic fluid. That means it's quieter, smoother, and way easier to maintain. No more loud hissing and pumping sounds. Just smooth, precise motion. And it can run at 2 and 1/2 m/s, which is a slow jog for us. But this thing can do it over and over without overheating, thanks to a cooling system that works like human sweat. Now, here's the part that blew my mind. Atlas's joints can bend and twist beyond what any human can do. Its waist can spin all the way around. Its hips can stretch at crazy angles. Imagine a worker pulling a heavy box from a shelf while doing a half turn spin in midair and never dropping it. That's Electric Atlas. And the gripper system, that's where it gets really interesting. Boston Dynamics built what they call the GR2 gripper. A three-fingered hand with seven degrees of freedom and seven actuators. [music] Two actuators for each finger, one for an articulated thumb that swivels and spins. Why three fingers? Because the team figured that's the fewest number you need to handle complex tasks. Large, heavy objects. Distribute tension across many contact points. Small, delicate stuff. Use a two-finger pinch with the thumb. And get this, the gripper has tactile sensing on the fingertips and cameras embedded in the palm. It's not just grabbing blindly. It's feeling and seeing what it's holding. In factory tests, Atlas autonomously moves engine covers between containers and mobile dollies using machine learning vision models. No prescribed movements, no teley operation. It's doing it all on its own, generating motions in real time. Do you think Electric Atlas is now officially more capable than a human worker? Let me know in the comments. And while Atlas grabbed headlines, another robot quietly became the company's real workhorse. About the size of a golden retriever, weighing 32 kg, this little robot can walk, climb stairs, and cross rocky or muddy ground that would wreck most machines. Spot is covered in cameras that give it 360° vision [music] so it never bumps into things. And in factories, it quietly walks between machines, listening for strange sounds,",
        "start": 538.399,
        "duration": 1395.919000000001
    },
    {
        "text": "weighing 32 kg, this little robot can walk, climb stairs, and cross rocky or muddy ground that would wreck most machines. Spot is covered in cameras that give it 360° vision [music] so it never bumps into things. And in factories, it quietly walks between machines, listening for strange sounds, equipment. If something looks off, Spot automatically warns the team before problems get serious. But here's where Spot really shines. Emergencies. When a building collapses, Spot can walk over piles of debris, use its cameras to look for trapped people, [music] and send video back to rescuers. It explores risky areas like nuclear power plants, collecting radiation readings without putting humans in danger. And even though it weighs just 32 kg, it can carry up to 14 kg of extra equipment on its back. A full backpack of tools or a small robot arm spot isn't just a machine. It's a mechanical coworker with personality and purpose. If you had to trust one robot in a real emergency, Atlas or Spot, who are you picking and why? But Spot didn't appear out of nowhere. Its roots trace back to one of the wildest machines Boston Dynamics ever built. This thing was a beast. A four-legged robot that could sprint at 16 mph across open ground as fast as a galloping [music] horse. Powered by a small gasoline engine that made it sound like a go-kart on four legs, Wildcat could run, hop, and spring off the ground with muscle-like power. You could hear it roar to life as it took off, kicking [music] up dust as it dashed across pavement and dirt. What made wild cats so special was how it kept its balance while running over rough ground. It adjusted every stride based on what was beneath its feet, shifting its weight and rhythm just like a real animal would when sprinting across uneven dirt or grass. It wasn't as fast as its predecessor, but it represented freedom and adaptability. No cables, no lab restrictions, just pure mechanical muscle. And the story goes even deeper because before Wildcat came the true record-breaker, the speed demon. In 2012, this four-legged machine made history by sprinting over 28 mph on a treadmill, faster than Usain Bolt. Its flexible spine and springy legs work together. Do you think Boston Dynamics should bring back Wildcat and push its speed even further? Comment your thoughts. But none of this happens without money. And that money came from DARPA, the Defense Advanced Research Projects Agency. The same folks who funded early internet research and stealth technology Boston Dynamics was founded in 1992 as a spin-off from MYT by Mark Ryber. But what really pushed them into global fame was partnering with DARPA in the early 2000s. DARPA wanted robots that could move like animals and humans, not just roll like machines. and Boston Dynamics delivered. Atlas DARPA funded designed but DARPA's influence goes deeper. LS3 the legged squad support system. This was DARPA's",
        "start": 708.959,
        "duration": 1747.1180000000013
    },
    {
        "text": "pushed them into global fame was partnering with DARPA in the early 2000s. DARPA wanted robots that could move like animals and humans, not just roll like machines. and Boston Dynamics delivered. Atlas DARPA funded designed but DARPA's influence goes deeper. LS3 the legged squad support system. This was DARPA's soldiers. Standing as tall as a horse, LS3 could carry 400 lb of gear, travel 20 m on a full tank, and follow soldiers through forests and deserts by voice or GPS command. Soldiers could tell it to follow them or send it to a GPS spot on a map, and it would find its way there automatically using cameras and sensors to avoid rocks, trees, and ditches. In videos, you can watch it trot along behind a human leader, keeping perfect balance even when pushed or walking over uneven ground. DARPA wanted LS3 to be tough enough for real missions. something that could travel up to 20 miles in a day, handle any kind of weather, and last for about a full day on a tank of fuel. The idea was to give soldiers a reliable mechanical teammate that could carry their supplies and follow them wherever they went. But LS3 itself had an ancestor, a robot that kickstarted the entire journey. Launched in 2005 with DARPA funding, Big Dog was built to help soldiers carry heavy gear through tough terrain. about the size of a small mule weighing around 110 kg. It could carry up to 150 kg of equipment. You could kick [music] it or push it and it would stumble but quickly regain balance. Almost like it had instincts. It could even climb steep slopes up to 35°, splash through water, or trot over ice without falling. Powering all this motion was a small gasoline engine running a set of hydraulic legs. Inside, it had sensors and computers that measured every step, how much force each foot pushed with, how tilted it was, and where the next solid spot on the ground would be. Big Dog's success paved the way for Boston Dynamics later creations. Its hydraulic muscles and sure-footed walking led to the stronger LS3, the speedy Wildcat, and eventually the smart and quiet spot. Love this kind of content where we explore all the robots a company is building? Hit subscribe. We've got plenty more coming. And let us know in the comments which robot family you want to see next. But the humanoid story actually starts earlier with Petman, the protection ensemble test mannequin developed in 2009 to simulate human physiology for testing protective military gear like chemical suits. Standing about 1.75 meters tall, weighing around 80 kilograms, [music] Petman could walk, squat, kneel, and perform calisthenics, mimicking human movements and physiological responses like sweating and temperature regulation. Powered by hydraulic actuators with 29 degrees of freedom, PTM was built to act as a human surrogate for environmental testing in hazardous conditions. It wasn't designed for autonomous tasks or complex",
        "start": 887.36,
        "duration": 2071.587000000001
    },
    {
        "text": "could walk, squat, kneel, and perform calisthenics, mimicking human movements and physiological responses like sweating and temperature regulation. Powered by hydraulic actuators with 29 degrees of freedom, PTM was built to act as a human surrogate for environmental testing in hazardous conditions. It wasn't designed for autonomous tasks or complex [music] test bed. a proof of concept and it became the foundation for Atlas. The same control systems, the same balance algorithms, the same understanding of bipeedal locomotion, all built on Petman's back. If Boston Dynamics could bring one older robot back with modern upgrades, Spot Classic, Big Dog, LS3, Cheetah, or Wildcat, which one should they revive? But Boston Dynamics doesn't just make robots that walk. They reinvent how robots move. The robot that surprised everyone. When it first appeared in 2017, people were amazed. Instead of the usual four-legged creatures or humanoid machines, Handle rolled around on two large wheels, balancing like a gymnast on rollerblades. It could speed across the floor at nearly 9 mph and even jump over obstacles almost 4 ft high. Standing about 2 m tall, handle was built for warehouse work. It could zip between rows, pick up heavy boxes with its long arm, and neatly stack them onto pallets, all without a human's help. Its gripper used suction power to lift each box smoothly, almost like it had a giant vacuum hand. What made handle special was its balance. As it bent, turned, or lifted, a counterwe at the back worked like a tail to keep it upright. It could roll fast, stop instantly, and turn tight corners without tipping over. Its cameras and sensors helped it see where boxes were placed and how to line them up perfectly. It was designed to build pallets with the same care as a human worker, only faster and with less space to move in. So, that's the journey. From military experiments funded by DARPA to commercial robots working in factories and disaster zones. From hydraulic beasts doing back flips to electric machines that think and adapt in real time. Boston Dynamics didn't just build robots. They built a legacy. They taught machines to run, climb, think, and move the way life has for millions of years, but with the precision of modern engineering. And we're just getting started.",
        "start": 1051.84,
        "duration": 2337.838000000002
    }
]