[
    {
        "text": " [Music] AI humanoid robots have just shocked the world again. From hotel cleaning champions mastering full service operations to dextrous hands handling delicate and heavy objects alike to nextgen robots breaking barriers in industry and education. The pace of innovation is nothing short of breathtaking. This week, we're uncovering the most jaw-dropping updates from Unixa, Pudu, Zyova, DAX Robotics, and more. Companies pushing humanoid robots from concept to reality faster than anyone expected. Let's jump straight in. Magic Lab's humanoid robot, Magicbot, is stepping out of the factory and into new spaces, proving just how versatile next generation humanoids can be. Once known for its industrial applications, Magicbot is now being deployed as a smart tour guide capable of walking with a human-like gate and using expressive body language to explain technology in museums and corporate halls. This makes interactions feel more natural and engaging for visitors. The robot goes beyond simple automation by offering multimodal interaction. It can hold voice conversations, recognize gestures, and even switch between multiple voices and languages, allowing it to adapt to diverse audiences seamlessly. But Magicbot isn't just about guiding visitors. It's also becoming a valuable tool for education and research. With its high degree of freedom body and open-source interfaces, the robot provides a powerful platform for embodied AI exploration, giving scientists and students the chance to push forward robotics innovation in real world contexts. By moving beyond industrial work and into commercial and educational settings, Magicbot highlights how humanoid robots are evolving from task-driven machines into intelligent interactive companions. This transition showcases Magic Lab's vision of blending cuttingedge engineering with practical human- centered applications. Dobbit Robotics is pushing the boundaries of humanoid robotics with a major leap in industrial applications. Their latest humanoid model is designed for cross scenario multitask generalization. A capability made possible by two key breakthroughs. Efficient humantoroot motion mapping and knowledged generative VLA technology. Together, these advances allow the robot to learn and adapt with a level of flexibility rarely seen in industrial automation. The robot is already proving its worth in demanding environments. It can handle precision assembly tasks with a repeatability of plus or minus 0.05 mm, ensuring high accuracy even under dynamic conditions. Built for resilience, it operates reliably in extreme heat. Functioning at temperatures exceeding 50° C. Beyond individual performance, this humanoid also shines in multi-root collaboration, enabling seamless teamwork across complex workflows. Another standout feature is its adaptive grasping ability. The robot can securely manipulate soft or irregularly shaped objects, making it well suited for scenarios that traditional machines struggle with. These strengths are already being put into practice in warehouse anomaly handling and quality inspection where flexibility and reliability are critical. Doot's innovation underscores how humanoid robots are moving from controlled lab demonstrations into realworld industrial ecosystems, driving efficiency and adaptability to new heights. At the very first World Humanoid Robot Games, a shocking upset unfolded when a brand new startup DAX Robotics secured a top three finish against industry giants. Founded",
        "start": 2.33,
        "duration": 454.5490000000001
    },
    {
        "text": "innovation underscores how humanoid robots are moving from controlled lab demonstrations into realworld industrial ecosystems, driving efficiency and adaptability to new heights. At the very first World Humanoid Robot Games, a shocking upset unfolded when a brand new startup DAX Robotics secured a top three finish against industry giants. Founded already established itself as the biggest dark horse in humanoid robotics, outpacing even billion-dollar competitor Galbat. The achievement comes from a mix of technical ingenuity and bold strategy. Dax's team, composed of seasoned veterans from leading tech firms, managed to design and build a worldclass humanoid robot in record time. Unlike many competitors, their robot tackled the difficult take basket and sort challenge, a realworld task that tested dexterity and intelligence. Remarkably, DAX was also the only team to operate fully offline, delivering smooth performance while others struggled with unstable network connections. Now, the company is setting its sights on commercialization. This September, DAX Robotics will launch the X7 humanoid robot at a price of just a few tens of thousands of yuan, around 1/if the cost of competitors. With over 1,000 pre-orders already secured, the X7 is designed for practical deployments in sectors likeies and retail. By focusing on scalable efficiency and affordability, DAX Robotics is positioning itself as a true disruptor in the humanoid space. At the IAA Xpang, founder Heao Pong unveiled an ambitious timeline that could reshape the humanoid robotics race. After 8 years of development and six generations of prototypes, Xpang now expects to launch its first truly mass-producible humanoid robot by 2026. He was candid about the challenges, stressing that building humanoids is even more complex than cars or flying cars. He described the process as a super integration of advanced hardware and cuttingedge AI software. A humanoid can have over 80 joints, he noted, and the failure of just one could render the entire machine unusable, highlighting the precision and reliability required to succeed. The upcoming Xpang robot is designed to operate autonomously without relying on an internet connection. and it will even be capable of conversing in German, reflecting the company's global ambitions. While he admitted that the first generation models won't be highly intelligent, he believes this is just the beginning. In his view, the robot era will accelerate rapidly in the coming decade with humanoids finding roles in business, industry, and eventually family life. By setting 2026 as the target, Xping is signaling its determination to compete at the highest level in humanoid robotics. Chinese startup ZOVA has officially unveiled the Flex 1, its first fully self-developed tendon-driven dextrous hand, and it's already drawing attention for its balance of lightweight design, precision, and humanlike control. Weighing just 380 g, the Flex 1 boasts an impressive 25° of freedom, including 20 active and five passive, allowing it to closely mimic the dexterity and fluidity of a human hand. At the heart of this breakthrough is a self-developed miniature electric cylinder, which powers a highly integrated tendon drive",
        "start": 229.44,
        "duration": 833.83
    },
    {
        "text": "just 380 g, the Flex 1 boasts an impressive 25° of freedom, including 20 active and five passive, allowing it to closely mimic the dexterity and fluidity of a human hand. At the heart of this breakthrough is a self-developed miniature electric cylinder, which powers a highly integrated tendon drive strong thrust while keeping the design compact and efficient. To further enhance performance, the Flex 1 is equipped with high precision joint and tactile sensors. Combined with multimodal data such as vision, the system can adapt intelligently during manipulation tasks, making it ideal for delicate operations. Beyond dexterity, the Flex 1 also excels in accuracy. With joint position control precision of 0.75°, it outperforms leading international products by around 25%. Perhaps most importantly, Zenova claims full stack ownership of the technology from structural design to algorithms, creating a closed loop system that supports scalable mass production. The Flex One marks a bold step toward making highly dextrous robotic hands practical, accessible, and commercially viable. Forier has just unveiled its latest humanoid robot, the GR3, positioning it as a versatile assistant built to integrate seamlessly into both work and everyday life. What sets the GR3 apart is its new full sensory interaction system, which combines vision, hearing, and touch to create more natural and responsive communication with humans. This multi-ensory integration gives the robot human-like reflexes and a communication logic that feels intuitive, making interactions smoother and more engaging. The GR3 is designed for versatility, capable of supporting tasks in daily living, interactive experiences, and even guidance roles in public or commercial settings. With its multimodal interaction system, it can understand and respond to people in multiple ways, whether through speech, gestures, or tactile cues, bridging the gap between human and machine collaboration. Reliability and safety are also central to its design. The GR3 comes with multiple layers of protection, ensuring stable and secure operation in dynamic realworld environments. Whether used as a personal assistant, a workplace collaborator, or a guide in service industries, Forier's GR3 aims to deliver consistent performance by combining advanced sensory technology with practical functionality. The GR3 is setting a new benchmark for humanoid robots as trusted companions in everyday life. X Square Robot has secured a nearly 1 billion yuan A+ funding round led by Alibaba Cloud in what marks its first ever investment in embodied AI. The raise will accelerate the company's full stack development strategy spanning everything from foundational AI models to advanced humanoid hardware. At the center of this push is the Quant X2 humanoid robot equipped with a high degree of freedom dextrous hand designed for complex manipulation tasks. On the AI side, Xqu has introduced the wall A series VLA model alongside an end-to-end chain of thought framework, enabling unified reasoning and structured task breakdown. This approach is aimed at helping humanoids move beyond simple commands to reliably executing multi-step operations in real world environments. In a significant step for the wider robotics community, the",
        "start": 420.4,
        "duration": 1231.9900000000002
    },
    {
        "text": "the wall A series VLA model alongside an end-to-end chain of thought framework, enabling unified reasoning and structured task breakdown. This approach is aimed at helping humanoids move beyond simple commands to reliably executing multi-step operations in real world environments. In a significant step for the wider robotics community, the foundational model, giving developers a powerful base to build new applications and accelerate embodied AI research. Founded just last year, X Square is already gaining traction with leading industrial and service clients, positioning itself as one of the fastest rising players in the humanoid space. With fresh capital, advanced models, and ambitious hardware, the company is quickly emerging as a serious contender in the global robotics race, Pudu has unveiled the Flashbot Arm, a next generation service robot that blends delivery functions with humanoid-like manipulation. Unlike traditional service robots that focus solely on mobility, the Flashbot arm comes equipped with dual 7 degree of freedom bionic arms and a highly precise 11 degree of freedom dextrous hand, giving it the ability to perform a wide range of tasks with both strength and delicacy. The robot relies on an advanced sensory and control system that integrates vision, tactile skin, and AIdriven force control. This allows it to adapt seamlessly to different objects, whether handling fragile food items or carrying heavier loads, while maintaining safety and precision. Its combination of multimodal interaction and task decomposition enables the Flashbot arm to demonstrate a level of human-like reasoning and execution that goes beyond simple automation. One of its most striking demonstrations is its ability to pour juice without spilling, even while a human twists its joint midtask. This level of stability and adaptability highlights its potential in dynamic, unpredictable environments such as hospitals, hotels, and restaurants. By merging delivery capability with dextrous humanoid skills, the Pudu Flashbot arm is pushing embodied intelligence into commercial spaces, setting a new standard for service robotics. Deep Robotics has officially begun mass delivery of its full lineup of robot dogs, marking a major milestone for the company and for Quadriped Robotics as a whole. What was once the domain of research labs and small-cale pilots is now rolling out on a much larger commercial scale with units being shipped in significant numbers to clients across multiple industries. The site of an entire fleet of DEP's robot dogs being delivered is nothing short of spectacular. These machines are built for versatility, capable of navigating complex terrain, performing inspection tasks, supporting logistics, and even collaborating with other robots in coordinated operations. With proven stability, strong payload capacity, and adaptive movement, they are designed to function reliably in both indoor and outdoor environments, from warehouses to construction sites. Mass delivery signals that Deep Robotics is moving beyond prototypes and demonstrations into true industrial adoption. By scaling production, the company is making its quadripeds more accessible to enterprises that need durable autonomous solutions for real world challenges. This moment captures the broader trend in robotics, where advanced platforms are no longer",
        "start": 622.32,
        "duration": 1595.270000000001
    },
    {
        "text": "signals that Deep Robotics is moving beyond prototypes and demonstrations into true industrial adoption. By scaling production, the company is making its quadripeds more accessible to enterprises that need durable autonomous solutions for real world challenges. This moment captures the broader trend in robotics, where advanced platforms are no longer being deployed at scale. For deep robotics, it's a powerful step into mainstream adoption. The UniXI humanoid robot, fresh off its victory at the World Robot Games with two golds and a silver, is already proving its realworld value. Its latest challenge takes it out of the competition arena and into a hotel environment where it's tasked with executing a full sequence of complex housekeeping operations. What makes this demonstration remarkable is the range and precision of its capabilities. The robot can clear a desk with careful organization, make a bed with meticulous attention to detail, and then move into the most challenging space, a cramped bathroom. There, it efficiently navigates tight corners to clean the toilet, wipe mirrors, and ensure every surface is spotless. Each action is carried out with a level of smoothness and accuracy that feels closer to skilled human service than traditional automation. This performance is powered by UniXAI's multimodal model, which enables it to recognize objects, optimize paths, and adaptively plan tasks in real time. By stringing together long, complex sequences without interruption, the robot showcases a leap forward in embodied AI. It's no surprise many are calling it the world champion of hotel cleaning services. Unix AAI is proving that humanoid robots can go beyond demos and deliver practical value in hospitality. The RAI Institute has unveiled a 23 kg wheeled robot that's redefining mobility in robotics. Built with a bike-like frame, this machine is not your standard ground robot. It's engineered for speed, agility, and acrobatics. What makes it stand out is its custom jumping mechanism, allowing it to leap onto tables, perform controlled hops, and even execute flips. That's right, flips. Something usually reserved for advanced-legged robots or human athletes. Behind these jaw-dropping abilities is reinforcement learning. The robot skills are first trained extensively in simulation where it can safely and efficiently practice thousands of trial and error attempts. Once the system masters balance, timing, and control in the virtual environment, those behaviors are transferred to the physical robot, enabling realworld execution with remarkable precision. This approach shows how reinforcement learning is accelerating the development of highly capable, adaptable robots. By combining simulationdriven training with a compact yet powerful design, RAI's creation pushes the boundaries of what wheeled robots can achieve. Instead of being limited to flat terrain, this robot demonstrates dynamic versatility, making it a potential gamecher for both research and practical applications in environments where speed and agility are critical. The Kepler K2 Bumblebee robot is taking a major step forward in intelligent training with a new demo showcasing its hierarchical VLA vision language action model combined with advanced semantic recognition. This approach allows the robot to not just",
        "start": 806.48,
        "duration": 1969.5090000000005
    },
    {
        "text": "and practical applications in environments where speed and agility are critical. The Kepler K2 Bumblebee robot is taking a major step forward in intelligent training with a new demo showcasing its hierarchical VLA vision language action model combined with advanced semantic recognition. This approach allows the robot to not just context, distinguishing objects, interpreting commands, and choosing the right actions with greater accuracy. What makes the Bumblebee especially impressive is how it blends real world data with large-scale simulation. By learning in both environments, the robot can evolve at an accelerated pace, building robust skills without the risks and limitations of purely physical training. This hybrid method is crucial for scaling humanoid and service robots toward reliability in unpredictable realworld scenarios. The latest training results show that the Bumblebee is quickly narrowing the gap between research prototypes and deployable machines. Its ability to connect perception, reasoning, and action makes it a strong candidate for commercial applications, from logistics to customer service. With each update, Kepler is showing how AIdriven robotics is moving beyond simple automation into adaptable, contextaware systems. The Bumblebee is more than a test bed. It's shaping up to be a versatile robot that could soon enter everyday use. Tesla has just stunned the world again, this time with Optimus. Fresh photos and videos of the humanoid robot have surfaced, and they're unlike anything we've seen before. One clip reveals Optimus gleaming in a striking golden suit, while another shows off a stealthy full black version on display at the brand new Tesla diner. Elon Musk has now confirmed the golden edition is officially Optimus 5 2.5, the next step in Tesla's rapid fire humanoid evolution. But here's the real bombshell. Musk says Optimus 53 is already on the way, calling it nothing less than sublime. That means we're about to see a robot that's faster, more capable, and more humanlike than anything Tesla has ever built. First, let's talk about the Golden Optimus. When images and footage of this robot first hit the internet, a lot of people thought it might just be a special display model, maybe something made for show at an event. But then Elon Musk himself confirmed it. This isn't just some decorative one-off. The golden version is officially Optimus 5 2.5, the latest iteration of Tesla's humanoid project. Now, the fact that Tesla is giving this version a specific number 2.5 tells us something important. It's not the full generational leap to V3, but it's also not just a minor cosmetic update. V2.5 suggests Tesla has made meaningful hardware and software upgrades over the V2 model, enough to distinguish it as a bridge between where Optimus was and where it's about to go. The Golden Suit is more than just a flashy paint job. Tesla doesn't do things like this for no reason. Musk and his team know exactly how symbolic this is. The gold finish screams confidence, progress, and maybe even a bit of showmanship. Tesla is signaling to the",
        "start": 995.839,
        "duration": 2329.1890000000017
    },
    {
        "text": "to go. The Golden Suit is more than just a flashy paint job. Tesla doesn't do things like this for no reason. Musk and his team know exactly how symbolic this is. The gold finish screams confidence, progress, and maybe even a bit of showmanship. Tesla is signaling to the story doesn't stop with the golden bot. At the brand new Tesla diner, fans spotted another striking version of Optimus. This time in a sleek all black design. And honestly, it looks like something straight out of a science fiction film. The black version is less flamboyant than the golden one, but it carries a futuristic, almost stealth mode aesthetic that matches Tesla's vision for a robot that's not just functional, but iconic. This matters because Tesla isn't only building Optimus to be useful. They're building it to be desirable. Just like Tesla cars are known for their design and presence, Optimus is being crafted to stand out as both a product and a symbol. The fact that they're already experimenting with different visual styles, golden, black, and presumably more to come, suggests that Tesla sees Optimus as something people will not only work alongside, but also proudly display in workplaces and maybe even homes in the future. That wraps up this week's AI robot update. And honestly, every week feels more like science fiction turning into reality. With robots evolving faster than ever, the line between human and machine is starting to blur. We'll be tracking every mind-blowing moment, so make sure you're following along. Trust me, you do not want to miss what's coming next. Thanks for watching, and we'll catch you in the next one.",
        "start": 1177.76,
        "duration": 2496.2280000000014
    }
]