[
    {
        "text": " Boston Dynamics showed the world what controlled agility looks like, and Unit's G1 proved how fast lowcost humanoids are catching up. But now, a new robot from China is stepping into a completely different category. Engine AI has finally revealed the T800, a much humanoid built with direct inspiration from the Terminator. Hey guys, Alfie here. Welcome to the AI Nexus. Today we're breaking down the T800, Engine AI's most anticipated humanoid yet. The first thing you notice about the T800 is the design. And [music] yes, the name is intentional. Engine AI borrowed it directly from the Terminator. Not for marketing hype, but because the fictional T800 represented a very specific idea, a humanoid machine with strong structure, balanced proportions, and movement that looked controlled instead of robotic. Engine AI isn't building a movie robot, but it is borrowing the philosophy. Aviation-grade aluminum gives it strength without unnecessary weight, and the proportions are close to an adult human for one reason. A humanoid built for agility needs the same geometry humans rely on. The inspiration is from the movies, but the execution is pure engineering, and the movement is where things really shift. Most humanoids still rely on bent knee walking to stay stable. It's the safest way to keep the center of mass controlled. The T800 doesn't do that. Engine AI aims for straighter leg walking, something humans do naturally, but robots usually avoid because it requires extremely fast, high precision adjustments. When the T800 walks, every microcorrection in the hips, knees, and ankles is calculated in real time. This makes the motion look far more natural than the typical robot shuffle. And that's just the baseline. The T800 can perform spinning transitions. Under the hood, the power system backs that movement with real force. Each motor delivers up to 450 new m of torque, which is significant for a humanoid of this size. That's enough to generate strong striking momentum or absorb direct impacts without collapsing. But torque at this level brings a natural engineering challenge. Heat. When a humanoid pushes this much force through its joints, temperatures rise quickly, and most robots deal with that by slowing down or taking short rest cycles. Engine AI didn't want those limitations. Instead of letting the motors cool off passively, the company built an active cooling system directly into the T800's leg joints. This prevents thermal throttling and keeps the torque output consistent even during highintensity motion. That's why the T800 can operate for up to 4 hours without a break. This cooling system works alongside a solid state lithium battery. Safer, more energy dense, and designed for long, demanding sessions where performance can't drop. So, the real question becomes, why build a humanoid with this level of mobility and force in the first place? Engine AI's answer is straightforward. Push the robot into environments where weaknesses show up fast. High-speed pivots, unpredictable movement patterns expose issues long before slow walking tests ever will. And this approach is what",
        "start": 4.319,
        "duration": 390.32
    },
    {
        "text": "becomes, why build a humanoid with this level of mobility and force in the first place? Engine AI's answer is straightforward. Push the robot into environments where weaknesses show up fast. High-speed pivots, unpredictable movement patterns expose issues long before slow walking tests ever will. And this approach is what interesting. On December 24th, Engine AI is putting the T800 into the world's first full-scale humanoid robot fighting competition, Ma King. These aren't toy robots or lightweight prototypes. Each T800 involved in the event weighs around 165 lb, roughly 75 kg, and performs full human-like movements in real [music] time. The matches won't be fully autonomous. Human operators guide the strategy while the robot handles the physical execution. Engine AI is even open- sourcing parts of the control software so teams can tune their robots for the tournament. The goal isn't spectacle, it's engineering. Stress exposes problems early, and solving those problems creates stronger, more reliable robots. The fictional T800 was shown as a machine built for pressure and impact. Engine AI is testing a realistic version of that idea safely, transparently, and with engineering goals in mind. Do you think the T800 could eventually challenge Boston Dynamics, or is it still too early to compare? Let us know in the comments. And here's the part most people miss. The T800 is not a sudden leap. Engine AI has been building toward this. The company started in October 2023 in Shenzhen under founder Xiao Tongyang and the pace since then has been unusually fast. The team about 36 experts from UC Berkeley, Tingua and other top programs, has raised over $42 million, including major investment from the Middle East. Their goal is to manufacture more than 1,000 robots a year by the end of 2025. And you can actually see that road map play out clearly in the machines they released before the T800. The first robot was the SA01 released in July 2024. It wasn't built for factories or heavy work. It was a teaching robot affordable at around $5,300 aimed at students, beginners, and research labs. It was Engine AI's way of entering the market quickly and gathering early realorld feedback. Then came the SE01 in October 2024. This robot stood 165 cm tall, weighed 48 kg, and became widely recognized after walking naturally on live TV during the Chinese New Year gala. With a waist capable of twisting 320° and advanced motion AI, enabling long, confident steps, the SE01 showed that engine AI could build a humanoid that didn't look rigid or robotic. The price was around $20,000 and the reaction was immediate. A Chinese humanoid robot finally demonstrating smooth humanlike gate in public. If you're enjoying the breakdown, make sure to hit subscribe. We cover every major move in humanoid robotics. The real jump arrived with the PM01 in December 2024. Shorter at 138 cm and 40 kg, [music] this robot added quick swap batteries, dual computing, Intel N97 plus Nvidia",
        "start": 199.599,
        "duration": 776.7979999999999
    },
    {
        "text": "in public. If you're enjoying the breakdown, make sure to hit subscribe. We cover every major move in humanoid robotics. The real jump arrived with the PM01 in December 2024. Shorter at 138 cm and 40 kg, [music] this robot added quick swap batteries, dual computing, Intel N97 plus Nvidia In February 2025, the PM01 performed the world's first robot front flip, a major sign that Engine AI's reinforcement learning process using Nvidia's Isaac Jim was producing results. And then the unexpected happened. Shenzen police began using the PM01 for patrols starting in February 2025. Wearing a high visibility vest and leed eyes, the robot walked alongside officers, spoke with citizens, assisted tourists, located lost children, and streamed live video back to command centers. [music] It wasn't fully autonomous. Engineers monitored every deployment, but it proved that Engine AI was building robots meant to leave the lab and handle real environments. Zooming out, all of this fits into a much bigger shift happening in China. The country is pushing humanoid robotics at a speed the rest of the world is trying to match. Humanoid robots were included in the official government work report, a sign of national level support. Multiple startups and research groups are developing humanoids in parallel. Analysts predict that China's embodied AI and humanoid market could reach $120 billion by 2030. Companies like Forier Intelligence, UBTEK, Xiaomi, Robot Era, and others are advancing rapidly. Engine AI isn't the biggest name yet, but it has one of the fastest development cycles and one of the clearest hardware strategies in the industry. If Engine AI keeps this pace, which robot do you think will improve faster? Unit's G1 or the T800? If you think AI robots are still far away, let me shake you for a second. Because by 2026, yeah, not 2035, not someday, robots will be inside your home, your workplace, your gym, even your kitchen, quietly handling tasks you don't even think about. And the craziest part, you won't even notice the moment they slip into your daily life. Let's start with something everyone deals with. Caring for older parents or grandparents. If you've ever watched an elderly family member struggle with simple things, standing up, walking safely, remembering pills, it hits you in a very real way and you can't be around them 24/7. That's where robots like the Forier GR3 come in. GR3 isn't some cold machine rolling around with beeping lights. It's slow, gentle, and built for small homes. It can recognize faces, talk in a calm voice, and help with light support, not lifting weights. Support things like reminding them about medication, checking if they got out of bed, noticing if something looks wrong. Think of it as a second pair of eyes that never gets tired. But here's the crazy part. Once families see how much stress it removes, elderly care robots won't feel futuristic anymore. they'll feel essential. And speaking of emotional support, loneliness is hitting people",
        "start": 394.639,
        "duration": 1132.5589999999995
    },
    {
        "text": "noticing if something looks wrong. Think of it as a second pair of eyes that never gets tired. But here's the crazy part. Once families see how much stress it removes, elderly care robots won't feel futuristic anymore. they'll feel essential. And speaking of emotional support, loneliness is hitting people robot that boxes or runs at 10 mph. Some people just want presence, someone who listens, looks at them, and responds naturally. That's where companionship robots like Xpang Iron and Elfer Schwan come in. Iron is built to feel physically comforting. The gestures are smooth, the movements look human, and the overall presence is warm, not cold. Jwan, on the other hand, is all about eyes and expressions. You talk to it, and it reacts with subtle facial micro movements almost the way a human does. These robots won't do your laundry. They won't cook. Their only mission is to sit with you, talk to you, and make your room feel less empty. And trust me, once you experience a full body AI companion holding eye contact with you, it hits way different than talking to a phone, it feels alive. Do you think Iron Robot could actually make someone feel less lonely, or is that going too far? Let us know in the comments. Now, let's shift to something way less emotional, but equally life-changing. Laundry, folding clothes, sorting clothes. The most boring loop humanity ever created. It never stops. It never gets easier. And honestly, it never needed a human brain in the first place. That's why Figure03 is such a gamecher. This robot can pick up clothes, understand shapes, fold them neatly, and stack them better than half of us do. Imagine walking into your room and finding a clean pile of clothes ready without lifting a finger. You'll think a fairy visited. Nope, just a robot deleting chores from your life one by one. And here's the wild twist. Laundry might become the first major home chore that humans completely give up. Not because robots are impressive, but because we're tired of doing the same thing every 3 days. Factories feel the same way. A shocking amount of factory work is just looking at objects and checking for defects. Tiny scratches, misprints, crooked labels. Human eyes get bored. Human attention drops. But Magicbot, it doesn't blink. It doesn't lose focus. It walks up to a station, picks up a product, rotates it under cameras, and instantly compares it to what a perfect version should look like. It's like having a super strict inspector that never gets tired and never misses a flaw. And that means humans can focus on fixing real problems instead of staring at items for 8 hours straight. But robots aren't just stuck inside factories. They're stepping [music] into stores and warehouses, too. Agility's Digit is probably the most working robot you'll see in 2026. Digit walks like a human, fits in human aisles, carries totes, restocks shelves,",
        "start": 576.959,
        "duration": 1458.3190000000006
    },
    {
        "text": "problems instead of staring at items for 8 hours straight. But robots aren't just stuck inside factories. They're stepping [music] into stores and warehouses, too. Agility's Digit is probably the most working robot you'll see in 2026. Digit walks like a human, fits in human aisles, carries totes, restocks shelves, inventory checks. Imagine walking into a store one day and seeing a humanoid robot silently moving a stack of items, scanning each one as it goes. You'd stare for 5 seconds, and then get used to it. That's exactly how fast this shift will happen. and wait until you see reception robots. Figure 03 isn't only folding laundry. It can literally stand at a front desk, greet visitors, [music] recognize familiar faces, and point people in the right direction. It can hand over access cards, take a package, or answer the same question a 100 times without losing patience. And honestly, routine front desk work is perfect for robots. They handle the repetitive stuff and humans step in when emotions or complex problems show up. It's the perfect tag team. Would you feel weird being greeted by a humanoid receptionist? [music] Or would you get used to it fast? Drop your thoughts. I'm reading every word. Now, the next category is wild because it turns every robot with a camera into a basic security guard. Face recognition plus mobility equals instant watchman. Robots can identify known faces, spot strangers, and notify humans faster than a person staring at a wall of CCTV screens. No chasing criminals, no wrestling people, just scanning, alerting, and logging. In a building with a few robots roaming around, no one slips in unnoticed. The future of security is literally wheels and legs carrying cameras. Let me flip this to something way more fun. Content creators and athletes are going to love this. A robot cameraman. No tripod. No asking your friend to hold the phone steady. A humanoid robot can track your body, circle around you, zoom in, and follow your form as you lift weights, do yoga, or shoot a basketball. Imagine filming your workout in perfect smooth motion while you focus on training. This alone will boost millions of creators because the shots will finally look cinematic without hiring a crew. And here's the crazy part. Robots don't get shaky hands. Speaking of daily routines, let's talk coffee. A robot making your morning coffee will feel like having a personal barista on autopilot. Physical intelligence style robots can grab your mug, place the capsule, press the buttons, and even pour milk with delicate precision. Xpang Iron has already shown this on stage. Smooth arm, soft hands, perfect timing. The robot doesn't just pick up a cup. It completes the full multi-step routine. And once you let a robot handle your morning prep for a week, you'll never want to go back. All right, quick little pause. If you're enjoying this breakdown, make sure to subscribe to AI Nexus so you",
        "start": 743.12,
        "duration": 1797.2780000000007
    },
    {
        "text": "doesn't just pick up a cup. It completes the full multi-step routine. And once you let a robot handle your morning prep for a week, you'll never want to go back. All right, quick little pause. If you're enjoying this breakdown, make sure to subscribe to AI Nexus so you back to the video. But coffee is nothing compared to cooking full meals. That's why the Moly or Mully kitchen robot is so mindblowing. This thing literally copies a professional chef's movements. It stands over a smart stove, grabs ingredients, stirs, flips, picks things [music] up, and plates dishes with accuracy that seems unreal until you see it. It's like having Gordon Ramsay's ghost arms inside your kitchen. And you might think this is too futuristic, but it already exists. So imagine what 2026 versions will be like. Now, let's jump to the serious stuff. Jobs where humans probably shouldn't be at all. Hazardous zones, radioactive leaks, chemical spills. You don't send a person in there unless you have no other option. Packbot is one of the robots already doing this. It goes in first with cameras and sensors, collecting info while humans stay at a safe distance. If something explodes or collapses, the robot takes the hit, not the person. This category will explode in the coming years because the logic is so simple. If it's dangerous, send a robot. And from danger, we move to saving lives, search and rescue. Robots like Spot, Alieno, and go too can climb over debris, walk through unstable structures, enter tight spaces, and carry thermal cameras to find survivors. They don't replace human rescuers. They expand their reach. Think of them as scouts that go into places too risky for firefighters and find the exact locations where humans are needed. In a disaster, information is the difference between life and death. Robots make that information instant. Then we have traffic management and basic police support. Forier's robots have already been used to direct traffic at real intersections. They wave cars through, signal when to stop, and help control messy situations. Companies like Engine AI are building robots that can patrol areas, record what they see, and guide people. Nothing confrontational, just assistance. Robots take over the repetitive stuff while human officers handle real human problems. Now, here's a weird one, but totally real. Dog training. Devices like Companion already use AI to watch dogs, talk to them, and give treats when they behave correctly. Imagine that same intelligence placed inside a small mobile robot. It can follow your dog around the house, practice commands, and keep them mentally active while you're at work. Dog owners are going to love this because training takes patience, and robots have infinite patience. And the final one might shock you. Creativity. For years, everyone said robots can't be creative. But robots like a mecha chat, write poems, sketch ideas, brainstorm stories, and even perform on camera with human-like expressions. They're not replacing creators. They're becoming creative",
        "start": 914.639,
        "duration": 2156.8779999999992
    },
    {
        "text": "takes patience, and robots have infinite patience. And the final one might shock you. Creativity. For years, everyone said robots can't be creative. But robots like a mecha chat, write poems, sketch ideas, brainstorm stories, and even perform on camera with human-like expressions. They're not replacing creators. They're becoming creative ideas, adds its own, and helps you build something new. It makes the process feel less lonely and way more fun. [music] So, here's the bottom line. Robots aren't coming. They're already here. They're slipping into tasks we forget even take time. Laundry, security, cooking, filming, talking, helping, checking, supporting. And the people who understand this shift early [music] will be the ones who benefit from",
        "start": 1097.52,
        "duration": 2208.7989999999986
    }
]