[
    {
        "text": " Japan shocked the world again with its futuristic technology. At this point, it feels like the country is already living in 2050. Japan has unveiled a robot that plays basketball. But that's not all. Japan also built a walking chair designed to help elderly people. And while many countries are using robots to replace workers, Japan has found a hidden method, using robots to give jobs to people with severe physical disabilities. And it all starts with a robot making a basketball shot that looks ordinary until you realize what's really happening. Toyota developed CUE, an AI powered basketball robot created to study precision, repetition, and learning through motion. This is the same robot that set a Guinness World Record by making over 2,000 consecutive free [music] throws. A level of consistency no human player could physically sustain. When CU steps [music] up to the free throw line, the process begins instantly. Cameras and sensors track the hoop, measure distance, and determine the robot's exact position. Inside the system, software calculates force, launch angle, and release timing to keep every shot controlled and repeatable. Once the ball is released, the analysis continues. If the shot goes in, CUI records what worked. If the shot misses, the robot studies the error and adjusts the next attempt almost immediately. Every shot becomes data and every outcome improves accuracy. Sui does not experience fatigue or loss of focus. When conditions change, the robot recalculates calmly and continues. It also does not copy human shooting form, developing its own motion based purely on reliability. This is not about basketball skill. It is a demonstration of how robots learn space, timing, and precision at scale. Watching a robot hit thousands of perfect shots feels unreal. It shows how far machines have come. But the next robot Japan built tells a very different story. Let's talk about Japan's robot cafe. At first, it looks like robots are working inside a cafe, serving drinks and greeting customers. But these are not normal robots. Every robot you see is being controlled by a real person. At the Dawn Robot Cafe, robots move through the cafe, take orders, and interact with guests. But the real presence is not the robot standing in front of you. It is the human behind the screen. Each robot is operated remotely by a person with severe physical disabilities, including individuals who are better than and unable to leave their homes. Through cameras, microphones, and live controls, operators see the cafe, hear customers, and respond instantly. When a robot speaks, it is not an automated voice. It is a real human speaking in real time. This matters deeply in Japan. The country has a strong work culture and aging population and growing loneliness among elderly and disabled citizens. Many people want to work and connect with others but cannot perform physical labor. The Dawn Robot Cafe gives them employment, purpose, and daily human interaction without physical strength. Here, robots handle movement. Humans",
        "start": 4.4,
        "duration": 405.4399999999999
    },
    {
        "text": "has a strong work culture and aging population and growing loneliness among elderly and disabled citizens. Many people want to work and connect with others but cannot perform physical labor. The Dawn Robot Cafe gives them employment, purpose, and daily human interaction without physical strength. Here, robots handle movement. Humans decision-making. Instead of robots taking jobs away, this cafe shows how robots and people can support each other, restoring dignity, not replacing it, the robot cafe shows how technology helps people with disabilities work in normal public spaces. The next solution helps them move through those spaces using a walking chair. The Toyota walking chair was created to address that gap. Developed by Toyota through its future mobility and assistive technology research, the chair is designed to move at walking speed rather than racing through streets. The user remains seated upright, staying at eye level with people around them. This small design choice allows conversations, eye contact, and social interaction to feel natural instead of [music] distant. The chair is intended for elderly users and people with mobility challenges. It does not replace walking completely. It extends it, making short trips, errands, and everyday public spaces accessible again without drawing attention. The design also reflects Japanese culture because many homes and public spaces involve floor level seating. The chair can lower itself close to the ground, allowing users to sit comfortably without standing. [music] The walking chair moves quietly, blends into sidewalks, and does not disrupt pedestrian flow. It is still a prototype, not yet commercially available, but it shows how Japan approaches mobility, slow, human scaled, and designed around everyday life rather than speed. [music] Would you use something like this if it helped you stay independent? Comment your view below. Japan is building everything from basketball playing robots to walking chairs. The next AI robot focuses on something different, helping people deal with loneliness. Erica is a conversational robot created to study natural human dialogue. Erica was developed by roboticist [music] Hiroshi Ishigurro at Osaka University. As part of long-term research into human robot communication, instead of focusing on appearance alone, Erica is designed around behavior. The robot maintains eye contact, listens without interrupting, nods during conversation, and times responses carefully. Small pauses, blinking, and subtle facial movements help interactions feel calm and attentive rather than scripted. That research extends into the Geminoid series. Robots built to closely resemble real humans. One of the most well-known examples, Geminoid, is a near exact physical replica of Ishigurro himself. Its purpose is comparison, helping researchers study how appearance alone influences comfort, trust, and unease. Erica, however, represents a different direction. Rather than pushing realism to its limits, Erica focuses on communication quality. The robot is used in interviews, guided conversations, and public speaking experiments to understand how tone, timing, and listening behavior affect interaction. Researchers study whether people open up more, speak longer, or feel more at ease when a robot behaves patiently and respectfully. Together, Erica and",
        "start": 206.8,
        "duration": 805.44
    },
    {
        "text": "focuses on communication quality. The robot is used in interviews, guided conversations, and public speaking experiments to understand how tone, timing, and listening behavior affect interaction. Researchers study whether people open up more, speak longer, or feel more at ease when a robot behaves patiently and respectfully. Together, Erica and to social robotics, testing behavior first, appearance second, and always measuring how humans respond before robots move into everyday life. Okay, a realistic robot, a walking chair. This shows how far Japan is willing to go, and the next robot will blow your mind. Japan is a country shaped by mountains, earthquakes, and narrow infrastructure. Not every environment is flat, stable, or designed for wheels. To move through those conditions, Kawasaki developed Corly, a four-legged robot built for balance rather than speed. Instead of forcing the ground to cooperate, Corio adapts itself to whatever terrain lies underneath. Each leg operates independently. When the ground slopes, shifts, or sinks slightly, the robot redistributes its weight smoothly to remain stable. Movement stays controlled and deliberate even on loose soil, steps or uneven surfaces. This makes Corio suitable for places where falling could be dangerous. In Japan, this matters for disaster response, infrastructure inspection, [music] and work in remote or damaged areas where humans face higher risk. Earthquakes, landslides, and aging structures often create environments that are difficult to access safely. Kawasaki's long experience in heavy machinery is visible in the design. The focus is traction, balance, and reliability, not appearance. Corio does not try to look human or friendly. [music] It is designed to move correctly under pressure. Like many Japanese robotics [music] projects, Corio reflects a careful philosophy. Technology is not built to rush ahead of people, but to support them, especially where conditions are hardest and [music] mistakes are costly. The level Japan has reached is insane. Robots like Corio can help people move across mountains and uneven terrain, but this goes far beyond robotics. But Japan is also pushing limits in how we experience reality. You may have seen massive LED screens before, but when a display creates depth without glasses, headsets, or special equipment, the experience changes completely. Japan has pushed this idea into public view through naked eye 3D displays, screens designed to show realistic depth using only human vision. By sending slightly different images to each eye, the brain naturally converts flat visuals into three-dimensional forms without the viewer needing to do anything at all. In busy districts like Shinjuku, this technology appears in the middle of everyday [music] life. Pedestrians walking through crowded streets suddenly look up and notice something that feels out of place. A giant 3D cat stretches across a buildingized screen, blinks slowly, and looks down toward the street. Some people smile, others pause. A few even step back before logic catches up. The reaction happens because the image does not feel trapped inside a screen. It feels present. There is nothing to learn and nothing to wear. The brain processes",
        "start": 409.28,
        "duration": 1191.3589999999995
    },
    {
        "text": "blinks slowly, and looks down toward the street. Some people smile, others pause. A few even step back before logic catches up. The reaction happens because the image does not feel trapped inside a screen. It feels present. There is nothing to learn and nothing to wear. The brain processes the real world. That realism is exactly why major brands adopted the technology. Companies like Nike and Puma use naked eye 3D billboards to create ads that stop people instantly [music] and spread online without explanation. Do you think public spaces should surprise us like this or stay predictable? Comment your thoughts. By placing these displays directly into busy Japanese city spaces, digital visuals blend naturally into the physical world. turning ordinary streets into shared moments of surprise. Okay, enough with the naked eye 3D display. In Japan's major cities, sleep often has to fit between long work days and crowded commutes. With intense [music] work culture and limited personal space, rest is not always a choice. It is something people have to manage carefully. To address this, Japan developed smart capsule hotels. Compact sleep spaces designed for reliable recovery in the middle of fastmoving city life. These hotels are built for workers, travelers, and commuters who need proper rest without stepping away from their daily routines. Most capsule hotels are located near metro stations, major railway hubs, and bullet train terminals, making them easy to access late at night or early in the morning. Hotels like 9 hours focus entirely on sleep quality, removing distractions and unnecessary features. The concept is simple. Arrive, sleep properly, and leave refreshed. More modern capsule hotels such as the millennials quietly integrate sleep technology. Lighting fades gradually instead of switching off suddenly, allowing the body to slow down naturally. Temperature stays balanced throughout the night, adjusting subtly as sleep deepens, while sound is carefully dampened to create calm without complete silence. Some capsules even provide basic sleep summaries in the morning. [music] The goal is not luxury. It is recovery. In a country where work often takes priority, Japan treats rest as something that must be dependable, not accidental. In Japan, robots are not only built for factories. They are being developed for places where work is unpredictable and mistakes can be dangerous. Construction sites are one of those places. Uneven ground, heavy materials, narrow [music] spaces, and constant changes make them difficult for traditional robots to operate in. This is where HRP 5P comes in. HRP 5P was developed by ASD to work in real construction environments rather than controlled factory floors. The robot is designed to observe its surroundings continuously, estimate the weight and balance of objects and adjust its grip and posture in real time. If something shifts or does not behave as expected, HRP 5P recalculates instead of stopping. This matters in Japan where construction work is physically demanding and labor shortages are growing. Many tasks require strength, balance, and precision, often under risky conditions. [music]",
        "start": 605.2,
        "duration": 1587.1199999999983
    },
    {
        "text": "adjust its grip and posture in real time. If something shifts or does not behave as expected, HRP 5P recalculates instead of stopping. This matters in Japan where construction work is physically demanding and labor shortages are growing. Many tasks require strength, balance, and precision, often under risky conditions. [music] work, reducing strain and danger for human workers. The idea is not to remove people from the job site. Robots handle physically exhausting tasks while humans focus on supervision, planning, and decisions that require judgment. HRP 5P reflects Japan's practical approach to robotics. Using machines where conditions are hardest, not where work is easiest. Japan feels like it's already living in 2050. From a basketball robot that broke a world record to robots creating jobs instead of taking them away. And this is just the beginning.",
        "start": 804.48,
        "duration": 1661.1209999999985
    }
]