[
    {
        "text": " [Music] CES 2026 just shocked the entire world with tech we thought was decades away. From ASUS reinventing the laptop with dual stacked screens to John Deere bringing massive self-driving AI to the farm and Razer putting a holographic AI companion right on your desk. Even Tensor is showing off a car built entirely around a robot brain. Hey guys, Alfie here. Welcome to the AI Nexus. Let's dive into the future. Asus opens the day by redefining what a laptop is even supposed to be. The ROG Zephorus Duo doesn't aim to look familiar, and that's intentional. Instead of one display, two full-size OLED screens sit stacked, turning the device into a portable command center rather than a traditional laptop. One screen handles the main task while the other manages everything around it. Editing tools, timelines, chats, controls, or reference material. The keyboard detaches and snaps back magnetically. Power comes from modern Intel processors and high-end graphics. But performance isn't the headline. Flexibility is. This laptop is made for people who need to do five things at once. Even though it's a bit thicker than a normal laptop, it stays cool and has a port for every cable you own. As ASUS didn't make this to look like every other computer, they built it to show that you can take a full two-screen setup anywhere you go. John Deere completely stole the spotlight at CES 2026. You might expect to see new phones or gaming laptops at CES, but John Deere proved that a massive autonomous tractor is actually the most high-tech gadget on the floor. They aren't just showing off big machines. They are showing off intelligent systems. These tractors and harvesters drive themselves using smart cameras to see the field and AI brains to make decisions every second. Instead of a farmer having to sit in a cab for 12 hours straight, these machines handle the exhausting work without ever getting tired. Even in remote fields, these machines stay connected to the internet. This allows them to talk to each other, share data, and even fix their own problems before they happen. It's like having a team of robots that learns how to do a better job with every single pass. While John Deere is automating the farm, Razer is bringing AI directly to your desk. They just revealed Project Ava, and it looks like something straight out of a sci-fi movie. Instead of being just another app on your screen, Project Ava lives inside a sleek, glowing glass cylinder. Inside that tube, a 5-in holographic character floats in the air, moving and reacting like a real person. It's equipped with high-tech cameras and microphones, so it can actually see and hear you in real time. Ava isn't just there to look cool, though. It understands the vibe of your room. During demos at CES, Ava didn't just answer questions. It helped gamers pick the best settings for their gear",
        "start": 2.35,
        "duration": 381.56899999999996
    },
    {
        "text": "with high-tech cameras and microphones, so it can actually see and hear you in real time. Ava isn't just there to look cool, though. It understands the vibe of your room. During demos at CES, Ava didn't just answer questions. It helped gamers pick the best settings for their gear what to wear or what to eat for dinner. The best part, privacy is builtin. With physical switches to cut the camera and mic, you're always in control. Razer isn't trying to take over your space. They're just making AI feel more like a real life companion. Now, the conversation moves to one of the most common daily struggles, cooking. After long days, standing at a stove, tracking steps, watching heat, and constantly stirring is often what pushes people toward takeout or frozen meals. That's where NSH comes in. Think of NSH as a robot chef that lives on your kitchen counter. It's a smart machine designed to take over the hardest parts of cooking. The process is simple. You load your chopped ingredients into trays, pick a recipe, and walk away. Inside, AI cameras and sensors monitor the heat and timing while the robot handles all the stirring. It's constantly making adjustments so your food never burns and always tastes fresh. At CES 2026, Ford proved they aren't interested in flashy hype. Instead of promising magic self-driving cars immediately, they unveiled a realistic road map for eyes off driving by 2028. The secret is their new vehicle brain, a powerful computer they built inhouse to control everything from AI to sensors. by designing their own software and hardware. Ford has tighter control over how their cars see and think. This isn't a science experiment. It's a shift to making vehicles that truly understand their environment. Ford is turning your car from a simple machine into a smart partner you can trust. Transportation takes a sharper turn with Tensor's Robocar. This is not an electric vehicle with autonomy added later. It is built around AI from the ground up. Massive onboard compute power allows the robot to process camera, radar, and LAR data simultaneously. Steering, braking, perception, and charging are all controlled by intelligent systems with layered redundancy. The vehicle can even charge itself autonomously, removing another human task. This electric vehicle is designed for private ownership and commercial deployment at the same time. But what if the robot wasn't a car or a tractor, but something you actually wore? At CES 2026, Asenti showed that the future of fitness isn't just about better shoes. It's about wearable power. Their new H1 Pro is a modular exoskeleton, which is basically a smart suit that you wear to give your muscles a boost. What makes it cool is that it's like Lego for your legs. You wear a main power belt and then snap on different parts depending on your day. If you're hiking a steep hill, you snap on the hip module to make climbing feel",
        "start": 192.959,
        "duration": 728.768
    },
    {
        "text": "to give your muscles a boost. What makes it cool is that it's like Lego for your legs. You wear a main power belt and then snap on different parts depending on your day. If you're hiking a steep hill, you snap on the hip module to make climbing feel backpack or have sore joints, you switch to the knee module to absorb the impact and protect your legs. Deffy pushes that idea further down to the feet. Walking may look simple, but it requires constant muscle engagement and balance. Deffy's robotic sneakers add powered assistance with every step, adjusting automatically based on gate and effort. At lower settings, movement feels lighter and easier. At higher levels, users feel a noticeable boost in speed and power. What begins as mobility support quickly enters performance territory. Early testing already shows improved endurance and faster walking speeds. Dey isn't replacing muscles, it's extending them. This technology targets confidence, mobility, and eventually athletic enhancement. Personal mobility takes a more human- centered form with the Strut Evan. Instead of feeling like a medical device, this EV1 feels like independence. Sensors, AI navigation, and assisted driving work together to reduce collision anxiety and expand movement. The EV1 follows, guides, and adapts to its user. slopes, uneven ground, and tight spaces become manageable. The system breaks down into portable components, making transport easier. Mobility shifts from limitation to confidence. ULS Robotics debuted the Vatrix at CES 2026 to prove that powers suits aren't just for movies. It's a lightweight exoskeleton, only about 6 lb, that learns your specific walking style. Instead of feeling like a stiff machine, it uses a floating hip joint that lets you do deep squats or long strides naturally. It's designed for hikers and travelers, giving you a 15-m power boost, so you can explore farther without your legs getting tired. Wheel Move arrived at CES with a simple but life-changing attachment for manual wheelchairs. In just a few seconds, this 20 lb motor snaps onto the front of a standard chair and lifts the small front wheels off the ground. It instantly turns a manual chair into an electric one that can handle grass, gravel, and hills. It doesn't replace the chair you already own. It just gives you the freedom to go where standard wheels usually get stuck. To close out the show, the big three of home tech reminded us that the screens and sounds we use everyday still matter. Dell went unapologetically big at CES by launching the Ultrasharp 52. It is the world's first 52in curved 6K monitor. Instead of having three different monitors with messy cables everywhere, this one screen replaces them all. It's a Thunderbolt hub, meaning you can plug four different computers into it at once and control them all with a single mouse and keyboard. It turns a cluttered desk into a seamless high-tech workstation. Highense used CES 2026 to show off their new RGB mini LED EVO technology. While",
        "start": 369.12,
        "duration": 1108.6900000000003
    },
    {
        "text": "It's a Thunderbolt hub, meaning you can plug four different computers into it at once and control them all with a single mouse and keyboard. It turns a cluttered desk into a seamless high-tech workstation. Highense used CES 2026 to show off their new RGB mini LED EVO technology. While brighter, Highense focused on true-to-life color by adding a fourth color, cyan, to their LED screens. They can show details and gradients that other TVs miss. Their new AI engine adjusts the picture in real time, making movies and sports look exactly how the directors intended, no matter how bright your room is. Clipch closed the loop on the show by returning to the headphone world with the Atlas HP1. These wireless headphones look like classic high-end speakers with what finishes, but they are packed with modern tech. They feature powerful noise cancellation that can block out a crowded convention center, plus new coaxial drivers for studio quality sound. They prioritize comfort and materials, proving that great audio should feel as good as it sounds. CES 2026 proves one thing clearly. Robots are no longer experiments. Robots are tools, companions, vehicles, and infrastructure. And this shift is accelerating fast. Forget everything you knew. CES 2026 just proved the robot revolution is officially here. Robotics unveiled a humanoid so lifelike it actually solves the uncanny valley. Engine AI's T800 proved that robots can now jump and sprint like pro athletes. Tombot introduced Jenny, the robotic pup designed for pure emotional comfort. From rollable laptops to AI powered sneaker cleaners and L'Oreal AI face masks, it was a wild show. Hey guys, Alfie here. Welcome to the AI Nexus. Let's get into it. Realics introduced Davidbot, a male humanoid designed to push realism far beyond previous demos. Davidbot uses advanced facial animation systems that sync speech with micro expressions. When the robot smiles, muscles around the eyes react naturally. When it pauses, the face settles instead of freezing. This solves one of robotics's biggest problems, the uncanny valley. Built on the Ask Arya platform, the system adjusts tone and expression based on detected emotion. It is positioned for entertainment, hospitality, and customer-f facing roles. The result feels less like a machine responding and more like a presence reacting in real time. If realism was one extreme, raw physical ability was the other. Engine AI showcased two humanoids that focus entirely on motion and strength. The PM01 is a lightweight embodied agent designed for realworld environments like malls, stations, and guided tours. Movement is smooth, controlled, and practical. Then comes the T800. This full scale humanoid delivers up to 450 Newton meter of torque per joint and 14,000 watts of instantaneous power. That level of force allows sprinting, jumping, and combat style movement. Instead of slow mechanical steps, the T800 moves like a trained athlete. This shift marks a move away from stage concepts and toward robots built for factories, emergency response, and physical labor. Not every robot at CES",
        "start": 561.44,
        "duration": 1509.1690000000003
    },
    {
        "text": "instantaneous power. That level of force allows sprinting, jumping, and combat style movement. Instead of slow mechanical steps, the T800 moves like a trained athlete. This shift marks a move away from stage concepts and toward robots built for factories, emergency response, and physical labor. Not every robot at CES designed for comfort. Tombot presented Jenny, a robotic companion created for seniors with dementia and individuals dealing with anxiety. Jenny uses nine servo motors to control subtle movements, ears, head tilt, eyebrows, and tail. The design was developed with Jim Henson's Creature Shop, giving it lifelike motion instead of rigid animation. Capacitive touch sensors allow the robot to respond when petted or held when interaction stops. Jenny reacts with gentle movement to re-engage. Priced around $1,500, it replaces neither therapy nor care, but offers emotional presence for people unable to maintain a real pet. Displays took a major leap forward with Lenovo's ThinkPad Rollable XD. At first glance, it looks like a standard 13.3 inch laptop. Then the screen expands upward into a full 16 inch vertical workspace. The rollable panel is powered by dual motors and steel cable support to keep the display flat and rigid. Unlike earlier concepts, there's no warping or distortion. Part of the screen wraps around the exterior when closed, enabling a world-facing display for notifications or schedules. This design removes the need for external monitors while keeping the device travel friendly. It's a practical evolution of foldables focused on productivity rather than spectacle. CES always delivers unexpected products. One of the most talked about was the Brolon Clear X, an AI powered shoe cleaning system. Shoes are scanned internally to identify material types like leather, suede or mesh. Based on that data, the system selects a cleaning and drying cycle automatically. The core technology uses micro nano bubbles which penetrate fabric without soaking it. This removes dirt while preserving structure and glue. With an estimated price between $500 and $800, it targets collectors rather than casual users. for sneaker preservation. It may solve a problem most didn't know could be automated. Behind many of these machines is one key player, Qualcomm at CES. The company unveiled the Dragon Wing IQ10 chip built specifically for physical AI systems. The chip features an 18 core Orion CPU and delivers 700 tops of AI performance. That's more than 10 times the power of most AI laptops. It supports up to 20 simultaneous camera inputs, allowing robots to see, reason, and act in real time. Qualcomm pairs this with a visual language action model, meaning robots understand what objects are and how they should be handled. This architecture is designed to move robotics out of labs and into everyday environments. Personal flight returned in a serious way with the air EV. Unlike air taxi concepts, this electric vertical takeoff and landing is designed for private ownership. The aircraft uses a flybywire system where onboard computers manage stability while the pilot controls direction. It reaches speeds of 155 mph",
        "start": 763.519,
        "duration": 1914.2890000000014
    },
    {
        "text": "everyday environments. Personal flight returned in a serious way with the air EV. Unlike air taxi concepts, this electric vertical takeoff and landing is designed for private ownership. The aircraft uses a flybywire system where onboard computers manage stability while the pilot controls direction. It reaches speeds of 155 mph version, Blade geometry was redesigned to reduce noise, one of the biggest barriers to personal aircraft adoption. Instead of futuristic visuals, Air1 focuses on usability and garage scale storage. It positions personal flight as a lifestyle tool, not a science experiment. If Air1 is a flying car, the RTOR X4 is closer to a flying dirt bike built for solo pilots. It uses a multi-rotor design with an open field of view. The standout feature is autonomous obstacle avoidance. Using LAR and ultrasonic sensors, the system detects trees, cables, and terrain in real time. Takeoff and landing are fully AI assisted, lowering the barrier for new pilots. Battery density improvements pushed flight time to 30 minutes, a notable jump from earlier versions. The X4 represents a shift from proving flight is possible to proving it can be safe and accessible. Minimalism took an extreme form with the HP Elite Board G1A. There is no separate PC. The keyboard is the computer. Inside its 0.7 in chassis sits an AMD Ryzen AI 300 series processor, cooling system, speakers, and microphones. It qualifies as a co-pilot plus PC with a dedicated NPU for AI workloads. Weighing under 1.5 pounds, it connects to any display via USBC. The internal design is modular, allowing RAM and storage upgrades. This concept brings back the spirit of early home computers, updated for cloud workflows and AIdriven productivity. Wearables also received a major AI upgrade. Lenovo previewed Caira, lightweight AI powered glasses weighing just 45 gram. The system delivers near instant live translation and contextual summaries of missed notifications, all without heavy hardware. For younger users, the Luca AI cube targets Gen Alpha. The cube uses multimodal AI to identify objects and explain them through stories and facts. Instead of screenbased interaction, it encourages realworld exploration. These devices show AI moving away from apps and toward ambient everyday assistance. Beauty technology took a scientific turn with L'Oreal's LED face mask prototype. The flexible silicone mask uses 630 nm red light and 830 nm near infrared light wavelengths known to support collagen production and skin repair. An integrated microcircuit controls exposure time and intensity to prevent overuse. Unlike rigid masks, this design conforms to facial contours for even treatment. Set for a 2027 launch, it represents skincare moving into regulated datadriven wellness rather than cosmetic experimentation. Displays reached another milestone with the Samsung Z trifold. Fully unfolded, it becomes a 10in tablet-sized screen. Despite the size, the device is just 12.9 mm thick when folded. A dual hinge system allows three apps to run side by side with no performance drop. Powered by the Snapdragon 8 Elite and paired with a 200MP camera, the device focuses",
        "start": 967.92,
        "duration": 2340.689
    },
    {
        "text": "unfolded, it becomes a 10in tablet-sized screen. Despite the size, the device is just 12.9 mm thick when folded. A dual hinge system allows three apps to run side by side with no performance drop. Powered by the Snapdragon 8 Elite and paired with a 200MP camera, the device focuses This design shows foldables maturing into serious computing tools instead of experimental form factors. The show closed on a softer note with Echovac Lilo, an emotional companion robot designed like a small animatronic dog. Lil Milo uses facial recognition and voice detection to interact naturally. Its charging station is shaped like a dog bed. When battery runs low, the robot crawls in and sleeps while charging wirelessly. This design avoids mechanical reminders of power and maintenance. Liil Milo highlights a growing trend at CES. Robots not just as tools, but as quiet emotional fixtures in everyday spaces.",
        "start": 1184.96,
        "duration": 2431.8899999999994
    }
]