[
    {
        "text": " Figure just did something massive that has the entire tech world losing its mind. They've just unveiled Helix 02, a unified AI brain for humanoid robots. This brain allows Figure03 to operate fully autonomously, and it can now literally feel what it's touching. They proved this with a jaw-dropping 4-minute demo where the robot cleared an entire kitchen without a single pause or any human help. And the crazy part, it's so humanlike that it even closes the dishwasher with a smooth hip kick and a gentle foot nudge. Hey guys, Alfie here. Welcome back to AI Nexus. Back in October 2025, Figure unveiled the Figure03 robot, and honestly, it shocked everyone. Most people were looking at Tesla hoping for the Optimus Gen 3 to drop. We were all expecting Elon to show us the next big thing. But while everyone was looking left, figure moved right. They are iterating faster than almost anyone in the industry. Think about it. We went from figure 01 to figure 02 [music] and now figure 03 in record time. Just 2 weeks ago, we looked at the running demo of the figure 03 and you guys were blown away by how fluid it looked. But that was just the body. Helix 02 is the brain that makes that body actually useful. To understand why Helix 02 is a big deal, we have to talk about why robots usually struggle with things that you and I find [music] easy, like unloading a dishwasher. See, for decades, robotics has been broken into pieces. Engineers would build one controller to handle walking. Then they build a separate one to handle the arms, then another one for balance. It's like trying to play a video game where one friend controls the joystick, another controls the jump button, and a third person controls the camera. If they don't talk to each other perfectly, the character falls over. Figure decided to throw that old way of doing things in the trash. Instead of 109,54 lines of handgineered C++ code, yes, they actually counted. They replaced it with a single neural network. Last year, Helix 01 proved it could move its upper body just by reacting to what it sees through its camera lenses with no middleman and no human help. But Helix 02 takes over the entire robot. Everything, the legs, the torso, the head, the arms, and every single one of those 10 fingers is controlled by one continuous system. This is what makes the motion look so real. Just watch the demo. It's slow, yes, but it's human. When it moves, the whole body reacts. It's not just walking and then grabbing. It's doing both as one fluid motion. And this part stands out. It closes the drawer with its leg. That little kick with the foot feels oddly human. This brings us to the dishwasher demo that is everyone talking. Before we go further, the AI race isn't slowing down, it's compounding. We track [music] and",
        "start": 4.319,
        "duration": 374.2420000000001
    },
    {
        "text": "fluid motion. And this part stands out. It closes the drawer with its leg. That little kick with the foot feels oddly human. This brings us to the dishwasher demo that is everyone talking. Before we go further, the AI race isn't slowing down, it's compounding. We track [music] and Subscribe if you want clarity, not noise. All right, back to the video. Figure showed a video of Figure03 executing a continuous 4-minute task. The robot walked to a dishwasher, unloaded it, navigated across a full-sized kitchen, stacked items into cabinets, and then loaded the dishwasher again, all in one uninterrupted sequence. And this is where Helix 02 really matters. Because the real breakthrough here isn't just what the robot did, it's how long it was able to stay autonomous without breaking. Helix 02 gives figures something most humanoid robots still struggle with. Long horizon control. Here's the simple way to think [music] about it. In robotics, a short horizon task is something like pick up that cup. There are only a few steps, so the odds of success are high. A long horizon task is completely different. It's dozens of actions chained together, walking, reaching, adjusting balance, [music] recovering from small mistakes, all without resetting or starting over. The dishwasher demo wasn't one action. It was 61 decisions in a row stretched across four minutes of continuous movement. And normally that's where robots fail. Even a tiny error early on can collapse the entire sequence. But Helix 02 allows the robot to keep track of what it's doing, adjust in real time, and keep moving forward instead of freezing or resetting. That's the difference between a robot that can do a trick and one that can actually finish a job. Figure03 did the whole thing entirely from its onboard sensors. No human intervention, no [music] resets. It even did things that made the internet lose its mind. The comments on the video were gold. One person said that little finger pushed to tuck the dish soap pod in just right. Chef's kiss. Another mentioned closing the drawer with the hip was a flex. These aren't programmed moves. The AI just figured out that using its hip was the most efficient way to get the job done. That is true intelligence. And just when you think this is only about kitchen chores, Figure quietly shows what Helix 02 can do. To prove it's not just good at big movements, figure runs Helix 02 on the figure 03 robot through four dexterity tests. The body is figure 03. The brain controlling it is Helix 02. First, the bottle cap. Figure03 holds the bottle steady with one hand and twists the cap off with the other, while Helix 02 controls the grip force and rotation so [music] it doesn't slip or crush the plastic. Next, figure moves to a much smaller scale. Figure 03 is asked to extract a single tiny pill from a medicine organizer. [music] The",
        "start": 205.36,
        "duration": 710.6410000000001
    },
    {
        "text": "and twists the cap off with the other, while Helix 02 controls the grip force and rotation so [music] it doesn't slip or crush the plastic. Next, figure moves to a much smaller scale. Figure 03 is asked to extract a single tiny pill from a medicine organizer. [music] The visibility. As the robot reaches in, its own fingers block the view from the headmounted cameras. This is where Helix 02 uses the hardware in a smarter way. Palmounted cameras give in-hand visual feedback and tactile sensors in [music] the fingertips detect contact. Helix 02 fuses that information in real time, guiding the fingers to isolate and lift just one pill without dropping it. Next, the syringe. Figure 03 pushes out exactly 5 ml. Helix 02 adjusts force in real time as resistance changes so the motion stays precise. And finally, the factory scrap pile at Figur's bot Q facility. Figure03 picks specific metal pieces from a messy shifting box. And Helix 02 keeps the grasp stable even in clutter. Of course, whenever a video this good drops, the skeptics come out. People started asking, \"Is this teley operation?\" Which is just [music] a fancy way of asking if a guy in a VR suit is controlling the robot from behind a curtain. Figure CEO Brett Adcock didn't dance around the question. He posted on X. I want to be really clear. There is inotle operation in this video. No human controlling this. It's an AI model called Helix and it controls the entire body, walking, touching, planning. It's the most significant release figure has shown to date. Nothing but nets. When he says nothing but nets, he means neural networks. No if then logic, no human puppet master, just pure AI learning. So how does the Helix 2 actually work? It's broken down into a hierarchy of three systems. It handles [music] the stuff you don't think about like balance and posture. Figure trained as zero on over 1,000 hours of human motion data. They also used simreal reinforcement learning where the robot practiced in over 200,000 parallel virtual environments at the same time. S0 runs at 1,000 hertz, 1 kHz. That means it's checking its balance and adjusting [music] its motors a thousand times every single second. This is why the robot doesn't [music] fall over when it kicks a door or carries a heavy stack of plates. S1 is the visual motor layer. It connects all the sensors, the head cameras, the palm cameras, and the touch sensors directly to the joints. It runs at 200 hertz. While S0 is busy not falling over, S1 is busy looking at the world and deciding exactly how to move the arm to grab a plate. It's the bridge between seeing and doing. S2 is the highle brain. This is the part that understands English. You can tell it walk to the dishwasher and open it or carry the bowls to the counter. S2 doesn't care how many cm the",
        "start": 375.759,
        "duration": 1058.3209999999992
    },
    {
        "text": "the arm to grab a plate. It's the bridge between seeing and doing. S2 is the highle brain. This is the part that understands English. You can tell it walk to the dishwasher and open it or carry the bowls to the counter. S2 doesn't care how many cm the the goal. It breaks the big goal down into smaller tasks for S1 to execute. One of the biggest reasons Helix 02 is so much better than the original Helix is the hardware on the figure 03. For the first time, we're seeing all sensors in, all actuators out. The Figure03 has palm cameras. This is a gamecher because when a robot reaches for something, its own arm often blocks the view from its head cameras. With cameras in its palms, it can see exactly what its fingers are doing. It also has tactile sensing in the fingertips. These sensors are so sensitive they can detect a force of just 3 g. That's the weight of a paperclip. This allows the robot to feel how hard it's squeezing something. In just 12 months, the job of a software engineer, the safest career in the world, could be completely vanished. That's not a clickbait headline. That is a bold public claim made by the CEO of Anthropic, Dario Amade, at the World Economic Forum in Davos just days ago. He says, \"The age of the coder is over. AGI, artificial general intelligence, is no longer a someday technology. It's here. And if you think this is just about people sitting behind screens writing Python, think again. Humanoid robotics are no longer circus acts or dancing puppets. They are getting an AGI brain. Elon Musk is already integrating the XAI Grock brain into the Tesla Optimus. And once that connection is complete, everything changes. We aren't just automating software, we are automating reality. Hey guys, Alfie here. Welcome to the AI Nexus at the World Economic Forum. The session was literally titled the day after AGI. Think about that. They aren't asking if it's coming anymore. They are planning for the morning after it arrives. Daario Ammedc, the man who helped lead Open AI before starting Anthropic, dropped the reality check. He revealed that inside his own company, the engineers don't even write code anymore. They just edit what the AI produces. we are now in terms of you know the models that write code I have engineers within anthropic who say I don't write any code anymore I just I just let the model write the code I edit it I do the things around it I think I don't know we might be 6 to 12 months away from when the model is doing most maybe all of what sues [music] do end to end he predicts that within 6 to 12 months AI will be able to do most maybe all of what a software engineer does into why because of the closing",
        "start": 552.32,
        "duration": 1388.9609999999998
    },
    {
        "text": "to 12 months away from when the model is doing most maybe all of what sues [music] do end to end he predicts that within 6 to 12 months AI will be able to do most maybe all of what a software engineer does into why because of the closing itself smarter. Two, the smarter AI writes even better code to improve itself again. Three, this cycle is accelerating at a rate humans can't even comprehend. Amade and Google Deep Minds Demi Hassabis both agreed on one thing. The bottleneck is no longer the software. The only thing slowing us down now is the physical world. [music] And even that wall is starting to crumble. If you want proof that this isn't just tech bro hype, look at the factory floor. Right now in South Carolina, the figure02 robot is working [music] inside a BMW factory. This isn't a pilot project anymore. These robots have already moved over 90,000 parts, working 10-hour shifts with a 99% success rate. Figure recently unveiled the Figure03 which is designed for even [music] faster mass production. They are building a facility to churn out 12,000 of these per year. These aren't just tools. They are autonomous workers that can position metal to the millimeter using nothing but their eyes and an AGI brain. Then there's the heavyweight champion Tesla Optimus Gen 3. Elon Musk recently confirmed that thousands of these bots are now working 24/7 across Tesla's jigafactories. They don't take lunch. They don't take sick days. And [music] Musk says they are now being trained with end toend neural networks. That means they don't need a human to program them to pick up a wrench. They just watch a video of a human doing it and then they do it themselves. If you want to understand the future before it hits your job, hit subscribe. We don't cover hype. We track what's actually happening with AGI [music] and humanoid robots. And don't forget Boston Dynamics. Their new electric atlas just debuted at CES 2026. It's now being deployed at Hyundai's Met plant in Georgia. This version can rotate its joints 360°. [music] It can do things a human body literally cannot do. All while being powered by Google's Gemini robotics models. But the real sleeper hit, China. While we focus on Tesla and Figure, Chinese companies like Uniritri and Aabot are mass- prodducing humanoids at a fraction of the cost. They've already shipped thousands of units. China is on track to produce half of the world's humanoid robots by the end of this year. We are seeing a global arms race to [music] replace human labor with physical AI. For years, we were told computers will take the boring jobs and humans will keep the creative ones. Then we were told AI will take the white collar office jobs, but manual labor is safe. Both of those statements are now proven false. The white collar hit. If",
        "start": 719.68,
        "duration": 1723.2
    },
    {
        "text": "physical AI. For years, we were told computers will take the boring jobs and humans will keep the creative ones. Then we were told AI will take the white collar office jobs, but manual labor is safe. Both of those statements are now proven false. The white collar hit. If can replace a parallegal, an accountant, or a middle manager in six. The blue collar hit. If a Tesla bot can work a 247 shift in a factory for the cost of a few kilowatt hours of electricity, the manual labor fortress has fallen too. This is the first time in history where the brain and the body of technology are evolving at the exact same time. The anthropic CEO isn't just talking about a software update. He's talking about the restructuring of the global economy. So if the day after AGI means coding is automated, white collar jobs are shrinking and robots are taking over the factory floor, what is left for us? This sounds scary, but at Davos, the conversation wasn't just about doom. It was about the great adaptation. Think about the 1800s. Back then, 90% of people [music] were farmers. When the tractor was invented, people thought it was the end of the world. But instead, it freed us up to become doctors, artists, and ironically, software engineers. We are entering a world where the cost of labor might drop to near zero. Everything could become cheaper. Work might become something you choose to do, not something you have to do to survive.",
        "start": 889.6,
        "duration": 1878.9599999999998
    }
]