[
    {
        "text": " The line between human and robot is fading faster than anyone expected. And what they can do now feels almost too real. X Pang just unveiled a female humanoid that literally walks like a runway model with crossing steps and rotating hips that'll make you do a double take. Unitry [music] dropped full body teley operation that lets you control a robot in real time. Toyota showed off a robotic chair that actually walks, climbing stairs like a living creature. And in China, researchers developed a new framework that boosts robot strength so much, one even pulled a car with pure mechanical force. Welcome back, guys. Alfie here. This week's update is different. Every single breakthrough you're about to see is pushing us closer to a future where the line between human capability and machine capability doesn't just blur, it disappears entirely. Okay, let's start with X Pang's big reveal. First up, Chinese EV giant Xpang just unveiled something that looks like it walked straight out of Westworld. Their next generation female iron humanoid robot literally strutdded onto the stage at their AI tech day in Guanghou like a runway model. And I'm not exaggerating here. This thing walks with crossing steps and rotating pelvis movements that are eerily human. It's 5'7, weighs 154 lb. And here's where it gets crazy. You can customize it to be male or female, [music] complete with soft three-dimensional lattice structures and realistic skin for humanlike body curves. They literally engineered this thing with posterior design in mind. The spine moves like yours does. The hands, 22 degrees of freedom using tiny harmonic joints. That's more dexterity than most robots even dream about. But here's the kicker. Xpang packed three in-house Turing AI chips into this beast, delivering 2,250 tops of computing power. That's enough to handle realtime factory assembly tasks using vision language action models. And get this, it runs on a solid state battery that's 30% lighter with 30% more capacity than traditional batteries. The CEO, Hi Xiaoing, was brutally honest, though. He said household deployment is getting delayed because the AI needed for home tasks is incredibly difficult with current technology. So, they're starting commercial first. Think X paying stores where Iron greets customers and shows off cars. Mass production kicks off April 2026. We're talking less than 6 months away from these hitting the real world. Imagine this, a robot like Iron greeting you in your living room every morning. Cool or creepy? Let me know in the comments. Now, hold on because this next one is straight up science fiction becoming reality. Unitry Robotics just released their embodied avatar full body teleoperation platform. And honestly, this is the stuff we've all fantasized about. Imagine controlling a humanoid robot with your entire body in real time, not just moving its arms. everything. You move, the robot moves instantly. The video they dropped shows their G1 robot doing actual household chores while being controlled remotely",
        "start": 4.24,
        "duration": 387.8400000000001
    },
    {
        "text": "And honestly, this is the stuff we've all fantasized about. Imagine controlling a humanoid robot with your entire body in real time, not just moving its arms. everything. You move, the robot moves instantly. The video they dropped shows their G1 robot doing actual household chores while being controlled remotely part, the video isn't sped up at all. This is realtime human speed movement with nearperfect precision. The operator isn't wearing some thousand motion capture suit either. It's lightweight and efficient. So, what can this thing actually do? The demos show the G1 picking up a soda can, using its leg to open a dust bin, and tossing the can inside. It cleans dining tables, does dishes, stacks items in the refrigerator, vacuum cleans your floor, even brings you water and fruit. Which of these robots blew your mind the most? Xpang's lielike iron, unit's real-time avatar, or Toyota's walking chair? But here's where it gets really wild. They showed it playing soccer in real time, doing full kung fu sequences, and executing boxing moves that mirror the operator perfectly. It's even learning full body movements from videos. Think about the implications here. Remote task execution in hazardous environments, search and rescue operations, healthcare applications, industrial automation. And because it's capturing full body data, this platform is generating massive imitation learning data sets that will train the next generation of autonomous robots. The use cases are staggering. You could work in a dangerous factory from the safety of your home, perform surgery remotely, explore disaster zones without risking human lives. We're witnessing the birth of true embodied avatars, and Unitry just made it accessible. Let's shift gears to something that's solving a real human problem. Right now, Toyota just introduced their WalkMe robotic walking chair at the Japan Mobility Show 2025. And this thing is revolutionary. Forget everything you know about wheelchairs. Walkme has four robotic legs inspired by goat and crab locomotion that let it walk, climb stairs, and fold into carry-on size. Yes, you heard that right. It climbs stairs. When it approaches steps, the front legs test the height and pull the chair upward while the rear legs push for balance. The ascent is smooth and controlled. Liar sensors, cameras, and weight sensors constantly monitor everything. If there's an obstacle, it stops automatically. If the chair starts tipping, it adjusts the base and seat tilt to prevent falls. The legs handle gravel, uneven ground, basically any complex surface that would trap a traditional wheelchair. For Japanese homes, this is a gamecher. The chair can lower itself to floor level for tatami mats and lift users into vehicles by adjusting leg positions. No additional help needed. Control is intuitive, too. Users can steer with integrated handles, buttons, or voice commands. Just say kitchen or faster and it responds. Now, here is where things get wild. A new player emerging from stealth mode. Physical robotics, a Norway based startup founded by Dr. Fuang Wuen just",
        "start": 197.84,
        "duration": 748.8790000000001
    },
    {
        "text": "help needed. Control is intuitive, too. Users can steer with integrated handles, buttons, or voice commands. Just say kitchen or faster and it responds. Now, here is where things get wild. A new player emerging from stealth mode. Physical robotics, a Norway based startup founded by Dr. Fuang Wuen just unveiled their PI robot. The PI robot is an upper body humanoid, just torso and arms for now. This simplifies engineering and lets them focus on core manipulation challenges. 16 degrees of freedom per hand gives it humanlike grasping, pinching, rotating, and balancing. They're targeting dull, dirty, and dangerous jobs. assembly lines, offshore oil rigs, hazardous material cleanup, agricultural harvesting. The robots designed for extreme conditions, too. Cold weather, heat, underwater, radiation, chemicals. And while physical robotics is tackling the mechanical side of strength and endurance, across the world, researchers are solving the brain behind that power. The age of machines just broke the sound barrier. The Unit G. One humanoid robot just pulled a car, got knocked down, and stood back up, keeping perfect balance like it was built for chaos. It stumbled, [music] recovered, and walked again with confidence, showing off movement so smooth it felt straight out of a superhero movie. And now, the secret behind that performance is out. Beijing's AI research institute has unveiled the technology powering it, a system called B AI Thor. This isn't just another robotics upgrade. It's a redefinition of balance, reflex, and control for humanoids. Thor, and no, not the guy with the hammer, is setting a new benchmark for what robots can do. This breakthrough framework teaches humanoid robots to push, pull, and brace themselves like a real person without losing balance. The name THOR stands for task oriented whole body reactive control. Developed by the Beijing Academy of Artificial Intelligence, the team's goal was to help robots handle real physical interaction, things like opening heavy doors, dragging objects, or holding their ground during strong impacts. Most humanoid robots today fall over when pushed or when trying to move something heavy. But Thor changes that by teaching them to lean and adjust naturally, just like we do. Using reinforcement learning and a force adaptive torso tilt reward system, it trains robots to shift their weight intelligently during every action. The upper body, waist, and legs move in perfect sync, [music] reacting independently but maintaining shared balance awareness. When tested on a Unitri G1 biped, the results were jaw-dropping. Thor pulled backward with 168 ntons of force, nearly half its body weight, and forward with 146 newtons, over 70% stronger than previous methods. In real world terms, the robot dragged a loaded rack, opened a fire door one-handed, and never lost its footing. That's not just power. That's control, coordination, and reflex. Thor isn't just a lab demo anymore. It's a working system ready to handle industrial tasks, rescue operations, or any job where strength and stability matter. Here's where things get wild. The next breakthrough",
        "start": 381.36,
        "duration": 1110.72
    },
    {
        "text": "door one-handed, and never lost its footing. That's not just power. That's control, coordination, and reflex. Thor isn't just a lab demo anymore. It's a working system ready to handle industrial tasks, rescue operations, or any job where strength and stability matter. Here's where things get wild. The next breakthrough robots could do. Where the Navi Navigator 2 humanoid is aiming to do it all. This robot recently demonstrated over 10 real world skills at a validation field in Ningbo, a full-scale test arena featuring a factory floor, a home, and a supermarket. Na'vi walked in and started greeting guests like a professional concierge, complete with smooth conversation and friendly gestures. But it didn't stop there. In the industrial zone, it handled precision tasks such as sewing fabrics and assembling parts with sub millm accuracy, even performing chemical reagent testing. Dangerous work usually reserved for humans. Then it switched modes and became a domestic helper, wiping surfaces, ironing clothes, and watering plants. Engineers say it's already learning advanced chores like cooking. In the retail area, Navi transformed into a 24/7 store clerk, offering product info, restocking shelves, and delivering drinks. Standing 1.65 65 m tall and weighing 60 kg. The robot packs 41° of freedom and 275 to ops of computing power. The goal is clear. Push humanoids from labs into realworld use at scale. One attendee summed it up perfectly. Robots like Navi could soon [music] empower thousands of industries and enter thousands of households. That's not just ambition. It's the future taking shape. Just when it feels like we've hit peak innovation, meet the V-bot named Babo. An intelligent home companion straight out of a sci-fi dream. Babo isn't just a gadget. It's a full-fledged assistant built to live and work alongside humans. From the moment you power it on, Babo understands your voice, gestures, and surroundings. No joystick, no app required. It's designed to move, see, and act with purpose. Vbot system integrates computer vision, voice recognition, and action planning in a closed loop. It sees, understands, acts, and even explains what it's doing. The company calls it a small follower, little cameraman, and mini bodyguard for your family. Babbo can follow you on walks, carry groceries, take photos on command, and keep an eye on loved ones when you're away. Its dual camera eyes offer a wide 230°ree view with lielike digital expressions, while its dual computer system drives perception, movement, and interaction with 128 tops of AI compute. A lidar sensor provides 360° spatial awareness, making navigation incredibly smooth. The standout feature, a modular back that lets you attach accessories like a robotic arm, an action camera, or even a tennis ball launcher. Backed by 3 billion RMBB in funding, Vbot is heading for trial production in September, mass manufacturing in October, and a global roll out by year's end. If successful, Babo could redefine what a home robot means. A true AI companion that listens, learns, and lives with you. Here's where",
        "start": 565.68,
        "duration": 1497.0399999999997
    },
    {
        "text": "Backed by 3 billion RMBB in funding, Vbot is heading for trial production in September, mass manufacturing in October, and a global roll out by year's end. If successful, Babo could redefine what a home robot means. A true AI companion that listens, learns, and lives with you. Here's where walking into a hotel where elegance and automation collide. And the staff isn't human, but flawlessly efficient robots gliding across the lobby like living art. The future of five-star hospitality has officially arrived. That's exactly what's happening as robots take over the hospitality game. Kenan Robotics just partnered with Shangriila to open the world's first hotel fully staffed by a team of humanoid and specialized robots. The Shanghai Hong Xiao Airport Shangria Traders Hotel now runs an eight robot service team handling everything from reception to room service. This isn't a gimmick. These robots are fully woven into daily operations. The highlight is X-Man R1, Kenan's humanoid greeter, standing at the front desk in uniform to welcome guests, answer questions, and hand out gifts. Visitors describe the experience as futuristic and almost cinematic. Meanwhile, behind the scenes, a team of specialized robots keeps everything running smoothly. W3 delivery bots zip through corridors with room service and amenities. The S100 works as a robotic bellhop, carrying luggage to rooms. The C40 quietly cleans halls and lobbies, while the T10 and T3 bots serve food from kitchen to table with precision. All the robots work together as one smooth system that covers different hotel tasks. This setup solves big problems like high demand, staff shortages, and keeping service quality consistent. These robots run non-stop, follow every rule, and help human workers focus on personal guest care. Kenan says this is the first hotel to use both general purpose and specialurpose robots in true teamwork. Each robot has a clear role. Greeter, runner, porter, custodian. Industry watchers call it a practical reference model for smart hotels of the future. This isn't novelty anymore. its scaled commercial deployment in a real luxury hotel. Welcome to 2025's biggest shockwave. [music] The controversy shaking the robotics world. Norwegian American startup 1X has been making waves with its Neohumoid, but recently they got called out hard. Neo is marketed as one of the first personal humanoid robots for home use. 5' 6 in tall, capable of household chores, available for pre-order at $20,000 for delivery in 2026. The problem is 1X's promotional material didn't make it clear that a remote promo videos showed Neo cleaning rooms, opening doors, and fetching items, all appearing fully autonomous. But then came [music] the twist. The Wall Street Journal revealed that nearly all of Neo's moves were done through something called expert mode, where a human controls the robot remotely using VR. During the demo, every action was guided by a person seeing through its cameras. Viewers were shocked, and many felt misled. To be fair, having a human in control isn't bad. Experts say it's a",
        "start": 760.0,
        "duration": 1860.962
    },
    {
        "text": "done through something called expert mode, where a human controls the robot remotely using VR. During the demo, every action was guided by a person seeing through its cameras. Viewers were shocked, and many felt misled. To be fair, having a human in control isn't bad. Experts say it's a issue was how it was presented. The flashy videos made it look like Neo could think and act on its own when in truth a human operator was behind the scenes. Technically, 1X says expert mode is a temporary step toward full autonomy, not the final product. Human pilots generate real world data through Neo's sensors to train its AI model, a vision language system called Redwood. This data helps Neo's AI learn by watching humans perform tasks. Now, let's end on a high note with skilled brain. This startup is taking a totally different approach. Instead of building one type of robot, they're building a unified AI brain that can control many types of robots for many tasks. It's an omnibody general intelligence. Think of it as a universal brain. One powerful AI core that can live inside any machine, whether it's a humanoid, a four-legged bot, a drone, or even a robotic arm. At NVIDIA's GTC conference, Skilled stunned the audience when its robots precisely inserted Apple AirPods into their charging cases and assembled a GPU tray. Tasks so precise they challenge even human hands. One observer joked that even their own brain struggles to get AirPods back in the case. Skilled robots didn't stop there. [music] They cleaned messy desks, sorted random objects, and walked through city streets with no pre-loaded maps or guides. The craziest part, every one of those actions came from the same skilled brain AI model. Not different codes or modes, but one unified intelligence. Its creator, Deepak Pathac, a respected AI researcher, explains that Skilled Brain learns from large-scale simulations and human behavior data to teach robots how to adapt, think, [music] and act with real world awareness. Using NVIDIA's Isaac robotics platform and Cosmos simulation tools, the team builds huge training worlds in virtual space. In real tests, a skilled powered humanoid completed 60 to 80% of tasks within just hours of learning, even in messy, unpredictable environments. In one demo, a four-legged, skilled robot lost a leg. But the brain instantly adjusted, staying balanced and moving on three. That's true adaptability, [music] not pre-programmed behavior. Skilled's goal is to create a foundation model for robotics, just like GPT4 is for language. What a robot learns in one task, it can reuse for another. Every robot connected to skilled brain sends data back, making the main AI smarter for everyone. The payoff could be massive. Robots that learn faster, adapt easier, and are ready for real world work in record time. Their motto sums it up perfectly. One brain, every robot. And their latest progress has experts believing generalpurpose robot intelligence is closer than ever. So",
        "start": 944.32,
        "duration": 2214.6419999999985
    },
    {
        "text": "AI smarter for everyone. The payoff could be massive. Robots that learn faster, adapt easier, and are ready for real world work in record time. Their motto sums it up perfectly. One brain, every robot. And their latest progress has experts believing generalpurpose robot intelligence is closer than ever. So showing off raw power and precision. Others are finally stepping out of labs into hotels, homes, and real jobs. If you made it this far, you're part of the few people actually tracking history as it happens. So, hit that like button, share this with your fellow tech fans, and drop your favorite robot of the week down in the comments.",
        "start": 1123.76,
        "duration": 2254.9629999999984
    }
]