[
    {
        "text": " Xpang has finally announced the price of their female iron robot at the Guanghou Auto Show. Yes, the same iron robot that walked onto the stage at Xpong's AI day earlier this month and stunned the entire internet. The same robot whose movement was so humanlike that people genuinely wondered if X Punk had put someone in a suit. Well, now we know what that robot actually costs. Hey guys, Alfie here and Xping's new price announcement changes everything we thought we knew about the robot market. Most humanoid robots today are priced like exotic supercars. $200,000, $300,000, sometimes even half a million depending on the company. That's why Xpang's announcement hit the industry like a shock wave. When Hi, Xiaoping revealed Iron's official launch price of $150,000, Xpong instantly undercut almost every major robotics company by tens of thousands of dollars. But the real twist came next. Hiao Pong said that once mass production begins, Iron's price could fall dramatically down to around $45,000. A number that suddenly makes humanoid robots feel less like futuristic luxury toys and more like something a normal household could realistically consider someday. But here's where the real comparison gets interesting. Elon Musk has repeatedly claimed that Tesla Optimus Gen 3 could eventually reach a long-term price target of under $25,000. That would make Optimus nearly half the cost of Xping's mass production iron. So now we're watching the first true price war in humanoid robotics. Xpang pushing toward the $40 to $50,000 range. Tesla aiming for $25,000 and the rest of the industry still stuck above $150,000. For the first time ever, companies aren't just competing on movement or AI. They're competing on who can build a robot cheap enough to actually enter people's homes. Here's how he Xiaoing explained the pricing. And this part is actually pretty smart. He said software makes up more than half of iron's value. Let me break that down for you. In a car, software is maybe 10 to 20% of what you're paying for. The rest is just materials, steel, aluminum, batteries. But with iron, the intelligence is what you're actually buying. The robot body is just the thing carrying that intelligence around. And since Xpang already spent billions developing self-driving car technology, they're basically reusing that technology for iron. They're getting two products out of one investment. That's pretty clever business. Hi. Xiao Ping also said something interesting about how valuable these robots could be. He claimed iron could be one to two times more valuable than cars. His logic actually makes sense. A car just moves you from one place to another. That's useful, sure, but iron could help you at work, assist you at home, and handle tasks in public places. It's not just transportation. It's like having an extra helper across your entire life. Iron becomes more than just a tool. It becomes a platform that can do many different things, and that's where the real value is. Xping announced",
        "start": 4.24,
        "duration": 381.0400000000002
    },
    {
        "text": "assist you at home, and handle tasks in public places. It's not just transportation. It's like having an extra helper across your entire life. Iron becomes more than just a tool. It becomes a platform that can do many different things, and that's where the real value is. Xping announced running by the end of 2026. And this isn't just talk and fancy presentations. Xping is already testing real iron robots in their Guanghou factory right now. Actual robots working next to humans, doing repetitive tasks, learning to pick up and move objects. This is real hardware being tested, not just concept drawings. Xping is aiming for what they call level three autonomy for Iron. They're borrowing that term from self-driving cars. What does that actually mean? It means iron can move around and do work without someone constantly watching over it. The technology making this possible is Xping's own vision language action system. This technology combines vision, understanding language, and physical movement into one system. All three parts work together at the same time to make iron act independently. What's really smart is how iron can get better over time. Just like Xpang's electric cars get software updates through the internet, iron will get new abilities the same way. Your robot could literally learn new skills overnight while you're sleeping. That changes everything because iron isn't a finished product that stays the same forever. It's a system that keeps improving. You're buying something that gets better as time goes on. Here's something revealing, though. The robot that walked on stage at AI day was version 7. The version X Pang will actually sell in late 2026 will be version 8. H. Xiao Pong specifically said the hands need to be better. During early tests in factories, the hands only lasted about a month doing the same tasks over and over. But the fact that Xping is being honest about these problems while still promising a 2026 launch tells you they believe the main robot design is solid. The foundation is good. [music] They just need to make the hands tougher. When Xping first revealed Iron at AI day in Guangha, the entire robotics world froze. Iron didn't walk like a robot at all. It walked like a person. The hips swayed naturally, the steps flowed smoothly, and even the hand movements looked organic. Within minutes, videos went viral across China. People replayed the footage frame by frame, zooming into joints, analyzing every shift of weight, and a massive question exploded online. Was this even real? Some thought Xpang had put a human inside a costume. Others said the movements looked too biological, pointing at the posture, the spine rotation, the fluid balance. Tech influencers and engineers openly questioned whether Iron was an actual humanoid or just a marketing stunt. Then it escalated even more when two identical Iron Robots walked on stage in perfect synchronization. It looked less like robotics and more like a choreographed dance, fueling",
        "start": 195.04,
        "duration": 725.4410000000003
    },
    {
        "text": "spine rotation, the fluid balance. Tech influencers and engineers openly questioned whether Iron was an actual humanoid or just a marketing stunt. Then it escalated even more when two identical Iron Robots walked on stage in perfect synchronization. It looked less like robotics and more like a choreographed dance, fueling Spang made a move no robotics company had ever dared. They brought Iron on stage again, this time with engineers holding tools and started taking the robot apart live in front of journalists. No edits, no cuts. They removed sections of the leg armor, exposing the steel frame, motors, cooling systems, wiring, and sensors. The audience could hear the fans spinning and see joints moving in real time. It was like a live robot autopsy. And it worked. Overnight, every conspiracy theory vanished. Xpang then released footage of Iron walking with the outer shell removed, revealing its 3D printed bionic muscle layer, the system responsible for that eerily natural gate. Iron's abilities are just as wild as the reveal. Its five-part spine lets it bend and twist like a real human, and the bionic muscle layer absorbs shocks for smooth, natural motion. Each hand has 22 degrees of freedom, enough to grip tools and handle objects. Though Xping admitted the early versions wore out quickly. Stronger versions are already in development. And Xping isn't stopping at functionality. Iron will be customizable. Different looks, body shapes, even soft skin with touch sensors designed to feel warm and friendly. But Xpong is deploying carefully. No factories or homes yet. They'll start iron in predictable environments, retail stores, tour guiding, reception, and expaying showrooms by late 2026. The long-term plan, 1 million humanoid robots per year by 2030, eventually entering homes as helpful companions, not just machines. Xpong isn't a small startup making promises. It's a major automaker with real factories and supply chains. If anyone can massproduce humanoids, they might actually pull it off. We just stepped into the future together. Now, be honest. Would you feel comfortable living with a humanoid robot? Why or why not? And if you think that's crazy, wait until you hear this. While Tesla's Optimus Gen 3 is making headlines with its new hand upgrade, and Unitry G1 is going viral with those insane kung fu moves, there's one company that's been unusually silent lately, but has made bigger headlines than both of them combined. Boston Dynamics. This is Boston Dynamic that went from hydraulic humanoids doing parkour to electric humanoids twisting their joints like superheroes. From robot dogs saving lives in rescue missions to four-legged speed demons sprinting like wild animals. In just a few years, they've built everything. The fastest robots, the strongest humanoids, machines that run like animals, climb like athletes, and AI systems that learn entirely on the move. This isn't robotics anymore. [music] It's evolution in metal. What started as military-funded experiments turned into [music] the most jaw-dropping robotic legacy on the planet. Boston Dynamics doesn't just build robots. They build",
        "start": 368.88,
        "duration": 1084.8820000000005
    },
    {
        "text": "machines that run like animals, climb like athletes, and AI systems that learn entirely on the move. This isn't robotics anymore. [music] It's evolution in metal. What started as military-funded experiments turned into [music] the most jaw-dropping robotic legacy on the planet. Boston Dynamics doesn't just build robots. They build And what started as wild science experiments funded by the military has turned into the most jaw-dropping robotics company on the planet. Let's start with the legend. HD Atlas. This hydraulic beast was the most agile humanoid robot ever made until it retired in 2024. We're talking backflips parkour running, dancing to do you love me in perfect sink. This thing could lift heavy engine covers, balance on one foot, and if you pushed it, it would stumble and catch itself [music] like a drunk friend at a party. The secret. 28 hydraulic joints pumping fluid at insane pressure, [music] giving it strength and speed that made it look super human. When Atlas did that 540° [music] twisting backflip they called the sick trick, engineers said every joint was pushing at nearly 100% power at the same time. That's not just robotics. That's engineering on the edge of what's physically possible. And the craziest part, it wasn't just playing back recorded moves Atlas was calculating in real time. how to jump, how hard to push, how to land without face planting. It was like watching a metal gymnast with a PhD in physics. But just when everyone thought Atlas had peaked, Boston Dynamics pulled the ultimate plot twist. Electric Atlas. Same robot, totally different guts. This new version weighs about 89 kg, roughly the same as a person, but it's packed with electric motors instead of hydraulic fluid. That means it's quieter, smoother, and way easier to maintain. No more loud hissing and pumping sounds. Just smooth, precise motion. And it can run at 2 and 1/2 m/s, which is a slow jog for us. But this thing can do it over and over without overheating, thanks to a cooling system that works like human sweat. Now, here's the part that blew my mind. Atlas's joints can bend and twist beyond what any human can do. Its waist can spin all the way around. Its hips can stretch at crazy angles. Imagine a worker pulling a heavy box from a shelf while doing a half turn spin in midair and never dropping it. That's Electric Atlas. And the gripper system, that's where it gets really interesting. Boston Dynamics built what they call the GR2 gripper. A three-fingered hand with seven degrees of freedom and seven actuators. Two actuators for each finger, one for an articulated thumb that swivels and spins. Why three fingers? Because the team figured that's the fewest number you need to handle complex tasks. Large, heavy objects. Distribute tension across many contact points. Small, delicate stuff. Use a two-finger pinch with the thumb. And get this, the gripper has tactile sensing on the fingertips and",
        "start": 551.2,
        "duration": 1421.601000000001
    },
    {
        "text": "and spins. Why three fingers? Because the team figured that's the fewest number you need to handle complex tasks. Large, heavy objects. Distribute tension across many contact points. Small, delicate stuff. Use a two-finger pinch with the thumb. And get this, the gripper has tactile sensing on the fingertips and just grabbing blindly. It's feeling and seeing what it's holding. In factory tests, [music] Atlas autonomously moves engine covers between containers and mobile dollies using machine learning vision models. No prescribed movements, no teley operation. It's doing it all on its own, generating motions in real time. Do you think Electric Atlas is now officially more capable than a human worker? Let me know in the comments. And while Atlas grabbed headlines, another robot quietly became the company's real workhorse. About the size of a golden retriever, weighing 32 kg, this little robot can walk, climb stairs, and cross rocky or muddy ground that would wreck most machines. Spot is covered in cameras that give it 360° vision so it never bumps into things. And in factories, it quietly walks between machines, listening for strange sounds, looking for leaks, taking photos of equipment. If something looks off, Spot automatically warns the team before problems get serious. But here's where Spot really shines. Emergencies. When a building collapses, Spot can walk over piles of debris, use its cameras to look for trapped people, and send video back to rescuers. It explores risky areas like nuclear power plants, collecting radiation readings without putting humans in danger. And even though it weighs just 32 kg, it can carry up to 14 kg of extra equipment on its back. A full backpack of tools or a small robot arm spot isn't just a machine. It's a mechanical co-worker with personality and purpose. If you had to trust one robot in a real emergency, Atlas or Spot, who are you picking and why? But Spot didn't appear out of nowhere. Its roots trace back to one of the wildest machines Boston Dynamics ever built. This thing was a beast. A four-legged robot that could sprint at 16 mph across open ground as fast [music] as a galloping horse. Powered by a small gasoline engine that made it sound like a go-kart on four legs, Wildcat could run, hop, and spring off the ground with muscle-like power. You could hear it roar to life as it took off, kicking up dust as it dashed across pavement and dirt. What made wild cat so special was how it kept its balance while running over rough ground. It adjusted every stride based on what was beneath its feet, shifting its weight and rhythm just like a real animal would when sprinting across uneven dirt or grass. It wasn't as fast as its predecessor, but it represented freedom and adaptability. No cables, no lab restrictions, just pure mechanical muscle. And the story goes even deeper because before Wildcat came the true record-breaker, the speed",
        "start": 721.68,
        "duration": 1761.2820000000008
    },
    {
        "text": "just like a real animal would when sprinting across uneven dirt or grass. It wasn't as fast as its predecessor, but it represented freedom and adaptability. No cables, no lab restrictions, just pure mechanical muscle. And the story goes even deeper because before Wildcat came the true record-breaker, the speed made history by sprinting over 28 mph on a treadmill, faster than Usain Bolt. Its flexible spine and springy legs work together. Do you think Boston Dynamics should bring back Wildcat and push its speed even further? Comment your thoughts. But none of this happens without money. And that money came from DARPA, the Defense Advanced Research Projects Agency. The same folks who funded early internet research and stealth technology Boston Dynamics was founded in 1992 as a spin-off from MYT by Mark Ryber. But what really pushed them into global fame was partnering with DARPA in the early 2000s. DARPA wanted robots that could move like animals and humans, not just roll like machines. And Boston Dynamics delivered. Atlas, DARPA funded, designed, but DARPA's influence goes deeper. LS3, the legged squad support system. This was DARPA's dream of a robotic pack mule for soldiers. Standing as tall as a horse, LS3 could carry 400 lb of gear, travel 20 m on a full tank, and follow soldiers through forests and deserts by voice or GPS command. Soldiers could tell it to follow them or send it to a GPS spot on a map, and it would find its way there automatically using cameras and sensors to avoid rocks, trees, and ditches. In videos, you can watch it trot along behind a human leader, keeping perfect balance even when pushed or walking over uneven ground. DARPA wanted LS3 to be tough enough for real missions. Something that could travel up to 20 m in a day, handle any kind of weather, and last for about a full day on a tank of fuel. The idea was to give soldiers a reliable mechanical teammate that could carry their supplies and follow them wherever they went. But LS3 itself had an ancestor, a robot that kickstarted the entire journey. Launched in 2005 with DARPA funding, Big Dog was built to help soldiers carry heavy gear through tough terrain. About the size of a small mule, weighing around 110 kg, it could carry up to 150 kg of equipment. You could kick it or push it, and it would stumble, but quickly regain balance, almost like it had instincts. It could even climb steep slopes up to 35°, splash through water, or trot over ice without falling. Powering all this motion was a small gasoline engine running a set of hydraulic legs. Inside, [music] it had sensors and computers that measured every step, how much force each foot pushed with, how tilted it was, and where the next solid spot on the ground would be. Big Dog's success paved the way for Boston Dynamics later creations. Its hydraulic muscles and",
        "start": 893.44,
        "duration": 2091.842
    },
    {
        "text": "hydraulic legs. Inside, [music] it had sensors and computers that measured every step, how much force each foot pushed with, how tilted it was, and where the next solid spot on the ground would be. Big Dog's success paved the way for Boston Dynamics later creations. Its hydraulic muscles and LS3, the speedy Wildcat, and eventually the smart and quiet spot. Love this kind of content where we explore all the robots a company is building. Hit subscribe. We've got plenty more coming. And let us know in the comments which robot family you want to see next. But the humanoid story actually starts earlier with Petman. The protection ensemble test mannequin developed in 2009 to simulate human physiology for testing protective military gear like chemical suits. Standing about 1.75 m tall, weighing around 80 kg, Petman could walk, squat, kneel, and perform calisthenics, mimicking human movements and physiological responses like sweating and temperature regulation. Powered by hydraulic actuators with 29° of freedom, Petman was built to act as a human surrogate for environmental testing in hazardous conditions. It wasn't designed for autonomous tasks or complex environment interaction. It was a test bed, a proof of concept, and it became the foundation for Atlas. The same control systems, the same balance algorithms, the same understanding of bipedal locomotion, all built on Petman's back. If Boston Dynamics could bring one older robot back with modern upgrades, Spot Classic, Big Dog, LS3, Cheetah, or Wildcat, which one should they revive? But Boston Dynamics doesn't just make robots that walk. They reinvent how robots move. The robot that surprised everyone. When it first appeared in 2017, people were amazed. Instead of the usual four-legged creatures or humanoid machines, Handle rolled around on two large wheels, balancing like a gymnast on rollerblades. It could speed across the floor at nearly 9 mph and even jump over obstacles almost 4 ft high. Standing about 2 m tall, handle was built for warehouse work. It could zip between rows, pick up heavy boxes with its long arm, and neatly stack them onto pallets, all without a human's help. Its gripper used suction power to lift each box smoothly, almost like it had a giant vacuum hand. What made handle special was its balance as it bent, turned, or lifted. A counterwe at the back worked like a tail to keep it upright. It could roll fast, stop instantly, and turn tight corners without tipping over. Its cameras and sensors helped it see where boxes were placed and how to line them up perfectly. It was designed to build pallets with the same care as a human worker, only faster and with less space to move in. So that's the journey. From military experiments funded by DARPA to commercial robots working in factories and disaster zones. From hydraulic beasts doing backflips to electric machines that think and adapt in real time. Boston Dynamics didn't just build robots. They built a legacy. They taught",
        "start": 1062.799,
        "duration": 2452.1620000000016
    },
    {
        "text": "space to move in. So that's the journey. From military experiments funded by DARPA to commercial robots working in factories and disaster zones. From hydraulic beasts doing backflips to electric machines that think and adapt in real time. Boston Dynamics didn't just build robots. They built a legacy. They taught the way life has for millions of years, but with the precision of modern engineering. And we're just getting started. Let us know in the comments which Boston Dynamics robot shocked you the most. I read every single comment. We're in 2025 where you can literally pre-order a humanoid robot for around $20,000. And Tesla's Optimus Gen 3 is expected to hit that price next year. Robots are quickly becoming the next big thing in consumer tech, just like smartphones once were. But here's the twist. There are still robots so rare, so advanced that even billionaires can't buy them. From Robonaut, NASA's humanoid astronaut working aboard the International Space Station, to DARPA's Nano Hummingbird, a spy drone so tiny it flaps its wings like a real bird. Today, we're diving into seven robots so exclusive even billionaires can't buy them. So, let's start. Let's start with Robonaut, NASA's humanoid space worker. Robonaut 2 literally flew to the International Space Station back in 2011 as part of the STS133 mission, making it the first humanoid robot ever to operate in space. The whole point of Robonaut is dexterity that matches or exceeds what a human astronaut in a bulky space suit can do. R2's hands have 14 degrees of freedom with touch sensors built into the fingertips, so it can handle the same tools astronauts use without needing a completely new toolkit designed for robots. Right now, there are four different Robonaut versions, each testing different stages of mobility and task handling. Some versions even use Segway platforms for movement. Robonaut operates through teleresence and varying levels of autonomy, which means astronauts or ground control can guide it through delicate repairs while the robot handles the fine motor work. Here's the thing, though. Robonaut exists solely for space missions and research. It's not a product. It's a multi-million dollar national space infrastructure project that requires launch costs, ISS integration, ground operations, and an entire science program built around it. You don't buy access to Robonaut. You need a space station first. Do you think NASA should ever make a version of Robonaut for Earth? Maybe for deep sea or disaster rescue? Drop your thoughts below. I'm curious what you think. Now, let's get into something that sounds like science fiction is insect- sized spy robots. When people talk about these, they usually mean the nanoair vehicle program. And the most famous result is the Aero Environment Nano Hummingbird. This thing has a wingspan of just 6.3 in and weighs 19 g, lighter than a AA battery. Unlike normal drones with propellers, it uses flapping wings just like a real hummingbird. Those wings provide both lift and steering, so",
        "start": 1245.6,
        "duration": 2800.803
    },
    {
        "text": "the most famous result is the Aero Environment Nano Hummingbird. This thing has a wingspan of just 6.3 in and weighs 19 g, lighter than a AA battery. Unlike normal drones with propellers, it uses flapping wings just like a real hummingbird. Those wings provide both lift and steering, so It flies around 11 mph with endurance up to 11 minutes and carries a tiny onboard camera that sends live video back to the operator. But here's the thing. These are military research systems. Most details, performance data, and follow-on platforms are classified or restricted. You can't buy a nano hummingbird like a consumer drone. Any modern successors are tied to US defense export laws and security clearances. A billionaire can buy an expensive racing drone. They cannot buy a Pentagon-f funed insect-sized spy platform. Now, let's talk about Astrobe, which might be the coolest robots you've never heard of. Picture three smart floating cubes about the size of a shoe box silently gliding around the International Space Station doing chores so astronauts can focus on actual science. These three robots are named Honey, Bumble, and Queen. And they're basically flying personal assistants for astronauts. But here's the crazy part. In microgravity, Astrob doesn't need wheels or legs. It uses tiny electric fans and air jets to push itself in any direction. The robots constantly scan the station interior using stereo cameras and depth sensors, comparing what they see to a digital map, so they always know exactly where they are. It operates in three modes. Fully autonomous, where it follows planned paths and records video independently. supervised mode where astronauts give commands on a tablet and teley operated from Earth where researchers literally drive the robot from mission control with signal delay. Forget buying a Tesla robot. These things don't even live on Earth. To own an Astrob, you'd first need your own space station, which puts the price tag somewhere north of hundred billion. Before we dive further, make sure you're subscribed because next week we're revealing the most powerful humanoid robots ever built. You don't want to miss it. All right, now back to the video. Let's talk about China's mechanical yak. The largest military bionic robot China has ever created. This thing is absolutely monstrous. Inspired by yaks that thrive in harsh mountain environments, the mechanical yak can carry 160 kg of cargo over 350 lb and move at speeds up to 10 kmh through terrain that would destroy conventional vehicles. It traverses steps, [music] trenches, cliffs, muddy roads, grasslands, deserts, snow fields, forests, high plateaus, and remote border [music] zones. It's equipped with advanced sensors and 12 joint modules that let it walk, sprint, turn, jump, and dash with incredible stability. The Chinese military designed this specifically for logistic support in areas where trucks can't go and where sending human soldiers would be too dangerous or exhausting. The mechanical yak represents a fundamental shift in how militaries think about logistics and",
        "start": 1422.08,
        "duration": 3144.6429999999987
    },
    {
        "text": "it walk, sprint, turn, jump, and dash with incredible stability. The Chinese military designed this specifically for logistic support in areas where trucks can't go and where sending human soldiers would be too dangerous or exhausting. The mechanical yak represents a fundamental shift in how militaries think about logistics and it's exclusively reserved for military operations. Let's talk about Fedor, Russia's humanoid space robot. Russia literally put this humanoid in the commander seat of a Soyu spaceship. Fedor stands for final experimental demonstration object research and it's a full-size humanoid standing about 6 feet tall and weighing over 200 lb 100 lb with full equipment. It started as a rescue robot and evolved into an experimental cosminaut. Fedora can operate in avatar mode where a human controller wears a motion capture exoskeleton and the robot mirrors those movements in real time. It can also run semi-aututonomous routines like walking, manipulating tools, or performing pre-programmed tasks. Before going to space, demo videos showed Fedor driving a car, using drills and wrenches, and controversially shooting pistols at a firing range as a test of fine motor control. In August 2019, Fedor flew on Soyuse MS14 to the ISS as the only crew member on board with no human astronauts. On the station, researchers tested it for using tools inside the Russian segment, interacting with control panels and tasks that could one day extend to spacew walk assistance or hazardous operations. Fedor isn't just a robot. It's an entire Russian space program wearing a metal body. The full system includes the robot control exoskeleton training facilities and integration with Soyos and ISS systems. Then there's Atlas, Boston Dynamics's flagship humanoid, originally funded by DARPA for disaster response in places too dangerous for humans. The fully electric version, unveiled in 2024, uses electric actuators instead of hydraulics, making it lighter, cleaner, and more efficient. It runs advanced model predictive control and whole body optimization, constantly simulating its next few steps and adjusting [music] to keep stable during dynamic moves. You've seen the viral videos [music] running over uneven terrain, jumping between platforms, doing parkour and back flips, handling boxes and tools. In 2024, Boston Dynamics announced Atlas is being redesigned as a real industrial worker with pilot deployments planned in Hyundai factories. The goal isn't just flashy parkour, but tasks like picking and placing heavy parts, working in tight spaces on assembly lines, and doing motions that are hard or unsafe for human bodies. But Atlas is a research platform, not a commercial product. Boston Dynamics doesn't list a price, and they only partner with select labs and industrial customers. Even if you could pay for the hardware, they're not in the business of shipping Atlas to private collectors. You've seen the clips on YouTube, but here's the reality. The only way you get Atlas is if Boston Dynamics decides you are their research project. Next up is Curiosity Rover, the Mars rover that's been rolling around the red planet since August 2012.",
        "start": 1597.44,
        "duration": 3505.7630000000004
    },
    {
        "text": "of shipping Atlas to private collectors. You've seen the clips on YouTube, but here's the reality. The only way you get Atlas is if Boston Dynamics decides you are their research project. Next up is Curiosity Rover, the Mars rover that's been rolling around the red planet since August 2012. Cape Canaveral in 2011, and it's massive, twice as long, and five times as heavy as previous Mars rovers. Curiosity inherited the six-wheel drive and rocker bogey suspension from earlier generations, plus cameras mounted on a mass to help mission teams navigate. But unlike its predecessors, Curiosity contains an entire onboard laboratory for analyzing Martian soil and rocks. NASA engineered it to roll over obstacles up to 65 cm high and traverse about 200 m per day across Martian terrain. It gets electrical power from a radioisotope thermmoelectric generator. basically a nuclear battery. Obviously, you can't purchase Curiosity because it's currently operating on another planet. But even if NASA built a duplicate, the launch costs, mission operations, and decades of engineering make this completely inaccessible to private buyers. Out of these seven ultra exclusive robots, which one blew your mind the most, space, military, or industrial? Let's see what the AI Nexus community thinks below. So, there you have it. Seven robots that redefine exclusivity. These aren't machines you can buy. They're national infrastructure projects, military research platforms, and space exploration tools that exist [music] in exactly one place doing jobs nothing else can",
        "start": 1780.48,
        "duration": 3664.2439999999997
    }
]