[
    {
        "text": " [Music] AI humanoid robots have just taken a leap so big that the world simply isn't ready for what's coming next. From advanced locomotion that looks almost human to brain-like AI control systems to robots performing tasks we once thought were decades away. The progress is happening at breakneck speed. This week we're breaking down the most shocking updates from Figure Unit, Agibot, and more. companies pushing humanoid robotics into a future that feels like science fiction come alive. Let's get into it. Figure just proved once again why its Helix 5LA model is one of the most important AI systems in robotics right now. The same model that previously folded laundry and sorted packages has now taken on another everyday challenge, loading a dishwasher. And it's doing it with impressive skill. What makes this breakthrough stand out is that Helix didn't need new engineering or hand-coded routines. With only additional training data, the model learned to isolate stacked plates and load them in sequence, reorient fragile items with both arms, and even adapt to messy, unpredictable setups. Perhaps most impressive, it can recover from mistakes on the fly, showing a level of adaptability that's critical for real world deployment. This is exactly the kind of versatility researchers have been chasing. A single generalpurpose system that can expand its capabilities over time without needing to be rebuilt for each new task. Figure dishwasher demo is more than just a neat trick. It's a signal that humanoid robots are edging closer to true general purpose autonomy capable of handling the unstructured everyday environments humans live and work in. If Helix keeps scaling like this, we're looking at a future where humanoids can adapt almost as naturally as people do. Zebot has unveiled the ZL1W, a compact 15 kg class wheeled robot dog built for realworld professional use. Unlike heavier quadripeds designed mainly for research or industrial deployment, the ZSL1W emphasizes agility, portability, and adaptability, making it a versatile tool across multiple fields. Equipped with a rugged build and advanced navigation, this robot is designed to operate in environments where reliability is key. In security, it can patrol perimeters, detect anomalies, and provide realtime monitoring. For inspection tasks, it offers precise maneuverability in tight or hazardous areas where human access may be risky. Perhaps most impactful is its role as a guide for the visually impaired, using its sensors and autonomous navigation to assist in mobility with a level of consistency that goes beyond traditional aids. By targeting the 15 kg class, Zabot strikes a balance between power and usability. Small enough for easy transport and deployment, yet robust enough to perform professional-grade tasks. This positions the ZSL1W as a strong contender in the growing market of service and utility robots. With the ZSL1W, Zibot isn't just releasing another robot dog. It's offering a practical multi-purpose platform designed to bring robotic assistance into everyday professional and personal life. AI Squared Robotics is quickly emerging as",
        "start": 2.33,
        "duration": 407.51000000000005
    },
    {
        "text": "positions the ZSL1W as a strong contender in the growing market of service and utility robots. With the ZSL1W, Zibot isn't just releasing another robot dog. It's offering a practical multi-purpose platform designed to bring robotic assistance into everyday professional and personal life. AI Squared Robotics is quickly emerging as the humanoid robot race. The company's IBOT series has already secured more than 500 orders with deliveries underway to top automotive manufacturers, a major biotech firm, and even Shanghai's Hong Xiao airport. Clear proof of strong commercial traction in a space where most competitors are still running pilots. What's fueling this momentum is not just hardware, but a powerful AI foundation. Their open-source FISVLA model is reported to outperform rival systems by 30%. Giving ibot robots a significant edge in learning adaptability and realworld task execution. Unlike companies that treat software as a closed black box, AI squared is betting on an open ecosystem to accelerate adoption and refinement. Equally impressive is the company's ability to attract capital. In just 6 months, AI squared has completed seven rounds of funding, signaling strong investor confidence in both its technology and business model. The vision is driven by doctor Guo Yandong, former OPPO chief scientist, who is blending expertise in cuttingedge AI with scalable robotics engineering. With its rapid funding, open- source AI advantage and proven demand. AI squared robotics is positioning itself as a frontr runner in the hardware plus large model revolution shaping humanoid robotics. Eston Codroid has just hit a major milestone. The company has successfully shipped its first mass-produced batch of humanoid robots. While details on who the customers are remain undisclosed, the move itself is a clear signal that humanoid robotics is shifting from small-cale prototypes and limited trials to true commercial rollout. Mass production has long been the defining barrier for humanoid development. Building a handful of advanced prototypes is one thing, but scaling up to consistent, repeatable manufacturing is what separates research projects from real businesses. By pushing Kodroid into production and delivery, Eston demonstrates not only confidence in its technology, but also the maturity of its supply chain and manufacturing capabilities. Even without named buyers, it's likely these units are destined for industrial and service applications, ranging from logistics and manufacturing support to customerf facing roles. For Eston, the shipments also mark the beginning of crucial realworld feedback loops where deployed robots generate the operational data needed to refine performance and reliability at scale. Unit's G1 humanoid robot has just done something nobody expected. It played table tennis fully autonomously. Not a pre-programmed arm swing, not a stage trick, but realtime rallies powered by advanced AI and whole body coordination. This moment marks one of the biggest leaps yet in humanoid robotics. And the system behind it, called Hitter, is proving that robots are finally learning how to master human level agility in one of the world's fastest sports. Now, why is this such a big deal? Because table tennis isn't just a casual",
        "start": 206.08,
        "duration": 780.7900000000001
    },
    {
        "text": "of the biggest leaps yet in humanoid robotics. And the system behind it, called Hitter, is proving that robots are finally learning how to master human level agility in one of the world's fastest sports. Now, why is this such a big deal? Because table tennis isn't just a casual of the most demanding sports on the planet, pushing human reflexes to the limit. A ball can travel at speeds of up to 70 mph with spins that make it curve unpredictably. Players often have less than 200 milliseconds to react. For a humanoid robot to return shots at this speed while keeping its balance, moving fluidly, and coordinating its entire body is something researchers have been chasing for decades. And now, thanks to Unit's G1 powered by the hitter system, we've finally seen it happen. Astrobot and SER Robotics just dropped a game-changing announcement. They're teaming up to deploy thousands of AI powered robots into manufacturing and logistics over the next 2 years. This is a huge leap from the dozens or even hundreds of units we usually see ordered in today's robotics market. These robots aren't just flashy demos either. They're being tasked with the backbone of industrial operations, delivering materials, handling bins, and loading or unloading goods. By scaling deployments to this level, the companies are betting big on transforming efficiency in factories and warehouses. For Astrobot, the move goes far beyond sales. Every robot deployed becomes a sensorrich data generator, feeding back realorld experience to sharpen their AI algorithms. In other words, this isn't just a deployment. It's a massive learning engine designed to accelerate autonomy and reliability. SER Robotics brings in its deep expertise in industrial solutions, making the partnership a powerful match of hardware ambition and practical integration. Together, they're not only aiming to flood the market with robots, but also to push robotics closer to mainstream adoption at scale. This thousand robot leap could mark a turning point, shifting from pilots in small batches to true industrial automation at scale. Vietnam's Vin Group is making waves in the humanoid race with its in- development robot, Vin Robotics. Standing at 1.78 m and weighing 75 kg, the humanoid is built to mirror human proportions while packing serious engineering under the hood. It's equipped with 31 smart motors, giving it precise control over movement and dexterity, and powered by two hot swappable batteries that allow continuous operation without downtime. Though still in development, Vin Robotics is already being positioned as a platform for automation across industries from manufacturing and logistics to service applications. The combination of humanlike height and robust motor control suggests it will be capable of performing tasks in environments designed for people, navigating spaces, handling tools, and interacting naturally with objects. The hot swappable battery design is particularly noteworthy as it solves one of the most practical challenges in humanoid robotics, sustained uptime in real world use. This feature makes Vin Robotics better suited for long shift industrial or service roles where",
        "start": 394.4,
        "duration": 1151.5100000000004
    },
    {
        "text": "navigating spaces, handling tools, and interacting naturally with objects. The hot swappable battery design is particularly noteworthy as it solves one of the most practical challenges in humanoid robotics, sustained uptime in real world use. This feature makes Vin Robotics better suited for long shift industrial or service roles where yet entered commercial deployment, Vinroup's push into humanoid signals Vietnam's entry onto the global robotics stage. With Vin Robotics, the company is aiming to become a serious contender in the future of human- centered automation. Leu Robotics has just scored a major victory in the humanoid race, emerging as the first place candidate for China's phase 2 humanoid robot data training center project with a winning bid of 82.95 million RMBB, 11.5 million USD. This deal marks one of the largest recent contracts in the sector and underscores Leu's growing influence in the national robotics ecosystem. The project is designed to accelerate the development of humanoids by creating a dedicated hub for data training, simulation, and large-scale validation. All critical components for improving autonomy and real world adaptability. By securing this contract, Leu positions itself at the center of China's push to build robust AIdriven humanoid infrastructure. This win also comes on the heels of other massive industry moves, including Agibbot's product launch success and Unit's large-scale deployments, showing how competition in the humanoid space is heating up at a rapid pace. While Leu may not have the same global recognition yet, securing a government-backed project of this scale gives the company both financial fuel and strategic importance. In short, Leu's big win isn't just a contract. It's a clear sign that the humanoid robot industry is entering an era of national scale investment and competition. Media has officially put its first humanoid robot Mirro O to work, marking a major step in the company's robotics journey. After development at the Meda Fosan Humanoid Robot Innovation Center, Miro has now transferred to the Meda Jingo washing machine factory, where it's beginning its first round of real factory duties. Standing at 1.9 m tall and weighing 68 kg, Miro combines scale with precision. Unlike traditional bipeedal humanoids, it uses a wheeled chassis manufactured by KUKA, giving it greater stability and efficiency in industrial settings. Equipped with laser navigation and radar, the robot can reliably maneuver through complex factory layouts without human assistance. Media also engineered Miro's arms inhouse, building in 16° of freedom and six active joints paired with a six axis force sensor. This setup allows the robot to perform delicate and precise tasks while maintaining strength and versatility. For now, Myro's role is focused on inspection work, including routine data collection and equipment maintenance. However, this deployment marks only the beginning. With its advanced design and integration into a live production environment, Robo Legent has just made headlines with its humanoid robot Robin, which has achieved something even Tesla's Optimus hasn't done yet. It can charge a Tesla car. This capability is",
        "start": 582.16,
        "duration": 1522.711
    },
    {
        "text": "equipment maintenance. However, this deployment marks only the beginning. With its advanced design and integration into a live production environment, Robo Legent has just made headlines with its humanoid robot Robin, which has achieved something even Tesla's Optimus hasn't done yet. It can charge a Tesla car. This capability is demonstration of realworld utility and precision for humanoid robots. Charging an electric vehicle may sound simple, but for a robot, it's a highly complex task. Robin has to identify the charging port, handle the cable, align it correctly, and connect it securely, all while adapting to slight variations in positioning or environment. The fact that Robin can execute this end to end autonomously shows an impressive level of dexterity, perception, and control. Robo Legent's achievement places the company in a unique spotlight. While Tesla has long envisioned Optimus contributing directly to Tesla factories and eventually homes, Robin has already tackled a practical Tesla related task, bridging robotics and EV infrastructure in a tangible way. This milestone suggests a future where humanoids could seamlessly handle everyday tasks tied to electric mobility, from charging vehicles to managing energy systems. For now, Robin has shown the world that humanoid robots are not just walking machines. They're edging closer to becoming true assistants in our daily lives. The Cherry Imoga humanoid robot has officially stepped into the role of a supermarket assistant, showing just how far service Robotics has come. Branded as a smart partner for shoppers, Imoga isn't just a novelty, it's actively handling multiple customer-facing tasks with surprising fluency. From the moment you enter, Immoa can greet customers, guide them through aisles with navigation support, and even help identify products on the shelves. Beyond that, it reminds shoppers of promotions, assists at checkout, and provides an interactive experience that blends convenience with efficiency. For busy supermarkets where human staff can only cover so much ground, a humanoid robot like Imoga brings continuous availability and consistent service. Of course, patience is still part of the equation. Humanoid robots aren't lightning fast yet, but the fact that IMOA can smoothly integrate into a retail environment highlights the steady march toward practical human- centered automation. With this deployment, Cherry is signaling that humanoid robots aren't just for factories, labs, or flashy tech demos. They're ready to start working where people are, helping in daily shopping routines and reshaping how we think about customer service in the age of AIdriven robotics. Agibot brought back a crowd favorite at its first ever partner conference. The AU humanoid robot once again performed the award-winning Soul of the Terracotta Warriors. This performance isn't just a dance routine. It's a showcase of precision, balance, and cultural storytelling through robotics. The A2 previously made headlines by winning the first gold medal at the World Humanoid Robot Games, setting a new benchmark for expressive humanoid movement. Its return on stage at the partner conference highlights Agibbot's vision of blending advanced robotics with artistry, proving that humanoids can go far beyond",
        "start": 770.399,
        "duration": 1889.1900000000003
    },
    {
        "text": "robotics. The A2 previously made headlines by winning the first gold medal at the World Humanoid Robot Games, setting a new benchmark for expressive humanoid movement. Its return on stage at the partner conference highlights Agibbot's vision of blending advanced robotics with artistry, proving that humanoids can go far beyond mastering complex gestures and synchronized movements, the A2 demonstrates just how far motion control, stability, and AIdriven choreography have come. For Agubot, reviving this performance also signals confidence in their technology, showing potential partners that their robots are not only functional, but capable of engaging audiences on a deeply human level. It's a reminder that humanoid robots aren't just about efficiency. They can also inspire, entertain, and bridge the gap between culture and technology. Agibbot is clearly positioning itself as a company that builds robots with both skill and soul. Unitry just dropped one of its boldest appearances yet. Its humanoid fighting robot showed up alongside UFC President Dana White. The moment instantly set the internet buzzing. Is Unitry hinting at the future of robot combat? Or was this just a high-profile demo? The robot built with Unitry's signature agility and strength looked right at home in the fighting arena. With powerful joints, rapid reflexes, and balance control that rivals top tier humanoids, it's not hard to imagine it stepping into a robotic fighting league someday. This isn't a far-fetched idea, either. Combat robotics has long fascinated both engineers and audiences, but we've rarely seen it reach the humanoid level with this kind of realism. By appearing at UFC, Unitry tapped into the world's biggest stage for combat sports, sparking speculation about a possible crossover between human and robotic fighting entertainment. While it's unlikely we'll see a robot in the octagon against a human anytime soon, the groundwork for robot verse robot fighting leagues looks more real than ever. Whether it was pure promotion or a teaser of what's coming, one thing's clear. Unitry wants us to start imagining robots not just as workers sat but as fighters built for the arena. Agibbot turned up the energy with its night cyber banquet. A showcase that blended robotics, nightlife, and pure entertainment. The event highlighted how humanoids can go beyond factories and service halls straight into lifestyle experiences. Leading the show was Yuan Jenang A2 delivering a fullon retro disco dance that lit up the floor. This wasn't just fun choreography. It was a demonstration of fluid motion control and balance that makes the robot feel more like a performer than a machine. Next up, Jingling G1 stepped behind the bar, mixing drinks live with precision. From shaking to pouring, the humanoid showed how robotic arms can handle delicate multi-step service tasks perfect for hospitality environments where speed and consistency matter. Meanwhile, Linkxy X2 took on bar service, carrying drinks and interacting with guests. Its ability to navigate a busy event space while handling objects smoothly reflects Agubot's focus on realworld adaptability. The Cyber Banquet wasn't just",
        "start": 955.759,
        "duration": 2241.110000000001
    },
    {
        "text": "handle delicate multi-step service tasks perfect for hospitality environments where speed and consistency matter. Meanwhile, Linkxy X2 took on bar service, carrying drinks and interacting with guests. Its ability to navigate a busy event space while handling objects smoothly reflects Agubot's focus on realworld adaptability. The Cyber Banquet wasn't just robots could become part of nightife and social venues in the near future. Agubot is clearly positioning its humanoids as not only workers, but also companions and performers capable of reshaping how we think about leisure and service. Detroit-based Borg Robotics has officially unveiled the first ever demo of its humanoid Borg 01, marking a major milestone for the young robotics company. What sets this debut apart is that the robot operated fully autonomously throughout the demonstration. No remote controls, no hidden operators, just real-time onboard intelligence driving every move. Borg01's demo highlighted smooth walking, environmental awareness, and decision-making in dynamic conditions. Instead of relying on presscripted actions, the robot adjusted its behavior on the fly, showcasing a level of autonomy that's becoming the gold standard in next generation humanoids. for Borg Robotics based out of Detroit, a city historically tied to mechanical innovation. This launch feels symbolic. The company is signaling that it wants to push humanoids beyond the research lab and into practical realworld applications where independence is key. By emphasizing full autonomy from the very start, Borg Robotics is positioning Borg01 as a serious contender in a rapidly growing field dominated by players like Tesla, Agility, and Unitry. While it's only the beginning, this debut suggests Borg Robotics isn't just here to experiment. It's here to compete. Boston Dynamics's Spot stunned engineers with a brand new set of aerial behaviors powered by reinforcement learning. Spot has been around for years now, and it's arguably the most famous robot dog in the world. It's danced to music, climbed stairs, carried loads, and performed warehouse inspections with ease. But as impressive as those abilities were, everything we'd seen until now was grounded, literally. Spot was agile, but it was still a creature of the floor. That changed when Boston Dynamics revealed their latest research using reinforcement learning, an AI method where the robot learns behaviors through trial and error. Spot has unlocked stunning aerial capabilities. Suddenly, this groundbased quadriped is performing mid-air moves with control and precision that nobody thought possible. Spot can now leap higher than ever, stabilize itself midair, and land with an accuracy that looks more like an athlete or gymnast than a robot. Engineers describe it as acrobatic locomotion. And when you watch it in action, it feels almost surreal. For the first time, Spot isn't just adapting to the ground. It's mastering the air in brief, controlled bursts. Deep Robotics is tackling the problem of adaptability in a completely different way. Their new Lynx M20 robot dog might not be leaping midair, but it's bringing something just as groundbreaking. A unique front elbow, back knee design that changes how quadripeds function.",
        "start": 1134.0,
        "duration": 2604.949000000001
    },
    {
        "text": "mastering the air in brief, controlled bursts. Deep Robotics is tackling the problem of adaptability in a completely different way. Their new Lynx M20 robot dog might not be leaping midair, but it's bringing something just as groundbreaking. A unique front elbow, back knee design that changes how quadripeds function. leg orientation inspired by animals. Deep Robotics flipped that formula, giving the Lynx M20 a hybrid structure that combines both elbow-like and kneelike joints. The result is a robot that can crouch, climb, and stabilize itself in ways traditional designs can't. This design choice isn't just clever, it's practical. The Lynx M20 is built as an industrial-grade robot meant for environments where ruggedness and adaptability matter most. Picture it navigating construction sites, inspecting pipelines, or traversing uneven terrain in search and rescue missions. The hybrid leg design allows it to handle obstacles and adjust its posture dynamically, giving it a level of flexibility that's hard to match. In other words, while Boston Dynamics is pushing agility to the extreme, Deep Robotics is reimagining versatility. The Lynx M20 is less about showing off and more about delivering reliable performance in environments where robots have to be tough and adaptable. That wraps up this week's AI robot update. And honestly, every week feels more like science fiction turning into reality. With robots evolving faster than ever, the line between human and machine is starting to blur. We'll be tracking every mind-blowing moment, so make sure you're following along. Trust me, you do not want to miss what's coming next. Thanks for watching and we'll catch you in the next one.",
        "start": 1317.84,
        "duration": 2776.630000000002
    }
]