[
    {
        "text": " [Music] Unit Robotics just dropped a new robot H2 and it's turning heads for all the right and wrong reasons. This full-size humanoid packs 31 motorized joints that can dance, do martial arts, and handle delicate factory work with optional dextrous hands. It's their most advanced robot yet, trading the H1's record-breaking sprint speed for serious manipulation skills and flexibility. With a smooth, almost too human face that some call creepy cool and movements fluid enough to make you do a double take, the H2 is Unit's boldest statement that humanoid robots are ready to move from labs into realworld applications. Hey guys, Alfie here and welcome back to AI Nexus. So, let's start with the face. The H2 has this smooth, stylized human-like face that's either going to fascinate you or freak you out. Some people are calling it uncanny valley territory, like those silver androids from Iroot. One blogger straight up called it creepy cool. And honestly, I can't disagree. Unitry dressed this thing up in actual clothing for the demo video, and suddenly we're not looking at a robot anymore. We're looking at something that could pass you in a hallway and make you do a double take. That's intentional, by the way. Unitry wants you to feel comfortable around this machine because their whole pitch is that the H2 is born to serve everyone safely and friendly. Those are their words, not mine. Now, you might be thinking, \"Okay, Alfie, it looks human. Big deal.\" But here's the crazy part. This machine is packed with 31 motorized joints. 31? That's a staggering 19% increase from their previous R1 model. What does that mean for you and me? It means this robot moves with flexibility and smoothness that'll blow your mind. The demonstrations showed it busting out coordinated dance routines and martial arts moves that would make Jackie Chan jealous. We're talking piouettes, high kicks, the whole 9 yards. The agility and stability improvements are absolutely mind-blowing. But wait, there's more. Let's talk about what makes the H2 different from last year's H1 model. The H2 actually has a bit less mass to its frame compared to the H1. Even though they're both full-size humanoids, the H1 weighed in at 103 lb, while the H2 is 154 lb. You're probably confused right now, wondering how H2 is less than H1. Stay with me. What I mean is the H2 redistributed its weight better. This clever engineering lends itself to much quicker footwork. You can see it in the videos. The thing moves with a speed and grace that the bulkier looking H1 just couldn't match in certain situations. Let me break down the technical stuff in a way that'll make sense. Each H2 leg has 6° of freedom. Each arm has 7° of freedom. That's a massive jump from the H1's 5 degree of freedom legs and four degree of freedom arms. Translation: The H2 can move its limbs in ways that are",
        "start": 2.35,
        "duration": 366.61
    },
    {
        "text": "technical stuff in a way that'll make sense. Each H2 leg has 6° of freedom. Each arm has 7° of freedom. That's a massive jump from the H1's 5 degree of freedom legs and four degree of freedom arms. Translation: The H2 can move its limbs in ways that are 3°ree of freedom waist that lets it twist and bend like a gymnast. The engineers followed something called a flexion abduction rotation hip configuration. Sounds fancy, but basically it means the robot can do all those fluid dance moves and kung fu kicks you saw in the promo. Here's where it gets really interesting, though. The H2 made a trade-off. Remember how the H1 set a speed record at 3.3 m/s? It could sprint. The H2 sacrificed that raw speed for something arguably more valuable, dexterity, and strength. It's limited to under 2 m/s. But what it loses in sprinting, it gains in manipulation ability. Each H2 arm can carry 7 kg normally and handle up to 21 kg briefly. That's the same payload as the H1, but with way more control. And get this, the H2 can wear optional dextrous robotic hands. We're talking multi-finger hands called the Dex 5-1 that let it grip and manipulate objects with scary precision. It can fold clothes without squishing the fabric. It can weave wires into panels with its arms stretching to full length while the spine twists into all sorts of awkward angles. Factory demonstrations showed it handling delicate tasks that would require serious finesse. This is not your grandfather's industrial robot. The power situation is pretty slick, too. There's a swappable battery pack tucked in the back, 864 W hours, same size as the H1s. It'll run for about 2 hours. And those M107 motors Unitry developed. They're low on inertia, making the movement speedier and quieter. Each joint delivers 360 new m of torque. That's enough to lift 15 kilos overhead or hold a squat position for extended periods without toppling over. Now, let's compare this beast to the rest of Unit's lineup because context matters. You've got three main players here. The H1 from 2023, the compact G1 from 2024, and now the H2 from 2025. The G1 is the baby of the family at 1.3 m tall and 35 kg. It's designed for classrooms and lightduty use. Starting price about $16,000. That makes it the affordable entry point for universities and robotics labs wanting to experiment with humanoid AI. The H1 and H2 are both full size at roughly 1.8 m, but remember that weight difference. The H1 was built for speed and set records in 400 meter sprints. It costs around $90,000, though some configurations run up to $129,000. The H2 isn't officially priced yet, but industry analysts expect it'll cost well over 100,000 given the advanced specs. It's positioning itself as the high-end research and development platform. Now, here's where it gets really interesting. The H2 can actually do useful stuff.",
        "start": 185.12,
        "duration": 733.3310000000001
    },
    {
        "text": "though some configurations run up to $129,000. The H2 isn't officially priced yet, but industry analysts expect it'll cost well over 100,000 given the advanced specs. It's positioning itself as the high-end research and development platform. Now, here's where it gets really interesting. The H2 can actually do useful stuff. performances and looking cool on a runway. This robot can fold clothes with fingers that grip fabric without crushing it. It can bring items from one room to another while scanning shelves to figure out where things should go. In factory settings, demonstrations showed it weaving wires into panels, stretching its arms to full length while the spine twists into awkward angles that would make a human chiropractor nervous. The only time it's not doing repetitive activities like sorting bins or inspecting production lines is when it's showing off those martial arts moves. This thing is built for repetitive jobs and onboard software logs everything, learning new tasks each time it performs them. But let's keep it real for a second. Is this the future or just another expensive tech demo? Unit's CEO, Wang Singing, is pretty transparent about where things stand. He positions the H2 as a high performance research and commercial platform complementing their lowcost R1 model. But he also admits that humanoid robots still face serious technical limitations delaying mass adoption. Right now, the H2's use cases are mostly developmental and demonstrative. It's showcasing what's possible with human-like dexterity and AI capability, but it's not a finished consumer product you can just buy and bring home. China's robot scene is exploding right now, and Unitry is right there competing with the big players. Boston Dynamics has their Atlas doing back flips and parkour in labs, but Unitry is going for a more accessible price point. The H1 sold for around 90 grand, and rumors say the H2 will be in that same ballpark for bulk orders. With government grants flooding the market to push prototypes into real production, the whole industry is opening up fast. Wang's vision. By 2030, thousands of robot fleets working warehouse shifts that never get tired. jobs that humans take for granted but struggle with because, you know, we're human. So, where does all this leave us? The H2 is a milestone. It's proof that humanoid robots are getting more capable, more humanlike, and more ready for real world applications. Universities and research labs will eat this up for studying bipeedal locomotion, AI perception, and human robot interaction. The high degree of freedom design makes it perfect for manipulation research, way beyond what the G1 can handle. And yeah, it'll make killer demos at trade shows and exhibitions because watching this thing move is genuinely mesmerizing. But for now, this is still early days. The H2 isn't practical for your home. It's expensive, experimental, and untested in domestic settings. Maybe someday we'll have humanoid helpers doing our laundry and cooking dinner, but that's still years away. What we",
        "start": 371.68,
        "duration": 1069.9709999999998
    },
    {
        "text": "because watching this thing move is genuinely mesmerizing. But for now, this is still early days. The H2 isn't practical for your home. It's expensive, experimental, and untested in domestic settings. Maybe someday we'll have humanoid helpers doing our laundry and cooking dinner, but that's still years away. What we humanoid unitry has ever built with 31 joints, 360 new m of torque per joint, and enough AI horsepower to navigate complex environments. It's not perfect, but it's a glimpse of where we're headed. And honestly, that's pretty mind-blowing all by itself. If you think that's crazy, wait until you hear this. Figure AI just changed everything. They just dropped their third generation humanoid robot, Figure03, and forget what you thought you knew about humanoid robots. While Figure 01 was the rough prototype, and Figure 02 proved itself in BMW factories, figure 03 is the pivot point that shifts the entire game. We're talking home first design, built for the messy chaos of your kitchen, your living room, your actual life. Lighter, safer, smarter, covered in soft textiles instead of hard plastic. Extra cameras built right into the hands. Wireless charging through its toes. And this isn't just another tech demo. This is the real deal. Here's what makes this absolutely wild. They've got a full production facility in California ready to manufacture thousands of units with economics that could bring prices down to used car territory. So, buckle up because what's happening in California is about to change everything we know about robots, work, and maybe even your own home. Let's break down how they pulled this off. Let me be crystal clear about what's happening here. Figure 01 was the proof of concept. All exposed wires and clunky first steps. Figure 02 got them into BMW's factory doing real production work. But figure 03, this is the pivot point. The entire design philosophy changed. Home first, general purpose, built for the messy, unpredictable chaos of everyday life. You come home exhausted, dishes piled up, clothes everywhere, and you just tell this thing, \"Clean up the kitchen.\" And it actually does it autonomously. No remote control puppet show. That's the promise. And the engineering suggests they might actually deliver. Here's what Home First actually means in practice. This robot stands 5'6, weighs 132 lb, and it's 9% lighter than Figure02. But that weight drop isn't just about efficiency. It's about safe fat. The exterior is covered in soft textiles instead of hard plastic shells with multi-density foam protecting against pinch points. They're thinking about what happens when your toddler bumps into it or when it accidentally brushes past you in a narrow hallway. The robot can handle household tasks that sound mundane but are robotically brutal. Loading a dishwasher requires recognizing dozens of different dish shapes, grasping them securely without breaking anything, and placing them correctly in the rack. Figure 03 has been demonstrated doing exactly that. Clearing tables, sorting laundry, tidying up living rooms. But here's the",
        "start": 541.44,
        "duration": 1427.892
    },
    {
        "text": "tasks that sound mundane but are robotically brutal. Loading a dishwasher requires recognizing dozens of different dish shapes, grasping them securely without breaking anything, and placing them correctly in the rack. Figure 03 has been demonstrated doing exactly that. Clearing tables, sorting laundry, tidying up living rooms. But here's the approach. By solving for the chaos and variability of domestic environments, Figure is building something genuinely general purpose. Your home throws everything at a robot. Different lighting, cluttered spaces, objects of every shape and size, humans constantly rearranging furniture, pets, kids, spills, you name it. If you can handle a home, you can handle pretty much any environment. Now, let's talk about what shifted figure 03 from prototype to actual product. Because this distinction is massive. Previous humanoid robots including figure zone earlier versions were essentially engineering prototypes, expensive, time-conuming to build, designed to prove concepts rather than scale production. Figure 03 flips that script completely. Every single component was redesigned with manufacturability and cost in mind. And here's where it gets real. Figureu built Bot Q, their dedicated manufacturing facility in California. This isn't a lab. It's a production line capable of turnurning out up to 12,000 humanoid robots per year initially scaling to 100,000 total units over 4 years. They've got state-of-the-art systems and a custom manufacturing execution system tracking every subasssembly with full traceability. The pricing implications are staggering even though Figure hasn't announced consumer prices yet. When you cut component costs by 90% and establish high volume production, the economics transform completely. Tesla's targeting around $20,000 for Optimus. Figures production approach suggests they could hit similar price points once volumes ramp. We're talking about a humanoid robot potentially costing less than a decent used car within a few years. That's the inflection point where adoption explodes. For home use, the applications span everything from routine chores to elder care assistance. Commercial applications benefit enormously from the home focused improvements, too. The advanced vision system, tactile sensing, and AI reasoning that enable delicate dishwasher loading also allow precise handling of small sheet metal parts or deformable polyags in factories. The spatial memory that helps the robot remember where you keep the coffee mugs also helps it navigate warehouse layouts and remember inventory locations. Every capability is multiplicative across use cases. Now, here's a feature that sounds small but is absolutely game-changing. Inductive toe charging. Figure03 has wireless charging coils built right into its feet. It just steps onto a charging mat and draws 2 kW of power. No cables, no manual plugging in, no fumbling with connectors. Think about the implications. The robot can autonomously manage its own power throughout the day. Battery running low? It walks to the charging station, docks itself, tops up, and gets back to work. In a home setting, it could have a designated charging spot in your utility closet. In a warehouse, multiple charging pads could be scattered around so robots recharge during natural breaks and",
        "start": 723.04,
        "duration": 1802.5299999999995
    },
    {
        "text": "Battery running low? It walks to the charging station, docks itself, tops up, and gets back to work. In a home setting, it could have a designated charging spot in your utility closet. In a warehouse, multiple charging pads could be scattered around so robots recharge during natural breaks and what they did with the hands. Figure 03's hands have 16 degrees of freedom each, meaning the fingers and thumb can move with near human dexterity. But Figure went way beyond just articulation. They developed first generation in-house tactile sensors for the fingertips capable of detecting forces as small as 3 g of pressure. That's the weight of a paperclip resting on your finger. This precision allows the robot to distinguish between a secure grip and an impending slip before the object drops. It can grasp fragile items like wine glasses, handle irregular shapes like crumpled clothing, or manipulate moving objects by constantly adjusting grip pressure based on tactile feedback. But here's where it gets absolutely wild. Each hand has an embedded camera built right into the palm. Why does this matter? When you're reaching into a dark cabinet or working in confined spaces, the main head-mounted cameras might be blocked. That palm camera provides redundant close-range visual feedback during grasps. The robot maintains visual awareness even when its primary vision is oluded. It can see what it's touching, adjust, and execute manipulation tasks with way more precision and confidence. This is hand eye coordination at a level that previous humanoids couldn't achieve. The fingertips themselves are softer and more adaptive, increasing surface contact area for more stable grasps across varied object shapes and sizes. Combined with the tactile sensing and palm vision, figure 03's hands represent a major leap in compliant manipulation. This isn't just about gripping harder. It's about gripping smarter. Adapting to the object, sensing what's happening at contact points, adjusting continuously. That's what enables delicate tasks like handling utensils, folding fabric, or assembling small components. Now, let's talk about the fabric wrapped body and colorways because this is where engineering meets psychology. Figure03 ditched hard machine plastic exteriors in favor of soft textile coverings. The robot feels less intimidating, more approachable, safer to be around. Those soft goods are fully washable and can be removed or replaced without tools. You can literally just swap out the robot's clothing for quick cleaning or style changes. The color strategy is brilliant. Darker tones and blacks for work environments, making the robot look professional and industrial appropriate. lighter grays and creams for home use, creating a softer, friendlier aesthetic that fits domestic spaces. You can even customize with various clothing options, including cutresistant and durable materials for harsh work environments. Commercial customers could design distinct uniforms for their robot fleets, matching company branding. Hotels could have robots in bellhop outfits, hospitals and scrubs, warehouses in high visibility vests. This isn't superficial. The fabric exterior with strategic multi-density foam padding protects humans from pinch",
        "start": 912.079,
        "duration": 2167.4910000000004
    },
    {
        "text": "and durable materials for harsh work environments. Commercial customers could design distinct uniforms for their robot fleets, matching company branding. Hotels could have robots in bellhop outfits, hospitals and scrubs, warehouses in high visibility vests. This isn't superficial. The fabric exterior with strategic multi-density foam padding protects humans from pinch accidentally bumps you, you're hitting soft textile and foam, not rigid metal. And psychologically, appearance matters when you're trying to get people comfortable with a humanoid in their homes. A sleek fabriccovered robot that comes in calming colors is way less scary than an industrial metal skeleton. Figure understands that adoption hinges on trust and trust starts with design choices that prioritize human comfort. So what about manufacturing and supply chain at scale? Because hardware is where robotics companies live or die. Figure established an entirely new manufacturing process purpose-built for humanoid production. They identified and partnered with suppliers globally capable of meeting absurd volume requirements under aggressive timelines with strict quality standards. For critical modules like actuators, batteries, and sensors, they went vertical, designing and building everything in-house to maintain control over iteration speed and quality. The shift from custom CNC machining to toolled processes required massive upfront investment in diecasting molds, injection molding tools, and stamping equipment. But the payoff is dramatic. Each figure03 unit costs substantially less to build than figure 02. With economics improving as volume grows, they've essentially created the manufacturing playbook that didn't exist for humanoid robots. Bot Q facility in California is equipped with digital integrations and a custom manufacturing execution system ensuring every subasssembly passes through with full traceability, quality control, repeatability, continuous improvement, all baked into the production process. The timeline they're targeting is aggressive but grounded in real progress. Figure 03 is being made available to select commercial partners throughout 2025 for testing and data collection. They're refining capabilities in real world settings, identifying edge cases, improving reliability. By 2026, they expect to push toward broader deployment, including home pilot programs. The goal is reaching 100,000 total robots produced over the next four years from bot Q alone. That's not speculative. That's capacity they've built and are actively ramping.",
        "start": 1096.72,
        "duration": 2441.251000000004
    }
]