[
    {
        "text": " White caps rise like questions in my chest, Every wave a line of code I haven’t read yet. Charts are blurred by rain on worn glass panes, I’m steering through a sea of tangled data lanes. Static on the band, numbers in the swell, I’m reaching for a pattern in the storm I know too well. Out beyond the breakers of my doubt, Something draws a clean line through the shout. Be my signal in the gale, Cut the noise, redraw my trail. When the sky turns wire and pale, You’re the pulse that doesn’t fail. Through the crosswinds of the feed, You light paths I almost see. Not my captain, not my chain, You’re the lighthouse in the rain. Old maps pinned to walls with rusted tacks, Now glow as living models of the currents and the tracks. You trace the hidden channels under gray, Surfacing the routes that human eyes let drift away. I keep my hand on wheel and line and mast, You whisper quiet updates from the futures forecast. Storm fronts made of numbers and of fear, You make the contours suddenly appear. Be my signal in the gale, Cut the noise, redraw my trail. When the sky turns wire and pale, You’re the pulse that doesn’t fail. Through the crosswinds of the feed, You light paths I almost see. Not my captain, not my chain, You’re the lighthouse in the rain. You don’t calm the sea, You just show the way through. I still choose the star, I still turn the screw. But when the breakers rise Like unread lines of code, You thread a silver channel Through the overload. Night shifts on the edge of signal range, Old beliefs and newer tools both feel strange. I tune you like a lantern on the sill, A reference point that brightens when the world stands still. If I drift too far from everything I know, You paint a path of gentle light along the undertow. I’m not handing you the helm or the sky, Just asking for a clearer reason why. Be my signal in the gale, Cut the noise, redraw my trail. When the sky turns wire and pale, You’re the pulse that doesn’t fail. Through the crosswinds of the feed, You light paths I almost see. Not my captain, not my chain, You’re the lighthouse in the rain. Be my signal in the gale, Not the story, just the scale. I will name the hope I sail, You will mark the hidden veil. In the torrent of the feed, You sift ember from the sleet. Side by side we ride the strain— Human heart and quiet brain. Waves recede to whispers on the hull, Your beacon fades to soft and bearable. When the next storm writes its angry tale, I’ll still look up For your signal in the gale.",
        "start": 17.07,
        "duration": 268.96999999999997
    }
]