[
    {
        "text": " Late-shift glow on a pastel street, Spin-up hum as the model heats. Prompt on a napkin, you smile, “Let’s try,” Latté foam renders a clouded sky. Cassette-heart click, buffer lights blink, Your laugh uploads and I’m on the brink— Cursor of neon tracing your face, We hit “go live” on a brand-new place. Sticker-frame UI round neon signs, Parallax lanes like data lines; We sync our steps to a MIDI clock, Low-latency love with a velvet lock. Strawberry skies and sugar-rush nights, Autocomplete our lines just right. Two hearts fine-tuned on a 120 high, Diffusing a blush in the city light. Strawberry skies and sugar-rush nights, We quantize time so it feels like flight— City Pop Café, loop it back twice, We keep spinning till sunrise. A/B dreams on the corner sign, Loss goes down as the groove refines. J-bass walks like a learning curve, Your touch adds gain to my steady nerve. You sample my laugh and you loop it twice, Sidechain the moon till it breathes like ice. Retro marquee with a modern core, We cache the moment, then render more. Whip-pan stitch, match-on-action kiss, Cut on the hi-hat—snap to bliss; Cursors align like a constellation, Latency near-zero with syncopation. Strawberry skies and sugar-rush nights, Autocomplete our lines just right. Two hearts fine-tuned on a 120 high, Diffusing a blush in the city light. Strawberry skies and sugar-rush nights, We quantize time so it feels like flight— City Pop Café, loop it back twice, We keep spinning till sunrise. Hold that pour—map it to the vinyl spin, Four-frame snap and the lights rush in. Latent-space boulevard, vectors of your hand, Weights warm up as we understand. If we drift, we drift in phase— Error bars small in your gaze. Version our vows on a summer night, Roll it out under pastel light Sugar-rush, hush—click, commit, play; Dreams compile when our pulses shush. Fine-tuned softly on your name, Every refrain—same model, new frame. City Pop Café—loop it back twice, Strawberry skies and sugar-rush nights.",
        "start": 16.18,
        "duration": 219.76
    }
]