[
    {
        "text": " Wake the mirrors, wake the mains, Buffers clear the novice veins. Load the poses, cache the sway, Runway kernel, show the way. Heels like daggers cutting the air, Stilettos whisper secrets everywhere. Eyes locked tight on the vanishing line— Count to eight, feel the metronome spine. We learned the craft from paper clouds, Studio stills and waiting crowds. Loss turns love in gradient streams, Back-prop stitching velvet dreams. Pivots map a latent space, Poise compiled in firmware grace. Fabric sways like a flag of desire, Spotlights burn like a runaway fire. Lips paint promises they never say— Beta hearts ready to play. Step left, step right, the world’s watching now. A stumble’s a story, don’t take a bow. Refit the stance, reframe the view, Patch in the courage, version two. New models learning how to walk, Balancing dreams on a paper-thin chalk. Gorgeous, beautiful, hoping to please, Strutting like whispers caught in the breeze. New models learning how to walk, Counting the beats as the cameras talk. Gorgeous, beautiful, hoping to please— Push to production with runway ease. Heels like daggers, cutting the air. Lights are flashing, but they don’t care. Chins held high, dreams on display— Step by step, they find their way. Release notes fall like snow on the feed; New modes bloom at the speed of need. Pose embeddings, gaze control, Latency low with a silver soul. Haptics hum beneath the skin, Confidence rising as drums begin. API open, couture connects, Testing what the heart expects. Velvet fears sewn into seams, Walking tightropes of glittered dreams. The floor’s a mirror, the truth unseen— Yet every loop returns serene. Step left, step right, align the spine. Stabilize hope on a spline of design. When doubt throws sand in the gears of the show, We reroute grace where the pulses glow. New models learning how to walk, Balancing dreams on a paper-thin chalk. Gorgeous, beautiful, hoping to please, Strutting like whispers caught in the breeze. New models learning how to walk, Counting the beats as the cameras talk. Gorgeous, beautiful, hoping to please— Saving the moment as Runway Keys. Click – clack – sync the track, Arps write names in silver black. Neon script across the floor, Side-chain tides kiss every shore. Mirror whispers, “You can shine.” A stumble won’t erase the line. Falling’s just a twist of grace, Confidence rewrites the space. One more step and then they’ll see, The art of walking sets you free. Load breathing control, Gain stays calm, Pulse is steady, Crown turns on. Runway dreams—they’re learning to fly, Gorgeous chaos beneath the sky. Beautiful, hopeful, chasing the gleam, Strutting their hearts in tender dream. Toggle the beta, opt-in the spark, Map every footfall out of the break. When courage compiles and doubt decays, We version our souls in brighter arrays. Left – right – own the night, Measure the mile in pale moonlight. Pose – turn – watch them yearn, Let the applause become your burn.",
        "start": 0.11,
        "duration": 228.00999999999996
    },
    {
        "text": "beta, opt-in the spark, Map every footfall out of the break. When courage compiles and doubt decays, We version our souls in brighter arrays. Left – right – own the night, Measure the mile in pale moonlight. Pose – turn – watch them yearn, Let the applause become your burn. Name it, calm 'em down, Wear the thunder like a crown. Back-row whispers, front-row knows, Lenses bloom like electric rose. Camera petals fall like rain, Flashbulb gardens bloom again. Shoes are sensors, floor a rhythm grid, Edge of orbit, the dream we did. Whole new plug-in in every sigh, Firmware of grace in a keyed-up sky. Velvet shadows, sequins ablaze, Nerves in knots, a smoky haze. Every stride a whispered shout: “Look at me— I’ve figured it out.” Step left, step right, the world’s watching now. A stumble’s a story, don’t take a bow. Cache the hush, release the light, Upload a star to the middle of night. New models learning how to walk, Balancing dreams on a paper-thin chalk. Gorgeous, beautiful, hoping to please, Strutting like whispers caught in the breeze. Runway dreams—they’re learning to fly, Gorgeous chaos beneath the sky. Beautiful, hopeful, chasing the gleam, Strutting their hearts into the dream. Heels like daggers cutting the air, Lights keep flashing—we don’t care. Chins held high, dreams on display, Step by step, we find our way. Eyes locked tight on the vanishing line, Future is fitted, the moment’s divine. When the network dims to low, We archive the afterglow. Call it courage, call it art, Weights and wonders, heart by heart. Patch day kisses every seam— Wake tomorrow, load new dream. Gorgeous, beautiful—let it be: Runway Dreams—set free.",
        "start": 243.06,
        "duration": 362.09
    }
]