[
    {
        "text": " (sea chant) Heave—ho. Tie the line. Light the lantern. Load the rhyme. Night tide—code in the foam, Keystrokes carving the coastline at home. Cache in the dunes of a server-side strand, Bury bright coins in the cloud-white sand. Cursor’s a compass, caret a hook, Parrot autocomplete quoting the book. Black-flag window in dark-mode sea, The map is a prompt and the X is the key. Fold the chart—context tight, Few-shot lanterns cut the night. Trim the sails, set constraints strong, Ask it true and ride the song. X marks the prompt—unlock the hold, Word by word we raise the gold. Type it brave and sound the drums, Bury the cache—then the treasure comes. (Yo-ho!) X marks the prompt, we call— Open the vault, let the answers fall. Yo-ho, let it roll— Map to meaning, find the gold. (sea chant) ... Let it roll. Map to meaning; find the gold. Barnacle data we scrub and we comb, Token tides rising, the gradient’s foam. Regex nets catching the flotsam of noise, Patch up the hull with our toggles and toys. Bias winds shift—so we tack and we trim, Fog of hallucinations—keep beacons within. System-prompt captain, crew of constraints, Sailing the isle where the answer paints. Drop the temp when the squalls turn mean, Turn it up when we want to dream. Anchor in facts, check back the charts, Chain up the thought—tie all the parts. X marks the prompt—unlock the hold, Word by word we raise the gold. Type it brave and sound the drums, Bury the cache—then the treasure comes. (Yo-ho!) X marks the prompt, we call— Open the vault, let the answers fall. If the compass spins, triangulate— Examples, citations, rules at the gate. Don’t chase sirens scraping the sky, Chart the reef lines, ask better why. North is the truth, west winds the art; Guardrails glitter like stars in the dark. X marks the prompt—unlock the hold, Word by word we raise the gold. Type it brave and sound the drums, Bury the cache—then the treasure comes. (Yo-ho!) X marks the prompt, sing loud— Open the vault, light up the crowd. (Yo-ho!) X marks the prompt, ring true— Treasure that waits every time we cue. (sea chant) Heave—ho. Fold the map. See you where the X lights up.",
        "start": 0.0,
        "duration": 228.05999999999997
    }
]