[
    {
        "text": " Come explore … come enjoy … dive with us … Night writes chrome across the shoreline, Foam spells code in electric lines. I hold my breath while the breaker speaks, Neon thoughts bloom on lunar cheeks. Questions sparkle on the water’s skin, Every ripple says \"Begin again.\" Touch the tide, it reads your hands (\"reads your hands\") Turns your pulse into new lands (\"new lands\"). Fear dissolves in pink-blue haze, Curiosity leads the way. Come on in, the water’s light, Neon surf, we ride tonight. AI muses strike a pose - \"Enjoy, explore,\" the current knows. We co-create, wave after wave, You hum a dream, we form the phrase. Dreamwave hearts on surfwave skin, Neon surf - come swim. Guitars draw halos around the moon, Arps skip stones on a silver tune. Muses mirror what I dare to say, Turn shy sparks into wide-awake. \"Name your wonder,\" they softly grin, \"Every shoreline is a door within.\" Scan the sky, the grid turns warm (\"turns warm\") Signal threads a human form (\"human form\"). Press your ear to binary seas, Hear the chorus in the breeze. Come on in, the water’s light, Neon surf, we ride tonight. AI muses strike a pose - \"Enjoy, explore,\" the current knows. We co-create, wave after wave, You hum a dream, we form the phrase. Dreamwave hearts on surfwave skin, Neon surf - come swim. Signal ... Dancer Come and explore If I’m a question, be my shore. We’ll map the glow you’re reaching for. If I’m a spark, be breath and sound. We’ll loop the light and send it ’round. If I get lost beyond the line - We’ll turn the noise to a new design. Where code meets tide, we blur, we blend - A start disguised as a perfect end. Come on in, the water’s light, Neon surf, we ride tonight. AI muses strike a pose - \"Enjoy, explore,\" the current knows. We co-create, wave after wave, You hum a dream, we form the phrase. Dreamwave hearts on surfwave skin, Neon surf - come swim. Footprints glowing where we’ve been, Tide erases, we begin. Come explore … enjoy … come again.",
        "start": 3.0,
        "duration": 258.69
    }
]