[
    {
        "text": " Sun up, laces tied, the pavement waking, Headphones hum, a quiet engine making. Warm up steps, then cadence finds the line— Every stride a note in time. Count it in—one, two—steady now, Three, four—feel the breath allow. Signals rise, and we align, Body learns, the mind refines. Kinetic signals—move with me, Run the rhythm, set it free. Every step, we fine-tune light, Iterate into the bright. Kinetic signals—heart in time, Pulse and pattern, you and I. Breathe it in and let it go— We get stronger as we flow. Jog to glide, brisk walking through the city, Sun on glass and shadows turning pretty. Chain on gears, the bicycle sings low— Round and round, the circles grow. Count it in—one, two—hold the form, Three, four—find your moving norm. Listen close, the feedback true, Every mile is learning too. Kinetic signals—move with me, Run the rhythm, set it free. Every step, we fine-tune light, Iterate into the bright. Kinetic signals—heart in time, Pulse and pattern, you and I. Breathe it in and let it go— We get stronger as we flow. Mat unrolled, the morning turns to stillness, Hands to heart, a gentle, grateful fullness. Lengthen, fold, then open like the sky— Balance whispers how to try. Count it in—one, two—soft and long, Three, four—let the air be song. Hold the shape, release the fight, Find your center, find your light. Kinetic signals—move with me, Run the rhythm, set it free. Every step, we fine-tune light, Iterate into the bright. Kinetic signals—heart in time, Pulse and pattern, you and I. Breathe it in and let it go— We get stronger as we flow. Rest is data, healing is design, Reset systems, then we climb. Small improvements, day by day, Training loops that light the way. Kinetic signals—move with me, Run the rhythm, set it free. Every step, we fine-tune light, Iterate into the bright. Kinetic signals—heart in time, Pulse and pattern, you and I. Breathe it in and let it go— We get stronger as we flow. Shoes by the door, the heartbeat slow— Today we learned; tomorrow, go. Kinetic signals fade to blue— Still in motion, me and you.",
        "start": 11.13,
        "duration": 288.239
    }
]