[
    {
        "text": " And we continue from a branch to a mobile app. From the risk model to the customer dialogue, AI is changing the entire money route. When this is said by a person with over 40 industry awards and more than 700 publications about technologies, you're supposed to applaud right now. More than 700 publications about technology, including AI. We have no doubt. Our next speaker will talk about implementation practices, measurable effects, and safety rules. President of the AI society and executive adviser of AI of his highness shake Naser AI research and development center Jasim with a report on AI in banking and finance. Hi good afternoon. this is my second year here. Last year I came and I was talking about AI in the industry and today we will be talking about AI in the business and specifically in the financial sector and the banking how this is evolving in the world the biggest industry is using AI so let's forget everything else that was done in the past and look how this is moving forward [snorts] the pillars of AI as you know it's not the infrastructure is the algorithms is the data and is our infrastructure that's why we have $5 trillion company like Nvidia making chips to train the data and then between the five top technology companies there is a $15 trillion worth of assets this is all to train our large language models and and nobody's coming near them. I mean you look at Nvidia, they are using u 90% of the market the the the the return on investment is growing but at the same times there are other techniques that we are using less and less the GPU. So, so let's look at the key types of data in the banking. First of all, if we look at the the banking data because we rely a lot on the on the banking on the historical data and the competitions. [snorts] So part of it is the fundamental company data is your earnings is your income that's done for the inside work. But when you go outside you need the environmental, you need the alternative data and you need sentiment data, customers behavior. You can't get those things for nothing. Their competitors are there. Your public data are very limited. So you need a lot of data related to the customers to the consu consumers nationally, internationally. This is the biggest challenge that the banks are facing today and in the future. So that's why we see a lot of gateway companies like Google Pay, Apple Pay and others. Maybe you have others in Russia. They're monetizing the data. The money that they generate from selling the customers data of course the mask data is more than the earnings that they do sometimes. So more the banks are relying on their business and the more they focus on the data and how to acquire the data. So some of it they",
        "start": 9.519,
        "duration": 418.08300000000014
    },
    {
        "text": "that they generate from selling the customers data of course the mask data is more than the earnings that they do sometimes. So more the banks are relying on their business and the more they focus on the data and how to acquire the data. So some of it they agreements. So on the other side what are the algorithms that we use to enhance those datas that we have from the predictiveness to the risk fraud detection to optimizations you know the predictive is taking over a lot of banking facilities and I'll show in a minute how the banks are getting disillusioned you you don't need a lot of people to be sitting there but also on the other side you have the risk you have the fraud And you have the challenges that are coming up today. We'll be talking about it. It takes every bank six to eight an average bank six to eight employees to do a fraud management. And it takes them over maybe three to four months to find out the final product. Once you do that, it's too late to get your money back. But with AI we have discovered that we can achieve the same things within three to four hours. Now we'll go to that one. So what what is the evolution of technology in in banking sector? So it started with robotic processing automations which is facilitating the back office activities you know this repeated repeated task it it is more to do with administration. And then we have the maturity of the RPA where it goes and looks for the invoices for the contracts and does the comparison. And then we have the generative AI when the chat GPT came out in November 22. But still that is prompted by human we have a lot of human interactions with that. So where are we going? This is the end AI agents and agentic AI where we're getting to a stage where we don't need people in the banking. This is the autonomous part and I'll be explaining that in a minute. So we start with RPA. This is how the high level automation the manual work is done. Lot of people in the banking and the business are doing repetitive jobs and we want to get rid of those jobs. So 60% of them may be achieved by RPA. RPA is not very intelligent. It's a repetitive task. It does what we tell them. But lot of tasks need to be done that way. You know it it it uses OCR, natural language processing. It uses lot of audit ready. You have to be ready for the auditors today. And I'll explain to it. You know how many% the auditors take from the banking sectors? A sample only 5%. 5% of the document is being audited. 95% is not because they don't have enough time. They don't have enough resources to audit everything. So they choose just",
        "start": 229.76,
        "duration": 749.6820000000001
    },
    {
        "text": "auditors today. And I'll explain to it. You know how many% the auditors take from the banking sectors? A sample only 5%. 5% of the document is being audited. 95% is not because they don't have enough time. They don't have enough resources to audit everything. So they choose just frauds hidden within that vicinity of 95%. So if you take 95% of few billion then you'll find out there are a lot of risks hidden there. So we try to through AI increase the percentage of the audit or the sampling from 5 to 95% and this is something I personally have been able to do in in the audit firm. So what is next? Next is came up with gen AI as I said earlier you know I started with the chbt3 to four to to five the competitors and this really helped a lot of personalization in the in the banking lot of content creation but still the data that's been trained is on the public so you have lot of and accuracy on that and the prompting is done by the human still you know you go and prompt on a generative AI on Chad GPT on Gemini on KK from Alibaba on on other ones on Deep Seek. So the the art of prompting varies from the expertise to non-expertise and how you get the information and how much you can rely on the information. It may be as good as what it is but this is changing now to something more of AI agents. Now what is AI agents? I mean you hear a lot of them. The AI agents is instead of you prompt we create an agent within the organization multiple agents. Each agent has steps to pro to to to follow. It has tools. It has lot of autonomy to focus on. So what are the ones that we can use in the banking? For instance, you have an agent just for your customers to look at what are the requirements and the agent has the authority to go and collect any data whether it's a PDF data or readym made data from the customers to be able to keep them. Then you have another agent looking at the security is looking at what is it called the maybe the risks the fraud because the risk is a big part of what the customer wants to invest in. The customers don't want anymore to be just telling them this is your balance and what you can do and how you can extract. They want to know what are the historical data that you have collected, what is your trends, where you've been spending it, how you should spend it in future and they don't need to go other places. That's why in the banks now you cannot own the the customer's data anymore. You need an API. So if I have an account in three",
        "start": 397.199,
        "duration": 1086.722
    },
    {
        "text": "what is your trends, where you've been spending it, how you should spend it in future and they don't need to go other places. That's why in the banks now you cannot own the the customer's data anymore. You need an API. So if I have an account in three or three agents for each account to be talking to each other. I don't want an analysis from one place and another. So that's why we have an agent for everybody. But beyond all that is the mastermind and the autonomous work where we have excuse me the agentic AI. The agentic AI looks at everything above the agent. So it looks at all the agents and it decides autonomously before just without referring to the banker and takes decisions. This is the mastermind. So each agents it has its own environment. It has its own decisions where it refers to the agentic AI and that one has its own path. What we have recently done also to what is called agentic rag. Agentic rag is also another step where continuously looks for the variations changes the updates in the market and it sends them to the agents. So imagine when you have an investment firm or you have an investment with the continuous updates from each agent and from the rag you'll be able to keep up with the timings of the markets closing in Tokyo and starting in in US and be able to manage your investment. So this investment where the bankers have an experience of many years and they cannot pass it with the maturity the agentic AI can be your man. But the condition here is that you have to get rid of the people and this is the fact because the more people you have replicating what the agentic AI is doing it will be like toppling in front of your feet. So that duplication it becomes very dangerous. So that's why people have decisions. So how the banks in future will look like like this. This is the banks of the future. You can't just put an AI in one part of it and then decide that the rest I'll be doing later. No, you can't do that because once you created the designs on the AI on the APIs then you try to create in few months time other facilities for instance you haven't done credit decision making or credit worth worthiness creditworthiness is about the lenders how much they do and there's a lot of questions on the you know ethical parts of it are you targeting people are you biased are you not but but you need to be doing this and then try to plug in which part AI will be penetrating. So this is the banks of the future and it starts from the operational models where you have the platform you have the the talent strategy to the core technology and data. This is your core systems",
        "start": 568.24,
        "duration": 1438.0829999999999
    },
    {
        "text": "this and then try to plug in which part AI will be penetrating. So this is the banks of the future and it starts from the operational models where you have the platform you have the the talent strategy to the core technology and data. This is your core systems different than others. They don't rely on ERPs on on normal generated systems. What aentic AI will do also in this case it will use gen AI to create commands the commands I mean prompts autonomously to the chat GPT to Gemini it decides which one it needs and it will create so it doesn't need people going and typing a questions or asking for an explanation this work is taken out of the people and agentic AI or agentic rag will be implementing that so so Then you get to the to the the most important part to the the decision making. How you make the decisions, how you do credit decisions, how do you do fraud detections on the high level because the fraud becomes our biggest enemy in term of AI. So there is less reliance on that. So that those banks are now called new banks. Neo not ne. So these are the banks where we don't need people. There are no boundaries. It's not digitalization. It's not an app that you have on your mobile that you start using it to transfer money because that's that's really brainless. There is no intelligent in that anymore. You continuously do actually do more dis mistakes with mobile apps than what you were doing earlier with the manual work because ma mobile app is is so probably available that you try to make rash decisions without referring to the analysis in the back end. So there are more problems but with the AI and agentic AI which is the future I think from 2025 this is what we said we said we don't need to rely on those anymore we need to take decisions ourselves and these are the part of the conversational intelligence that new banks will do most of the countries from 8 to 10% of the banks are created and move to new banks but I think in the next five to six weeks that will be more than 50% of the banking or the investment firms because don't forget the investment firms the insurance are also in the some part so so what are the elements of those one is the customer service virtual assistance now I haven't personally seen a lot of customer virtual assistants in the banking that really triggered my eyes you know you don't want for instance another conversational or virtual assistants to greet you and ask you what is your problem and it says well I logged it and somebody will be calling you. That's not how it should work. The virtual assistant it should be able to take you through the whole journey through",
        "start": 748.56,
        "duration": 1781.6029999999998
    },
    {
        "text": "instance another conversational or virtual assistants to greet you and ask you what is your problem and it says well I logged it and somebody will be calling you. That's not how it should work. The virtual assistant it should be able to take you through the whole journey through problem. It should be able to make decisions. It should be able to credit you at the same time. It should be able to advise you to to close your accounts. This is where we want the customer services. And don't forget this becomes part of the bigger banking that I shown you the future of the banking. If you continue with what the current customer service virtual assistance it will be very limited and still you need human to interact with that. The credit scoring or the credit worthiness in the banking sector there are two different parts. how they provide you with credit cards or in the creditworthiness loans for the lenders today is done through a lengthy process through your background check. A lot of banks they get it wrong as well and they don't get their money back and they get to the courts and maybe the periods are gone. Don't forget there are two types of loans there is one is a short-term and a long-term. The short-term ones you need to make faster decision. The long-term ones that are related to investment and land and buying cars, it requires your behavior. You know, it requires your spending habits, your environmental, your history, and that's not easy to get. But with AI, with the agents, if you create an agent for each person, [snorts] you will be able to look at the models to generate proactive offers to people or to limited people. You can't just go and say I have an offer in the bank for you know 3% interest for everybody because then you spend 70% of the time trying to say no to the people who are not eligible but if you have the intelligent behind your customers or p or proposed customer it doesn't have to be your customers on how you retain your customers and acquire other customers with the AI intelligence that goes into the credit scoring Anas say there to maintain the approval rates while cutting the default by 75% on the credit scoring. Now fraud detection as I said a lot of our times or the banking times are spent on the frauds and the frauds can be related to the data that is received or it could be to the security. Now historically it shows the banks have not been able to protect the bankers from the fraud management and and part of it that they don't tell you is when you don't get your interest rate goes down because they have not been able to detect the frauds and the bank has been suffering from some of the biggest",
        "start": 922.0,
        "duration": 2120.0040000000004
    },
    {
        "text": "able to protect the bankers from the fraud management and and part of it that they don't tell you is when you don't get your interest rate goes down because they have not been able to detect the frauds and the bank has been suffering from some of the biggest who pays the who pays the price is the people who have their money in the bank. So the fraud management is not for the banks, it's for the people and it should be also intelligent enough in future to be able to give a fraud management for each person and I'll talk about it if there is a time and an investment in banking. This is a very very very important I generated fraud man investment. No one's today wants to invest based on their own knowledge or the friends or the advisers or what's in the internet. You need a customized investment framework. You need an agent that understands your investment, your habits and the risk that you want to take to be able to do investment. So there is no oneshot investment for everybody. It doesn't work like that. Same thing in the cyber security. Cyber security is by far now out of the hacker's hands. There are cyber criminals that have been out of job because AI is creating the cyber attacks. So who's going to defend your network, your interest, is it human anymore? No, forget it. They are too slow, too far to be able to do. So we need an AI on the defense to be able to detect the attacks, etc. And AI and regulations and compliance. I think the the central banks are too slow, too legal, to write lot of these regulations and policies to protect or also to be able to provide banks with AI regulations. The fintech is not getting anywhere and blockchain has the same thing. So you need an AI to be able to stay competitors. The customers need each your own generative AI. You don't need the general public data trained for your bit. You need the data related to you that is trained is very customized to you. Your own chat GPT that when it goes to it, it has all your information from the childhood until now your family. So, so when you converse with it, it comes back to you and of course the challenge is it becomes very complex. the legacy infrastructure slowess. You need to move on the investment and the strategy. It cannot be done just pockets. But the banks need to be part of it. If they don't lead it today, tomorrow they'll forget it. And part of it is the ethics and the ethical values that I know everybody talking about it. It's too slow to keep up with AI. Maybe AI can generate his own. [snorts] So, , thank you for listening to me and if there are any questions,",
        "start": 1094.0,
        "duration": 2443.523000000002
    },
    {
        "text": "they'll forget it. And part of it is the ethics and the ethical values that I know everybody talking about it. It's too slow to keep up with AI. Maybe AI can generate his own. [snorts] So, , thank you for listening to me and if there are any questions, Thank you Dr. Hassim Khaji. Thank you. Thank you for sharing your experience. Thank you. Thank you very much. [music]",
        "start": 1257.919,
        "duration": 2463.121000000002
    }
]