[
    {
        "text": " Well, shall we begin? If you want to see tomorrow, ask those who are building it today. We are literally talking with the future of world science. Four young scientists, three countries, Russia, India, and China. Right now they will talk about new ideas, engineering, creativity and skills that will actually be useful. Welcome the participants of the session. The new generation of artificial intelligence, silver medalist of IO AI 2024. Shellen Paradia, winner of AI Challenge 2021, founder and CEO of Brainwave ML. Denise Ding Muhamemedov, gold medalist of IO AI 2025, student of the computer science department at HSE University. Zun Yang Dwan, silver medalist of IO AI 2025 and the session moderator, vice president, director of AI and ML technology development blog at spare, Maxim Yuringa. Good morning. Good morning everyone. It is my great pleasure to welcome all of the participants of this conference. Today we are wrapping up this conference with this day that is going to discuss the development of AI in science and fundamental research. Before we go to the discussion and panel discussion with our participants sorry I don't have the clicker I think. Anyway, I wanted to show you a couple of pictures. I'm going to use voice command. We have a voice readiness technology implemented. Anyway, the first picture I think you have seen it. It is a recent report of Microsoft report in terms of they're talking about the speed of the penetration of AI technologies in mass large scale use as Microsoft shows AI technologies. I mean if you start with chat GPT of November 2022 AI technologist just had to go through three years of journey to get a an audience of 3 billion people and this penetration level that you see on the slide on this one yeah it's 20% that means it is also compared with electricity with electrification and the internet and mobile phones. And as you can see, the similar level of penetration required decades for the previous technologies. AI just needed three years. Skeptics would say that the term AI appeared more than 70 years ago. But the ubiquitous use of AI and large scale implementation of AI before the end of 2010s like somewhere in 2019 no one was talking about AI and in its active implementation and this is the first idea that I wanted to mention before the start of our panel. The second idea is the role of the young people. Here you have the diagram of chat GPT use and as you can see that during summer vacation the number of users go down almost threefold that testifies to the fact that this service the use of the LLM models big models is especially popular among young people who are studying in schools and universities. In this relation, I'm we're going to discuss one item on the agenda and meaning how to actually use the technology to develop our skills including cognitive skills and maybe another idea",
        "start": 8.48,
        "duration": 487.96200000000005
    },
    {
        "text": "the LLM models big models is especially popular among young people who are studying in schools and universities. In this relation, I'm we're going to discuss one item on the agenda and meaning how to actually use the technology to develop our skills including cognitive skills and maybe another idea is that we have two diagrams here. at the lower diagram is a kind of a forecast in terms of the number of scientific articles that are going to be published at the top conferences if the dynamics as we have now remains in place. On the other hand, the majority of the the significant part of the articles are are going to be written by and authored by the generative AI and we see the first articles appear. I think that with one of our scientists, we had a discussion in terms of when the first article that is going to be fully generated by AI is going to be authored and some people said in 5 years but actually I think the first article appeared in 2025. if it was fully generated by AI, the scientific article. And when we will have the last article that was authored by a human that didn't use AI and you know that's a good question. I mean if you make a projection for 2030 there is an opinion that around 1 million articles per year are going to be written and published by AI. The question is whether you can digest being a human all these number of articles without AI and the place of AI in the cutting edge scientific research. What will it be? Now moving to our main panel discussion. I wanted to quickly introduce everyone. All of the panelists are the young people who achieved great results on the global scale. They're all winners of international contests and international Olympiads. and the winners silver medalists. I mean on a global scale having gold or silver or even bronze means that you're one of the best in this area because they're not just using AI, they are contributing to the AI's development and a huge contribution is delivered. It's not a PR hype when the young bright people of the working in huge corporations for these people other other companies want to hunt them and pay them millions like with the footballers. So I would like English to avoid some miscommunication of the translation. So our first panelist is Tunan Dwan. He is a silver winner of international Olympiad on AI initiator of the AI science team cup. So a couple of days ago here in Moscow at the first day of the conference the president of the Russian Federation Vladimir Putin addressed the very important question. So how should we use the AI in educational process in the way that will avoid us to to decrease or impair the cognitive skills of kids of teenagers and so on but in the way that will help or assist",
        "start": 285.84,
        "duration": 936.2030000000002
    },
    {
        "text": "Russian Federation Vladimir Putin addressed the very important question. So how should we use the AI in educational process in the way that will avoid us to to decrease or impair the cognitive skills of kids of teenagers and so on but in the way that will help or assist process more efficient. So to equip teenagers, kids with a significantly new tool that provide us the better capabilities. I mean the generative AI as a part of educational process. Yeah, I get your point. So firstly we should taught teach students how to distinguish how to use AI correctly like AI is trained on like he all humans knowledge so it got its wisdoms but on the other side it have illusions and may give answers that's completely nonsense. So in my perspective, we should teach students how to distinguish which part of the answer generated by AI is useful and we could put it in use and learn from AI and that just drop the nonsense parts. So as a father of three daughters starting from six years old to the 12 years old, should I restrict them the access to the large language models to avoid the game in the system or should I address the some guidelines for them or should I use it as a a tool to the to the improvements of of their skills maybe to cross-check the results of the homework and so on? Yeah, I I believe like letting kids use AI is not a right or wrong question. It's a to what extent question like to what extent do we allow kids to use AI? Like surely we could not let them use AI to do all their work because they would not like learn and think about what they're doing. But if as I've said earlier, if we tell them how to use it correctly, how to learn from it, then kids would definitely achieve better with the help of AI. Okay. so and the next point do you believe that AI especially the generative AI or the multi- aents will become the the helpful assistant for for education and as well as for the scientific research in next few years or it's overhyped and we we should consider the some practical reasons that it will be restricted in in terms of the usage and the popularity. Yeah, AI could definitely help with scientists scientific research. So firstly AI could help us get help scientists brainstorm new ideas and somehow get new insights. So with the help of AI they could easily like know about what the frontiers in the area is doing and AI could help them gather information and they could find a better topic and secondly AI related methods is a like significant breakthrough in artificial intelligence. So let me give an example. So in years later maybe scientist scientific discoveries would be datadriven instead of formulad driven. So we would tell the pattern from",
        "start": 515.2,
        "duration": 1383.0039999999997
    },
    {
        "text": "gather information and they could find a better topic and secondly AI related methods is a like significant breakthrough in artificial intelligence. So let me give an example. So in years later maybe scientist scientific discoveries would be datadriven instead of formulad driven. So we would tell the pattern from in Beijing that I know. So they are using AI to solve problems with molecular dynamics. So instead of solving the really complicated differential equations, they're just using an AI model to predict the dynamics and that would increase the calculation speeds by like hundreds or thousands more. So that's how we could use AI to help with scientific research. Thanks so much. So it sound that we will increase or improve our capabilities to make more scientific research in the in the time of the unit. Yeah. So speaker is I will switch to Russian back to Russian because the next speaker is from Russia. Denise I think like two or three years ago together with Alexander Gastnikov the director of Inopoulos. We were discussing debating not really a problem but something that we can see in the first years of the school program school curriculum. those who are participating in mathematical contests in participating in STEM contests well I mean physics is not in the curriculum in the first couple of years at school but you know let's say STEM contests and some contests that there are in high school like if you increase the the funnel the conversion of the the conversion rate of those who participate in the first years of school. if you save and maintain this number of those who participate in the first years of school Olympiads so that they participate in the same numbers in the higher schools and then enter universities join universities because the more people that are have a passion for STEM enter universities and want and those who want to showcase that they that that that you know this this Olympiads this contest is like a high level sport but anyway to to cut it to the chase I mean you are the winner of the international contest I think you can't go higher than that but at the same time you have such a great background this is your 10th contest I think I guess So the question is what it gave to you and what it delivers for other participants to what extent it is good for the development of the new talents and the science. Thank you very much for the question Maxim. As for the benefits of international contests I would categorize them in three buckets. First of all, it's your personal privileges. I mean, obviously, if you talk about Russian big tech companies, you have some lower entry barriers to join them if you're a winner. And as you prepare for this contests, you go through a lot of practices that you that it's pretty hard to go",
        "start": 743.36,
        "duration": 1841.5650000000005
    },
    {
        "text": "it's your personal privileges. I mean, obviously, if you talk about Russian big tech companies, you have some lower entry barriers to join them if you're a winner. And as you prepare for this contests, you go through a lot of practices that you that it's pretty hard to go are working with you. They prepare you to do the very complicated tasks. Apart from hard skills, there are soft skills that are developed as well. Working in the team a UAE International Olympiad, we had a u a team task and we were preparing for the task. as part of the team collaborating with folks from other countries also help to boost these soft skills. The third thing that is very important is that you can share your experience with others. So you have gone through this path and you understand some of the things that less experienced guys do not get and at some conferences like AIG you can share your experience and say what you should do and what you shouldn't do it will help the younger generation in the future. when I was in the high school, it would be great if I had some podcasts with these guys and so that they where they share their experience. I would eagerly listen to them. apart from your dialogue with Alexander Gasnikov, I think that this conversion this convers this conversion funnel will delivered by the contest will give you the b the boost really. If you do STEM in high school, if you are passionate about that and committed to sciences, it is much easier for you to enter the technical university and to become a scientists, you know, if if you compare it to a person who just do not have any background, scientific background and just starting in this area. Yeah. By the way, you know, thank you very much. The soft skills is I think I heard about soft skills when I was like 30 years old. you understand the value of it and so you're very lucky here in international contests I don't know whether there is this effect or not but we this is our 10th conference 10th annual conference and during this 10 years we organize contests and hackathons and among grand masters and contesters you can see that you start to unite in the team and share the knowledge between the participants and it gives a great leap forward because you cannot achieve those results by yourself and when you contributeed to a in your shared task then you know it's it's great you know it's easier to be better than the than the average but you know getting to the top of the board to get in this point something% that's very complicated. So did you experience that? Yes. I think you know on the Russian official Olympians usually it's distributed beforehand like either you resolve the tasks the problems within the team or as a",
        "start": 986.56,
        "duration": 2245.9650000000015
    },
    {
        "text": "know getting to the top of the board to get in this point something% that's very complicated. So did you experience that? Yes. I think you know on the Russian official Olympians usually it's distributed beforehand like either you resolve the tasks the problems within the team or as a think that the teamwork gives you the boost in hard skills and in in in soft skills because someone decided to use one model, someone else decided to use another model and when you combine these solutions to the problems, the overall solution becomes a better one. Yes, thank you Denise. Well, teamwork obviously gives great results. Thank you very much. Round of applause please for Denise's take once again. I switched in English. so Shelene our we met each other four years ago in 2021. You was the one of the winner of our a journey contest and you also decided to to to go to the part of our team. So you passed through the internship program of but a few months later you decided to come back to India and what was the reason that you made decision to return because I know that you got here a lots of opportunities to to to get the education in the best universities of Russia. and what was the main reason that you made decision to return apart of the cold winter in Russia? Thanks Maxim. yeah it's a good question actually. so my moving to India was a very personal decision of mine. it comprised of my family of my people there my friends there and something to even contribute to my country. but for speaking about AI in India we have you know many collaborations that you know companies are making. for example just a few months back we the open AI decided to open their office in New Delhi and then Enthropic CEO also visited with the prime minister. So a lot of exciting things are happening and along with that we have a vibrant eco de developer ecosystem in New Delhi Mumbai and Bangalore in which you know they have experience with u many companies from you know middle east regions from Indian companies and from companies from Europe but u in India a lot of things are happening and that's why I wanted to get into the chase and that's why I made a decision to come back to India and help my community. okay. Thanks. And let's imagine or let's assume that now we are living in 2041. So you are correct me 35 or 34 years old. What what is your vision of your ideal role in the development of the AI as a entpreneur as a researcher or as a executive of the of the large technological company? What is close to you? So exactly a lot of things are happening in the industry and things are moving very fast. compared to even few years ago LLM was something that",
        "start": 1196.32,
        "duration": 2653.8039999999996
    },
    {
        "text": "AI as a entpreneur as a researcher or as a executive of the of the large technological company? What is close to you? So exactly a lot of things are happening in the industry and things are moving very fast. compared to even few years ago LLM was something that doing research in those domains and now we have companies great companies from Russia from China and from all parts of the world who are you know contributing to this community contributing to open source and u making huge companies with huge valuations but I believe that across you know as you said 2041 it's a huge It's a huge it's a big problem for me to decide what's going to come in future. But all I can say is u people need to integrate with AI. They need to learn AI. They have to understand AI. What's the power of it? what's the limitations of this great technology and then u use it to their opportunity make use in their workspaces make use in their daily lives and because in future most of the work is already going to be automated using my robots or AI but the ones who are going to succeed are the ones who use AI utilize AI in a very positive way and make the best opportunity out of it. Yeah. Thank you. Thanks so much Charlin. So my next question to so you are one of the winner also of the international olymp Olympiad or Olympic games I don't know how it's better to call Olympiad on AI. Yeah. So what what are so continuing the idea of how your your winning and your outstanding results in the math and as well as in computer science will help you in the next few years especially when you will be at the choice of the career tracks and so on. Do you consider yourself as a researcher in scientific world or it's more passionate to you to develop your talents as a manager in the company? What what is your vision on your career track? thank you for your question. so for me my personal previous experience is working as a competitive programmer. so the experience of competitive programming actually like involves more about like solving small elegant problems. and you mentioned another option is to like work for the society and like solve some large scale problems. but for me personally I would choose to like go on in a theoretical or a scientific research because there's one critical reason. So in the current era with the like new technology of AI the there's a a boost or a big explosion in like re researchers about like social matters or large scale problems but eventually after sometimes the technology will reach a brick that the current technology cannot solve anything like any any large scale problems beyond that brick. But eventually that comes to the technology or the techniques behind. So",
        "start": 1402.32,
        "duration": 3072.524999999999
    },
    {
        "text": "in like re researchers about like social matters or large scale problems but eventually after sometimes the technology will reach a brick that the current technology cannot solve anything like any any large scale problems beyond that brick. But eventually that comes to the technology or the techniques behind. So backend techniques that can really push the like pu push the our solutions to the big problems in the society one step forward. So I think I will like be more a researcher or more with the like techniques or technologies in my future. Okay, thanks so much for your answer and so at the beginning I said that the some guys from Silicon Valley got very very nice job offers from the new company that trying to compete with the big tech companies. I mean the like the intellectual machine of Miraati or the ASI team of Meta. So they are offering the hundred of millions of US dollars per year and you consider that to be a researcher it's it's practically better than to do the some engineering stuff or so now I I suppose you can combine your scientific background with the something practical. Yeah. In the in the such company. yeah, of course. if you're like talking about like if some big company provide me with like good offer good offers with like a big salary or something. I mean the salary part isn't actually the greatest part or greatest deal of of my considerations. So if I actually I'm lucky enough that in my future I got a job offer or a occupation that is high or like involving making some great decisions and that's the part that I like most. So if you're like doing scientific researches, it's about a like a somehow narrow part into the technology. But if you actually have the ability or the possibility to make great decisions that can push humanity forward or maybe that not that big not that big deal but just some important decisions that can help others or guide others to the correct path onwards and that would be the actual exciting part for me. Thanks so much. Thank you. And my next question will be to each of you. So the question will be the about the about how you can change the world. So you are a young genius, young prodigious and if you had a one super task, one super task that you had to solve with the usage of AI with the benefits of AI advantages of AI let's say in next 10 years next 10 years not only for money or for the fame but for the humanity what it will be so I believe I will contribute to the area of high school AI education in the next 10 years. Thank you. So because like me and Chan we are from really large cities in China and we could have like some how the top",
        "start": 1618.48,
        "duration": 3516.1259999999984
    },
    {
        "text": "the humanity what it will be so I believe I will contribute to the area of high school AI education in the next 10 years. Thank you. So because like me and Chan we are from really large cities in China and we could have like some how the top us a chance to learn AI and compete in AI Olymp. But in some other regions of China like the education isn't so great. So students are struggling with their school work and they don't have their free time to like study about AI even though AI is crucial for the society like for you to live in the society and for you to work right now but they do not have the chance to somehow learn about it in high school. So I believe that would be a crucial problem for us to solve in the future. Thanks so much Daniel. I personally have two super tasks. The first one is the one said by the president. The goal said by the president. You mean the demographic one? that as well. But I'm talking about the one related to AI. It's it's true. It's difficult to say to a child or to show a child how to use AI correctly because many children these days grow up using smartphones and in the future they will have a model embedded in in them by default. And so children will learn how to use these models from from a very early age. It's a difficult issue. It's hard to come up with some solution. How do you encourage a child to not just press a button mindlessly but engage intellectually? And another goal, another task, a more applied one, more practical one is automation of production. I drew this inspiration from China. I learned that they already have factories that are fully automated, fully robotized. So this is something I would like to replicate here in Russia. production is very labor intensive. It requires a lot of investment. So if you can automate it in large scale, I think that would save us save up a lot of money, a lot of resources. Thank you. Those are great answers. yeah I think I will also contribute to my community. in India there are many kids and many children who have you know great mindset of improving in future and they just lack opportunities and if given chance they could get this opportunity and do great wonders. So I believe you know high school children, college children and then university students should get their knowledge of AI. they should apply you know contribute to open source communities where they are making you know every models and all these documentations for free and for everyone to use. So that would be a great contribution to humanity as well as everyone is joining a race which is towards positive sides of humanity and I would like to do similar for that",
        "start": 1845.2,
        "duration": 3886.9249999999984
    },
    {
        "text": "are making you know every models and all these documentations for free and for everyone to use. So that would be a great contribution to humanity as well as everyone is joining a race which is towards positive sides of humanity and I would like to do similar for that community an AI intensive community and get more young children and young people involved in it. Yeah. Thank you Shine. so they have talked about some like realistic parts associated with the society. So I'm going to say something different like it may not be that realistic but we're just predicting the future so it's fine. for me like if AI technology is that good in future years I would love to have it how to say have it create problems for themselves and solving it. So currently AI is kind of good at solving all the problems that humanity raised to them but they have not reached the current stage or they have not had the ability to create problems for for themselves and solving it. So with that ability they can like re revolutionize themselves and make real scientific research with solely AI themselves and that would be really great if is actually in the future but maybe that will just not happen. I don't know but I think it's actually a good thing. Yeah. Thank you. So you are very young guys. Yeah. So you each of you below 20 years old because if I'll have a discussion with the guys who are after the 40 they will say that they will like to make the some breakthrough scientific breakthrough breakthrough in the life longevity digital immortality and so on. But you are not both about that. Yeah. So you're too young. so my next question will be also to each of you. we got a almost 10 minutes. So two two minutes for each of you. what would you recommend to the others to the others young people who are watching on you? what is the your advice for them? how they should develop their own capabilities and skills? how should they handle with the AI in the era of generative AI and of growing technology in every sphere of our in every field of our life. Yeah, that's a valuable question. So from my perspective, I would urge the like young students to pursue their passion. So with the help of AI people could accomplish more than what people did like years before. So maybe before what we need a team to like build a project and make a company but like in years later with the help of AI I could help you to like accomplish nearly everything. You could learn from AI. You could use AI to solve basic problems and do repetitive work. So you are the one to give ideas and be innovative. So if you are passionate about if you're passion about something, you could just",
        "start": 2044.88,
        "duration": 4306.845999999998
    },
    {
        "text": "could help you to like accomplish nearly everything. You could learn from AI. You could use AI to solve basic problems and do repetitive work. So you are the one to give ideas and be innovative. So if you are passionate about if you're passion about something, you could just for example, if you want to develop a game, so you could use AI to draw the arts like to design the game play and to write the codes. So maybe before AI, you would need a whole team. You would need programmers, artists to help you build that game of yours. But later you could just use AI to do all the work. So just do the things you want to do and you have interest in. So the only limitation is your passion. Thank you. Thank you. global recommendation. I think you should once again engage intellectually way more rather than ask an LLM to think for you. from my experience I can say that when you are trying to solve some difficult problem it's very it's quite a challenge to to refrain from turning it to an LLM for for answers for hints but that's exactly what makes you better trying to think for yourself once you get a hint from an LLM you lose something and another recommendation for those who have already started working on AI is do not limit yourself to just one topic to just research or just practice but do both because when you're focusing only on research for example it's hard for you to understand how big services work from the inside if you're focused on practice, it's harder for you to come up with something new to generate new ideas. So work on both areas rather than just one. Thank you, Dennis. Charlene, I think young children have a great exposure I think of AI and social media. so already they know much more things compared to the older generation like our parents. and you know I think I can see you know so many u cool things that are being made using AI using these AI applications like using APIs model APIs then you're using VIP coding websites and apps. So like the leveling the playing field for even the senior guy and even the like a normal child who has use of AI has become same. So for example, a senior guy who was who has an experience of coding maybe like 10 plus years and compared like to a child who has access to AI now they're at the same level because he can just wipe code the apps and websites. So this has never happened in few in our civilization because there was always an exchange of power. There was always you know some benefit that some other people had but now the playing field is same. so I believe from here young children should or you know young people under",
        "start": 2257.92,
        "duration": 4677.725999999998
    },
    {
        "text": "this has never happened in few in our civilization because there was always an exchange of power. There was always you know some benefit that some other people had but now the playing field is same. so I believe from here young children should or you know young people under associate themselves with more experienced people I believe because experience is unmatched some people have great experience in industries collaborating with people that's a big thing also and keep learning new things I believe and participate in these competitions like this u great AI competition by such a great bank and that'll be my advice and enjoy your life. That would be my advice. Thank you much. Thanks so much. So Tui again I'm mentioning my experience as a competitive programmer. So what I want to highlight is the word competitive. It it is an important trait like passion is also important but if if you lose the competitive part you only got passion. is like our future with AI is like a long expedition and if you lose the competitive part you're like walking alone by yourself and you may get far but more likely you will get lost. So this is what competitive comes into part. It's not about like comparing yourself with others like I'm the winner or he's the winner but it's more like with competitiveness you get a companion on your path with researchings or in your future with AI and there are like many ways to keep yourself competitive like like joining the joining competitions like we have here we have a perfect competitions for the for the teenagers and also you can like have a companion in your researches and you can share your ideas, compare your ideas and that helps you get farther and not get lost. Thanks so much. So we got a almost four minutes maybe a couple of questions from the hall from the audience here. if there there's anyone who want to ask a question to these brightest very successful speakers if you could give the mic. I can give mine maybe address the question. I I think I'll put a general question. My name is Alexander. I'm a student of program 360. I I have this question that I just came up with. It was told that there will be some model in the smartphones and from very early childhood kids will start using AI. Obviously that opens up new opportunities and we were focusing that these opportunities will be used for some applied educational purposes. I mean developing games is an some proper application but if they start to use AI and if they are kind of frozen to AI you know just using it merely for entertainment should we restrict them from using them or they should go through some their own way and grow themselves and understand what is good and what is bad in AI",
        "start": 2460.079,
        "duration": 5072.124000000002
    },
    {
        "text": "to use AI and if they are kind of frozen to AI you know just using it merely for entertainment should we restrict them from using them or they should go through some their own way and grow themselves and understand what is good and what is bad in AI everyone. Yeah, I think I'll jump in. I think this is the task that was one of the tasks that was set by the president of Russia. I don't think there's a one silver bullet for all of that. I mean, should you limit your child using the phone? You know if your child has been growing from the smartphone with the smartphone in hand from very early ages that means that he's limiting himself you know in terms of communication with other kids and teenagers. So can you restrict them from using ban them from using big models? I think you can you know just I don't think that they should have gadgets when they're very young because sometimes it's it puts barriers to socialization. Thank you very much, Denise. Any any more questions? Maybe one more question and then we'll wrap it up. Sorry, I can't hear you without the mic. I just you know kind of answering the previous question. So you said that restricting kids from LLM, banning them from using LLM and other developments of civiliz civilization will limit their socialization capabilities. But some as a someone who just recently have been very young, I would say if you restrict kids from using all these developments of civiliz civilization, will that not create an outcast from kids? You know, for example, those who had Nokias before in school were laughed at by other kids with the smartphones. Maybe using LLMs, kids can fine-tune their communication skills if they're introverted. Maybe it would be great to think about that. Maybe it's a good thing rather than the evil thing else and you know being the moderator unfortunately we're out of time. So but at the same time everything that you have said personally I resonate with that because this is the effect like you know kids should not only hear the words from good literature but also some swear words obscene words so that they know that they should not use them in while communicating with others. But you know as a parent of as a father of three kids, I can say that sometimes when your kids are using more than using screens for more than 10 hours a day, you think, well, maybe you need to kind of limit that usage because it starts to compete with the real communication with real other with other real kids, with homework, with sleep. So there are two you know extremes to totally ban LLM and the other one is to give full freedom and you know people as well as kids can overuse something but you know it's like when someone is limited in terms of",
        "start": 2669.68,
        "duration": 5497.245000000005
    },
    {
        "text": "other real kids, with homework, with sleep. So there are two you know extremes to totally ban LLM and the other one is to give full freedom and you know people as well as kids can overuse something but you know it's like when someone is limited in terms of playground because everyone else is using LLM and their parents allow them to use that this is the scenario that we wouldn't like to see. Thank you very much and for the questions and for the comment and for this little debate that we had. I'd like to thank everyone. Unfortunately, the time is up and we are wrapping up this session. On a kind of a suspended note, we have a couple of questions that were left unanswered. But anyway, I would like to wish all the participants and viewers to achieve great success and to be inspired by your my work. And I would like to thank all of the participants. Thank you very much for giving such a great vision. I mean the guys have proved to themselves and to the entire world that they are one of the best and let them be the showcase of what can you achieve. Let them motivate others to achieve the similar level of success. I would wish a very productive third day of the conference and the science day and I wish you all the success in science and research and its applied tasks. A round of applause for all of the panelists and a special thanks to Maxim, the moderator.",
        "start": 2906.72,
        "duration": 5666.683000000006
    }
]