[
    {
        "text": " How do you combine benefits and privacy and regulations? This is something that is going to be explained by our next speaker from India. Vice Chancellor of Sai University Ajit Abraham with the report generative AI in healthcare. Very good afternoon to all of you. I would like to thank the organizers for inviting me for this important event and presenting some of the research which I was doing during the last several years. I was working in this field for almost 30 years. The initial 10 years I used to work a lot on foundational models, building AI from scratch to understanding how things work. In 20 08 I got exposed to some challenging problems facing the society. I got involved in a geriatric hospital where al-Shemer's patients were admitted mostly for taking care of the end of their lives. It moved me in different dimensions because these patients they can't communicate no relatives of course and even medical staffs they don't want to look after them because it is very tough. So there was a huge turnover of nursing staffs. Nurses they come work for a few weeks few months they run away. So it was a very complex situation and then we decided how can technology be used to ease the situation. So I would say during the last 20 years from AI foundational aspects I started doing a lot of things in healthcare and the particular project which I was mentioning we developed a software platform there is no generative AI in 2008 a multi- aent system, variable devices, using RFID technology, using Wi-Fi, connecting patients with various monitoring systems where a nurse will get alerts if a patient doesn't move for several minutes or if the patient doesn't interact the way it is supposed to be. So we showed that by having this monitoring system we were able to ease the workload of the hospital system. A reduction of about 50% paperworks. For example, a nurse would go to the room and then record some incidents. at the same time it improved the operational efficiency of the hospital system. So today I'm going to give you a quick overview about some of the work which we continued from 2008 until I would say some of the ongoing works. If you look at life expectancy especially during the last 10 years postcoid it is continuously increasing especially if you see those dark blue areas those countries have the highest expectancy and if you look at north south Africa still we have a lot of challenges. There is a need to improve certain measures so that we can also give all of them equal opportunity to live. So in the next few slides I will try to summarize what are some of the current innovations in the healthcare field which especially with the invention of generative AI what it has done from understanding medical images which a technician sitting in front of a CT machine or",
        "start": 8.24,
        "duration": 645.1570000000002
    },
    {
        "text": "live. So in the next few slides I will try to summarize what are some of the current innovations in the healthcare field which especially with the invention of generative AI what it has done from understanding medical images which a technician sitting in front of a CT machine or or MRI scans might miss the generative AI platform can easily pick that help writing the reports, finding patterns. In a way, it can help to more precise diagnosis. Most of the diseases especially cancers, neurological disorders, the number of patients are relatively less and getting data is a very complicated task. Using generative AI, it is possible to generate almost good data which is similar to the data we need so that we can build AI models which could be useful for detecting such complicated diseases. in turn supporting radiologists, helping cancer patients, understanding various pathological situations etc. We have seen how COVID 19 vaccine was discovered. Typically a vaccine takes 5 [snorts] to 10 years because you have to do a lot of research, develop the vaccine, do some laboratory testing, take it to clinical testing in a small scale, get various approvals at different government levels, then do some testing in real case and then finally release it for public consumption. But we have seen how COVID 19 vaccine for example Sputnik how fast we are able to release it from discovery to consumption few months less than a year. So AI especially generative AI helps us to reduce the time frames understanding molecular interactions protein structures how they dock together. Such simulations and understandings we can speed up using generative AI. Personalized healthcare has taken a new dimension. You can have a doctor in your cell phone in your pocket. electronic health records. Just by talking to a device, it can note down the prescription, link it with your genomics, your genetic data, your current lifestyle, and give you personalized treatment plans. And personalized means individually depending upon how you spend your day on a daily basis. So from generalized medicine we are moving to precision medicine which has found immense applications in our daily life especially in the healthcare industry. virtual assistants from AI chatbots. Previously we have seen in banks, in some insurance companies, universities but nowadays you can also see this in hospitals. Depending upon the need of the hour, it can give you a lot of information. It also makes health care more accessible. Imagine someone living far away from Moscow in a remote village. It is not possible to get access to a good doctor. But having such devices helps the general public to access and afford to get the best medical care. It reduces the administrative load of the hospital system. Can set up reminders, automatic reminders. It helps the doctors to link many things. Otherwise doctor would have to ask so many questions. What happened to this one? How it happened? Which day? Which hour? Now everything is linked",
        "start": 372.24,
        "duration": 1250.7610000000002
    },
    {
        "text": "medical care. It reduces the administrative load of the hospital system. Can set up reminders, automatic reminders. It helps the doctors to link many things. Otherwise doctor would have to ask so many questions. What happened to this one? How it happened? Which day? Which hour? Now everything is linked summary and it helps the doctors to make better decisions using generative AI. Multimodal integration from speech to various electronic records to your genetic data to images to various other vital signs. All these can be integrated with the history. Imagine if a patient who is 80 years old might have a huge file especially if he or she has complicated disease history. And linking all this together is not simply easy. And all these models will support in real time and with precision medicine. All these things will together help in the best decision making, giving the best health care, population health management. We have seen towards the end of covid-19 we have seen how we are able to control the virus spread to some extent. We can predict given today's data this is going to move in this direction. So we can allocate resources, do the necessary interventions, set up hospital systems, set up various of the logistics. So epidemic management AI can support in a very big scale by generating various simulations situations. We are able to understand risk assessments in a the best possible way. optimizing resources and all this will help policy makers, government bodies etc. So I just want to summarize especially using generative AI how much we have come across how much we have progressed. I would say first is is faster image interpretation from automatic report generation by looking at an image. The radiologist would have to see slices of CT images. It could take several minutes to see all the slices of CT images and see if something is wrong. But using AI we'll be able to summarize it in few seconds to couple of minutes. Segmenting those organs which has some problems could be cancers could be some abnormal findings. focusing on those areas automatically at the same time. Multimodal integration [clears throat] connecting with various other data points connecting with genetic data connecting with previous health history previous images and it helps to minimize the efforts by the radiologists. Imagine a radiologist looking at these slices of images for one patient 10 to 15 minutes. The next patient, imagine the life of a radiologist on a daily basis. Quality enhancement and reconstruction which is I would say the beauty of artificial intelligence. A radiologist probably after a few interventions 10th patient would miss something in a CT scan in a particular slice or few slices. But having AI in place there is no room for missing such event. So we have seen various imaging schemes from X-rays to MRI scans to ultrasound, endoscopy, colonoscopy, PET scans, CT scans and understanding various abnormalities from cardio for the heart,",
        "start": 707.2,
        "duration": 1850.5189999999998
    },
    {
        "text": "scan in a particular slice or few slices. But having AI in place there is no room for missing such event. So we have seen various imaging schemes from X-rays to MRI scans to ultrasound, endoscopy, colonoscopy, PET scans, CT scans and understanding various abnormalities from cardio for the heart, neurological diseases and several cancers. So in the next 10 minutes what I'm going to do is I'm going to show you some of the research which we have been doing especially during the last 10 years and I'll not be able to go into details because I'm going to show you various diseases what you have done but you will see the QR code and if you scan it you can directly go to the publication ations and if you have more questions, you're always welcome to connect with me at any time. So enhancing MRI images using thresholding. So by thresholding MRI images, it is also possible to get more insights of these images which a radiologist or a doctor might not get. So in this case we were able to categorize ALS patients. It's a neurological disorder lateral sclerosis about 85% patients we are able to categorize accurately similarly enhancing MRI images using various clustering methods. So in this case we used a clustering based on fussy logic with which takes into account of imprecision, uncertaintity, noise and basically we are able to see neurological disorders specifically Alzheimer's disease something is coming probably it'll take several years to show up in a regular MRI scan. So it is more like you looking at a cloud and telling that it's going to rain in the next 3 hours. Similarly looking at an MRI scan and we are going to say that you're going to get diumas in the next 3 years. Again using MRIs using genetive AI with various other schemes we were able to categorize different types of alchemas. Moving to blood from AML, acute myoid leukemia to cickle cell diseases. We were able to categorize using artificial intelligence. And nowadays there are even variables you can feel the pain and suspect that something is wrong with your nervous system and probably you need to do some blood works and imagine if you have blood works and then all this AI platforms it can help you to easily identify well whether something is wrong. So typically what happens in a real situation is all these patients number of patients getting leukemia or serious blood diseases they're very few and typically when you have symptoms of leukemia you might have only 6 weeks 8 weeks to live and if the laboratory takes 2 weeks 3 weeks to give you a report by the time the who came here might have progressed you might get the chance to live only for 3 4 weeks. So imagine if you can flag something is wrong with this blood sample need some quick intervention. So probably that can minimize",
        "start": 1028.16,
        "duration": 2356.0829999999987
    },
    {
        "text": "weeks to give you a report by the time the who came here might have progressed you might get the chance to live only for 3 4 weeks. So imagine if you can flag something is wrong with this blood sample need some quick intervention. So probably that can minimize lifetime. Intercranial hemorrhage detection strokes is a very common aspect. Again using genative AI we are able to categorize different types of strokes. for example epidural subaranoid and various other categories is strokes. So typically these are I would say initial samples that something is going wrong and you file dissess and then after some time you're okay and then you go to the hospital and the hospital will tell that everything is okay because it's already cleared out. So the more delay you have in detecting these type of strokes can also give you more problems because in medical terms usually they say that ismic strokes are some initial points where something big is coming. So it is always better to understand this much earlier so that you can be well prepared. So we tested this in few different data sets and we got very interesting results. Similarly lung cancer detection various types of lung cancers and using an explainable AI model. So usually you get results okay you got this cancer but why many times we interested to know why I got this results so this model also gives some explanations using some descriptors colctile cancer is another killer especially for men above 50 years old And generally it is recommended to have this scan colonoscopy every year. Men over 50 years and typically takes about 12 to 15 hours. You need to clean up your system, go to the hospital, go to the laboratory. the procedure, then the report analysis, the whole process takes about 15 hours. And imagine if you have to do this on a yearly basis and if you use artificial intelligence whether we can do something better. So we did some initial studies. So we can see that on the screen. So polyp less than 5 mm is considered as you don't have to worry now but probably we'll wait until the next 6 months or one year to see whether it has increased. So using basic AI models we are able to detect this even better than a conventional radiologist. radiologist would take several minutes but a simple AI platform could detect this in few minutes. We are continuously doing more work in this direction. And now the current work is to detect such polyps just by using CT scans. Which means that there is no need for this 15 hours preparation time. But all you have to go to this hospital and take a CT scan and in 5 minutes 10 minutes you'll get the report telling that there are no polyp or polyp are below some threshold there is nothing to worry. Similarly, cervical cancer is another major killer and",
        "start": 1304.159,
        "duration": 2871.158999999997
    },
    {
        "text": "time. But all you have to go to this hospital and take a CT scan and in 5 minutes 10 minutes you'll get the report telling that there are no polyp or polyp are below some threshold there is nothing to worry. Similarly, cervical cancer is another major killer and given very good results. Scoliosis detection. So these are I would say very minor compared to other cancers or neurological disorders. But again for children having this kind of vertebral column or spine it is difficult to give them the best of life. So there is a need to understand these defalities in the beginning itself. So using AI we can easily categorize them into mild, moderate, severe and then flag for further intervention. Lyme disease is a common bacterial disease from ticks found in the bed. It might sound very small but if you're not giving proper attention it can spread. It can cause major problems. So just to conclude I am about to exhaust my time. I will give two sets of summary. First is from generative AI. As you know that most of these models are based on data. So we have sometimes what you call as data bias handling privacy and security. Many a times we're dealing with patients data. So managing this is a complicated challenge. Hospital systems, health care systems have their own legacy platform software. So integrating all these AI based software platforms, tools is often a complicated task and also convincing the medical doctors, the clinicians or the health care professionals that this is important if you use this these advantages. Many times it takes some time to get them convinced ethical and accountability issues. Many times you get decision from the software and sometimes whether you can blindly trust the software decisions. Who is accountable if the platform or software makes an error? So deploying AI in healthcare requires careful planning, data governance, proper validation. You cannot simply get some results and straight away implement this in a clinical situation. need to follow all regulatory complaints and ethical considerations to ensure patient safety and trust from the health care service providers. From a health care perspective, we have also seen lot of challenges. First is lack of highquality data. So many times it is very difficult to get data for various studies and many a times we don't have sufficient good quality data very important thanks to generative AI where we can generate very good quality data they're always concerned about ethical legal concerns concerns about database and how to integrate this in a clinical workflow, financial barriers, implementation costs. So again there is a need for robust data governance more interdisiplinary collaboration. I always see that medical health care professional they work more like silos. So we need to work together to develop the next generation AI platforms so that we can serve the community in the best possible way. Thank you so much [applause] Dr. Abraham.",
        "start": 1577.36,
        "duration": 3458.731999999996
    },
    {
        "text": "data governance more interdisiplinary collaboration. I always see that medical health care professional they work more like silos. So we need to work together to develop the next generation AI platforms so that we can serve the community in the best possible way. Thank you so much [applause] Dr. Abraham. contribution that's very [music] important for science and for healthcare. Thank you very much. Thank you. [applause] [music] That round of applause, please. Round of applause again. Friends, we are having a 20 minute break after which we are going to talk about how science and government doing things together. [music]",
        "start": 1886.88,
        "duration": 3518.3499999999954
    }
]