[
    {
        "text": " [music] We are happy to welcome you back to the main stage of AIG 2025. It's time for a business session with the AI Alliance to discuss the unlocking of AI potential and overcoming key barriers to business adoption. Please welcome to the stage chairman of the supervisory board of AI alliance Russia Alexander Vidian Tigran Hudan Yandex Stanislav Bisnuk Tnologies Vladimir Verhashinski Alpha Vasili, Vasili Nakonov, Cibour and Andre Bvar. Good afternoon, dear friends. , happy to see you all in the audience and happy to see everyone watching us online. A very warm welcome to our partners, members of AI alliance. I am here in a slightly different role. I'm here as a chairman of the supervisory board of AI alliance. It is a rotation role. Every year we have a new chairman. We can at least have a new chairman. [gasps] And we have gathered here today to talk about the way No, let me start again to talk about how AI is already being implemented and we will talk about maybe not problems. They ask me not to say the word problems but challenges the challenges that we're facing today. You know, it's an interesting thing. We have leading companies and then we have companies that are overall interested but are not very good at it yet. When we look at the public landscape it looks great. we have leaders who do everything without any mistakes without any problems. They know solutions in advance and then there are those who are lagging behind. So we have agreed with the colleagues that we will be talking about the challenges, the difficulties, the decisions that we've been making sometimes successfully, sometimes not. And to give this conversation a structure, let's start with this bit of research or or a survey that we conducted within the alliance where we asked companies in industry that participate in industry clubs. We asked them what are the main limitations for AIUS. more than 150 participants in the survey named the following key barriers. The first key barrier for large scale AI adoption is people competencies, culture, engagement, that sort of thing. Second, infrastructure, data, computing, security and cyber security. something that we need to talk about investment or return on investment. There's a dialogue within each company on how much you invest and what is the ROI that you need to target. How do you convince the financial services the the owner of the company that that it's needed? ethics, regulation, rules of the game, trust in AI and strategy, the goal setting from that comes down from the CEO and everything that has to do with the KPIs and organizational structure. It's hard to deliver results without it. We are beginning with barrier number one, people. Before I ask my question to Stanislav Lnuk, I would like to turn to all of the speakers and say that we have a free mic. We have known",
        "start": 9.825,
        "duration": 509.7770000000001
    },
    {
        "text": "with the KPIs and organizational structure. It's hard to deliver results without it. We are beginning with barrier number one, people. Before I ask my question to Stanislav Lnuk, I would like to turn to all of the speakers and say that we have a free mic. We have known let's have a an informal conversation and informal discussion. If you have anything to add, if you disagree, if you want to interject, please go ahead and do so. Take the mic. this is a a free conversation in front of a wide audience but still so stas the first question is for you as I said I've been to your office several times to Tchnologies and it has always impressed me the way you treat people there every detail is very meticulously thought out the the way your your employees the workstations are located, how you work with each other. You have a lot of data scientists and it looks as if you didn't have any talent shortages. , I apologize to everyone here from Spare, but it feels like everyone wants to work for the yellow companies Tab Bank or Yandex. Okay, Sasha, we we've agreed to to adhere to the to the program. All colors matter. Yellow, green, even blue. Okay. what's the color of Sibur, by the way? Green. Oh. Okay. So, we we're outnumbering them, the green ones. Okay. Stas, maybe you can answer the question. Well, thank you for for the kind words. I agree that One of the key questions, one of the key issues is indeed talent and people where we are here to share experience. So the the problem of human capital is twofold. All technologies and innovations require people. people who we didn't start cultivating 10 years ago data scientists AI AI staff AI experts we can say that we do not really have such a big problem with people but actually we do have the problem because there's not enough experts they are cultivated not by educational institutions but rather by companies who invest in it invest in training but what they're lacking is people experts. I'm sure we'll get back to the educational topic, but that's just part of the problem. Another part of this human capital problem is leaders, managers who are often older and who often are unsure about the necessity to invest in this technology. So we are lacking people who can execute it and then people who can prioritize these issues do not do that. Sometimes in big tech in fintech companies the top management and and linear management they may have a good understanding of what should be done about it but then there are companies who are lagging behind who do not have this clear understanding. All of these industries try to come together to to work out a solution. This will create demand and then the market will respond with supply with experts.",
        "start": 294.88,
        "duration": 948.2570000000001
    },
    {
        "text": "what should be done about it but then there are companies who are lagging behind who do not have this clear understanding. All of these industries try to come together to to work out a solution. This will create demand and then the market will respond with supply with experts. new industry. Back in the day we had an IT boom and then IT integrators came out of it. I think this will be a similar situation. We will have consulting companies that will heed to the demands of of a company or an industry to automate this or that process. They will encourage them to to automate to adopt and increase value. So this will be a push towards creating talent and then we will be trying to retain all these talented people here in Russia for all kinds of interesting tasks. I think it's it's fair but we do have the push. We don't have the people. I'm going to ask to comment on this. We have people from fintech companies, from Yandex and a person from the industry. So what I'm hearing is that people from big techs, fintexs, you can engage all kinds of specialists. We do not really believe in it, but we have our own competition. But where do you find specialists of a good enough level without superinflated salaries. Basili, have you found an answer to this question? Yes, but the answer depends on how you ask the question. I would divide it into several parts. The first is that to develop AI, you need a platform. You can start by looking for people in the market to build it over a certain period of time or you can try to find a partner a big tech company or a telecom company or a similar one. This is our path and you can save time and money and you in this situation you don't have to look for the people in the market. As Star said, this model is attractive because you can replicate this experience to other companies not necessar necessarily in our own industry. It can be capital intensive industries with continuous production in in steel works for example. then again you need agents you need a lot of coding and for that you can use startups who are narrowly specialized to deliver specific cases. So you don't really need to hire these people as full-time employees. Next engineers we don't need that many engineers actually. I want to compliment people here because they are doing a great job cultivating these talented people. But it's it's hard to find your niche in the market, but you always you're always able to find people who find the tasks in your company interesting and challenging. and you try to engage them. And lastly, it's not just about IT people, but all kinds of technology people. You also need people in business units who generate ideas.",
        "start": 526.48,
        "duration": 1353.8570000000004
    },
    {
        "text": "market, but you always you're always able to find people who find the tasks in your company interesting and challenging. and you try to engage them. And lastly, it's not just about IT people, but all kinds of technology people. You also need people in business units who generate ideas. an LLM if you do not know anything about an LLM. A few things help here to improve personal performance. people are pretty knowledgeable. They they like to expand their horizons. The vectors for using these tools can be manifold, but we need to be able to manage it. What kind of data can you use in the cloud for example? We need rules here in terms of changes in processes. in addition to improving your performance our company for example is very centralized. When we were catching up with best practices and operational efficiency it was an advantage because you could replicate them fast. now with AI the centralized model also pays off because it's easier to to replicate. I also wanted to add and add a compliment to civil because they are actively engaged with educational projects. When we were creating the central university, we're creating it for all our partners. It now has 60 partners there. Sibu was one of the first partners to answer the call and they're organizing all kinds of internships and training programs. They even have a co-working area there. It was as I saw rather easy for you because you you are used to engaging with the younger audience because you believe this is the right thing to do. Thank you. Thank you. I'm looking the at Tigran who who is who looks very appensive. Yandex was among the first companies to start working with data scientists actively with IT specialists. Tigran, how do you handle this? Do you experience any talent deficit? I don't live that far away from Yandex HQ, or at least I used to right before you moved to a different place. And I saw these many young people walking around with raspberry rafts, how do you retain them? How do you track them? Good afternoon. I think for all of us sitting here on stage and in general in Russia, I think we are not the ones to complain about staff deficit. We are at the top of the list of countries. top three, top five, top seven countries. Doesn't really matter the quantity, but at the top of the list, at the top of a rating of countries with a lot of super talented specialists. I think the colleagues will agree. It's it's just a fact. Yandex, Spur, Tab Bankang, we all have a lot of great specialists. But speaking of problems, maybe we will discuss this today. In order to turn AI from a toy into something of actual benefit to humanity and yesterday we talked a lot about this problem where the children do their homework by delegating it to AI. So it's",
        "start": 751.04,
        "duration": 1765.9380000000008
    },
    {
        "text": "of great specialists. But speaking of problems, maybe we will discuss this today. In order to turn AI from a toy into something of actual benefit to humanity and yesterday we talked a lot about this problem where the children do their homework by delegating it to AI. So it's It's a harmful toy. So how do you turn it from a toy to something useful and beneficial? Specialists, experts, people who are passionate about it, driving forward thousands and thousands of projects across the country in fintech in Yandex as well. This is the challenge for all of us. Actual beneficial use. The ability to say that yes in our company, in this business, in this line of work, we are achieving a significant share of benefit thanks to AI. So how do you motivate people? How do you retain people? I think you you you deviated hugely from the answer. It's it's I think it's obvious whether you are at the center of it or just a bystander. I'm sure you will agree that we are witnessing maybe the biggest technological revolution in our history. not not smaller than computers or internet or smartphones and that alone is is more than enough to motivate people I think and I think it's motivating all of us sitting here as well we've come here because we're motivated because of it we have alpha and spur right I select alpha okay our brand color is red. The first deputy chairman of Spur Bank. You know actually you know Zur is flanking this panel discussion. The red one is in the center and the representatives of yellow colors all the rest and yeah the the green one is here obviously. So anyway, sorry. the the people how do you plan to retain people? AI unfortunately is an something very expensive. I mean [snorts] only big and efficient corporations like the corporations that we represent can engage in AI. There's no problem with with talent. Russia [snorts] has a lot of talented people and all of us were able to learn how to build great office spaces with food courts with fitness centers. 20 or 15 years ago, even a decade ago, that was absolutely outlandish. But now it is a standard and now we compete for these people. We pay high salaries. But this is kind of a the common thing you cannot retain people with that. But I think culture is the most important thing in Cibur in Yandex in Zur in Tibank and the culture is special. for us we're building the culture for the smart ones and the free ones and not everyone are in line with this culture but those who get there [snorts] they these are the you know the creative young people who who are there who are in line in Yandex. Tigran, he's a very big boss at Yandex. Have you seen him on the street? You know, he's was just he's just using the",
        "start": 964.639,
        "duration": 2187.658999999999
    },
    {
        "text": "but those who get there [snorts] they these are the you know the creative young people who who are there who are in line in Yandex. Tigran, he's a very big boss at Yandex. Have you seen him on the street? You know, he's was just he's just using the backpack, you know. Now remember my colleague from another bank comes from ask Mercedes and me too I came on a on a car on a fancy car and you know but he just said okay bye guys and just jumped in in the tube zur yeah in we have a different culture. Yeah, it is a different culture. But I think the digital leaders in Russia now have exciting tasks and their own authentic culture and you know that goes outside of the box of smoothies and fitness centers and you know I mean this is how these digital giants work. Thank you. What about Zur? What's Burbank do to retain people? What are the things you don't know about that? Well, you know, I'm asking you as a president of the supervisory board of AI alliance. You know, I would build on that question and we'll talk about a challenge. You know what we are facing right now? We are developing fundamental models based on these models. Right now we have more than 500 initiatives. These are the teams that are actively developing the products and as well as the agent systems across the perimeter of ZBAR. And then we can see that when we start to create this agent system, data scientists are not interested because do you need to train the model? Okay. No. Okay. You'll work it out yourself. Developers are also not very excited. They say okay I mean something complicated code something challenging code that would be great but like do something routine with the model no that's not interesting not exciting but neither of these can finish and complete the task because sometimes you need to optimize the speed the model to properly work with the data and you know this is kind of an area that is between the two areas, between the two industries. So neither developers nor data scientists can do it properly by the way. So you know during this year we were investing in some patterns. If you start if you look at the start of the year there were no best practices on how to implement these large systems in the large corporate landscape. There was just some simple cases like developer chatbot. But if you talk about the serious landscape with the scalability with the reliability, the speed, security and trust, there were no frameworks like that. And basically for the entire year we were experimenting you know with trials and errors you know some looking at some cases and we're trying to understand what works what not. When we understand that something works in a stable fashion, we try to",
        "start": 1198.16,
        "duration": 2566.19
    },
    {
        "text": "there were no frameworks like that. And basically for the entire year we were experimenting you know with trials and errors you know some looking at some cases and we're trying to understand what works what not. When we understand that something works in a stable fashion, we try to [snorts] and the skills should be shared across the market. I do not want to say it's a new profession but this these are new skills for the new profession. You know I remember the era when we the mobile apps was just started to be developed. You know that was a major challenge back then. Now it's a routine task, but people were saying, \"Okay, well, how do you develop a mobile app?\" They didn't know that. And it was just recently. We're at the same spot right now. It's a new tech stack. You need to learn how to work with it. It's not bad. It's not good. It's not more difficult or less difficult. You just have to learn it. We see another example on the profession because a year ago futurologists were saying that prompt engineer will be the new profession will be a new job. I mean a year ago they were saying this is going to be a totally new job and now it's it's laughable really if anyone has hired prompt engineers you don't you can fire them they don't they're not needed. So I agree with TIG runs something that happened during my entire career in technologies and these skills you know they are totally new they're very exciting and we are exchanging information in terms of how do you find people who are doing these things I can give you an example a son of my friend is studying at the higher school of economics He got the internship at Zur without my participation by the way and he calls me and asks okay where should I go in Yandex in search or driverless vehicles. He says this is a cool organization and I they give given me the middle pos level position and I say well go to the to the search I would go to the driver as well. You are motivated to work in Zur. I have Ive I've heard your presentation. I mean, it's the general thing and I would say that it's a good it's [clears throat] something good here because we train young people and they're here and I would like to thank everyone present here in terms of for what are they doing for their learning and I would ask maybe to you know to say what what is your contribution to the market you're talking about the new talent right Tigran that's an exciting and promising story Yandex for many years like more than 10 years I've been investing in the data analysis school I'm not going to be humble here but Today I think on the global landscape is",
        "start": 1389.12,
        "duration": 2937.739
    },
    {
        "text": "to the market you're talking about the new talent right Tigran that's an exciting and promising story Yandex for many years like more than 10 years I've been investing in the data analysis school I'm not going to be humble here but Today I think on the global landscape is scientists in the world and same this the data analysis school is not fully connected to Yandex I mean some people graduated and go to other companies the graduates I think like onethird goes to Yandex we have many graduates working with Burr by the way yeah and we we are really happy to take them yeah because because this is a top of the top really. We have a joint project with spur AI 360. This is a specialized program based on the a number of top Russian universities together with spur and these universities. We are selecting these students who are excited about that about AI and they have a good foundation. They have good mathematical skills and this is a specialized educational program for these kids. I mean for the students I can talk about that at length. We have our own analysis school and we have a joint pro program with spur and many other programs. So with other universities I think all the other panelists will join me here because the Russian financial companies have been investing a lot in the education and have been doing that for a number of years. So this reversal is really something that is happening. I think that it used to be the case that it was the priority and now it's AI and the new programs are focused on AI exactly on AI. Thank you Stanislav. you know why big tech or fintech in Russia is great because we have some excitement and drive to do something new and [snorts] as CR is saying you know we are living through the revolution and this we're having this paradigm shift and as paradigm shifts happen the new products appear and if you're a large company you have this effect from the operational involvement you know you have in implemented something you improved something by 0.5% and you got like billions saved or and whatever. So we have a lot of tasks and when young professionals join our team you give them this task they can experiment and create something and I think this is very important because that really drives the skill to to learn and we have this full layer of AI native employees engineers it's I mean they are now being trained not by universities but by IT large IT companies and many companies started to invest on the level of schools and competitions. Yandex school Yandex MA program is fantastic. We have a lot of employees from that school. We had a couple of courses on fintech and coding and now we have launched a big central university project. The main idea is",
        "start": 1581.44,
        "duration": 3320.5390000000016
    },
    {
        "text": "started to invest on the level of schools and competitions. Yandex school Yandex MA program is fantastic. We have a lot of employees from that school. We had a couple of courses on fintech and coding and now we have launched a big central university project. The main idea is developers, ML experts who know how to leverage the the today's knowledge to improve the process and products and in all areas in all industries. So this is a not a corporate university but this is a school that helps them to work in various industries. So they're going to drive this client centricity high-tech culture. by the way kids it is all based on mathematics. All AI is based on mathematics. Coding as well just to learn mathematics. This is the best science in the world. Yeah. You know mathematics is the is the queen of all sciences. I understand this is this is true. Yeah. I mean those who are adults now you know this is true. I mean [snorts] in school we thought that teachers were just saying something that was not important really but now it remained to be true. Yeah. Same was for me. You know I have two daughters. my one of my daughters is in university and she's like she says okay I'm I'm I'm a humanities girl and she went to the high school of economics and she's studying advertising and I remember one evening very late at night I asked her what are you doing and she says I'm writing an ML code for an API for telegram channel and I said well sorry but you're in an advertisement And I said, and she says, \"I hate artificial intelligence. I just have to do it.\" So anyway, the the the point of the story is that you will have to learn AI whether you want it or not. [snorts] Yeah. You know, there is a we open sourced giga agent. We put it on Git verse. It's an open source system. It's very simple. you can ask it to you use the data to train a small ML model and use it in your work. So you have an agent that is based on fundamental network but within itself it can do something being a pretty good data analyst and can train another ML model and you it can train the model to answer the questions. I will I will to I will say that to my daughter not not now maybe I mean she has to learn some Python skills. Yeah. Well, since we are talking about children, boasting without children, you know, my son is is in school. He's 17 years old. And he says, you know, I can now code websites with AI. And I say, well, try it out. And in two days, he comes to me and says, well, I earned 10,000 rubles. And I say, well, you know",
        "start": 1782.159,
        "duration": 3681.014000000002
    },
    {
        "text": "my son is is in school. He's 17 years old. And he says, you know, I can now code websites with AI. And I say, well, try it out. And in two days, he comes to me and says, well, I earned 10,000 rubles. And I say, well, you know And he says, \"No, it's just like took me half an hour.\" And you know, whatever we talk about, whatever we say about gadgets and widgets and AI, I think that people will adapt and our children will be stronger and smarter. They will work differently. They will interact with it. I mean, we will be outdated. We will be grumpy granddads and grandmas who would not like that. But this is the progress. This is the natural flow of things. And if we talk about our contribution the of contribution of Alpha Bank in the development of the youth guys at T Bank created a central university fantastic thing fantastic project huge respect [snorts] this is like a approach to dive deep you know to select the best guys and to train them. Yandex is doing the same. We have decided to unite all of our initiatives in one platform. It's called Alpha Future. it has been online for a year now. I mean they does not have we spent billions of rubles. We have we partner with 300 universities around the country including ITMO in St. Petersburg and many other universities and schools as well. And our team loves that because they tour the schools and universities and they get motivated giving lectures. [snorts] So we decided to make it a you know wide scale large scale project and it's great that in our country we have big tax fintech and you know very large digital corporations that can help us to move this technology forward and to unlock human potential. Yeah. Vasili was kind of looking at us and watching us watching our discussions and I think in the industry you need to have some specialized technical background. Yeah, I want to say that the engineers who are going to look at that I mean I am [snorts] I wear two hats you know and I have one of the hats is the alliance of specialized professions and for example there we discuss what program should be selected for chemical engineers and I think with the special education we were able to achieve some great results. we have formulated what we need for the higher education. But the future engineer should know how to use models for the modeling of the production line. Should know how to use u drones on other driverless vehicles in the production. They need to understand how to use predictive diagnostics and together the community of the businesses and the engineers and the state institutions we develop the programs to make sure that engineers can use AI in their everyday world. Yeah. Talking about the education, we",
        "start": 1974.159,
        "duration": 4054.6960000000017
    },
    {
        "text": "driverless vehicles in the production. They need to understand how to use predictive diagnostics and together the community of the businesses and the engineers and the state institutions we develop the programs to make sure that engineers can use AI in their everyday world. Yeah. Talking about the education, we but the question is not about the money and the investments, but the question is about the talent in the educational program in the educational system. Because if a person works in the industry, he knows what to give you in terms of the content. It's very pragmatic and down to earth. And I think it's a great trend when large companies allow their employees to read lectures and lead seminars and workshops in universities because you know they're working in a company they develop some product and they then tra relay this knowledge to the younger generations. So you know it's like raise someone who will be like you great motivation. I think this will mean that there will be a lot of demand and there is a lot of demand for these lectures of these professionals sharing their knowledge and their practical skills. Yeah. Now that was something that I would like to comment on as well. In Yandex we have 30,000 people. Half of them are engineers and 960 employees of Yandex and this is not their direct responsibility. It's not in their job description but they give lectures and seminars. They also create training courses and training materials. 960 people pretty much in their own time outside of their direct responsibilities engage in training in this activity of humanitarian value. And it also increases the value of an employee within the company because there are people who enjoy teaching. and in addition to just doing a good thing, they display this loyalty to the company. Friends, to avoid turning the session into a session on just one question because we have 38 minutes ahead and four sections to discuss, let's maybe speak up a little bit. The second barrier from the survey is infrastructure. Three main problems here. Problems with the quality of data, lack of computing powers, computing resources and cyber security. Let's start with cyber security. An unexpected turn or maybe data. No, cyber security. a brief poll. When we talk to our corporate clients and tell them about AI transformation, mid-level management say that's all good and fine, but we have cyber security the cyber security department that say no, it's too complicated and then that there are a lot of nuances. Is it going to be in the cloud or on prem? And this dialogue happens in every company at Spur as well. Obviously, it's a difficult discussion. What do you do about this? You are the decision makers of your companies. How do you delineate between moving forward, progressing forward and being open-minded to the adoption of models, experiments with models, new data, etc. and the requirements of cyber security.",
        "start": 2165.359,
        "duration": 4502.136000000005
    },
    {
        "text": "as well. Obviously, it's a difficult discussion. What do you do about this? You are the decision makers of your companies. How do you delineate between moving forward, progressing forward and being open-minded to the adoption of models, experiments with models, new data, etc. and the requirements of cyber security. let me begin. I think It's akin to this question when did you stop drinking cognac in the morning? Artificial intelligence or the transfer of data to AI is in no way a cyber security issue. I mean there's this big problem. There is a a revolution happening. Everyone understands that you can optimize business significantly. It requires experiments. There are no out of the-box solutions. None of them has it. There is no single out of the box solution that you just install and there you have it. No, I mean you can and Alphab Bank will be doing great. But the point is you need to experiment and then this problem of cyber security comes up. the cyber security team that say this these data cannot leave leave the perimeter of the company and then it all goes to the CFO because the CFO starts asking questions why do you need this? and the answer is I just want to run experiments and experiments cost tens of millions of rubles. For example, Gigachad published its huge LLM with 700 billion parameters. How much does it cost to simply run it? 700 billion. That probably cost you tens of millions of rubles, right? You're right. But we have a a better idea for the colleague you're describing. there is this TV show called severance you know it so we have decided to implement this sort of severance we have giga. chat the public giga chat you go there and then it asks you you are you using your corporate account or not if you're using your corporate account you can work with all kinds of corporate data corporate files presentations excel spreadsheets etc. It's a separate environment. It it has double hemispheres, a corporate one and a personal one. The interface is the same, but it's just this delineation. I understand there are several companies in Russia, Sp Yandex, some other companies that provide cloud-based infrastructure, but it's it's a deadlock. Unfortunately, cyber security does not allow you to transmit data outwards. What can you do with this? I I have no idea. I've been discussing this with one CEO of a big company and he says I can't imagine it either. and also all frauds happen with social all data leaks happen as a result of social engineering. When we overcome this barrier I and I hope we will because this is a very serious barrier. I hope everyone listening to me today and doing cyber security in their companies information security we need to sit down and have a serious discussion and revise our approaches. But when AI is implemented when it starts making decisions that's when",
        "start": 2400.079,
        "duration": 4906.896000000006
    },
    {
        "text": "will because this is a very serious barrier. I hope everyone listening to me today and doing cyber security in their companies information security we need to sit down and have a serious discussion and revise our approaches. But when AI is implemented when it starts making decisions that's when tasks of securing your business, securing your people from decisions already made by AI. So, I suggest we invest all of our bio intelligence into trying to solve this problem and not trying to solve the problem of someone stealing a terabyte of data from some machine. Yandex or create a model, train it, and then someone steals it, steals data from a temperature sensor from the cloud. The cyber security problem is making people really passionate. I see. Let's look at an LLM. What is an LLM? It really is a large model. One server processing data with B200 maps for example. You can use it to place an ultra model one model and then this paradox comes up. It it will be working way slower in this configuration then it when you place it on a super pod with several dozens of pods, several dozens of nodes and then transfer into the cloud is inevitable. You can buy one server. It costs roughly 50 million rubles. You can't work with just one. You need to have a backup. And then the check is 100 million rubles. But but you can have a cloud and a reliable cloud partner that can help you scale up your infrastructure and you pay only for what you use and it will be cheaper and faster. So at the end of the day, cyber security indeed should be looking at how you make this secure and importantly it can be done much faster. You can start using it tomorrow and you can run your experiment not six months from now but but tomorrow when I hear about cyber security I hear we need to close everything and no data should leave the perimeter. But when you're doing something new, once again, you don't have an out-of-the-box solution that you just install and everything is running fine. You will inevitably have mistakes and you need to have some tolerance to these mistakes. You need to use the mistakes for learning. But you shouldn't use it to limit, to restrain, to put barriers for companies, for infrastructure because it will slow down progress. Another thought speaking of cyber security I've recently had this discussion with our IT security team and IT security is about bots fighting among themselves. fraudsters can use all kinds of data sets, all kinds of models and they're using them for their attacks. Our security should be on par with them. If you have prohibited everything and then the fraudster uses some latest development to attack you, you will you will fail. You will not be able to repel the attack. And then again, you need to make AI",
        "start": 2618.88,
        "duration": 5282.332000000005
    },
    {
        "text": "them for their attacks. Our security should be on par with them. If you have prohibited everything and then the fraudster uses some latest development to attack you, you will you will fail. You will not be able to repel the attack. And then again, you need to make AI GPT, and the rest available to your employees. I'm talking about our experience. you can slap them on their wrists and say don't go there, don't use that. But what we do is that we have about 80% of employees using these AI based solutions daily. We have our internal solution that is an aggregator of all kinds of models and then you go there to use our model or you can use a a model by Yandex or Spare and as soon as you try to transmit business sensitive data they get all kinds of notifications and alerts. No, you you you cannot transmit that data. So that's that's our workaround. You can use anything but there is this initial filter that gives you recommendations. please do not upload, do not transmit any critical sensitive data and that becomes a habit. more and more people are getting accustomed to it and yes it improves our efficiency. The topic of cyber security is a very important one increasingly important one. It's not a premium. It's a crucial responsibility. There is this agent fever emerging and we will have social engineering of an unimaginable scale. So yes, we do need to do cyber security in the same responsible manner as as we do everything else. Sex security in our case is a part of agile, a part of other technological processes. And also I think that as AI develops, cyber security is becoming a much more important challenge, a much more a much more interesting area for mathematicians, for talented young people and maybe will be even more prestigious. it's it's a cutting edge area with more and more innovations. So we do need to focus on it as much as on aggressive technology development. Half of the audience here presumably supports cyber security passionately and the other half is more liberal about it judging by the applause. What about the industry partner Vasili? I have a different perspective. There is this constant war between IT and security. IC and S you mean yes they cannot do without each other but that said despite this war as a person who is with the IT crowd not the S crowd I would like to put on a different hat. There is the question about what data you can transmit to the cloud. Yes. And then security can say give us a a list of types of information that we need to keep secure and then we'll give you the the secure measures. And so you go to business and ask them what sensitive data is for you for your area. so my observation is that it's",
        "start": 2826.56,
        "duration": 5700.010000000007
    },
    {
        "text": "can say give us a a list of types of information that we need to keep secure and then we'll give you the the secure measures. And so you go to business and ask them what sensitive data is for you for your area. so my observation is that it's rigid about this. The first thing they say is we cannot we can't transfer any kinds of data. All data are sensitive. Okay. But what if we anonymize it? What if we use masks etc. Another observation is Can you make can you ask AI to make a decision and then roll back two aspects to it in a lot of areas you can you can do a co c co-pilot you can use a co-pilot the co the the the AI suggests something I I review it as a human being and then I correct if necessary so it can be a sort of post control post review if the price the mistake is not horribly high. I can do selective review and see if AI has been making good decisions and then the price of a mistake is very high. you need human involvement at each step of the way to guarantee security. A designer of any technological capacity clearly includes foolproof means It has measures that protect you against all kinds of risks and mistakes. It's it's not that simple to just push a button and everything collapses. And lastly, I think it's about a psychological barrier. Many companies have this bias against clouds. I think it's becoming less and less of a problem. platform. You can use a preconfigured platform cloud-based platform and many people are opting for that instead of building something in house. And also what people are learning and and learning to use more and more mechanism is when you get a standard mechanism, it reduces the number of arguments between the IT crowd and the security crowd. Thank you. , let's put a pin on it for now or or maybe someone else has a comment. It's it's a it is an explosive subject. It is indeed another explosive subject is finance. Maybe not as much as cyber security, but still it's common place and grant described it. I think not in our companies obviously, but in some other companies, a person comes to you and says, \"I want to run an experiment. I have this great idea, a neural network. , it will ignite. It will be great. Give me some money for the for this. And the answer usually is , come back next year. We don't have the budget for it just yet. My question for the participants of the session is rather straightforward. How do you how do your companies make these decisions? You specifically are the people who have to answer these questions who make investment decisions. How do you make them [clears throat] based on your take on the efficiency of",
        "start": 3050.559,
        "duration": 6106.291000000011
    },
    {
        "text": "question for the participants of the session is rather straightforward. How do you how do your companies make these decisions? You specifically are the people who have to answer these questions who make investment decisions. How do you make them [clears throat] based on your take on the efficiency of people to executives who are only beginning to make decisions on AI and for whom an investment of [snorts] 50 million rubles is a material one? Andre. Andre. Yes. , how do you do it at Burbang? Please let us all know. I have this thing to to give me a hint. A rule book, a case book. Yes, it's a great thing. The alliance companies helped publish this book. we would like to thank Alphab Bank, Deandex, and Spare contributors as well. This is about how you convince the CFO that AI gives financial effects, but life is usually more complicated than that. And usually we make decisions not just based on a leaflet. And this book, this this rule book combines all of our collective experience. But still we have a certain threshold where we decline projects that do not meet our criteria but criteria can vary right. I have some practical recommendations in order to progress towards economic effect and profit and ROI is a fundamental investment. If you want to invest in your own fundamental models, no, sorry to interrupt. If you want to train your own foundation models, the recommendation is do not do that. Use the ones by Yandex or Spur or some other models. train them, fine-tune them, but do not train your own basic model. Yes, thank you for that. So that's that's the first threshold. Just don't don't do it. And there's this other thing. How do you evaluate the effect? How do you decide whether to invest on it in it or not? two perspectives. First, how do you estimate the effect? How much will it give you? Very often there are cases where you will not know unless you try. In this case, you need a hypothesis and then you use statistical methods for comparison. You need some ground truth where you know how much it cost you to do something today. If you don't know it, you won't be able to assess the potential effect from implementing something. This needs to be some basic truth. You test it and then you see whether technology gives effect. We have this complicated discussion on tools for developers. With certain metrics, we know how many hints we can create, how many lines of code you can you can you can write, what is the effect on the economy. One of the approaches that we've been using is we measured two teams with the same skills, how much time it will take them to perform a task with or without the system agents. And then we drew conclusions with a certain samp sampling that yes there is an effect and we know",
        "start": 3273.04,
        "duration": 6512.527000000014
    },
    {
        "text": "approaches that we've been using is we measured two teams with the same skills, how much time it will take them to perform a task with or without the system agents. And then we drew conclusions with a certain samp sampling that yes there is an effect and we know based on it. So you can make research you can make comparisons and internal AB tests but you need to know how much does it cost today. The second story is a bit more complicated but it is inherent with any technological transformation stage. If you have one process and you want to improve it and speed it up, you'll get an increment. But sometimes it is measured by point something%. If you're talking about tens of percents, that's that's a lot. Why the process is not changed? Because well, it's the same. Yes, some of the stages of the process were removed or made more less costly, but the nature of the process is the same. On the other hand, when you start to fully redesign how to do it, if you are able to do it as an autonomous generative system, but then you have to rethink the entire process, how the product is built, how to make it totally different from the very start. And this is where we can have effects and we can see it in several areas. You have multiple fold effects and you can do something that you were not able to do before. billions of rubles of effect was the effect of some of the projects. We were not being able to physically do that because we needed armies of employees really a lot of employees and then we started to do it with generative AI and we got that great value. So are you adding something with AI to the existing process or are you building them from scratch based on AI? Thank you very much. Very exciting. You know budget process and you say like okay you removing some initiatives from the list of the budget with your pen or your pencil. Should I be honest or not? No, of course not honest. Well, we have models with AB tests. Every effect every project gives us billions. Well, it's the same for us. Yeah, everything works great. I think it's more of an art rather than the science. It's maybe management science. But how do we distribute technology investments? 73% of all investments this year in technologies are AI related projects, tens of billions of rubles. And then the longer the technology lives the more precise the metrics are in the calculations. Well that's what's required. And on the early stage I have this rule. I say okay if a developer has a better productivity of plus 5% how much money will we get? Well this will be the amount of money we will win. Okay let's go and do it then. And when you cannot",
        "start": 3489.359,
        "duration": 6882.687000000014
    },
    {
        "text": "And on the early stage I have this rule. I say okay if a developer has a better productivity of plus 5% how much money will we get? Well this will be the amount of money we will win. Okay let's go and do it then. And when you cannot I mean those who just started to invest in AI they are lagging behind but you can can calculate that that value that AI will bring. I think the strategic management task is to put this strategic tasks. It's great that Bur and Gandex are producing the LLMs as well as TBank who is tuning the Chinese models, Chinese LLMs. I'm sorry if it sounded if it sounded condescending, you know. I think it's just a different way. Yeah, I think it's an effective way. Absolutely. Because there is also I mean are good as well. There are only three companies in Russia who use Chinese models or American models. Our alphagan platform is using that and we cannot afford not doing it. Have we calculated the ROI? Well, never. But on the strategic level, you understand, okay, we need to invest this amount of money, but you can't calculate the ROI. when the technology just start in its lifespan you can't really understand what it life what it contribution is going to be but after some time yeah you can calculate the metrics and the ROI great experience thank you sen well first of all we don't have budgets you don't have a budget yeah you know this process when you like remove something from the budget list budgeting list with a pen you know this is how our company works Secondly, we have discussed information security and we said okay this is not secure that is not secure. If the finances are not calculated properly, you can burn burn billions millions of rubles with AI. Even a junior employee can just, you know, burn through 100 million rubles with AI. But you know it's great that large companies exchange experience on how to measure the efficiency of AI and how to calculate properly what are the approaches to make sure there are no mistakes and if we talk about how we make decisions basically there are two effects of AI implementation direct efficiency where a large company with a lot of transactions and operations and clients and we have a constant change process the improvement of unit economy and thanks to AI we can have a we can improve that constantly and our rule is simple all investments that we put in this year should have an ROI next year so every year we have to have an return on the investments of the previous year and we have living within this paradigm for the last 10 years and it works. I'm sorry, but okay. You you started to develop your almost your own LLM. Do you expect to have a return on that",
        "start": 3675.28,
        "duration": 7279.807000000015
    },
    {
        "text": "have to have an return on the investments of the previous year and we have living within this paradigm for the last 10 years and it works. I'm sorry, but okay. You you started to develop your almost your own LLM. Do you expect to have a return on that all, we haven't started developing our own LLM model. We're not so rich. Well, first of all, they don't have the budget, right? Yeah. So we took an American model then we closed it then we took another American model then took an Chinese model trained it for the Russian language and you know it kind of did the job but training model is very complicated and very expensive and you know it's billions might be even trillions. So it's a it's a fancy thing to do. So yeah, we took a model, we tried to train it. Fine-tuning the model is much easier than developing a new one. But the approach is that okay, next year we should have a return on that. And it kind of works. If you look at the expenses, they're increasing. They're doubling every year, but we still see the effect. So the direct operational expenses are saved. an example to prove that there is some life there. There is some potential but great it's great when this technology delivers a new product. You know this paradigm shifts creates new products and here it's really hard to make a decision because you have to jump over your head. You know you're going to make a product and it's going to be popular and this investments are going to be returned to you. Now this is a more difficult but we were able to make such leap forwards. Not always do we succeed but we have this culture in the company that people are not investigated if there make an error but if you increase the expenses twofold then but you will have return next year then you can do that and to drive the business. Oh, Stannislav since he's a very humble guy, , he actually initiated this methodology and this panel. This is true, St. Thank you very much for that. Tigran, I don't think we have a lot of time, but I'll be quick. I think that we're discussing education. Education is very expensive. [snorts] Very large companies are working on the education. And I think those who are here they [snorts] are concerned about how to use AI and if you were not able to create a lot of problems by yourself you know like cyber security and other things let's just give a check for 50 or 100 million rubles and you just connect it and for 1,000 rubles you got the access right now to the cloud based Russian or non-Russian services and you know there's like a lot of free stuff as well and he started to experiment that's very important I think the main",
        "start": 3878.319,
        "duration": 7637.645000000012
    },
    {
        "text": "100 million rubles and you just connect it and for 1,000 rubles you got the access right now to the cloud based Russian or non-Russian services and you know there's like a lot of free stuff as well and he started to experiment that's very important I think the main human related first of all we discussed security that was the first topic secondly people are concerned they are concerned with what automation is given to people who are proficient in some area and you know people are saying, \"Okay, Alexander, automate what you do.\" And you think, \"Okay, well, , if I'm going to automate my my job, , I mean, maybe as a captain, you're going to be removed and automated being the last one.\" But they say, \"Okay, you have automated this function, just remove 20 or 30% of the team.\" So yes, if you did something there is a success and then immediately there's a concrete wall in front of you. So you have to change and break this mentality in the companies. I don't have a recipe on how to do that. And in Yandex, we have this problem as well. It's kind of obvious. We're all humans. And so you're kind of thinking whether you do need to automate this thing or maybe not. Maybe it will threaten me. So yeah, that's it. Thank you. st well you know just that we don't have enough monies that's why we just do training readym made models Chinese models and yesterday announced that it will put its models to open source there's not a lot of companies in Russia even in the world who can develop their own models. So the fact that there is the open- source models that are being made available and that are fine-tuned for the for Russia for Russian language, this is a boost for people to have some effect and to fine-tune these models and to have the effect on the on their business. So yeah, you can test drive this and you can make some errors, you know, some errors. It's easy for us to talk about errors because if we make an error in our financial industry, maybe no one will notice. And what about you in chemical engineering, chemical production? If you make an error, might lead to some major consequences. Well, since AI is a priority, the higher the level of the top management made in a decision the more prioritized it gets. So we created a special high level committee and we make decisions there. It is categorized in three categories. the like for example there are some projects that help to decrease the expenses on the logistics or procurement and I mean these are the projects with understandable business case. The second category are enablers like smart search when we say okay we believe in the fact that if employees will have access to the information to other parts of",
        "start": 4058.799,
        "duration": 8019.967000000013
    },
    {
        "text": "to decrease the expenses on the logistics or procurement and I mean these are the projects with understandable business case. The second category are enablers like smart search when we say okay we believe in the fact that if employees will have access to the information to other parts of them it will be very effective and the third one is infrastructure I have already told you how we made it how we make it less costly but we're not creating our own models it's not a lot of money that we invest in that so it's not a pain for an organization. Thank you very much. We have just 5 minutes left and the large topic that is called the strategy here. We're talking about the organizational structure and the KPI. Let's boil it down to that. How do you need to change the organizational structure? What KPIs do you need to put to make the AI implementation work? Let's start with you Tigran. One minute. Well, no recipe here, no silver bullet. All organizations are different. It's hard question how to change the organizational infrastructure. But based on my experience, you have to have a pressure from the top. As Vasili said, the top management should be committed and want it themselves. they should not I mean they should walk the talk really and be very driven. So that's the top down pressure that should be present. Then through some tools it should go to a KPIs. There should be some recruitment limits. the professions, the jobs that should be automated should not get this new people. You know like when someone wants to increase the membership of their team, the headcount of their team they their actions their activities should be assessed within the company. should be the goal to create an infrastructure so that the company can make this experiments. If you don't have that infrastructure, if you immediately fall down, then nothing will be achieved. this year for 2025 we have a special award to the employees for various optimizations that managers supervisors can give this money award to an employee if they implemented some optimization. Neural geese is something that we have a special award, nonmonetary award. If you have done a project for optimization or creating a new pro product or a some new process optimization and we have an award ceremony and people have uploaded and these are the tools that are needed. And the last thing is that you have to keep a breast of what is happening in the world because we are just on the at [snorts] the start of the journey. We have the problem of the white sheet. you have a paper, you have a pen, you don't know what to to write and it's like a computer with no files in it. Thank you Stanislav. Okay, I'll be quick. The top management have to believe in this technology because",
        "start": 4253.04,
        "duration": 8426.368000000008
    },
    {
        "text": "We have the problem of the white sheet. you have a paper, you have a pen, you don't know what to to write and it's like a computer with no files in it. Thank you Stanislav. Okay, I'll be quick. The top management have to believe in this technology because technologies, the competition will eat them up. The young people have to be involved and give them the right for experiments and tests. You have to be tolerant to their errors because you can't do without trials and errors and you need to start with the high school with the first years at university to give some tasks because if a young person joined your team they're open they they have an open mind and they can make a company more of an AI oriented company. Thank you. I do agree with the all of the words of the previous speakers. the most important thing is that we have AI in in action committee. This is the the committee with a lot of weight actually used I mean we have been living through this AI trend for a couple of years but Estig is saying this is just the start so we are not talking about some specific KPIs but we have a common excellence center the head of this block is of this section is going to sign some memorandum I think so everything related to that is there is concentrated there there it's like an octopus system you know with the big head and the tentacles everywhere and then this everyone is talking about that everyone is getting getting some achievements getting the money for an AI enabled project is much easier than for any other projects and everything is going from down to top as well and all the initiatives in AI are supported. Thank you. Well, we are experimenting as well, but I would be bureaucratic and I will say that we have organized a specialized board meeting and we said that in the personal goals of every member of the board. There will be two KPIs in AI. First one is the implementation of initiatives and secondly implementing AI in their teams. How many people have gone through AI training and how many tools are used? KPIs is the backbone of everything. Andre, what about Burbank? Well, it's hard to answer this question to you. I'm [snorts] going to share this with the audience. I think that Zur has gone through all the stages, through all the options and varants. And I think AI in Zur, I mean, Alexander has been an active champion for that. We had very decentralized models across businesses. Everyone in siloed businesses were doing siloed models. Then the models were more centralized. So we're changing the approaches. So we went through various options and we have another evolution stage. Right now the transformation we understood that these solutions becoming more mature. we have a special team",
        "start": 4459.12,
        "duration": 8807.491000000004
    },
    {
        "text": "across businesses. Everyone in siloed businesses were doing siloed models. Then the models were more centralized. So we're changing the approaches. So we went through various options and we have another evolution stage. Right now the transformation we understood that these solutions becoming more mature. we have a special team and here we are talking about the implementation on the market for the retail and corporate customers I mean there's no organizational model that you should use for every stage you need to reconfigure and assess what level of maturity are you at what problems do you want to solve right now and then to adapt the organizational structure and the model and the KPIs We like the KPIs very much or not really depending on the circumstances. But what's important is to avoid being static. The world is so dynamic and changing all the time that you cannot expect everything to go according to your forecast. And another effect that I think we need to take advantage of is we need to lower the threshold for entry as much as possible. The lower it is, the higher the chances are to develop technologies that will be changing our organizations and our products for the benefit of clients and people. Dear participants, dear friends, thank you for this conversation. I still have a lot of questions for you. I think as as all of you do we meet with the colleagues very very often and we can spend hours and hours debating these things. There are a lot of many there are a lot of interesting issues that we can discuss and it's great that we have this platform of the conference to exchange our opinions. I encourage everyone to join the alliance and if it is impossible for you for for some reason you can participate in thematic discussions which is a much more friendly format. Valeria the CEO of the alliance is here today. she will be happy to help you with all kinds of organizational issues. We gather together as alliance members to discuss the most pressing issues. This great methodology book is the result of all the insights that we've collected that we've garnered from all these productive discussions. Thank you very much and hope to see you back. Your round of applause for Alexander Vidian Vlatimov and Andre Bv. Thank you very much for the session. We will continue very shortly. While the speakers are leaving the stage, let me remind you that tomorrow we will have day three, the closing day of the conference AI journey 2025. This will be the day dedicated to science. We will hear from AI experts on the latest developments and innovations in AI and three award ceremonies. Today after this short break we will move on to the national awards ceremony for the biggest contributions in AI. We will reconvene at 1810 Moscow time. [music]",
        "start": 4659.28,
        "duration": 9236.473999999997
    }
]