[
    {
        "text": " the participants of the session of the second international forum bricks plus business forum AI bricks plus of AI journey the moderator of the sessions the first deputy chairman of the executive board of Burbank Alexander Vijakin Eager Coin, the head of the center of the international industrial cooperation of UNIDO in the Russian Federation. Yanzin Lu, the secretary of the committee of the Communist Party of Shanghai Scientific Research Institute of the AI. Martin Khauser Martin Kolhauser managing partner of Czech VC Amir Hussein M the head of AI section of the center for the development and progress under the president of Iran. Ronaldo do Santos the national president of the Brazilian association of professionals and companies in telecommunications, internet of things and AI. John Smley the CEO of the Turkish initi in Initiative in AI, Redwan Elui, the president of the Moroccan Federation of the High-Tech Companies and the African Federation of the Digital Companies, Ajit Abraham, professor vice chancellor of Sai University. Friends, hello. As you can see, we have a very high level and representative panel, fantastic, exciting guests. And we decided to talk about the applications of AI and everyone is going to talk about their success stories and maybe failures as well. You know, I've said before that when I opened the day with Mr. Novak that we were so excited about the success stories that we might have forgotten the challenges related to AI integrations that everyone faces. I would like to say a few words about ZBR and then give the floor to all of the other participants. We are going to ask them how they can how they are implementing AI, what is their story. We are going to speak either English or Russian or other languages but I think I will ask questions maybe in Russian and in English. But I think I mean there simultaneous interpretation. So anyway, a few words about ZBR. just you know quick notes for our international audience. Last day 172 countries, 30 million viewers. So a pretty big audience. Now a couple of words about Zur. So 90% of the Russian population are our customers. We are working in AI have been working in AI for more than 10 years. We are the largest acquirer in the world in terms of the bank transactions and bank cards processing despite all the challenges that we face right now. Now what do we mean when we say AI native vision of Zur? Obviously we are talking about hyperpersonalization around every customer and every customer is absolutely unique. Everyone who is watching this here on online totally unique and the task of spur is to create an ecosystem around every person and to provide the services and the products that they need right now. This is what we called humanentric approach and without AI obviously this is absolutely not achievable. But when we say AI, obviously we're talking about generative AI",
        "start": 8.88,
        "duration": 527.757
    },
    {
        "text": "of spur is to create an ecosystem around every person and to provide the services and the products that they need right now. This is what we called humanentric approach and without AI obviously this is absolutely not achievable. But when we say AI, obviously we're talking about generative AI Herman Graph yesterday mentioned it many times and talked in detail about it. there will be major releases in open source as well. We have Kandinski model that generates images and videos. But it's not the model that was created for the sake of the model. It was the model created for the sake of our customers and Giga Pro, Giga Max, Ultra. the range of the models. Today these models are going to be introduced in greater detail. What are the practical applications? Right now we have more than 500 cases of AI implementations in Zbor. it's pretty challenging but we are successfully addressing the challenges that we face. the Gen AI target effect is 50 billion rubles in 2025. as it is expected and we appreciate the fact that Genai gives us direct benefits from the implementation. On the slides you can see pretty ambitious figures. I'm not going to read them out to save time, but there is no process in ZBR. I'm not even talking about the bank, but about the entire ZBA group where AI would not drive some value. Sometimes it's 10% increase of value, sometimes 50, 100 or sometimes we're talking about the many fold effects. Kandinski, it's our model with the Russian code so to speak. And obviously is not only a bank, it's an active participant of an AI alliance. the heads the the the chairman of the supervisory boards are rotated. I am the this year was the chairman of the supervisory board of AI alliance of Russia. it's a big alliance. those Russian companies that have not already entered and joined this AI alliance in Russia, please do so. you will be very warmly welcome. 21 countries are in the AI alliance network. 28 AI associations basically all continents and today our panel has one of its brightest representatives of this alliance. Now we have discussed that I think that the maj the major result would be the exchange of practical cases practical opinions and we have discussed them but we thought how to crystallize our discussion to make sure that we have this kind of a summary. We decided to create an AI success hub together with Unido and we're going to talk about that a bit later. This hub helps to find solutions tailored for you. I would ask to launch a video. Yes, [snorts] that's that's the video. , basically it just uses the prompts the prompts that you that that are pretty pretty standard. You can find the cases that you need to address your specific business task and you can select the case that is tailored for you that is in line with",
        "start": 295.12,
        "duration": 1035.438
    },
    {
        "text": "that's the video. , basically it just uses the prompts the prompts that you that that are pretty pretty standard. You can find the cases that you need to address your specific business task and you can select the case that is tailored for you that is in line with to use this I invite you to use this this hub it's an international it's a collection of international cases international experience. Please leverage that opportunity. This is I think it for Burr. I would like to thank Mitri Khan as a representative of Yunido who has helped us a lot and he also organized the platform for all of these things to happen. Eager, please you have the floor. Ladies and gentlemen, good afternoon. First of all, let me express my sincere gratitude to the organizers Burr and its partners for hosting this international forum AI journey that has become a unique platform for discussing the future of AI and its role in the industrial development of bricks plus countries. For me as the head of the UNIDO center in Russia, it is a big honor to speak here on behalf of the United Nations industrial development organization, a structure that for more than 50 years has been helping countries turn industrial ambitions into inclusive, sustainable and technologically oriented outcomes. It is great to talk about our success stories and next steps. Today we mark an important event as you know we are launching the bricks plus AI success hub. It's an international platform for sharing AI use cases in bricks plus countries. On behalf of our organization, I would like to emphasize that we sincerely welcome the creation of this platform and we are pleased to contribute practically to its development in terms of real industrial solutions tested in UNIDO projects in different regions of the world. And these are not just theoretical examples but technologies that have already proven their effectiveness from automating production lines to applying machine learning in the agricultural sector in industrial monitoring systems. Our platform is of key importance for several reasons. First, it makes successful solutions visible and it helps compare their applicability applicability in specific production conditions. Second, it lowers the information barrier for small and medium-sized businesses, those enterprises that often lack access to knowledge about modern technology and best practices adopted by their competitors for example or colleagues. And finally, this initiative creates conditions for replication when a successful case in India, for instance, can inspire a company in Russia or Brazil to implement a similar solution, but a solution that will be adapted to their own tasks. Our contribution to this platform is based on three key areas of UNIDO work. The first one is regulatory and intellectual leadership. UNIDO participates in the development of the UN global digital compact and it helps countries formulate practical actionable strategies in the field of AI. We see our job as ensuring that the principles of responsible and inclusive",
        "start": 564.08,
        "duration": 1460.879
    },
    {
        "text": "key areas of UNIDO work. The first one is regulatory and intellectual leadership. UNIDO participates in the development of the UN global digital compact and it helps countries formulate practical actionable strategies in the field of AI. We see our job as ensuring that the principles of responsible and inclusive policies of different states. The second stream is international partnership platforms such as AIM Global and the BRICS center for industrial competencies. AIM Global brings together over 200 participants including ministries, technology leaders, universities and development banks. Meanwhile, the BRIRC center for industrial competencies established under the mandate of the industrial ministers of BRICS countries facilitates the exchange of technology, development of competencies and acceleration of digital transformation of industry in BRICS plus countries. Third is the practical implementation of projects in more than 700 current UNIDO projects. We see how digital solutions help modernize production, increase labor productivity, reduce costs, and expand sales markets. One of the recent examples is in Namibia, AI helps analyze huge arrays of data, including satellite imagery, to increase the yield of farms. And this is just one of dozens of similar use cases where AI becomes really helpful. And four is partnership with the corporate sector. When we were preparing for this event, we asked ourselves an important question. What value does business truly gain by participating in such initiatives? For the largest companies, this means access to new markets and new geographies. Unido provides platforms or or centers of excellence in more in more than 10 countries with separate offices and generally in more than 170 countries. These centers of excellence help companies test their solutions and present them to ministries and industrial agencies of partner countries. Second, working with the next generation of engineers. This is where young specialists learn to use digital twins, robotic systems, control systems and they essentially become ambassadors of this technology. They help their own countries to adopt them. Third is strengthening international positioning. Participation in sustainable development initiatives enhances a company's status as a responsible technology leader. Small and medium-sized businesses businesses can gain access to technologies staff training and the opportunities to integrate this into their technological chains. Importantly, we also help them, as I said, train staff regardless of the level of maturity of the company. And we also give them an opportunity to become integrators of solutions and not just their users. It is important to emphasize that aim global, the bricks center for industrial competencies and the bricks plus AI success hub platform are all parts of a single ecosystem. Aim global is the global expertise and technological vision. BRICS center is for the regional needs and focus on competencies and applied tasks of the group countries. And the bricks plus AI success hub platform is the bridge between them. The place where in demand technologies meet the real demands of economies. Today as we have the first cases already uploaded to the platform. I would like",
        "start": 787.92,
        "duration": 1951.8360000000002
    },
    {
        "text": "focus on competencies and applied tasks of the group countries. And the bricks plus AI success hub platform is the bridge between them. The place where in demand technologies meet the real demands of economies. Today as we have the first cases already uploaded to the platform. I would like technology leaders to post their solutions more actively and I encouragememes to use the platform as a handbook of practical approaches that can be implemented as early as tomorrow. Let me also note that on November 23rd at the UNIDO general conference in Riyad, we will present the new platform to the international community and we will be talking about cooperation with Spur and Russian partners. We see growing interest from member states in the best practices of BRICS plus countries and we call on them to join the new platform. Colleagues, today we are not talking about the potential of AI but about its proven effectiveness. The new international platform for sharing AI use cases in bricks plus countries is a step towards making the technologies of the future accessible today. UNIDO is ready to support this process through regulation setting through partnership platforms and through real projects on the ground. I invite all of you to join the efforts in developing industrial solutions, scaling best practices and creating a digital future that will be inclusive, reliable and sustainable in the interests of all bricks plus countries. Thank you. Thank you, Mr. Ken. when we talk about AI, the first thing that comes to mind is of course this race between the US and China. As I see it, China has been winning this race in many respects. Speaking of publications, for example, 33% onethird of all research papers on AI in 2024 were papers written by scientists from China. In 2020, that number was only 20%. So we see this sharp increase and we also see that China has a lot of platforms for developing AI. Shanghai AI research institute is one of the major platforms in China for developing AI not just in China but around the globe. I'm very happy to welcome here Miss Yanglu from Shanghai AI Research Institute the CBC Secretary. So what I'm interested in is how you do research because research doesn't always translate into commercial use but then again you need to make money to make profit. How do you commercialize AI solutions AI developments? Why is that important? Because we often say well let's be practical and someone else will do the research and then we do not have enough to invest in the research and that's that's where it ends with a practice. But China does research very well and does practical use very well. How do you combine the two? Thank you very much Mr. Vidian. good afternoon ladies and gentlemen. I am very happy to be here on this platform discussing how AI has been reshaping our world. I would like to begin my speech today",
        "start": 1043.6,
        "duration": 2376.1580000000004
    },
    {
        "text": "well and does practical use very well. How do you combine the two? Thank you very much Mr. Vidian. good afternoon ladies and gentlemen. I am very happy to be here on this platform discussing how AI has been reshaping our world. I would like to begin my speech today created in 2019 by professors from the central academy of fine arts commissioned by our institute in sense time. It took a year of field research to complete this work. It's called artificial intelligence 2019. It depicts the long way of AI development. It's modeled after the map of the Yanzi River Delta uvial plane and it combines the history, present and future imagination of AI. At the origin we see that there are three tributaries number theory, information theory and assembly language converging into the river of the Dartmouth conference where the concept of AI was first established globally through long-term evolution. AI has progressed from early supervised learning to today's deep learning and from knowledge graphs to intelligent control training. As a result, as we see in this painting, we can see the chip giant island featuring familiar names like Intel, Samsung, Qualcomm, and Nvidia. The artist includes a political metaphor here as well. On the far right there is this isolated island called Huawei Tilling hinting at the politically motivated pressure that Huawei faces. However, the artist gives this idea that Huawei will be able to overcome this. But let's turn to China. Since 2020, China has entered a rapid development phase for large models. A cohort of general purpose large models is advancing swiftly and their applications are accelerating their expansion beyond office productivity, daily life, and entertainment into healthcare, industry, and education. Presidents Xiinping visited Shanghai 3 months ago and gave special care on the science and technology development. During the visit, he said, , I would like to summarize this as follows. AI is the technology of the younger generation and at the same time AI needs global cooperation. China is no longer just catching up. It's innovating constantly owing to four major factors. Top level industrial design and PL and planning globally leading data resources and frameworks domestic open-source ecosystems and more importantly AI education and talent incubation. One example is China's breakthrough in large language models or deepseek. And now I would like to give you an outline on our institute. The Shanghai AI Institute was established in 2019 by the municipal government and Shanghai Jaoong University. this initiative aims to implement major national decisions and developments and deployments on AI development serving as an innovation platform to advance the innovationdriven development strategy. SARI focuses on original innovation in foundational AI technology breakthroughs in core application technology, R&D and industrial translation as well as talent cultivation and industrial ecosystem development. It has become an influential new type R&D institution in China. Focused on full chain innovation paradigm leading standard setting. SAR employs a demanddriven R&D model guided by major scientific and",
        "start": 1281.44,
        "duration": 2812.9570000000017
    },
    {
        "text": "technology breakthroughs in core application technology, R&D and industrial translation as well as talent cultivation and industrial ecosystem development. It has become an influential new type R&D institution in China. Focused on full chain innovation paradigm leading standard setting. SAR employs a demanddriven R&D model guided by major scientific and established a complete closed loop from fundamental research, technological breakthroughs, result translation, ecosystem building and industrial implementation. We have created joint laboratories with a number of companies in robotics new energy vehicles, smart healthcare, digital finance and digital government. For example, together with Costco shipping company, we established an automated terminal transportation industry R&D center to conduct research on key common technologies focusing on the major technological needs of China's automated terminals and smart ports. Also jointly with AI digital government joint joint laboratory with Kazakhstan National Information Technologies. We have been striving to build a benchmark case for digital government under the belt and road initiative. Our labs also made breakthroughs in embodied intelligence and humanoid robotics. We have developed China's first commercialized mass production factory for general robots. And so far we have trained over 1,000 robots in the factory based on comprehensive real world scenarios. We also established the world's first million scale data set and full potential hardware platform. I'll give you a close look into our robots. [music] [music] Heat up here. [music] Heat. [music] [music] Heat. Heat. Heat. [music] [music] [music] Heat. Heat. [music] [music] Beyond those, Siri is also a globalized institute and we always bear this in mind as a global challenges need global cooperation. On July 1st, 2024, the 20 at the 78th U United Nations General Assembly, a China resolution was adopted on enhancing international cooperation on capacity building of AI with over 140 countries supporting the resolution. This marks the first UN resolution that specifically focused on international cooper collaboration in AI capacity building. The UN has been actively promoting global cooperation in AI governance through the global digital impact governing AI for humanity as well as a series of industrial reports and white papers. Just as UN Secretary General Guer suggested, AI must run on sustainable energy so that it fuels a more sustainable future. Let us move for an AI that is shaped by all of humanity for all of humanity. On July 4th, 2024, the Global Industrial Artificial Intelligence Alliance Center of Excellence was officially launched at the opening ceremony of the World Artificial Intelligence Conference and the high level meeting on global governance. The Minister of Industry and Information Technology and the Director General of the United Nations Industrial Development Organization were jointly inaugurated. Positioned as a crucial hub for international scientific and tech technological innovation, the global AI center of excellence is dedicated to building a core platform for global AI governance, technology application and industrial acceleration. In his meeting with Guterish, President Xiinping also emphasized that China supports the United Nations in playing a leading role in advancing the",
        "start": 1516.24,
        "duration": 3204.324000000003
    },
    {
        "text": "scientific and tech technological innovation, the global AI center of excellence is dedicated to building a core platform for global AI governance, technology application and industrial acceleration. In his meeting with Guterish, President Xiinping also emphasized that China supports the United Nations in playing a leading role in advancing the architecture and the global governance of AI. [sighs and gasps] The center is jointly operated by Shanghai AI research institute and the United Nations department of digital transformation and artificial intelligence strategy. We also opened a center of use cases in customs for all bricks countries. We encourage all of you to participate in their work. This center as I said is jointly operated by Shanghai AI research institute and the UN department of digital transformation and AI strategy. It is positioned as an international AI guest room and global AI industrial accelerator. We provide services to international organizations, government bodies, , research institutes, industry and enterprise to form a healthy AI ecosystem for global economic and social development. We have now connected with nearly 20 countries and regions. Here is a glimpse of some partners across the world. And I would like to extend our sincere invitation to the guests here today to join our network and work together for a more collaborative future in the field of AI. AI is here to empower not replace. China is proud to stand alongside the global community, sharing knowledge, setting standards, and innovating for a future where technology serves humanity. Thank you. Let's build that future together. [applause] Thank you very much, Madame Lu Yansin. It would be great to see this AI map right now, you know, like in 2025. Did Did you try to have this map to to paint this map for 2025? Yes, I think that actually next year we're going to do that. since we have a lot of models that emerged and we have more and more scenarios. So, we're going to change this map, repaint this map of course because there's a new we have a new stage right now and also using AGI we will be able to develop that and create the next exciting topic for this new map. Yeah, I wish you do that. So there will be a separate island maybe a continent that will be responsible for the ROI on AI. It's a huge hype. I think the the the market is overheated. Stargate $500 billion. Invest AI in EU 200 billion e. It's like u multiple trillion investments. 1 trill200 billion and while the income is like 500800 not even the profits that's the ROI on gen generative AI now those who do those who are engaged in AI and right now obviously we there's a more and more investments in AI increasingly more investments and this is a big challenge not only for the developers not only of developers of LLMs but but those who use AI but obviously for investors who well invest in AI entrepreneurs",
        "start": 1828.08,
        "duration": 3643.584000000001
    },
    {
        "text": "AI and right now obviously we there's a more and more investments in AI increasingly more investments and this is a big challenge not only for the developers not only of developers of LLMs but but those who use AI but obviously for investors who well invest in AI entrepreneurs here with us and I would like to ask him how to transform the AI developments in real and valuable solutions for companies. What investors think about that? How do you select that? Because now you can write AI somewhere in the presentation whether you have it or not your market cap will grow dramatically. So how do do you choose the companies that you want to invest in and how do you make sure that these companies perform well and how your participants in your portfolio how they get the proper value from the AI? I've been investing as an angel investor in Europe but for the last two or three years I'm investing in Russia because we very much believe in a round of applause here for Martin. Thank you. We very much believe in ma in startups made in Russia. And I was honored by the way one month ago on the spare startup summit. I was honored to be the most active angel investor in Russia in 25 and accordingly next step we are now setting up a fund which is called chak. We are investing in AI startups in seed phase. we're setting up right now but the deals flow has already started and for today's sessions I have checked that we've we've analyzed like 220 startups within the last month and I was wondering what they are doing what they actually doing and I want to share this with you 10% are working on process acceleration 10% aimed on cost optimization 20% targeted forecasting and analytics and 50% % focus on automation. So the keysite is clear, automation stands out. It brings measurable results and it's reducing routine work so people can focus on more creative tasks. So what makes AI startups succeed? I want to point out three factors. The first is a clear vertical focus. The whole world is now watching it. Startups is seeking for startups that are vertical AIs. It means you have to understand who is your client. It's maybe experts, maybe SMB, it's maybe corporates. You should focus on geography on industry and of course on the right delivery model. So you maybe can quickly set up a SAS model. But if you work with corporates they want on premise and that's a very different story. a very different focus. So the second thing is step-by-step integration. What does it mean? If you start with pilot projects, you have to identify real business pains and you have to spend a lot of time and resources on UX means if you have the best application in the world but the end user doesn't understand or doesn't",
        "start": 2072.56,
        "duration": 4033.9850000000006
    },
    {
        "text": "step-by-step integration. What does it mean? If you start with pilot projects, you have to identify real business pains and you have to spend a lot of time and resources on UX means if you have the best application in the world but the end user doesn't understand or doesn't one of the key points I really want to focus here. AI from start startups isn't sold. It's proven in small steps. This is very important. Tell this to all the founders out there because they think I have the nicest product. Everybody should like it just like me. But no, they will like it if they understand it and they love it and they will use it if you integrate in small steps. So that's the second point. the 30s you have to understand and survive survive visit the the the full business deal cycle. What does it mean? You come up with a nice product but you have to show resilience because very often startups don't understand the processes in corporates means you have a nice product but you have to prove that's a nice product and you have to fulfill all technical requirements. You should see the eyes of startupers when the corporate points out that there are more than 300 requirements and you have to fulfill it or you go. So you have to have resilience also in financial terms which means you have to partners who finance what you're doing until the real flows from corporate start. So this is like maybe sounds like very theoretical. give you two specific examples from my portfolio. First one is in HR. You know in recruiting you have very very different processes and you know recruiters are those guys who open their browser and they have like hundreds of tabs open because they're looking for the right people. So these startups Russian rooted founder they automated short listing of candidates. What does it mean? You need for example a C++ programmer, five years experience, some other requirements. He should know English whatever and you open a chopboard maybe LinkedIn or some other maybe open your ATS system and having set these requirements you get hundreds or thousands of hits. So these guys have invented a tool that makes short listing means this person fits 98% this person 97 and so on. And why I'm telling you all this because in order to come up with a let's say MVP plus very interesting instrument it took more than one and a half years no turnover but you want you want to to eat you you need some housing you one and a half years somebody has to finance you and after this one more year to refine UX means to make it fit that people really love to use it and using it. So these guys were like two and a half years spending on developing the instrument to make it nice and then within one month they",
        "start": 2270.32,
        "duration": 4383.665000000002
    },
    {
        "text": "you and after this one more year to refine UX means to make it fit that people really love to use it and using it. So these guys were like two and a half years spending on developing the instrument to make it nice and then within one month they customers paying customers. from an investment point of view it's like a like a textbook story. I was the first investor then the Stockholm School of Economics took over. They supported them and after showing tractions after two and a half years they raised the next round 350,000 euros which is about three 30 million rubles and now they're doing fine. they're can can develop their product and go for more clients. So that's the first case. The second case I want to share is a Russian startup present simple AI. These guys are simplifying corporate presentations based on the brand book. what is interesting here they started as a B2C company. They had something like 700,000 registrations during first year, students, teachers, experts and then they pivoted to corporate to B2B customers which is which is not very easy because you you get a lot of technical requirements, security requirements and so on. But they did fine. this year they already realized five pilot projects. One of them we're very proud of that in spare marketing. a lot of people using their this software and from an investment point of view I was again the first angel investor believing in this idea I was introducing them to two other angel investors one just giving money other one giving expertise in the industry and network and a small fund now they have these pilots now they have the B2B tractions they're knowing they know what they're doing they are they know what they're not doing very important they are ready maybe for next step to go to bricks because it's a very interesting product not only for Russian companies and so now two two funds want to raise provide the next finance round. So in a nutshell what I'm talking here beyond the model itself what truly matters is integration persistence and focus integration persistence and focus doesn't sound very technical right so AI models become commodities but real emerges but real value emerges when founders understand industry deeply solve a specific pain and stay resilient. And this means for investors, startups alike is surviving the real world AI deal cycle means thinking less about the size of the model. You should be very flexible in which models you use. Of course, they also using spare gighat, but they're also using Chinese models. and the very very focus should be on the problem you solve for your customers. Thank you so much. Thank you, [applause] Martin. Martin, thank you very much. I have some questions. You have questions about startups. I have questions about corporate customers. Yes, they have a different approach. But yeah, you need to discuss this concerns.",
        "start": 2447.839,
        "duration": 4778.125000000001
    },
    {
        "text": "on the problem you solve for your customers. Thank you so much. Thank you, [applause] Martin. Martin, thank you very much. I have some questions. You have questions about startups. I have questions about corporate customers. Yes, they have a different approach. But yeah, you need to discuss this concerns. a these were great remarks. Islamic Republic of Iran is our next speaker. When we talk about AI and Islamic Republic of Iran, you want to learn more because you want to hear how AI is going to be developed in Iran. So Amir Hussein Mi will now have the floor is heading the AI section under the president of Iran. Please you have the floor sir. Hello everyone. Good afternoon. I'm honored to be here. it's good. I'm hired to be here today to answer your question. As I know many actions are under way in this area. Many projects, many infrastructure projects are defined in my country and are being carried out. I will mention some of them in my speech. there are plans to encourage the big domestic investors to enter the AI field in Iran and also we're taking steps to encourage the AI economy e ecosystem including universities startups mediumsiz companies and also bigger ones and [clears throat] also we have programs to foster our AI education system to have more and more scientists and professionals in AI. Definitely cooperation with other countries will speed up our plan and our actions to reach the goal. Let's get started today. when we talk about artificial intelligence, it's easy to get lost in a sea of fear. Fear of job losses, control, inequality, and exclusion. And some of those fears are not unfounded. We are also we have already seen concerning uses of AI from autonomous weapons killing tens of people at a time to a content generation engines used in propaganda. From recommendation algorithms optimized to narrow our thinking for engagement and profit to platforms that harvest personal data under the guise of smart services. And perhaps most troubling of them, we see a time where even the novel concept of AI safety and ethics is being misused. used as a justification to centralize power and limit open innovation. But the future cannot be built on fear alone. We must go beyond these concerns and actively shape a better plan. One grounded in wisdom, openness, and shared purpose. Because when guided by ethics, empathy and human intention, AI can became can become one of the humanity's most powerful lies. It can help us understand our past by processing vast historical data and revealing lessons that can inform better decisions. It can help us understand history's complex patterns. It allows us to learn from the mistakes of those who came before us, ensuring we are not doomed to repeat them. It can depend our resistant understanding of the world around us. Uncovering patterns in science, nature, and society that were previously invisible, opening new",
        "start": 2650.64,
        "duration": 5303.886000000001
    },
    {
        "text": "understand history's complex patterns. It allows us to learn from the mistakes of those who came before us, ensuring we are not doomed to repeat them. It can depend our resistant understanding of the world around us. Uncovering patterns in science, nature, and society that were previously invisible, opening new of our universe. It can help us understand ourselves by revealing our moral blind spots, recognizing patterns in our behavior and guiding us toward greater self-awareness. It can make us more conscious of God's blessings and encourage us to live gratefully, respect the rights of others, and care for the environment and all living beings. It can amplify human capabilities like creativity, inspiring artists, assisting writers, and fueling innovation, not by reflecting imagination, but by extending its boundaries. And perhaps most importantly, it can bring us closer together through real time translation, cultural understanding, and the building of empathy across borders. All of this suggests AI could lead us to deeper, more purposeful lives, not merely longer or easier ones. As Tolto is often quoted as saying that the meaning of life is not in living but in living noly. Of course it is an English translation but the message remains powerful. In the country I represent. We are pursuing this positive path through a number of national initiatives. One of our most important projects is the development of a national AI platform, a unified environment where engineers, researchers, and data professionals can develop models, algorithms, and intelligence products with speed, security, and efficiency. This platform simplifies development ensuring access to shared tools and workflows and supports high performance computing at a scale. Another major initiative focuses on AI powered assistance across government institutions. This seems these systems are being designed to support dialogue with laws and regulations. Streamline administrative process processes and provide intelligent recommendations for polic policy makers all aligned with institutual policies and national priorities. Ultimately, they will be integrated into a unified government assistant framework to deliver a smart, consistent and human- centered public services. Beyond governance, we are investing heavily in applying AI to solve critical challenges especially in water management, energy planning and infrastructure resilience. These projects use predictive analytics and datadriven modeling to support long-term sustainable development. But perhaps our most valuable asset is our community of experts, researchers, and young talents in AI. A generation committed to building a smarter and more equitable future. And today in this international gathering, I would like to extend a clear invitation. Let us identify and build pathways to collaboration in sharing high quality data in co-developing models and frameworks and in setting joint goals for intelligent products that address our specific shared challenges in bricks plus countries. Let us move beyond fragmented efforts and work toward a future where artificial intelligence is not a tool for power but for humane. Let us choose the right path together. Thank you. [applause] Thank you very much. We will be very interested in",
        "start": 2920.4,
        "duration": 5825.227000000003
    },
    {
        "text": "specific shared challenges in bricks plus countries. Let us move beyond fragmented efforts and work toward a future where artificial intelligence is not a tool for power but for humane. Let us choose the right path together. Thank you. [applause] Thank you very much. We will be very interested in As we know, Iran has very good, very solid education in mathematics and computer science. , I've visited Thran recently and I was very happy to meet some of the experts there. We wish you every success and I hope you will count on our expertise as well. Thank you. And next, our guest from Brazil, Ronaldo Dash Santos, our good friend, he is back for his second AI journey. I think Brazilia in terms of remoteness, geographical remoteness at least. I think it's the the farthest country from Moscow out to those represented here. But in terms of AI adoption, it is one of the leaders. In fact, interesting figures. When I was preparing for the panel session, I saw that in just the past year plus 2 million Brazilian companies started using AI. That means roughly three companies every minute. I think that's that's the estimate. and also more than 9 million enterprises in Brazil already have already adopted AI in one way or another. So I have this question for for Mr. Dos Santos. What is helping you adopt AI in Brazil in such a large scale and what are the main success stories for this technology? Why does everyone want this technology? Okay, thank you Mr. Alexander Vidyahim. Thank you their friends that are listening to me here now the public present the panelists and Brazil has indeed invested quite a lot in in AI you know that Brazil today at the very same time we are here now in Brazil the COP 30 is going on there in Brazil I don't know if you know about that we are discussing in Brazil about our most important thing that's the legacy we have received from the past that's our natural resources and u so I bring you warm greetings of Brazil of the Brazilian people who are currently currently hosting the cop as I told you in the city Belindu para discussing the greatest legacy we process that I told you our planet's natural resources in that context while open world leaders, the government, the Brazilian government drew from within our culture and presented to the world a concept. So I'd like to teach you a new word, a Portuguese word that is much. Could Could you friends repeat with me this word much? Can you say that? Yeah. Much is a Brazilian word that comes from our culture. When for example in Brazil have to build up a house in a village that somebody doesn't have enough resources, they get the friends together and they make the mu much to come together and build a house. And very soon, very quickly, we can do that.",
        "start": 3194.64,
        "duration": 6227.385000000001
    },
    {
        "text": "from our culture. When for example in Brazil have to build up a house in a village that somebody doesn't have enough resources, they get the friends together and they make the mu much to come together and build a house. And very soon, very quickly, we can do that. more than cooperation. is more than union or collaboration. It is a concept that that takes the ingredients of all these words that I said and puts on or adds synergy creating a model of cooperation while where peers fool each other with energy strength and I tell you the result is amazing is great and Brazil implemented this much there in the COP 30 to put countries together for a purpose that's good for all of us. I I I in Brazil am president of this association called aimest one entity that practices the muching technology. We bring to the same table government, telecom operators, airports, ports, agri business, banks, academia and professionals and we discuss technology creating a catalyst environment for across select for across sectors relationship and we promote understanding solving problems and innovating solutions. Regarding AI, we have had the joy to see in Brazil a promising future indeed because of two things. First the Brazilian government, sec and second the private sector. As you said in Brazil we are around 26 million companies and from them 9 million are using now as the number you said Alexander 9 million companies are using today artificial intelligence. Every minute three companies are coming are joining AI in many areas. In Brazil, our government has created a plan called Brazilian plan for AI. a plan of investment of 23 billion Brazilian reis or something like 4.5 billions US dollars for the next three years to promote a leap in the usage of AI in Brazil. Paraphrasing a Brazilian song of Gerald Vandre that says who knows makes the time does not wait it to happen. We could not wait in Brazil. So we are leading America in this sense takes the first or takes firm steps to invest and open ourselves to investments with a detailed plan. That is the plan I told you PBIA which will make available to the inter interested parties. If you want to know about that afterwards I can send to you more details papers regarding this where we can show the opportunities in the country. We are acting in infrastructure like big data centers. You know Brazil has a clean system of production electrical energy. Then we have a tremendous power for for data center legislation, education and we are paving the future and promoting AI for good of all as our president in Brazil likes to say. And the the results do not stop with the government. Our private market is at full step. As I said, 40% of our private companies are using already it. The majority sees great benefits. a research a recent research made the",
        "start": 3404.88,
        "duration": 6661.705
    },
    {
        "text": "all as our president in Brazil likes to say. And the the results do not stop with the government. Our private market is at full step. As I said, 40% of our private companies are using already it. The majority sees great benefits. a research a recent research made the have seen one increase of 30% in their profit. So they are investing more and more in the usage of AI but basically they using AI Brazil for customer services. We are not integrating that deeper and that's there is where we see many possibilities to to go deep more than just the relationship with customers but use AI for development of products to put it in the engine of the companies that we can really really increase the profits of company. I think a significant portion of those companies faces or faces a major major shortage that is the specialized AI professionals. 46% of them says we need more professionals in Brazil. So we are looking for partners to increase part partnerships in education with our university. Brazil wants to relate to all countries in a multilateral way doing business respecting sovereignties and warranty our own sovereignty. Issues such the storage of Brazilian data and also the development of one LLM in Portuguese and Spanish that incorporates our regional knowledge are central objectives for Latin America and also for Brazil. We want therefore to open the doors for business and partnerships aligned with the this concept. Together we can make a global multi round where everyone wins with the final focus of achieving the beneficial AI for all. Just as the J that stands here in the name of our meeting, AIG stands for join. The Union of Forces, the Brazilian Mirang shares the same desire of join. So in this spirit, we invite everyone come participate in the Brazilian AI market. Ourademies are open. Our companies are eager, our government is active. So long living for the multil multilateralism and also long living for the Brazilian multi. I thank you. [applause] Thank you very much for how do you pronounce this? [laughter] Right. So mut in Russia, I think that was prior to the revolution among Russian peasants, we had this tradition where people would gather together to build a house together with with a whole village. But I don't think in Russian we have a similar concept, a similar word. But we did have this tradition. I think we can borrow the the term from from from your language but anyway this approach of collaboration of gathering together to do something collectively that's that's a great concept thank you very much for that term that new world new word for this beautiful Brazilian image I've been to Brazil and I have great tremendous warmth for this country for for for all the the Brazilians. And as for Turkey, I used to live in Turkey for about 3 years. I lived in Turkey in Istanbul and I worked",
        "start": 3625.52,
        "duration": 7089.863000000003
    },
    {
        "text": "new word for this beautiful Brazilian image I've been to Brazil and I have great tremendous warmth for this country for for for all the the Brazilians. And as for Turkey, I used to live in Turkey for about 3 years. I lived in Turkey in Istanbul and I worked when we were preparing for the session, we had this brief discussion with him and I have great fond memories about that time in Istanbul in Turkey. I'm very happy to give the floor to Mr. Cine to talk about the development of AI in Turkey. What are the success stories there, the use cases there? Mr. Ciney is the head of the association that unites 400 AI startups, Turkish companies, and he is the point of contact on AI in Turkey. Please, you have the floor. Dear Alexander Vyakin, thank you very much for the lovely introduction and inviting me. hello everyone, this is John Sinami. I I am bringing you warm regards from Istanbul. let's go back to your question. Yeah, thank you. Let's go back to your question. [clears throat] let's talk about let's discuss about AI integration challenges, realities and some guidelines in Turkey. Except for the top 300 400 companies there is almost no data driven structuring within firms. the the culture of being data oriented has not yet matured. there is a data although the data exist it is not organized or nor clean. So there is a lot of things there there is a lot of ground works to do that means it's a it's a challenging transformation journey which requires investments and unless the top management of companies support and sponsors the AI projects AI initiatives these projects fall short or fail oftenly and we face furthermore we face difficulties in strictly restrictor regulation for example in health care sector in banking insurance energy sector we have strict regulations for example you cannot use public data even though you will use it anonymously. it is forbidden to use public data for health sector for example or you cannot use external cloud services for banking, insurance, energy sectors. Here we have we we are contributing the ecosystem as Turkish AI initiative. we are acting around two major mission. first of all is to rise awareness and develop knowledge about AI in business sectors. Second is to build, develop [clears throat] and strengthen the AI ecosystem. we have variety of services and events for this. For example, we have TRAI acade academy, TRI consulting services. we provide some recommendations like gold standards. We we we telling them to develop strategy. It it means align AI strategy with parallel in parallel with your main corporate strategy. and also you have to choose carefully use cases a identify the most relevant and the high priority use cases. Here for the mediumsiz company we go further to help them. We are telling them we are asking them to provide their business processes department departmentally",
        "start": 3858.559,
        "duration": 7632.420000000005
    },
    {
        "text": "your main corporate strategy. and also you have to choose carefully use cases a identify the most relevant and the high priority use cases. Here for the mediumsiz company we go further to help them. We are telling them we are asking them to provide their business processes department departmentally smalls size companies doesn't have AI teams or you know business analytics or data scientists so they have to focus with limited source courses. so we we we want them to focus on their department departmental based bottlenecks pain points in order to gain quick wins that will boost their moral and achieve success and get experience. By doing this we are offering ecosystem stakeholders I mean Turkish AI startups we will connect them they will use their expertise without needing without the need of creating teams first of all after having after being successful on this projects they may build up their team by simultaneously in investing in training and development of their team. we are also guiding them to to finalize their project and get results because you know after the MIT research Gartner research 80% 90% of projects are failing or falling short. so in order to be success you have to you have to follow some guidelines we say that kind of golden standards and we are there to help them. Thank you. Thank you. Thank you. [applause] We're moving to Africa, Morocco. And our next speaker is Ridan Alui who came from this sunny country. AI in Africa. This is something I wanted to discuss with him. Africa is a very fastly growing continent. We're talking about the northern part of Africa, the central part of Africa as well, growing very rapidly. What are the challenges for the AI solution development in Africa? What are the practical solutions are applicable in this continent? It would be great to hear your thoughts. Hello. Thank you, Mr. Alexander. I'm it's honor to be here in the for the second edition of AI journey and I want to to present the federation because I have two hats. I am the president of the federation of ICT sector private sector in Morocco and also the president of the federation of African digital businesses that's the organization private sector ICT that we are connected with some African brothers to share best experience talking about that like this subject AI cyber security so when we talk about artificial intelligent for Africa. People often imagine a distant future. In reality, the vision the future is already here at least partially across our countries. We see four types of actor moving at the same times our techmemes and startup for us it's very important this definition. Startups for us is explorator of innovation. some companies that's going someplace that nobody go but takememes that's the builder of digital that is very important for us to distinguish these two actors and we have also infrastructure operators and also government and public administrations",
        "start": 4140.319,
        "duration": 8137.060000000002
    },
    {
        "text": "it's very important this definition. Startups for us is explorator of innovation. some companies that's going someplace that nobody go but takememes that's the builder of digital that is very important for us to distinguish these two actors and we have also infrastructure operators and also government and public administrations and finally a whole layer of traditionalmemes enemies that are only beginning to enter the digital economy. What we are trying to build in Morocco and Africa across Africa is a true AI ecosystem that connects all these actors. But to do this, we must be honest about the challenge. The first reality where data is ready AI moves fast in sentient country and ministries major companies and infrastructure operators the situation is clear as my colleague Mr. can told in Turkey processes are already digitized data exists it's rel relatively clean and structured so in this environment AI has been integrated quickly to optimize operations automat improve citizens or customer services enhance security or plan infrastructure better where data exist AI is not a concept It's a productivity engine. The second reality without digitalization. AI is useless. If data is not collected, if it's not structured, there is no point talking about AI. So AI will not compensate of for the absence of system or processes. On the contrary, it will amplify disorder or inefficiency. So for allmemes, the first level of economic de development is not doing AI. It's first to digitize properly, structure their operations and start collecting data consistently. sales, inventory, logistics, customers, transactions. Our core challenge is data challenge, not AI buzzword challenge. The third reality as your president has told yesterday the sovereignty where do our models run and who control the data. So if all AI capabilities depend on infrastructures outside our borders then we face a serious issue of digital sovereignty. Two principle and no are are non-negotiable. AI mo models must be able to run on local or regional data centers under governance frameworks we control. Strategic and sensitive data must be stored on infrastructure subject to our own laws. GPUs have become a strategic resource just like energy or raw materials. Africa does not produce GPUs. So our ability to secure supply and to build the energy capacity required to power them will directly determine or our place in the AI economy. And the fourth reality energy fiber bandwidth the infrastructure behind AI the Africa continent is a big continent is not like some continent is a very big some country has more than 5,000 6,000 to to to to do fiber so AI requires stable and significant electricity robust data center and high capacity telecommunications and frau AI is not just compute it's also the ability to move massive amounts of data quickly if we want AI to benefit to the whole continent not just a few capital we need to develop the fund fundamental infrastructure energy connectivity data center and crossborder digital corridors",
        "start": 4415.199,
        "duration": 8652.26
    },
    {
        "text": "telecommunications and frau AI is not just compute it's also the ability to move massive amounts of data quickly if we want AI to benefit to the whole continent not just a few capital we need to develop the fund fundamental infrastructure energy connectivity data center and crossborder digital corridors become a simple consumer market for AR solution, but elsewhere with the right infrastructure, data governance and emphasisment in talent and digitalizations, Africa can become a co-producer of AI with its own priorities and development models. Thank you very much. [applause] Thank you very much. our last speaker Ajit Abraham. Those who were present yesterday at our event, those who were watching it online have seen how Ajit was answering the questions of Mr. Graph and Mr. Buddhen. Very exciting answers, very exciting insights. Ajit, I have a different question for you. How do you resolve the problems with talents? Because human resources talent is the major factor of success and lack of success for AI implementations. So you as a professor, what are your take? What is your take on that? Thank you. Thank you, Alexander. It's a great honor for me to address this bricks forum. as an academician today I will not talk about AI or technology. I guess we have the whole day for tomorrow talking about various aspects. Today I want to make an appeal or a call to all the members present here. As our member from Brazil talked about mucho, we need a mucho in a very big way among all nations, all countries from bricks, bricks plus to AI alliance network members which is expanding at a very big scale. I guess all of us are doing much in our own way, in our own culture, in our own countries, solving our own problems. But it solves more of our challenging problems facing the world. For example, from climate change, renewable energy, looking at even defined sustainable development goals like poverty, justice, equality, life underwater, life above water, green energy. We have to work as a team. It's not just AI, but we need to solve greater problems facing our own nations as well as the planet at large. So today I want to highlight one of our most transformative frontiers. It's a great opportunity AI and the critical need for deeper scientific cooperation among brick first nations in its development and various applications. AI is no longer an isolated discipline. It is a shared ecosystem, one that demands coordinated research, ethical alignment and collective innovation. BRICS bricks plus countries already represent more than 40% of the global population and a rapidly expanding share of global R&D investment. By pulling our scientific capabilities, we can craft an AI landscape that is inclusive, adaptable, and responsible. At the heart of this cooperation lie shared laboratories and join research infrastructures. Imagine crossber AI hubs where scientists from Sao Paulo, Shangghai, Ptoria, Moscow and New Delhi plus other cities in other",
        "start": 4676.08,
        "duration": 9131.401
    },
    {
        "text": "By pulling our scientific capabilities, we can craft an AI landscape that is inclusive, adaptable, and responsible. At the heart of this cooperation lie shared laboratories and join research infrastructures. Imagine crossber AI hubs where scientists from Sao Paulo, Shangghai, Ptoria, Moscow and New Delhi plus other cities in other on generative AI models, medical imaging, agit media and variety of challenges. ing problems facing our society. Joined intellectual property frameworks can protect innovation while ensuring equitable benefit sharing creating trust among institutions and countries. Another con cornerstone of this movement is not just people but also the idea the intellectual knowledge. By developing regional talent pipelines, our universities and research centers can exchange scholars, PhDs and earlier carry researchers under unified bricks program. This accelerates skill diffusion and cultural collaboration ensuring that our breakthroughs reflect diversity of thought in all areas. However, scientific operation must be matched by educational reform. The I revolution is outpacing the capacity of traditional curricular which we are usually using in our universities and classrooms across bricks plus institutions. We must modernize our educational programs to embed critical thinking, reasoning, cognitive skills, data ethics, foundations in natural science and artificial intelligence across disciplines. Such modernization should not stop at university gates. We need a dynamic model of lifelong learning powered by industry embedded micro credentials when corporate and academic partners co-design short stackable courses in areas such as machine learning applications in various industries. They make AI skills accessible to working professionals and expand the national innovation base by aligning curriculara to industry needs. We also make reskilling continuous. A data scientist in a manufacturing plant, a doctor using predictive tools, or a lawyer navigating algorithmic complaints. All should be part of one connected learning ecosystem. The bricks platform provides a scale to make this vision real. When science, education, and industry intersect, traditional sectors transform. In healthcare, crossnational air research is already using federated data learning techniques to diagnose disease without compromising privacy. In law, AI assisted compliance systems are helping harmonize regulations across emerging markets. In manufacturing, collaborative robotics and predictive maintenance systems powered by shared learning data sets are boosting productivity. In finance, AIdriven credit analytics are extending financial inclusion. In agriculture, precision farming guided by satellite data and local crop intelligence is improving yield while conserving resources. All of these frameworks depend on one thing. Open cooperative science built upon mutual trust among bricks bricks plus partners. AI is not just a technology. It is an expression of how we imagine our collective future. By investing together in shared labs, unified intellectual property policies, talent exchanges, and co-created educational frameworks, bricks plus nations can define a more balanced global AI order. One that prioritizes social impact alongside economic returns. Let this forum mark a renewable renewed commitment to align our scientific strengths to build bridges between classrooms and companies and to ensure that AI serves humanity's broadest goals. BRICS nations have always been engines of creativity and resilience. Together",
        "start": 4922.48,
        "duration": 9714.040000000008
    },
    {
        "text": "AI order. One that prioritizes social impact alongside economic returns. Let this forum mark a renewable renewed commitment to align our scientific strengths to build bridges between classrooms and companies and to ensure that AI serves humanity's broadest goals. BRICS nations have always been engines of creativity and resilience. Together can lead not just innovation but in shaping a more equitable digital century. Thank you so much. [applause] Thank you very much Ajit. you know the the word that we have this mutra I'm sorry for for pronouncing it wrongly mut is a kind of a Russian word there is a Russian word subotnik you know we had that in the Soviet time people gathered together to clean the parks and other things but anyway I asked Gigacha to come up with another response so mutra can be translated in Russian with another word Maybe you know that would relay the essence of this word Portuguese Brazilian word is mutual help mutual assistance and mutual support and I'm really glad that all the speakers were talking about that this mutra this mutual support mutual understanding and mutual assistance is the main topic that we are going to use to underpin our cooperation in AI. We're I'm talking about the international AI alliance and all our efforts. So, I'd like to thank all the speakers and I'd like to thank all those present here and on watching us online and we are continuing with the second day of AI journey. Thank you very much. Now we are going to present the speakers with case boxes, special presents, special gifts.",
        "start": 5217.679,
        "duration": 9917.561000000005
    }
]