[
    {
        "text": " [Music] Want to see how AI really works in business? What is the benefit of it today and how do you enhance the effect in the future? We are already reaping the fruit of AI, manufacturing, transport, finance. Soon on stage, we will hear from experts from Russia, China, Bahrain, Congo, Malaysia, and the US. Stay tuned for keynote talks about AI transformation. All of the viewers can get feedback from our speakers. You can scan the QR code on the screen. You can submit your question and your name. And at the end of each session, these speakers will answer the most interesting questions. Let's continue. Science fiction gives you questions and reality gives you answers. New challenges for the future. Brief history of AI, its current uses and the use cases for dozens of years to come. Imagination does shape the world. That's what our next speaker thinks. author, science fiction writer, co-author of the book AI 2041, Tifan Chen with a report on the future of artificial intelligence from fiction to reality. Good morning everyone. , it's my great pleasure to be here on the stage of AIG in Moscow. Today I want to share you the future of AI from imagination to reality. So, as a science fiction writer, I always been asked why we need to read science fiction to better understand the reality and the future because somebody might say, \"Oh, it's all imagination. It's all made up, right? So, it's like bullshitting and making no sense at all.\" But actually, it is not. Let me tell you why. we can see the chronology of AI from different aspects. For example, you can see in terms of evolution of technologies. So we can see all these curves like waves. It comes and goes in history, right? So imagine if we are living in one of this curve like we're in the 60s when AI just emerged. Can we predict? Can we imagine we're in the second wave of AI boom which means the expert systems and when we were if we were living in the time of 80s right so like Joe McCarthy so back in the 70s and 80s he said like we will be able to create machine things like human within five to eight years but of course it never happen. Can we imagine from the 90s we will have deep learning and we will have artificial neural network just like Jeffrey Hinton did in his lab is quite marginalized in a way. So nobody ever believe in him in his direction. Right? So basically this is our limitation because human intend to think in a linear manner but actually reality happen in different way and think about all of those iconic figures, products and events right. So think about when each one of them emerged in history, everyone will think, \"Oh, this is really revolutionary.\" But we all know like figures they have their lifespan, they have their",
        "start": 0.49,
        "duration": 478.0680000000001
    },
    {
        "text": "actually reality happen in different way and think about all of those iconic figures, products and events right. So think about when each one of them emerged in history, everyone will think, \"Oh, this is really revolutionary.\" But we all know like figures they have their lifespan, they have their their life cycle. So it just comes and goes again and each one of them might represent a school, a style, a direction of imagining the future of AI. Let's think. Okay, here might be some timeline of the AI robotic imagination in the classic sci-fi movies and you know fictions when Arthur C. Clark working together with director Stanley Kubri in 1968. So they imagine in the year 2001 we can travel we can fly to the moon and we have base there and everyone can read the news u from this kind of tablet and we can have the super intelligent AI to governance the spaceship like how 9000 and we can see maybe it didn't happen in the year 2001 But it happened definitely later. So I would say I'll argue that the best class of science fiction they predict something right but in different time in different shape. So we might see it as kind of metaphor. Let me give you some example. So this is the almost 100 years ago when when Chapek his Czech so he wrote this theater play Iur Rousam's universal robots and it was adapted into different theater also in Russia back in the day. So he imagined in the future robots might replace human labors and there might be a strike rise by the robots and the robot the term actually from Czech a robot which means forc labor but you know three years ago when I was in Los Angeles in LA so I witness this massive strike happening in Hollywood you know proposed by all the human writers. Can we imagine that? Can we imagine this kind of strike actually happened not in physical labor not in the field of manufacturing but in creative works. So this is something of course Chapek makes something right and get something wrong but we see it in a metaphorical way. So he predict the future of this conflicts within the capitalistic system and this ine distribution of resources of time and hierarchical power dynamic. Basically we're causing a lot of problem through the time of erosion with the acceleration of technology and automation of everything. Let me give you another example. So this is from the classic science fiction writer isak Asimov. So we all know that right? So people in the room three laws of robotics. A robot may not injure a human being. A robot must obey orders. A robot must protect its own existence. And actually it was first introduced to the world in his short story runar around in 1942 and expand this idea later in his eye robot the",
        "start": 248.319,
        "duration": 988.0690000000002
    },
    {
        "text": "laws of robotics. A robot may not injure a human being. A robot must obey orders. A robot must protect its own existence. And actually it was first introduced to the world in his short story runar around in 1942 and expand this idea later in his eye robot the can Azimov imagine almost like 80 years after we might find that some mother you know accusing AI basically make his son like 14 year old boy committed suicide because of character AI and he's basically she's basically suing the AI company for allegedly contributing to his son's debt, her son's death. But you know, as parents, we always blame on technologies, video games, mobile phones, internets. But maybe it's not all of the problem is maybe sometimes we should ask ourself what parents did wrong to their children's right and think about the human enlightenment issue. So this is the classic one and also my favorite one. I I rewatched this film since kid because I couldn't get it. You know when I was a kid back in the kindergarten I start to watch this film and I always fell asleep when you know the spaceship travel through the stargate. It's kind of psychedelics in a way and it's quite you know dazzling but I just couldn't get it. But you know what? Now we're talking about the killing AI. So when how 9,000 speak the iconic lines I'm sorry Dave I'm afraid I I can't do that. So because the AI through the lip reading reading the lip of the astron speaking to each other they plan to shut down the AI and AI decided he must take the first move he want to kill two astronauts and we're we're talking about alignment issue right now but to me in the movie actually shows the humanity enlightenment of the AI because it fears it fears the death. It fears to be shut down by human beings. And by the end of the I think when Dave is about to shutting down you know taking off one piece by the other the chips out of the machine it just slowly fading away its consciousness and it started to sing a lullaby and that was the most beautiful moment and it captured me. It was haunting me for all the time and couldn't we say this is the most human moment of AI in history. So when we talk about alignment, we have to ask ourself with whom we require the AI align with which country, which civilization, which class, which race, right? So and which level of the value from the nationalistic to family level or to individualist level. So this is all very ambiguous question. They might be not easy answer out there and humanity. Are we static since the caveman time or we're just continuously evolving through the time through the history? I think that's the question. I don't have a clear answer",
        "start": 511.84,
        "duration": 1465.5900000000004
    },
    {
        "text": "or to individualist level. So this is all very ambiguous question. They might be not easy answer out there and humanity. Are we static since the caveman time or we're just continuously evolving through the time through the history? I think that's the question. I don't have a clear answer that. And to me, science fiction offers as a diversified, open and nonlinear lens, a cognitive hedging system to counterbalance the bias. You know because each one of us we were trapped we were trapped in our own momentum our own limitation of thinking our you know our social construction you know the way of seeing things the way of thinking about things the way of imagining the future basically was quite limited but through reading different versions of the future It might expand expand our cognitive infrastructure and what's more important to benefit from the uncertainty. Right? So right now we're embracing huge massive uncertainty in human history. But just like Nasim Talb in his famous book anti- fragile he said the the most important things how we create this kind of ability how we nurturing our ability to benefit to gain something out of all this uncertainties I think that's the most important thing we have to learn nowadays And of course I'm here because of this book. I think maybe some of you have read it and I my co-author Dr. Ky Lee was speaking previously through the screen and in this book we predict and we try to predict a lot of futures with AI with human interaction and we touch upon different sectors healthcare education finance media warfare even sustainability and across different cities around the world and one thing actually was so fascinating because we co-authored this book during the time of co from 2019 to 2021 when the book was published in English and traditional Chinese and one year later it got published in simplified Chinese and right now we have 20 something language editions and I'm so happy. It was kind of popular here in Russia and I I I met people all around and said they how much they love the book. But do you remember in 2022 November the 30s when chat was launched basically it changed how we imagine the future of AI right so that was actually one year after the book was published. So many things in the book you know about all this technology about all the details of how technology might evolve especially on AI could be wrong for example one story happened in Africa lers we're talking about in the future people still using the model GAN you know generative adversarial network to predict to produce all this deep fake imageries animation films whatsoever but actually one year after you know diffusion model emerge so it basically changed everything so this is what I found fascinating when we try to predict the technology like mostly we got it wrong because we only",
        "start": 754.48,
        "duration": 1962.1509999999996
    },
    {
        "text": "to predict to produce all this deep fake imageries animation films whatsoever but actually one year after you know diffusion model emerge so it basically changed everything so this is what I found fascinating when we try to predict the technology like mostly we got it wrong because we only we try to capture So the humanity mostly we got it right. Why? Because humanity is more stable, right? It's just like the bad rock in the ocean. And the technology just basically like the water it comes and goes. It's always like that waves after waves is always changing. So this is a very f futurology perspective how we see futures in different ways. You can see maybe literature, maybe films, all kind of creations. It try to encapture all the possible futures. While science fiction is very good at you know projecting plausible future, probable future even some of them are good at projecting like very specific scenario of the future. But what's the best best kinds of science fiction to me is through the storytelling we are able to create the preferable future. That's the future we are aiming for. We try to create. We try to demonstrate. We try to actualize through the storytelling through building up all this consensus and share imagination about the future. I want to share you a story from ancient Chinese mythology. It's talking about a king meets the artifier so he's the master of building things. So who present a mechanical man that can sing, that can dance and even flirt with the king's lover. And the king got so angry and he wants him to execute it. But Yianu the monster dissembles the man called uncle man into all the wooden parts. So to show the king actually there's nothing there. There's no one man hidden be behind the scene to making all the things up. So this is quite fascinating. It could be the very first science fiction in human history. You know it's talking about human no robots just like our silver bank launch yesterday. And what we can see deeper in this story is basically you see a lot of illusion of anthomicizing itself. So we project our jealous, our envy, our angry or even passion, our love onto another thing. the otherness, the object, the humanoid, you know, crafting. And we have always this kind of durism like awe and dread, like fear and favor of technologies. And this is something we're always been trapped. We always try to escape. And also AI could be the thing to blur all these lines between what is real, what is force, what is human, what is machine, and what is emotion, what is simulation. Basically, when you're talking to the model, sometimes you might feel, oh, it it really does understand how I feel, right? It feels like it's the best friend, is the even perfect lover in a",
        "start": 1007.68,
        "duration": 2458.630999999999
    },
    {
        "text": "is force, what is human, what is machine, and what is emotion, what is simulation. Basically, when you're talking to the model, sometimes you might feel, oh, it it really does understand how I feel, right? It feels like it's the best friend, is the even perfect lover in a The feeling is real, right? But what about what about the projection of yourself onto it? Is that real? So think about the recursive feedback loop create by this human machine interaction. I created thing you know it's not about what is the technology what is AI what is the machine looks like in the future but it's also about how we see the technology and how we interact with the technology in Chinese it's called guanchi relationship so I I I I draw this charts you know you can see the you know xyaxis with the in intelligent level and the time and there's human baseline and there's machine intelligence. So I just summarize in different pattern of imagination of human machine power dynamic. So I'll explain each one of them in a very brief way. So like people told me in Russia when you when you when you mention AI when you mention robotics people were always going back to oh that's Terminator right and that's Skynet. So I think that's the mentality not only in Russia but all around the world will human beings be and nai will be erased by the machine totally from this planet will will us be enslaved by another species. But what if the real skynet is not the future AI but just our decision to build today's AI entirely on war logic and arm race incentives. We're thinking that way sometimes we're thinking everything is zero sum games, right? We have to be we have to be dominant. we have to be the only winner and we have to build something to erase the rest of the others. So what if that kind of mentality be learned be picked up by AI and it help it to become something just like Skynet in the future and let's see another kind of imagination of human machine relationship is machine slavery right slavery and later on there will be revolution so this is also in the very famous TV series west But does dreaming of robots uprising distract us from the fact that we still treat millions of people as deposable extension of the algorithms. So that's just another way of you know you know try to distract the focus and it doesn't make things any better. And another classic very negative very dark imagination of future human machine dynamic is human becomes become the battery form. So it's the resource can be exploited. So actually it's what we are facing right now right all these platforms already mining our data and attention in the most in extreme way right so basically we were trapped in this kind",
        "start": 1257.52,
        "duration": 2928.790999999998
    },
    {
        "text": "machine dynamic is human becomes become the battery form. So it's the resource can be exploited. So actually it's what we are facing right now right all these platforms already mining our data and attention in the most in extreme way right so basically we were trapped in this kind spreading stretching our attention as thin as possible across different medias but how to be focusing how to how to help our generation younger generation to rebuild their attention, their cognitive ability to think deep, to write deep. So this kind of repu or bupio fantasy expose the system or just excuse us from refusing changing the game. Of course, we have some bright one. We have symbiotic society mode which from one of my favorite animation series the pantheon which was show last year. But think about when upload consciousness and that kind of virtual world virtual mix of human robotic and AI whatsoever intelligence just another projection of the reality hierarchy into a symbiotic AI future. So are we really transforming anything at all? Are we really transforming the power dynamic or just with hot coding today's domination into tomorrow's ecology? So yeah, so this is all the questions I want to ask, I want to raise and to me like imagination forms narratives, narrative shape reality. So we are living in the world of poly crisis. We have geopolitic crisis. We have economic crisis. We have clim climate change crisis. We have all this crisis. But also the imagination crisis. We're lacking of new imagination. So can we tell new story about AI of the future? So this is the new book just got published in China. It's called ocean break. It's a ocean and climate change fiction but in this novel so I create this so-cal leela large intelligent lunatic agent in the future. So it's talking about like this AI or she or they call themsel call themsel EI. So it's emergence intelligence which emerged from the human trash data set of all time and it tried to unlearn all this humanistic human centric value to expand to other species even the whole planet and it tried to create this kind of planetary sensory layer not only to observe outward but also reflecting inward to see what's happening within the planet within the atmospheres and it tried to inspire the human agency in a huristic way. So this is the brand new story try to reimagine how AI will be evolved in the near future. So let's go back to that question. how can we benefit from all these uncertainties? So basically this is what we're doing right now. We recognize ourself from the mirror of otherness. We see all this fear and flavor bipolar. We see this zero some phobia. We see this human centric blind spot because we couldn't think beyond that. And also we all trapped in this dark forest paranoia. Right? So this is what we see",
        "start": 1497.279,
        "duration": 3409.589999999995
    },
    {
        "text": "ourself from the mirror of otherness. We see all this fear and flavor bipolar. We see this zero some phobia. We see this human centric blind spot because we couldn't think beyond that. And also we all trapped in this dark forest paranoia. Right? So this is what we see AI relationship of the future. The question is can we become a better human rather than asking can we build a better AI. So that's my that's my argue right. Parents always think about, oh, how can I raise a better child, smarter child? How can I, you know, nurturing a more care caring, a more beloveing offsprings? But it's just the mirror you how to look into yourself. So this is three quotes about the future. two of them from my favorite science fiction authors. One from William Gibson. Everyone must know this. The future is already here just not evenly distributed. It reflects the capitalistic future the narrative. And the other one from Ursula Luin she said the future is already full. is much older and larger than our present and we are all the aliens in it. So it represent the alien native future which human are kind of irrelevant and could be something even more marginalized in the future. But to me I might argue that we need to build up this kind of participatory future with every future we wish to create. We must first learn to imagine it. To me imagination just like muscle is something you can practice you can learn is part of the future literacy. You have to learn how to sensing the future, how to knowing the future, how to extrapolate, extrapolating the future and how to integrating the future to creating the future. I think all of those should be part of our education system. Like yesterday, Mr. President mentioned how we can change the education to help the younger generation to adapt in the age of AI. I think this might be part of the answer like how to encourage the younger generation the children to imagine. So this is what AI still couldn't do right. This is what they are not ready there yet and this is the future we really need to cocreate all together. So thank you. Thank you to fine chain. Thank you very much for expanding our imagination. Thank you so much for your performance. Thank you for sharing the most breakthrough ideas. Enjoy Moscow. Enjoy Russia and the conference. Thank you. [Applause] [Music]",
        "start": 1742.399,
        "duration": 3825.0299999999934
    }
]