[
    {
        "text": " Friends, today as part of AI journey 2025, we would like to show you another exciting thing. Even in the during our business day, we still prioritize create creative things. The students of a cinema academy have together with a giga has have created the first short film and it would be great to watch it. Our next speaker, senior vice president, director for head of marketing and media communications for Bur Vladisl Cranian France. I'm going to be very quick. Last week we rolled out with a movie collection of short movies Russia I love you. It talks about interesting situations and interesting people who are in these situations and one movie was saved for this day so that you going to experience the premiere. this is the short movie created by the students of the movie academy of Russia and our giga model Mikail Lurman of a famous poet of the 19th century. His vision on the Russia was u pretty sometimes controversial sometimes he was oh so boring. Oh yeah. Yeah. Remember that you should I should write an essay. Gigach chat. Let's fantasize together. Okay. Sure. What are we going to start with? What would the classical writers do if they were living in our time? Let's put Larman on this on this lift. And there you have Lmentoto with a phone. [snorts] No, not not this one. my smartphone. I was ready to love the whole world and no one liked me. No one put any likes and this is how I learned to hate. Became a hater. He's So maybe he is a blogger. He should be a blogger. Well, I'm in Pigor. Fantastic town. Fantastic springs. It's great to live here. Turkish coffee, please. No, no. Something else. Vanilla rough, please. Vasa. No, my not my name is not Vasa. I'm someone different. I going to pay with a card with a smile. I don't see any smile. So, I'm going to the road alone. I'm going through the fog. And this is something that I created in Pitigorsk. And there's a beautiful girl nearby. She should be beautiful like and bright like my mom. I'm sorry. Can I invite you for a tea? You're very beautiful. I would go to a duel with with you. This is my house. And who are you, Lurmantov? Let's continue. Let's talk about maybe he should ride a scooter. I really love Amore River. Fantastic town. Switzerland and Finland had never I have never felt such an liberty there. Can you feel the air? Feels so great. Now I need to find a hotel. Everything should be beautiful. in humans clothes, thoughts, soul and social media presence. Healthcare is my lawful wife and literature is my lover. When I don't like to be with one, I'm going to another one. Well, this is like abuse. Fantastic. And very bright region. Such a life is happening here. Haven't seen that in Europe. Maybe a bear should",
        "start": 7.839,
        "duration": 533.7149999999999
    },
    {
        "text": "media presence. Healthcare is my lawful wife and literature is my lover. When I don't like to be with one, I'm going to another one. Well, this is like abuse. Fantastic. And very bright region. Such a life is happening here. Haven't seen that in Europe. Maybe a bear should Pushkin. Let him be in this rose hoodie. Well, wait. He is in the shooting at a shooting range. What about Dantes? I wouldn't have missed. Oh yeah. Well, we had this beautiful day and the twinkling of the glass and the champagne. I have to post a photo while the light is still good. Oh, this machine destroyed my poems. And there's the Russian rap on the screen by Pushkin. Oh wow, my essay is ready. This is something I have dreamt of. Or maybe not. No way. Well, they would have something to write about here for sure. A round of applause. Now, of course, we're going to continue I have no doubt about that because the authors of this short video are going to enter the big cinema world and AI will create so many new jobs and we will have many encounters with the favorite characters and writers. Something that might not happen. Sometimes you think something will not happen but it will happen. AI journey 2025 Russia, India, Bahrain, , China, Congo, US and Malaysia. These are the countries from which the experts shared their experience in AI. That means that this AI conference is really global. , but we have other events coming up this session in AI. the AI alliance session unlocking AI potential overcoming key barriers to business adoption. This is a business session with AI alliance Russia as well as the AI leaders awards ceremony. we are now going to have a 10-minute coffee break and we will reconvene in 10 minutes. [music]",
        "start": 310.24,
        "duration": 817.714
    }
]