[
    {
        "text": " Next level is where robot uses millions and millions of virtual episodes to learn and confidently acts in the real environment. Embodied AI and use cases that mature first. Let's hear from director of my EDU institute, Jeffrey Tubantan with a report on from service robotics to embodied AI evolution and the future of AI. Good afternoon, ladies and gentlemen. [applause] So, I'm Jeffrey from Lada Robotics Malaysia. So, I'm very glad to be here today and I'm even more happy when I saw the robots. So you still remember the human robot that is locally made here in Russia and it excites the crowd and that actually excite me even more. Why? Because my presentation is very similar to what excite you. So I I believe that you you you will like it. Right? So this is my topic right? It's a bit technical. So from service robot to embodied intelligent the evolution and future direction of artificial intelligent. All right. So in simple term I'm going to show you like over the year AI has been transforming robotics research right and together they are actually making wonderful things as you saw in the previous presentation that actually a lot of this robotics technology once we add in AI and it come out wonderful things like what you saw just now in the autonomous car. Okay. So I'm going to show you more because that is what the stories that I'm going to share with you. So I'm going to start to turn back a few decades back to show you some background. So when I mentioned robotics maybe like 15 years ago. So everyone will talk about the one on the left hand side right. So that is basically robots in factory. Okay. So we call it industrial robots. Okay. So it depict it actually like somewhere in 1980s where we use a lot of robots and increase our productivity. So it is a a good creation of humanity and it brings a lot of value in our life. Right? But it actually do very repetitive thing. All right. So what I can say is like it is good, it is fast, it is strong but maybe not that smart. Right? So AI come into the picture. Right? So somewhere in between 1980s to 2000. So we start to think of like how to make robot more intelligent. Okay. So we have another new domain of robots. So we call it service robot. So we can compare between these two on the left and on the right hand side. Right. So the service robot basically do something out of what it's supposed to do because in this video the robot is basically not cleaning robot but instead it is actually interact with the customer which is this condition never happened in industrial robots right because industrial robot is designed exactly what it's supposed to do and does it right but for service robot it actually",
        "start": 8.24,
        "duration": 405.27900000000005
    },
    {
        "text": "in this video the robot is basically not cleaning robot but instead it is actually interact with the customer which is this condition never happened in industrial robots right because industrial robot is designed exactly what it's supposed to do and does it right but for service robot it actually human Okay, of course the first concern is safety but how to interact with human especially when the robot supposed to do something that's out of it scope like Roomar is not designed to play with babies right okay so that interaction actually require a lot of intelligent and that is where AI come into picture so this is where the direction of my presentation today so we can see after we have the roar which is a success story of service robot then start people start to think like what else that we can do. So we start to add more and more intelligent into robots and we create more and more smarts robots. So we can see from intelligent robot research that happen throughout the year throughout the world we can see a lot of robots start to get smarter start to get better and also we create a lot of new services. So for example in elderly care home right so or in like children home etc. So there are a lot of facilities that require human care but we are lack of this human label. Okay. Previously it is done all by human labor but now we have robots start to take over the position because it it it slowly acquire the intelligent that it can really fulfill the scope of the job. Right? So as you can see also in 2020s we have covid that make a pause of the world but that actually make a big push to robotics that we have seen like for example delivery robots. So robots start to help us to deliver our stuff not only deliver food, medicine in hospital and also a lot of other things. For example in hotel they start to take orders in restaurant and not only just basic needs as you can see on the right hand side lower we have very fancy thing like robot restaurant. So today we can see there are actually a lot like for example robot is making latte art for your coffee right and it's actually making much better than normal human being right so we can see once we add the intelligent part into robots this service robot actually can give good service to us human right so that is basically the growing part so now how we actually go moving forward from there. So a little bit background that I actually did this like 15 years ago. So when I joined this competition called Robocop at home. So it's a competition is a worldwide competition platform that is designed to call upon all the scientists all the researcher around the world that we",
        "start": 215.519,
        "duration": 764.4780000000002
    },
    {
        "text": "So a little bit background that I actually did this like 15 years ago. So when I joined this competition called Robocop at home. So it's a competition is a worldwide competition platform that is designed to call upon all the scientists all the researcher around the world that we see what or how we supposed to design our next generation of service robot or the robot that help us in our home environment. So actually without realizing I'm actually into what we call the embodied intelligent research direction. So from there we actually have from service robot now we are talking about embodied intelligent. Okay. So this is the competition setting. So as a comparison when I building the robots we can see that the robot actually have very similar component as a humanoid robots or or what we what we call it embodied environment embodied intelligent. So I roughly divide into this five parts. So you can see the robot brains okay which is well you have the robot intelligent plus the AI which is it involve all the AI machine learning cloud computing big data etc right then we have the eye okay the eye like just human eye so we use AI to make robot can see better just like how human being perceive the environment then also we have the mir which is like we give the capability using AI for the robot able to communicate with each other like us human communicate with each other, right? So that is the human robot interaction and of course robot arms which is the object manipulation. So that is where we have physical interaction with our environment and with other human being. And lastly of course this one pretty much presented in the last presentation which is the robot leg which is the autonomous navigation. So now we know that robots actually able to navigate not only outdoor but also in indoor environment that it can move around just like us human as long as we have the maps as long as we have the coordinate system and so on which is today we have all the sensors that help us to do that right so these are all the components that slowly build up the embodied intelligent okay so from Here I would like to show you some example. So for example like in vision over the year you can see slowly last time I still remember when I was in school I use very primitive way to make cameras to take photos and to understand what is happening in the environment do pattern matching and so on. But as AI grow or AI advance today we have machine learning and even deep learning. For example, on the left hand side we have the deep learning model that actually help us to in real time understand what are those thing in front of you right and this thing can be",
        "start": 397.759,
        "duration": 1115.3559999999998
    },
    {
        "text": "AI grow or AI advance today we have machine learning and even deep learning. For example, on the left hand side we have the deep learning model that actually help us to in real time understand what are those thing in front of you right and this thing can be we can use it in the industry. So for example in the automated visual inspection that show on the right hand side and this technology actually keep on advancing because today we have what just mentioned in the previous presentation the VLM visual language model that we don't even need to train right for a particular case but now if we can just connect to those big VLM that is available our robot can just understand what an apple look like all right or what a bottle look like etc. So it actually go very far with AI. Then the second thing is human robot interaction. So if you still remember in the slide that I show you the roomar which is a play with the babies. So that is a very primitive interaction right but today the human robot interaction is getting very complex as you can see on the left hand side and also on the right hand side whether is in a domestic environment like a old folks home or in a technical factory environment. So this robot actually have a lot of intelligence thanks to our large language model that it can actually interact. Also we have very excellent speech recognition and speech synthesis technology that enable this robot able to communicate very naturally with human nowadays right even maybe now you might realize that you don't actually feel weird talking to robots anymore right so we can see AI actually bring forwards this human robot interaction and I believe in future it is not weird at all when human starting to communicate a lot with human with robots. Yeah. So maybe I can also say that maybe some of you now actually can have a very lengthy chat with chat GPD or something like the giga chat. Right. Right. So of course the next thing is manipulation. So physical manipulation. So we have this mobileation. So in factory when we want to do some pick and place it is very simple because everything is control. We have precise measurement for everything. But in a home environment, it is a totally different story because your fork, your spoon, your plate in your house and in your neighbor's house are totally different. So how to actually precisely can manipulate all this object require very high intelligent and that is where AI come in and not only for mobile platform and even we can actually put on Lego robot that now manipulation done by robots can actually reach a lot of difficult challenges or task in mobile manipulation. So thanks to the AI that come into picture right so of course this is the the parts",
        "start": 579.12,
        "duration": 1479.3559999999998
    },
    {
        "text": "only for mobile platform and even we can actually put on Lego robot that now manipulation done by robots can actually reach a lot of difficult challenges or task in mobile manipulation. So thanks to the AI that come into picture right so of course this is the the parts because the previous speaker have already tell you a lot of stories so with the autonomous navigation technology that we have nowadays robots start to able to navigate it start to able to drive car it start to able to bring us to everywhere because it knows its location it knows the maps know where to go and this can also be applied indoor, outdoor or anywhere. Right? So robot now is safely can move around thanks to the technology and also thanks to the advancement in AI and even now we also talk about using large language model to make robot able to move somewhere with a very vague input. For example like please go to please bring me like a water right. So for example then the robot will understand like where to get a get a water etc. So yeah pretty much the navigation part is already solved thanks to the advancement of AI that is bring the robotics into another high. Okay but last but not least of course is the brain. So we have robot intelligent previously but now with enhancement of AI then we actually open up a new domain. So as mentioned by the brief speaker we have this what we call the VLA visual language and action. So these are the three parts. So similarly like LLM. So we try to find the relationship between words. So over here VLA try to find the relation between visual which is the images, language which is your our description in language and also action like how we do something right for example how you eat, how you walk, how you do something, how you tidy up the dining table etc. So we combine all these thing and we use the LLM technology. We use the transformer technology to find the relation between that and that actually help us to teach how robot able to perceive the world and do some actions so that it can complete some task. So over here VLA model is actually an AI model that integrate vision language action the anobbile robot to understand natural language command and execute task in real world but of course this is a very new research and state of the art and now a lot of debates still talking about world model how we should perceive how we should understand our world and so on and I feel that this is a very interesting research direction that's going on from now onwards Right. So let's come back to human or robots. So I show you a lot of this how AI actually empowered robots so that",
        "start": 764.16,
        "duration": 1822.3929999999998
    },
    {
        "text": "how we should understand our world and so on and I feel that this is a very interesting research direction that's going on from now onwards Right. So let's come back to human or robots. So I show you a lot of this how AI actually empowered robots so that intelligent. So when this thing we apply into a very special species of robot which is the humanoid robot robot that look like human. So ultimately it come to what we actually dream on maybe next last time when we start to build robots. So as you can see these are some of work that I collaborate in Japan that they start to build humanoid robots to help in the production line. Okay. So over here is a food production line. So over here okay so just to to to confirm the one in the middle is robots and then the one on the left and right hand side they they're robots okay right so it looks very similar now so this robot able to actually share the load try to understand how human pick up the ingredients so that they can assemble into a box of food right so that is some I think the first step that we try to introduce humanoid into a real use case that provide productivity or provide real value in an industrial setting. But of course ultimately we hope robot can actually help us doing our whole housework at home. I I believe that is what everyone that talking to me they are asking me when the robot is going to help us to like do their laundry, prepare their meal and so on. I believe everyone is asking that right. So we are working on that and now we almost have all the ingredient assembled and I believe in near future this is a very exciting development that is going to happen. Yeah, I I really hope so and and we try to work hard for that. So you can see with this platform we try to work toward this to make it a reality. But the last part of my presentation today I would like to show you another new domain. Okay. So we have robots that able to move around like human and in fact it is getting much smarter, much agile, much dexterity, higher dexterity etc over the day. Right? So as you can see the robot in front of you in the video and it is basically getting much stronger because like it can fall down just like normal human being but it can actually come backwards. All right [snorts] just like human. So with that maybe another domain that humanoid robots can go into is sports. So we try to put this robot into soccer field and start to play soccer right and with that we actually open up a lot of new things that we are very excited to explore. For example it",
        "start": 938.8,
        "duration": 2161.513999999999
    },
    {
        "text": "that maybe another domain that humanoid robots can go into is sports. So we try to put this robot into soccer field and start to play soccer right and with that we actually open up a lot of new things that we are very excited to explore. For example it development and also education. So we can see the full body motion. Okay. And also if you want to play football it is a multi- aent task. So a few embodied agent is going to fight against another team right. So it is a very high level and also perception the localization and the soccer game is a very exciting thing. So we have done it for the past few years and we put it in such a way that we want to see how far this thing can go and surprisingly it actually give a lot of very exciting result as you can see. So this video is the real video that we take okay with no tell operation okay and the robot just fall down and then it go back up and it continue the soccer game just like how we teach our young children to play soccer. Okay so this is a very interesting future that we really look forwards into it. I can see that when we do this it actually create not just a simple soccer game but it's a new world of sports and entertainment because for the past two years we do this we have attract a lot of sponsors the venues are put tickets are sold we have hundreds of millions of view online and more and more universities team are actually creating right so we become a new ecosystem for sports or robot sports Okay. So today it is just the very beginning over here. I would like to bring you this message that towards the new horizon of humanoid robot with embodied intelligent. Let's build the future together. With that, thank you. I'm Jeffrey from L Robotics Malaysia. [applause] Oh, by the way, this is the dance move by Michael Jackson. Just so you saw the moonwalk, right? So that is what u we try to make the robot able to do it etc. Okay. Thank you very much. Thank you. Thank you professor Tan. Thank you. Now we know that future of artificial intelligence is in a good hand. Thank you very much. Thank you. Thank you Jeffrey Chan. Jeffrey Tun Chan. Round of applause again. [music]",
        "start": 1111.679,
        "duration": 2453.294
    }
]