[
    {
        "text": " Moving to engineering of ideas, hybrid and cognitive systems, new architect aritectures and bio inspired AI where mathematics is coupled with intuition and nature inspires the design. We're continuing our keynote talks section the new era where AI combines the digital the material and bi biology trust agro energy and healthcare everything is on the table. what works and what not. How do you ensure that you negotiate the the issues across the countries and build trust. Institute of computing unicamp professor Anderson Roshia artificial intelligence in the new era foundations trends opportunities and global collaboration. Hello everyone. Thank you for being here. I'm going to be your provocator. now I'm from Brazil a very small city called Campinas with 1.5 million people and the idea today is to talk about bang. So bank is an acronym for bits, atoms, neurons and genes. Everything that we are living nowadays is related to one or more of these letters. Communication, internet, social media, AI, that's bits. Material science, energy, new forms of energy, renewable energy, that's atoms. research in understanding the brain. This is neurons. Research in longevity, how to live longer and better, how to cure diseases. This is genes. This is biotechnology. And then when consider when we consider all of these together, we have what's called convergence revolution. We have five technologies that are changing the way that we live. The first one is genetics, biotechnology. The second nanotechnology, the third robotics, the fourth internet of things, the fifth AI. In the years to come, we have number six, quantum computing, and number seven, blockchain. An example, the vaccine of COVID 19. It was discovered in three weeks with AI algorithms and the technology of crisper cast 9 the mRNA decisizer that allows us to go to the DNA and cut it edit it in the right place. Then of course we needed months to test it. If we consider nanotechnology, we have now many bots, nanobots that we can swallow and it will image for instance our stomach for diseases. If we consider robotics, if you go to a warehouse, you're going to see lots of them in place helping humans to solve problems. Everything is connected through the internet of things producing data all day long. And then we have artificial intelligence at the center of it. All of these together are called exponential technologies. Each one of them is exponential, not linear. Their growth is not like this. It's like this. And then if we advance one of them, it will influence the others. And they will converge to a single point. That's the convergence revolution. And all of this gives us the feeling that there is a big wave coming at us just like this example in Kanagawa. And we have this feeling that everything is happening everywhere all at once. And that's true. As I mentioned before in the previous section, one year in technology in AI is just like a decade,",
        "start": 25.119,
        "duration": 534.321
    },
    {
        "text": "that there is a big wave coming at us just like this example in Kanagawa. And we have this feeling that everything is happening everywhere all at once. And that's true. As I mentioned before in the previous section, one year in technology in AI is just like a decade, purpose of this talk, let's define AI. It's not philosophical. It's not religious. It's an engineering definition. Every computer system, any of them that we can collect data from the world, process this data, interpret it, learn from it, organize it, and then use this learning capabilities to solve specific problems and adapt over time change in the world. This is AI. And then this is a new field that's changing everything from automation to autonomous learning. It is learning, reasoning, adapting and acting. And then we also have these systems that will serve as a general purpose technology, a GPT for us in many different fields. We consider AI to work in perception, reasoning, and action. How can we perceive the word? How can we reason about the word? And how can we take action? It goes from vision and audio and language to prediction models to forecasting and then to decision making. We have to have a critical mindset in here. As President Putin put it yesterday, we should not just press buttons. We need to think and to think is the most important human value that we have. So if you consider the last decade, we had key advances in different modalities considering deep learning generative AI in the last years for text, image, audio, everything. We started a few years ago with key advances in con convolution neuronet networks. Then we evolved to transformers and now we are with foundational models. And then the next one is going to be reasoning models that understand common sense and understand the word. All of these are emergent technologies and capabilities. We know that transformers the technology behind chat GPT deepseek and others they changed the paradigm attention allowed us to pay attention to focus on the specific parts of the data and with that we can transfer multiple modalities and learn different things. So foundational models now are the key infrastructure. Everyone here probably already interacted with one of these Genai models, Deepseek, Chat, GPT, Gemini and others. And it's very important to consider them as tools and not as replacements of human beings. So these generative models they allow us nowadays to study proteins, molecules, mi material design, creative industries, simulation and digital twins. First question to you to think when you go home. If models invent new molecules, who owns the intellectual property? So to put this in context, I'm going to show you some of the research that we do in my lab in Brazil. I created in 2009 this lab with a few other colleagues. We are nowadays 350 collaborators around the world and 200 inside the university and nine professors.",
        "start": 295.6,
        "duration": 980.5600000000006
    },
    {
        "text": "So to put this in context, I'm going to show you some of the research that we do in my lab in Brazil. I created in 2009 this lab with a few other colleagues. We are nowadays 350 collaborators around the world and 200 inside the university and nine professors. what we do there. And I'm going to show you one example in health and well-being. This word in Portuguese, viva bane means live well. How can we do that? Consider that we use wearable technologies like rings or smartwatches. They have a myriad of sensors, accelerometer, gyroscope. It can measure temperature. It can measure the amount of fat and muscles that you have with bio impedance in your body. What can we do with it? We can do studies in neuroscience. We can do studies in physical education for performance. We can develop AI algorithms to help people live better. We can put this in the industry with software engineering. In this example here, we have 11 lines of research. The first one is how to s how to detect early signs of Parkinson's. We do not want to detect Parkson now. We want to detect the early signs years in advance as soon as the watch can sense the first tremors. Can we calculate the intensity? Can we detect early signs? If the person already was diagnosed with Parkinson's, can we see the effects of the medication and see if the medication is working? All of these are objectives of our research. Another example here is number eight. How can we help the elderly? We do not want to detect falling. Suppose that I have one watch here and then I fall. I could detect that easily because it changes a lot in the sensors. But I want to detect early on I want to detect that the this person is losing strength. There is a problem with the elderly when they lose strength when they lose muscles. This is called sarcopenia. If the elderly lose strength there is the likelihood that in the future they will fall and falling is one of the major causes of death for old people. What we want here is to signal to this person look for a specialist there is something wrong you are losing strength or with number 10 anxiety we have now algorithms to allow us to detect with more than 90% accuracy when the person is anxious and anxiety is one of the greatest problems of our times we can prepare reports like Last week you had six episodes of high anxiety. This week is 13. Something is going on. You should look for a specialist. We collect data to understand different activities and to help training the algorithms like this one. We collect different activities like sitting in a chair, dancing, drinking, watching TV, standing, just working. We call people to the lab and we have them to sleep in the lab. Yes, people",
        "start": 521.44,
        "duration": 1370.1610000000005
    },
    {
        "text": "specialist. We collect data to understand different activities and to help training the algorithms like this one. We collect different activities like sitting in a chair, dancing, drinking, watching TV, standing, just working. We call people to the lab and we have them to sleep in the lab. Yes, people science. And then we collect data during the night to prepare a report for them about the quality of their sleep. And then with that, we can learn the best features to help people live better and sleep better. For all of it, we collect the data also which areas of the brain were active during sleep. We do it for anxiety as well. How can we simulate anxiety in the laboratory? Of course, we could have some people putting the hands inside a box with a cockroach, but we don't do that. We ask them to do a mathematical calculation in their heads just like how much is 13 * 396 under 20 seconds with the watch in front of them. So the more the watch goes down the closer to zero second the more anxious the person gets and then we learn the curve of the bio signals that this person have has. And this is this acquisition data situation here. We collect brain activity, bloody pressure, heart rate, exhaled CO2, electroc cardiogram, all of that to learn how to detect anxiety. And here are some of the changes that we have for people that are anxious and not anxious. So we learn about the stressor, we learn about the condition of stress, detect the state of anxiety and understand the semantic and physiological insights with machine learning. Here's an example. If you look down on the left, you have an image representing the signal. It's a very low, very small red part. And then on the right, you have more active red. So that's the difference in the signal with our method. The image on the left is a person with low anxiety. The one on the right is a person with high anxiety. We also have a method to understand the activities the person is doing to detect sedentism. People think that if they do one hour exercise per day, they are not going to be classified as sedentary. But that's wrong. If you walk one hour a day and then sit for 10 hours, you are in danger. So here we understand all of the things related to the bio signals that help us tell that person that something is wrong. So if you want to know more a little bit about our project VI vivaben, you can go to this website. There is an AI translation behind it. Another example that I want to show you today is a is called synthetic reality. Synthetic reality is when people fabricate new species. Like in Brazil, we have lots of fabrication of new species regarding medications, fake doctors, magical treatments to help people cure",
        "start": 719.04,
        "duration": 1747.2000000000005
    },
    {
        "text": "is an AI translation behind it. Another example that I want to show you today is a is called synthetic reality. Synthetic reality is when people fabricate new species. Like in Brazil, we have lots of fabrication of new species regarding medications, fake doctors, magical treatments to help people cure can we design algorithms to detect this kind of thing? So what we do is to develop AI algorithms. Just an idea for you in 2023 as of August only we had 16 billion images generated with AI. So data is all about all around. GPUs process this data with AI at the center and we can produce marvelous things like this one. This is a painting quote and quote created a few years ago in an art competition. The thing is the author, the artist won the award but then afterwards he admitted that it was the creation of AI with 800 interactions. This is the artist. Important thing about three billion people use image editing apps regularly. Every single day we have 34 million images generated by AI in the internet. And most important here ever two pieces of fake news one of them we use we use a fake image. So if we can detect a fake image we can detect that something is wrong. What we can do? Well we can combine different algorithms using mathematics and probabilities. We can develop specific detectors that analyze the noise of the acquisition of the image. like this on the left you see the face of a person that's real. So it it's richer in terms of noise. Then when it's fake you have like less information in the face in the eyes. We are also developing methods to detect scientific forgeries. People are fabricating results when they publish and this is bad because they fabricate new medications. They pretend to have the cure of cancer but they don't. How can we detect they are faking results? This is what we do and we develop these methods. They are open source like this one that can detect when a person is imitating another when an image has been edited with a software or recently we proposed an algorithm to detect at the level of a pixel if it was modified or how to extend GPT or Gemini or deepseek to understand what is fake. So here you can interact with a chatbot, upload an image and ask is it fake, where, why, how it was modified. So this is what we are doing. All of these is inside this project that we created a few years ago called Horus, which is the Egyptian god for truth, son of Isis. And with this project, we want to help society to understand better what they are reading, listening to and watching. We design methods to detect when a person is falsifying identity or posting something pretending to be another or when you receive a fake [snorts]",
        "start": 908.399,
        "duration": 2148.64
    },
    {
        "text": "for truth, son of Isis. And with this project, we want to help society to understand better what they are reading, listening to and watching. We design methods to detect when a person is falsifying identity or posting something pretending to be another or when you receive a fake [snorts] WhatsApp. How do you know it's your real bank contacting you? This is fishing and we do design algorithms to detect that. Or even people that are using AI to create child pornography. It's very important that we detect this kind of action. Fishing, as I mentioned, is when you get a message in your phone asking you to give your credentials. how to make sure that that contact is real or a deep fake when a person creates another image or a video of yours that's exactly like you. How do you detect? Or when you have your phone, it's face recognition. What if a person presents another phone with a photo of yours or a video of yours or a silicon mask pretending to be you? How can we detect that that's happening? This is security and we do develop algorithms to help detect that. How do you protect your children? What they watch in internet in the internet? So this is parental control. How do you prove that someone that's talking to you is really there live and that's really that person. So this is livveness detection. and how do you protect content that you put online? All of these are related to synthetic realities and we develop algorithms to help in that. In scientific forgeries, there are people that get other people around and they fabricate results like fake doctors, fake medicine. We de develop methods to help identify that. And we do mind about the protection of children online. So if you want to know a little bit more about this, go to recod.ai. Let's get real. AI is here and is here to stay as this ad was in Davos some time ago. When we consider the key open challenges here, it's about trust. How can we make sure that the algorithms do not hallucinate? How can we measure the uncertainty? How can we make sure it's fair? or that it does not misuse our data. How can we make secure systems? How to develop governance in terms of regulation and innovation? Consider the energy problem for instance. How can we scale to do all of these calculations without exploding the consumer of energy? We need efficient architectures. We need new methods. We do not want data centers that consume as much energy as the city of Moscow. We want to develop methods that are much more efficient and that really helps us solve real problems. Here we have the global inequality compute data and talent gaps. How can we bridge that gap? Language inclusion. How can we make sure that minorities are represented? How can we make sure that languages that are",
        "start": 1112.559,
        "duration": 2544.8799999999997
    },
    {
        "text": "that are much more efficient and that really helps us solve real problems. Here we have the global inequality compute data and talent gaps. How can we bridge that gap? Language inclusion. How can we make sure that minorities are represented? How can we make sure that languages that are lost? So if we do not take action, we can increase geopolitical divides. Another question for you when you get home. We made machines smart. Can we make them responsible and aligned with our objectives? So here are some trends that we see in research and development for the next years in artificial intelligence. Instead of having these big large language models for everything, we start having small lang language models for specific domains that are efficient and that really help us to solve problems. We are going to see AI more and more embedded in small devices instead of just connecting to the internet and doing everything there consuming a lot of energy. We are going to have research in reducing hallucination and in increasing the truthfulness of responses. We are going to have better algorithms in term of alignment with our objectives. Multi mode realtime systems and agents to help us solve different problems. AI for science more and more. You might have heard that a few months ago we had the first first solution using AI to kill bacteria. So the first bacteria fighting algorithm antibiotic the first antibiotic ever developed by AI. So this is the new trend using AI to help you design new medications design new molecules. So what's is on the rise right now? lower latency models, lower cost, specialized small language models, new patterns, new UX interaction forms with screens and other devices. What are crucial here to truly require large language models? So instead of just deploying in your business large language models, ask is it really necessary here or should I use something more efficient? To reduce hallucination, we need to think about self-reflection. So the method needs to understand its presence. It needs to be self-consistent. So is if I start talking to this chat one hour ago during the whole conversation, it needs to be consistent. If I come back tomorrow, it needs to be consistent. How can we implement this with different agents in our day-to-day retrieval augmented models is just not the answer. So if I have this model here and I use this memory, it's not enough. I need also to implement other algorithms like causal and effect understanding of the word. So in terms of multimodality combining different methods we need to consider text image audio. The word is multi- signal. I should not focus only on text or only on images. How can I process this together? So we need to go beyond the normals model the normal models that we have nowadays to consider also intelligent systems that we see hear and act. We need them to help us plan",
        "start": 1314.4,
        "duration": 3003.6800000000003
    },
    {
        "text": "should not focus only on text or only on images. How can I process this together? So we need to go beyond the normals model the normal models that we have nowadays to consider also intelligent systems that we see hear and act. We need them to help us plan We need to have collaboration and think of AI not as artificial intelligence but as augmented intelligence as a way of increasing our capabilities. We should think of also how to generate data to help us train these methods. We call it synthetic data. So there are many opportunities here in science for instance, new medications, new ways of detecting diseases or like just in the case of health and well-being, how to anticipate signals of something that's wrong. Creating digital twins to understand better a factory and how to produce better and more efficiently and more effectively precision algorithms. You know in a few years we are going to hit 10 billion people in this planet. How can we feed all of these people? We need better seeds. We need to be resilience to resilient to climate change. We need to produce food that's more nutritious. And to do that we need research. We need science. We need technology. Where is your unfair advantage? data, compute, algorithms, what we need to do better. Think about personalized health care. Medicine during all all of history was designed for the average. So we understand what is a headache. We understand what is like missiles and then we prepare medications for the average of the population. But now with bio bio signals we have the ability to design methods specific for a person and that can be much more effective and allow us to finally live over a 100 years. Sectors most impacted now are finance, healthcare, biotechnology, industry, law, energy. New business layers in a few years, AI security. If you are starting your career now, one important career that's going to be crucial in the future is security of technology, security of AI. specialized AI models optimized for particular industries. Another profession in the future that I think evaluation of the alignment of the AI algorithms to the human objectives. How do you make sure that it's aligned? What the human wants and what the algorithm is solving? Is it aligned? So probably we're going to have a specialist to understand and to solve that. So let's think of this. Artificial intelligence should not be artificial. It should be augmented intelligence with the human at the center. Human centered artificial intelligence. Once again, let's get real. AI is here is here to stay. But we need to drive where we want to be with it. We need to be in the loop. That's what I wanted to tell you and to provocate you today. Thank you very much. [applause] Thank you, Professor Rous. Thank you. We wish you a great success in your scientific discoveries. Thank you very much.",
        "start": 1546.08,
        "duration": 3426.9080000000004
    },
    {
        "text": "we want to be with it. We need to be in the loop. That's what I wanted to tell you and to provocate you today. Thank you very much. [applause] Thank you, Professor Rous. Thank you. We wish you a great success in your scientific discoveries. Thank you very much.",
        "start": 1766.559,
        "duration": 3426.9080000000004
    }
]