[
    {
        "text": " how AI and high tech transform the entire industries investment portfolios and the structure of export. Someone who has built for the foreign direct investment fund a network of the investment partners that are joined by investors from more than 15 countries. the special representative of the president of the Russian Federation on the investment and economics cooperation with the foreign countries, the general director of the Russian direct investment fund, Kuril Mitrif is going to report on the investments in the future AI and high technologies. Thank you very much. I wanted to welcome you all. I can see that you we have very motivated, driven and smart people here. They use AI actively and they are driving AI. I would like to share some thoughts that we have on artificial intelligence and the thoughts on how AI should be properly used and invested in and promoted. But first of all, I would like to thank Zur Bank. No, sorry, Zur and Herman Graph for this fantastic conference and for all their contribution to AI development. And I think we have forgotten the fact that just 10 years ago, 8 years ago maybe as B was criticized in terms of whether they need this ecosystem, why they're not just a bank and it was Mr. graph who insisted that the ecosystem was important that the development of technologies was important and they were at the core of the bank development and they are now I mean Zur now is one of the leaders in AI. as Bur has gone through many barriers very was a pretty convoluted path to the end goal because many were put in barriers was there and this way of for any of us that lies ahead when that we need to go through when we need to create the value this is a major goal we say that one of the major goals is to have in five or 10 years in Russia AI with a very high IQ level and let's maybe I'll I'll expand my thought here. We know that IQ this is the co the ratio of intellectual capabilities in various estimates 100 points in IQ is the average level 160 170 level of IQ means that this is a genius. What we see right now in many models, we see the models with IQ of 240. So we see a number of models that have higher IQ than the people who are geniuses and we start to compare the IQ of AI not only with the that of the people but with that of humanity. So maybe soon we will see the AI who will that will be more powerful than the entire humanity and we are talking with representatives of many countries including the countries of the Middle East and they say that the major goal for the country is to have the most powerful AI in the next 5 10 years to",
        "start": 8.16,
        "duration": 409.0400000000001
    },
    {
        "text": "will that will be more powerful than the entire humanity and we are talking with representatives of many countries including the countries of the Middle East and they say that the major goal for the country is to have the most powerful AI in the next 5 10 years to other countries because just imagine the world that has where someone has an AI with IQ 10 of 10,000. Others have an AI with IQ 5,000 and you have the AI with IQ 1,000. For those who have an IQ models with with 10,000 of IQ points, that means that you have various biotechnologies and fusion technologies and other high techch and valuable and affordable technologies that they can leverage. So this is a competition. This is a race, a live forward in terms of who is going to have this powerful AI in the next 10 years and who will not and Russia has a number of very important advantages here and you have to we have to to leverage that and yesterday the president mentioned that we have a major advantage in terms of energy. As we know, energy underpins AI and the fact that Russia has various sources of energy that can be used in various AI applications is obviously Russia's global advantage. Basically, thanks to our energy capabilities, we are a very interesting partner and promising partner for any countries and companies that develop AI because we have a very powerful energy advantage over them. The second important advantage of Russia is regulation because in Russia you can and you should really change various regulations to make sure that driverless cars and driverless flying [snorts] vehicles are used e and can be used quicker. and our regulations are more liberal than those in Europe and other countries. So our data can be used better in a more efficient way and uniting this data can be done very quickly. So regulation is a major advantage and the third major advantage of Russia [clears throat] people. We have a very talented highly educated and motivated successful people in our country. And without a doubt this level of education helps not only to make the leap forwards in AI but helps to use AI in a proper way and in a successful way. And using AI is the skill that should be adopted by everyone. And we know that at the start the AI users were mostly mathematicians or engineers. But now people are using AI in their everyday life. For example, one of my friends he had a conflict with his girlfriend and he uploaded the chat in telegram with his girlfriend to AI and AI gave such a response that their relationship is growing and only a year after that conflict he admitted to her that that was AI responding to to her needs in the chat. So using AI in various situations is something that is critical and for that you need high level of education",
        "start": 213.519,
        "duration": 847.92
    },
    {
        "text": "a response that their relationship is growing and only a year after that conflict he admitted to her that that was AI responding to to her needs in the chat. So using AI in various situations is something that is critical and for that you need high level of education that Russians have and yesterday President Putin raised an important issue of motivation in the world where every text any text can be created by AI and now there is research that from Many people who ask AI to write a text and in five minutes they do not remember what they requested and prompted the AI machine to write because there is no engagement. There is no thinking process. How do you make sure that the symbiosis with AI is successful? How do you make sure that people are motivated to develop? How do you ensure that they see AI as a tool instead of a comprehensive all-absorbing matrix which will fully control their lives? In this respect, what's truly important is our efforts together with spur on guidelines on how to use AI and also education which needs to give people not just skills to use AI but also some sort of a moral framework or ethical framework for using AI. And this is a great segue for me to international partnerships. We believe that it is only through international collaboration and international partnerships that we can implement the Russian potential in AI faster and in in a more robust fashion. We've been partnering up with companies in the Middle East in Asia and we see that in terms of regulation and the cooperation among our companies this international aspect is absolutely crucial. International collaboration is important for Russia to build a component base which will be integral to technological sovereignty. I'll I'll draw a few examples. One example is the company called Murica. about 10 years ago, we've invested in it. They produce prosthetics for children. They use AI very actively. They are present in more than 30 countries. And this is a great example of our technology which is one of the best technologies in the world for manufacturing prosthetics using AI. We also support on tech company for face recognition. They are actively present in Saudi Arabia and in other countries as well. They leave all of the data inside the country within its perimeter. They are building meaningful partnerships with the countries in the Middle East because they help them control the risks, mitigate the risks of data leaks and also mitigate the risk of misuse of data by other countries. So it is through partnerships with a large number of countries that we need to move towards the development of AI AGI. this is how we need to this is why we need to take advantage of the AI alliance which as you know has expanded as was announced yesterday and we need to acknowledge that without international collaboration international partnerships the",
        "start": 434.0,
        "duration": 1265.0399999999997
    },
    {
        "text": "we need to move towards the development of AI AGI. this is how we need to this is why we need to take advantage of the AI alliance which as you know has expanded as was announced yesterday and we need to acknowledge that without international collaboration international partnerships the will be hampered it will be less successful and in conclusion I would like to touch upon this one thing I know that there is there's a lot of students here today from various universities from various areas of specialization. I would like to encourage all of you to be very [clears throat] careful, very rational in approaching AI. You need to know what prompting is, what an AI agent is, and how you can use it to simplify a large number of everyday tasks. One of the key ways to go about it is to daily use Giga Chat or other platforms to understand to learn the different ways to use AI. We often ask people to debate on a certain topic. So you can write a very simple prompt like analyze this or that industry or you can ask it to imagine what five or six industry leaders would say about this topic or you can upload a memorandum and ask to identify points of analysis or gaps or ways to improve this document. There are a lot of profound and beneficial ways to take advantage of AI for each one of you. And I encourage you to to give it a try. I only have just a couple of minutes of time. If you have any questions, three or four questions, I'll be happy to answer. Please go ahead. I think we don't have the mics for the audience, so you can just stand up and ask the question. The interpreter does not hear the question. Yes, thank you. The question was, \"How do I personally use AI?\" I use it sometimes to write a presentation. So, I'm I'm in a car driving to the conference. I I have five or 10 minutes. So, I put in this prompt. Imagine you are a speaker at this conference. what would you say about AI in five bullet points? So that's one use. another use case is we create we develop different projects and different industries. For example, we are going to invest very heavily in satellites. So I have this project which not only give me analytical insights on satellites on the market but it also gives me this news feed every day on the latest developments and the most important trends in industries of interest. Also it's very easy very it's very easy to use it for translation. our press service. Our marketing team use it in just a couple of minutes or in a second. You can translate the text, you can summarize it, you can turn text into a post for social media. I haven't taken any training on AI. It's just it all",
        "start": 646.079,
        "duration": 1666.5569999999987
    },
    {
        "text": "for translation. our press service. Our marketing team use it in just a couple of minutes or in a second. You can translate the text, you can summarize it, you can turn text into a post for social media. I haven't taken any training on AI. It's just it all you try it. You try different use cases. You explore it. But it's very important as was said yesterday to be motivated because it's very easy to get lost to lose your engagement to stop thinking and it's a great danger actually. Yes, please go ahead. Another question. A round of applause for Curl Midri of Oh, they're ushering me from the stage. It's just that we have questions submitted through the QR code, the platform. from the online audience. So the question is in which industries of Russian economy is AI the most beneficial? Well clearly in all industries but I I like this example very much. There's this company called Lab Advance. It works with a lot of oil and gas companies in Russia. It is entering the markets in the Middle East. Essentially, it analyzes deposits using AI in a much more efficient way. So, AI creates a model of of an oil and gas deposit and this reduces 40 to 60 times the cost of exploration and development. This is a very concrete effect. And another example, this is a very important example and we see more examples anywhere in in the agricultural sector for example where drones with AI on board can be beneficial for agriculture. We are witnessing radical changes, disruption in all industries and an increase in their performance and their efficiency several fold in the next 7 to 8 years and and also if you learn to use it if you use it routinely this will give you a competitive edge. Thank you. We can continue with the questions from the audience. Yes, please go ahead. The speaker is asking the question without the mic. Right. So in your presentation you said several times that we are working closely with countries in the Middle East in Asia on AI but I'm especially interested in this in the west in the US for example they've been developing AI very actively as well and Russian companies are represented there as well the energy sector journalists What is your personal opinion? What are the opportunities there? What what are the opportunities for collaboration with western countries such as the US? Thank you very much for this question. I think this will be the last question. Yes, thank you for the question. I think we need to be open-minded and it's good that this is the final question. , I think we need to be open-minded and we need to understand that a lot of Western countries are hostile to to Russia. But that said, Europe while waiting itself off of Russian gas lost trillions and trillions. We have data from German businesses",
        "start": 852.959,
        "duration": 2092.319999999998
    },
    {
        "text": "this is the final question. , I think we need to be open-minded and we need to understand that a lot of Western countries are hostile to to Russia. But that said, Europe while waiting itself off of Russian gas lost trillions and trillions. We have data from German businesses companies from Europe will be firing employees and only 13% will be hiring. So the Russian market is extremely important for for European countries. They tried to create isolation short-term isolation. It didn't work. So I think we will see more and more companies trying to get back to the Russian market in the next two to three years, building new partnerships and the government will be deciding who they will be letting in. But the point is that the Russian market is very important for the western countries and we believe that as soon as we see some positive changes in our relations with the US for instance just an hour later Europe will come running back trying to get back to the Russian market. We are open to collaboration, but within the framework of this understanding that a lot of European companies ran away from the Russian market and left all kinds of assets and employees behind. So we need to maintain our sovereignty but still be open. Thank you very much. CEO of Russian Direct Investment Fund, Kir Mitrif. Thank you for that presentation.",
        "start": 1075.2,
        "duration": 2257.2429999999977
    }
]