[
    {
        "text": " Thank you very much. And right now, someone for whom AI is a tool that changes lives and businesses. This is one of the leading world women AI researchers. According to Forbes, she consults the largest global corporations that in many ways shape the technology market of tomorrow. The solutions that the development of which she led helped to detect 40 potential drugs for 11 types of cancer. She's the voice that is heard at the board and when we talk about AI when we talk about saving lives of millions of people and today we have a unique opportunity to hear this great expert the CEO and co-founder of XLabs and Rybo AI Radica Dirks the name of the presentation what's next in AI building value through emerging intelligence radical has connected to us online. A round of applause. Such a pleasure to be here. Thank you for having me. I wish I was right there in Moscow with all of you, but I'm glad to be joining virtually. And what a moment it is as we close out today, the second day in business at AI journey to be talking about what's next. It's such an interesting moment. In fact, these are the headlines from the news less than 24 hours ago. We're at this very paradoxical moment, isn't it? Market uncertainties are at an all-time high. It's okay. Don't pull out your phones just yet. It's we can last 30 minutes without checking ticker symbols. And the reason for this is because we have built a large industry just in a span of three years. If you look at what's at stake, this is just the top AI companies in S&P 500. And the market cap of these companies, mind you, it's not even global, right? We're looking at $23 trillion in AI companies. So no wonder the markets are having a panic attack anytime we have any kind of movement and we have built this emerging industry with so many cross deals and partnerships because it's happened in the last few years just again in a span of almost three years since GPT was released by open AI and there's good reason for this paradoxical moment because there is a plethora of tools out there. Again, this is just a snapshot by SEOA and we're not even touching on the majority of tools out there, but anyone who has seen or played with generative AI immediately gets a feel for how useful they can be. So, we're sitting at this very like it's tying back to the uncertainty. The markets are sitting on this massive capital and looking at where is the value. We have deployed this. Anybody using it can sense the value. But there is this massive discrepancy that also trickles down to the technology. This is Sam Alman himself and few days ago he's talking about how now we're at a phase where Chad GPT can remove M dashes. you know the long",
        "start": 7.839,
        "duration": 445.67900000000003
    },
    {
        "text": "this. Anybody using it can sense the value. But there is this massive discrepancy that also trickles down to the technology. This is Sam Alman himself and few days ago he's talking about how now we're at a phase where Chad GPT can remove M dashes. you know the long compare that to his quote from January where it's like oh we we know we're on the path to AGI. So this paradoxical is it a hype? Is it not a hype? How can this be a hype? I can see the value. It's all interwoven and that's what we're going to discuss today. Yes, there are massive companies out there many of them my clients deploying billions of dollars. JP Morgan has more than $2 billion in and this uncertainty this paradoxical moment has also obviously translated on the business side because while billions have been invested productivity has actually gone up the stark reality is that 95% of organizations 95 have seen zero returns on generative AI So the question obviously becomes we have invested more than 30 to40 billion in enterprise AI but what are these 5% of organizations doing right because this is the key point of this keynote which is that in order for us to see the returns on AI in order for this industry to keep growing and bring the benefits and power of the technology to full circle returns. We need to be looking at beyond LLMs. No matter which industry you're sitting in today, whether it's technology, healthcare, banking, manufacturing, energy, the way to get the returns on your AI investment is by integrating what I call emerging intelligence. And that's the key point today. I'd like to close out today by making the observation that it's not going to be a particular app or how we implement it or how we integrate a particular tool but sort of this larger looking beyond what's available today and getting ready to implement what's already in the pipelines. So we won't be discussing any specific things. What I instant want to do is to share a landscape view. We're going to zoom back a little and talk about three emerging waves. Each of these waves has a technological reason for it that we will cover. Each of these waves is solving a very real business value that is missing in generative AI today. And each of these waves is also going to tie back and bring full circle to the returns. And we'll wrap it all up as we end with like next steps and how you can implement this and what you need to bear in mind as you implement this. So I hope you're ready as we get started here with the very first wave. We just heard about this very interesting talk. The first wave is the embodied intelligence. So this is where we're taking the LLMs and going beyond. Right? It's not just putting the capability of LLM into",
        "start": 233.04,
        "duration": 812.4790000000002
    },
    {
        "text": "I hope you're ready as we get started here with the very first wave. We just heard about this very interesting talk. The first wave is the embodied intelligence. So this is where we're taking the LLMs and going beyond. Right? It's not just putting the capability of LLM into than that. And this is just a snapshot of some of the US companies. Most of my talk is going to be geared and calling on examples from mostly US companies, a few Chinese companies. But bear in mind that everything I'm discussing is applicable globally. And these robots, as you just heard, are not just useful for, you know, helping things around the house, , but also in machines, in operations, manufacturing, playing sports. but they also come in many shapes and sizes like little pets little humanoid pet robots or sibling robots for kids useful for education. I mean wide variety. The reality though is that many of these robots are humanoids are still being operated by teleoperators. And there's a reason for this because what is the underlying tech capability that we don't quite have yet? This is where the underlying tech that's being developed beyond LLMs is world models. You might have heard this language being thrown around quite a bit. You might have also heard of the term spatial models. And the biggest difference between world models versus large language models is as these models learn on visual information, not just being able to predict on large quantities of text, which is the realm of LLMs. Now, this is going to be a huge step forward when we start integrating them more and more into our business because these humanoids, these machines are learning on real world. This is the physical world. It's not the abstract world of being predicting and creating content which has been useful and productive but they lack the realworld experience. It's more than just a physics. So when I see these things going around Miami and I know that there's a tele operator behind them, these are like food operator robots that you know can now see around the world. you're you're you the point to remember here is that not only are they adding immediate value right now but they're actually collecting the data that's required for the autonomous operation. So if you're thinking about from an investment perspective, the companies that are have the data records from autonomous operations from say driving and if they're extending it to humanoids, they have a natural leg up because there's all these years and years and manurs of data that they can pull on to then apply. Again, it's more than learning physics. It's it's learning how humans walk around. It's learning how we navigate traffic. It's learning how the real world bumps and pebbles and rocks come into your workflow and how what do you do when you come across a human child or a dog.",
        "start": 420.16,
        "duration": 1167.9979999999996
    },
    {
        "text": "Again, it's more than learning physics. It's it's learning how humans walk around. It's learning how we navigate traffic. It's learning how the real world bumps and pebbles and rocks come into your workflow and how what do you do when you come across a human child or a dog. the actual technology is being understood and learned. But this is a one of the older videos from Nvidia actually but it really explains one way we're teaching these robots to learn. Let's watch physically based simulation and transfer zero shock to the real world. The group model will enable a robot to learn from a handful of human demonstrations. So it can help with everyday tasks [music] and emulate human movement just by observing us. Just by observing us. And that's part of the reason why many of these humanoids that are being beta tested or I guess I should say alpha tested in homes today have a teley operator behind them. They are learning and you're training the robots. And that is a new kind of partnership, a new kind of deal if you will that we're making with the world of embodied intelligence. The biggest ROI implication, what is this going to bring to businesses? What is this going to bring to the AI industry? Is in addition to extending the use cases by bringing them you know full circle into the homes into the real world being able to operate and do a lot of these tasks autonomously is that more importantly they bring the relevance and the context. Because if you look at where the value is really missing today in these enterprise implementations, it's not in the use cases. people are actually using them but they break when the real world context is not there anytime you actually apply it to an actual real world implementation. The second wave is that of embedded intelligence. So we're moving from embodied intelligence to the second one which is embedded. And in this we started seeing this wave you know pretty much a few months after LLMs were released you know any kind of device with edge functioning with edge AI right on them. These are meta's rayband glasses. So, with the tip of your finger, you have access to any of the LLM type tools. Play music or you know, ask it some questions like what temperature do you need to cook the chicken at? Or you can ask it to play back the conversation you just had with your wife to show her who's right. All are possibilities. But those are not the only ones. We have a plethora of single function devices. And you know at one point I remember when smartphones came around and you know nobody carried their watches and stuff anymore. I used to think wow that's just a single function device like who wants it? Turns out we do now because these single function devices from like you know",
        "start": 601.2,
        "duration": 1511.5029999999995
    },
    {
        "text": "you know at one point I remember when smartphones came around and you know nobody carried their watches and stuff anymore. I used to think wow that's just a single function device like who wants it? Turns out we do now because these single function devices from like you know detect and prevent snoring so-called marriage saver or a smart mirror that tells you everything you need to know. These are just samples. I mean if you can put AI in anything, we are putting AI in anything. My vacuum talks back to me now. And the reason for this, right, the underlying technological capability that we're going to pull in full circle is that it's learning workflows. It's learning how to in real time how the human operates, how the devices operate. It's learning your workflows. And this way it can bring back what's really needed in LLM and Gen AI today. Adaptability. We talked about context. We talked about real world. But getting the LLMs to adapt real time is one of the most crucial missing capabilities in technology today that's causing this big gap on returns in investment. This embedded AI doesn't just come in devices. You can embed it to current software tools. Let's watch. Hey Daniel, what's up? So, right here we have Messi. And this is the real Messi. This is not an AI avatar of Messi. This is the real Messi. But with face processing tools, language processing tools, direct face recognition, and customization, he's now able to talk in any language to your customers, understanding how they interact and increasing the amount and the depth of interactions you can now have with your clients, with your customers, with your different audience. This too is embedded AI. So it's kind of like a double level, you know, it's abstract as well as in devices. And that's the second wave that we're seeing. The direct ROI, as I mentioned before, is now you're going to have adaptable models, moving away from static models that are only updated once in a while and take billions to almost a trillion dollars. Now we're looking at adaptable models that is learning from everyday mini tasks or mini functions. Which brings me to the third wave, executive intelligence. This is the big one. This is what differentiates the, you know, the leaders and the decision making capabilities of humans on everyday tasks where the minute it goes from something simple to something complex. This is when you're drawing on your years of expertise. This is almost human intuition. This can't just be boiled down to a step of rational if when this. But even if it could be boiled down to if when this, we don't currently have the tools for that. So this is the big one and a great example of this is how the UAE is has appointed AI as an advisory member of the cabinet. It was a",
        "start": 777.12,
        "duration": 1885.4249999999995
    },
    {
        "text": "But even if it could be boiled down to if when this, we don't currently have the tools for that. So this is the big one and a great example of this is how the UAE is has appointed AI as an advisory member of the cabinet. It was a strategic consultations, generate reports and conduct predictive modeling. So this was the vision like even two years ago I remember talking about this where we were talking about having an AI as a board member AI as your advisor and while this is possible today but it's take it's taking a whole lot of build and workflows and stitching together remember 2025 was supposed to be the year of AI agents. This is where I was supposed to have been able to with one click of a button have my agent plan a whole trip, bring my friends together, book our tickets, plan itineraries all with like one click. Well, this is Andrew Kaparthy one of the prominent researchers in the field, the the guy who coded the term vibe coding. And we are all realizing that it's going to take a whole lot more to bring agents, real world agents to the majority of people in the world. , and it's not as quick as we thought. Why? Because they lack intelligence. They can't use computers. They lack multimodality. They lack continual learning. And more importantly, they forget what you tell them. And this forgetting what you tell them is something we'll come up come back to over and over again. And perhaps we're seeing these gaps won't take a decade. I am I'm way more optimistic than Andrew when it comes to this. But it's also important to remember that these this is the reason agents haven't taken over quite yet. And the missing piece, if you look at where in businesses a lot of our implementations are failing, it's not in people not using them. They're using them. They like the LLMs, but they are using them for simple tasks. At the minute we move to a complex task, anything that requires multiple people takes weeks, not minutes. Anything that requires cooperation, multiple teams, this is where the agents are failing the stitching together. AI today is failing along along the seams and along the seams is where you need to be focusing on in terms of workflows, in terms of what to build and in terms of extracting the value. And this is where the technology is headed because you see the reality is LLMs today live outside of time. What do I mean by that? you can of course ask you know your chat GPT or any of the LLM you like to use the time. It'll tell you the time by looking at you know the system clock etc. But when you go into the world of LLMs it has no memory. For example, you can ask it to",
        "start": 978.88,
        "duration": 2228.143999999999
    },
    {
        "text": "you know your chat GPT or any of the LLM you like to use the time. It'll tell you the time by looking at you know the system clock etc. But when you go into the world of LLMs it has no memory. For example, you can ask it to journal report on everything we did today. , but you cannot ask it without external workflows and having rappers, etc., etc. You cannot ask an LLM today to write that journal report every night for you automatically. And that's because they don't have this concept of time. And as a physicist, I can tell you when you don't have a concept of time, you're missing the dynamics. You cannot learn. you cannot adapt and without memory how can you make real time decisions. So this is going to be the is already one of the biggest moves in the world of models. Temporal modeling, causal modeling or neuros symbolic. These are all capabilities. Neuros symbolic refers to when you integrate the neural nets that the current technology is based on with symbolic logic. the if then else's kind of chain of reasoning predictive decision making weighted expectations scenario mapping and this is where we're going to start seeing the executive intelligence because this will achieve one of the biggest gaps today which is moving to complex tasks this report that came out of MIT this year just a couple of months ago talking about how 95% of organizations sees zero returns also dives into why because on the surface it might look like the biggest operational failure of generative AI but not quite because 90% of people while they prefer humans for complex tasks for all the reasons we just talked about they prefer AIs for simple tasks so the $50,000 or more enterprise applications are failing to the $20 consumer apps and customers I mean employees everywhere are using the AIs that they're used to but the barrier for enterprise applications are higher because they've seen on the consumer side how easy it is how quickly they can increase their productivity but somehow this productivity value is not translating to business returns and that's the gap we need to fill for the markets to calm down and start seeing how we can extract the actual value that is inherent in the technology. The second reason is that we're losing a lot of time and implementation results between when we investigate these apps to what's actually being imple implemented and once again here the consumer apps are winning in the enterprise use cases. So people are using it behind the scenes. So while we investigate so if you take something like chat GPT or publicly claude or any of the publicly available enterprise any of the publicly available LLMs they reach actual implementation 5% of the times compared I'm sorry 40% of the times compared to 5% for integra for generative AI enterprise apps hidden here is this story because",
        "start": 1155.6,
        "duration": 2615.3429999999985
    },
    {
        "text": "like chat GPT or publicly claude or any of the publicly available enterprise any of the publicly available LLMs they reach actual implementation 5% of the times compared I'm sorry 40% of the times compared to 5% for integra for generative AI enterprise apps hidden here is this story because LLMs and integrating them with this emerging technologies across embodied embedded and executive intelligence. It's only when we start bringing all pieces together, every little bit helps, but when we start bringing those things together, we're going to see this industry really solidify and continue to grow. The biggest boon and boom that generated AI gave us was that it achieved one of the holy grails of the field the field of AI which is what if we can command computers with the power of human language but language linguistics is just one aspect of human programming it's huge in in a way it's the operating system of humans but we need the real life context we need the world models we need the spatial models. We need the symbolic reasoning. We're not just language. And if we're trying to get anywhere near to human level intelligence, we need to look beyond LLMs. And whether, you know, we can just scale with more data, especially just textual data, that remains that open debate I find myself on the other side of. but it will certainly not hurt us to start investigating newer models and integrating more of these newer models because this is a very useful technology. Again pulling on just chat GPT because the numbers are so easy to assess and access. So it has more than 1.8 billion visits a year. We're coming up on the third year anniversary. It's deployed in over 161 countries. It covers 96 languages. And remember when you know they started out and they added 1 million users in 5 days where this is a quote from a tweet from Sam Alman just in March where they added 1 million users in one hour. So AI in many ways is really not a hype because anyone can see how quickly people are adapting the technology and how much we're using it. And we've moved past the days of one of the other reasons organizational implementations fail is when they take months and months. Southwest has a fantastic example where they implemented they rehaul their entire crew management system, their legacy management system in five weeks and that was one of the biggest success cases for them. We're using this live and this is pulling from my client work. We're designing hospitals of the future with one of the top architectural firms here. and even before generative AI, this was Rebo where we pulled up 40 new potential cures for 11 types of cancer. And this is one of the biggest points I can make here, which is that AI is larger than generative AI. And the more of the AI",
        "start": 1350.799,
        "duration": 2965.2639999999997
    },
    {
        "text": "firms here. and even before generative AI, this was Rebo where we pulled up 40 new potential cures for 11 types of cancer. And this is one of the biggest points I can make here, which is that AI is larger than generative AI. And the more of the AI statistical information, basian analysis, all these tools that we can pull in and integrate it into LLMs, that's when we're going to really start seeing the real operational value in AI. With the three waves, what becomes really important is that how we start navigating the space. And I think any talk in AI should address two really key things. , one is ethics and security. And I know we're going to dive a lot and we have separate sessions on either of them, but I want to quickly touch on these before we get to next steps and how you can integrate them directly. The first is ethics. Every powerful technology carries with it the potential for catastrophe. We've seen this over and over again. you know, from nuclear engineering to space engineering to mammals being cloned and every time we've had to navigate this with care. AI is absolutely no different. This movement in generative AI, what the industry is telling us right now is that we've moved past the attention economy that AI was built on, the social media world. This is a race to intimacy. And over and over again, if there's one thing we have learned from the past industrial booms all the way from the automotive industry or even the dot is that the businesses that succeed, there's always like a blossoming of companies, but the ones that really succeed and thrive are the ones that really hone in on the ethics and zoom in on what really matters and how you can improve human lives. And that always seems to help. Whether it's Ford or Google, they are still around. AI is changing the nature of fraud and the nature of human trust. If as a leader, as a decision maker, as a user, you can tap into this and be on the right side of this, this is where true wins, this is where industry building iconic companies are going to come from. AI ethics comes from each and every one of us and so does AI security. This itself is a whole new budgeoning field at this point. , just a few months after Chadribute was released, , we had a Hong Kong worker in finance who thought he was paying out $25 million to his CFO on a live video call. And this is without any of the emerging intelligences. These capabilities already exist. , AI worms are out there. And this is anthropic just a few days ago reporting on hackers that hacked into Claude to get access to multiple company documents and multiple sensitive information. And of course, one of the biggest issues that is typically underneath the",
        "start": 1529.12,
        "duration": 3340.9449999999983
    },
    {
        "text": "These capabilities already exist. , AI worms are out there. And this is anthropic just a few days ago reporting on hackers that hacked into Claude to get access to multiple company documents and multiple sensitive information. And of course, one of the biggest issues that is typically underneath the AI tools in ways they plagiarize because they're built on existing content. And the same thing will continue to happen with each of the emerging technologies because we're learning on existing data. So this is me asking Bing back in the day to write a conversation in the style of Quinton Tarantino. And it starts talking about two hitmen Jules and Winston sitting sitting in a coffee shop. And I love Quinton Tarantino. So as I'm looking at this I'm like oh my god I would watch this movie. It throws in a Bible verse and I'm like, \"Oh my goodness, I will definitely watch this movie.\" Well, turns out it's pulp fiction. And this is a really important point as we step forward because all of these devices, all of the models are learning on your data, which means it's a two-fold issue. one, you could unintentionally infringe on somebody else's copyright, but then at the same time, you have to be very sensitive about your information and have very direct clarity on what you're sharing because you're training these models. So, that's part of the reason imple enterprise implementations have stalled because they're walking this really fine line. But the real secret is that as we look at the emerging intelligences that are coming out from embodied intelligence to embedded and executive, we're learning that whether it's world models or learning workflows or really learning true agency in order to integrate them into real value, we have to look on the shadow side. The shadows are there to teach us something to help us evolve. So we can't quite ignore them. It's by leaning in that you can awaken and build what you want to build. Shadow AI is an actual term and it refers to the fact that most people are using AI. 90% of employees are using AI in organizations whether it's been implemented at the enterprise level or not whether there's a policy there or not or even if they have an enterprise implementation how they prefer using the $20 commonly available tools because the barrier to them is less their tolerance to use them is less like it's it's just way more convenient. So this is what the shadow is telling us. Make it easy for them. In a way, this is the largest enterprise application of any technology or adoption of any technology that has been but it's failing when we try to do it officially and that's where the returns are missing. So this is a 5% playbook. As we wrap up here, in order to get your ROI on AI today, the first thing I would recommend is revisit your",
        "start": 1719.2,
        "duration": 3675.983999999999
    },
    {
        "text": "technology that has been but it's failing when we try to do it officially and that's where the returns are missing. So this is a 5% playbook. As we wrap up here, in order to get your ROI on AI today, the first thing I would recommend is revisit your it. And what you want to do is you want to build for friction, not for flash. So, most organizations invest their AI dollars into sales and marketing because it's easy to generate the content, but it's also easy to have direct measures like K KPIs. You can see how many customers you're targeting. What is the return? What is the click? But the real value is in the back office. And that was the biggest finding from looking at hundreds of organizational implementations this year. The biggest value is in the back office. So you want to build for systems with learning loops. You want humble AI, one that can learn and admit uncertainty. And you want to lean deeply into workflows. Companies that start recording data on their workflows are going to already have a leg up over the next year. And you want to buy not build. You want to work with external partners and bring in external advisors who have perview over the entire industry because AI in the fundamental models the foundational models are not built for any one particular industry. And the same is going to be true for the world models or the temporal or the neuros symbolic models. These are generalpurpose machines. So you want advisors because learning how it's implemented in one industry will give you a lot of insight into how it's going to be should be implemented for yours and it's time to start building differently. We don't want to just look at technology first. this question like what can AI do for you is one of the worst questions you can ask because it can do many many things for you and you don't want to also lean into the vertical what are the problems you can solve today you want to look at the vision you want to look at what is it that you can build that seems impossible and that is the recurring theme of the massive billiondoll and trillion dollar companies that are leading today and will continue to lead build for vision. So the main message I would like to end with is that every industry, every aspect of society is being transformed. AI just happens to be the face of that force and this transformation is going to happen regardless and it's through emerging intelligences that we can come back full circle to get the returns on investment. Thank you. Thank you. Round of applause for Radica Dirks friends. [music]",
        "start": 1889.76,
        "duration": 4002.8449999999975
    }
]