[
    {
        "text": " Deputy Chairman of the Government of the Russian Federation, Dimmitri Chernenko. This plinary session is about foresight. how AI will change in 10 years. Dear friends, I'm very happy to see all of you in this room in this AI artificial intelligence journey. This is a great day for the scientific community this conference. Let us thank and Mr. Gra personally for wonderful organization of of the science day and the whole AI journey. We are used to thinking that AI is just a system of the new economy. And as our president said, Mr. Putin at the planner recession yesterday and a couple of hours ago, we can say so as well. We have unique competencies for the full cycle of forming the fundamental language models starting from their creation and learning to adaptation to the specific industries. This is something that we are doing already and I must say that our teams are showing wonderful results in various industries and I think those of you who have visited the stands realize that this is the true reality. It's very impressive. But it's not just about the development of technology but about the strategic choice which determines the future of this country and even the countries that are in the AI alliance right now. This choice is not to be done blindly. other people in this room who know the groove effect you know about it right? So for AI, I think this can be especially true because last year in order for you just to understand where science currently stands in AI and which areas will [snorts] be prospective and what risks we must foresee in advance. We held a number of foresight sessions in AI. The first foresight was on the 30th of May last year. We were sort of training at that time and so there were 10 most prospective areas for fundamental research. We determined them and I underline the fact that this is fundamental research which serves as a foundation for applied re research and you well know that only after this commercialization is possible. So 10 areas they had 37 sub areas and 113 research tasks which our scientists thought is the most promising. So based on these results, the Ministry of Economic Development chose a number of research centers in AI. This was already the third wave based on a very rigorous contest and the AI as a competence for [snorts] this research center actually reflected [snorts] itself in the position of Russia, the number of publications as a whole in AI in Russia and also it manifested itself in the performance executed by the research centers. But the groove effect is that everything changed in just a year and our president Vladimir Putin said that we should bring this to the international level and only in this format we may be sure that we're moving in the right direction and instead of just existing in the the state of being detached",
        "start": 17.68,
        "duration": 491.2790000000001
    },
    {
        "text": "that everything changed in just a year and our president Vladimir Putin said that we should bring this to the international level and only in this format we may be sure that we're moving in the right direction and instead of just existing in the the state of being detached enemies may want but we don't want it. So I would like to thank all of the scientists who participated in this international work including our own universities and research centers, the SE sapphire foundation, the international AI alliance and all those who helped. In 2025, the international foresight in AI was held in three stages. There were expert sessions, deep dive interviews and then we worked on preparing the final report. This was held actually throughout the year together with research centers and the events which we had more than 20 in in Russia and abroad. In Russia, there were 10 foresight sessions with our partners and thanks to our alliance, the international alliance in AI. There were 11 sessions that were done in Morocco, in the Emirates, in China. Two times in Shanghai and Shenzhen, Serbia, Pakistan, Usbekistan, Bellarus, Indonesia, Armenia and Cuba. So a very large and wide geography. This allowed us to calibrate our priorities considering the fact that there are various scientific schools so to speak and it's very important to form a kind of a consensus on all the tasks. Also we held deep dive interviews with the scientists in order to determine how they see the prospects of development of science in the area of AI and why we can actually trust the results that they achieved. You know it's the the scientists their words that the whole world is linked to they are being quoted and they are being learned from every of these science scientists have a high level and publications fivestar kind publications behind them. So many of them are participants of our foresight sessions and more than half of them more than 150 of them are from foreign countries. So this included Europe, Asia, North and South America, Africa and you know actually with the whole advanced part of the humankind we worked on this task. Some of our colleagues, the foreign scientists came to AI journey specifically to share their own vision of the results of these sessions. And I must say that the interviews after the sessions allowed us to gather independent assessments of which areas are still prospective, which areas are stagnant, where we require additional approaches, etc., etc. also those suggestions on alignment of these tasks because we understand that we must fine-tune these on a regular basis and we see whether they remain topical and the most responsible part everything that we received were put in one pool and then we finalized the the report on the international foresight you can see the QR codes on the screen where you can read the digital version of our report",
        "start": 277.44,
        "duration": 910.8770000000001
    },
    {
        "text": "we see whether they remain topical and the most responsible part everything that we received were put in one pool and then we finalized the the report on the international foresight you can see the QR codes on the screen where you can read the digital version of our report colleagues and also would like to hear from you to learn what you think about that. So the results that we see following the foresight in AI we must say that our Russian scientists are not fundamentally different from the rest of the world. the actually they moved to the top and right with the development curve. So I must say that in a year we strengthened our understanding of the scientific basis and expanded the potential. We need that for groundbreaking results. So this foresight confirmed that the vector for 2024 was right. There are 102 new research tasks. 62 research tasks were changed or clarified by experts and 14 tasks were either merged with others or removed. So as a result as I say the the list grew to 102 tasks and so these considerable shifts are the result of our systemic work. The scientific breakthrough is 100% impossible to plan but we can change its probability the probability of scientific breakthroughs and we must improve the funnel and see that the competences and research is as full as possible work in all the possible directions raising [snorts] the chance of this breakthrough happening as of now I think you well know that there's contest for not for the specific technologies but those who build the ecosystem based on this technology [snorts] maybe even the operating system for the future those who are able to do that those will determine the rules will set the rules the others will become dependent on the decisions of others so we're looking at that in the kind that this is not about chasing someone but about forming the circuits of the future which will be based on the shape of the future based on the specific scientific basis it's it should not be just it shouldn't belong to just one corporation or one nation it should be for everyone the 10 areas that the scientists determined for AI so they can be imagined as a ladder from the foundation to the integration into our real lives in the foundation we have architectures, algorithms, mathematics and then we move on to the level of AI agents, models and security [snorts] how they are explained and then on at the top is the integration [laughter] AGI and human machine interaction and also the change in the society the only non-technical part of the research this is the principle that is in the foundation of our foresight report. Now that you have it, you can take a look at that. We plan actually to share this with all of our partners circulated with the government, the UN also on behalf of the international AI",
        "start": 491.039,
        "duration": 1312.0770000000005
    },
    {
        "text": "research this is the principle that is in the foundation of our foresight report. Now that you have it, you can take a look at that. We plan actually to share this with all of our partners circulated with the government, the UN also on behalf of the international AI into three languages and there were two editors and foreign and a foreign researchers worked on that. So here we are here to listen to those who created this foresight and I think without further ado we should talk to our scientists. You can see that here there are only two chairs and in this format we're going to work we're going to invite our speakers here and the current foresight is under the brand of AI horizons. the forecast will be updated and I would like all of us to use this collective brain so to speak not something that's given by the generative network but our own minds collective minds to participate in this work and maybe suggest how our unified platform should be called. Let us use this QR code to make your own suggestions. You'll have time to do that. You may think about that. Maybe some thoughts of our experts and scientists will make it easier for you. Then we will calibrate and ask AI. It will help us tell us that maybe our AI horizon is a very good name or it shall be remain it shall remain or maybe there will be a new one. I would like to invite [laughter] our first pair of esteemed scientists who will tell us about the areas that are the basis of this research the architecture algorithms of machine learning and optimization. I invite the professor from Serbia, head of applied research in Singodon University, Neboa Bachanin Jakula and director of Inapolus University, Alexander Gaznikov. Please floor is yours guys. Let us support them with a round of applause. watch the screen because you will have a limited time for that and there will be two questions to each of you please. Professor Bachan Jakol, I'm very happy to see you here again. We were in St. Petersburg with you together and I know you have a very big program in Moscow that you're visit going to visit the Bush Theater. I'm not sure which player going to look but I hope you like it. Do you have plans? What else do you want to do in Moscow? We can help organize that. First of all, esteemed deputy prime minister for great Russian federation. Many thanks for your kind words. It was honor meeting you in St. Petersburg economic forum as well as here. I love Moscow. I love Russian people. So I'll go to Bchvat to watch opera souls. -huh. That's you know because I want to go to this historical stage because it's of national level ever importance to go there and honestly the second thing I",
        "start": 697.12,
        "duration": 1697.8380000000009
    },
    {
        "text": "forum as well as here. I love Moscow. I love Russian people. So I'll go to Bchvat to watch opera souls. -huh. That's you know because I want to go to this historical stage because it's of national level ever importance to go there and honestly the second thing I wife is here with me in this very hall and she wants to go to this because she admires the Bervat. But besides this we will see all other you know beautiful sites of the greatest city in the world which is Moscow definitely. Okay. I'm very happy that you are so warm about Moscow and Russia. You know while you were talking I asked Gigashad quickly who is the most popular composer in Serbia and it told me Stefan Moarat. Is it true? He's one of the most famous means Gigachhat wasn't wrong. [laughter] So we wish you a nice evening at the theater. But we know that this beauty is based on the structure of the of the play or a ballet. So it's done on a certain basis. You will see that. But in in ar in AI it's based on architecture and algorithms. So for us to be on the same page tell us please what is there what is the foundation why it specifies the framework of all other AI areas. So this is the first research area and it's basically the foundation of all other research area in terms of mathematics and engineering which is basically the core of modern AI. So this research area is important because it connects architectures, optima, optimization and the learning formulations into the unifi process of model creations. So it's foundation for everything else because models are the most essential here. Also when we talk about models, we should mention architecture. Architecture defines how AI represents information while optimization helps you know adapts models to the data and mathematics here is very important because mathematics provides guarantee of stability generalization and robustness of all those models. finally I would like to mention that the progress in this area is accelerated through breakthroughs in the AI for science in which in the years 2024 2025 managed to incorporate scientific knowledge into so-called road models. It's also accelerated by using the generative models generative modeling and also by using the multi- aent systems which is very important for the future as well as federated learning. So that's why that's foundation for all other pillars and focus areas. there are also many other things to tell about this like LLMs here are very important which are used to evaluate and to create a new architectures as we all know each architecture should be adapted for solving particular challenge. Before LLMs, we had to do it manually by using narrow architecture search or auto machine learning or by applying meta heristic which is my field. I love this. But LLMs are much better in this because",
        "start": 900.8,
        "duration": 2083.9980000000005
    },
    {
        "text": "as we all know each architecture should be adapted for solving particular challenge. Before LLMs, we had to do it manually by using narrow architecture search or auto machine learning or by applying meta heristic which is my field. I love this. But LLMs are much better in this because blocks or foundations to build the model which adapts to specific problem because according to the NFL no freelance theorem there is no universal model which is able to solve all kinds of tasks. That's why we should adopt the model for each and every particular task and that's why L&Ms here are very important this area. And also when we talk about the model adaptation we have this algebra for AI which combines the structural components into architectures and optimizes to adapt the model for particular you know data set and this is one of the long-term and short-term predictions in this very important focus and research area. Thank you. Thank you. Thanks professor. You know actually Our scientist, mathematician here, Alexander here today AI is very complex. So that mathematical tools are not usable. We need new algebra which professor just mentioned the world international models. We saw the release for example of the adaptive system. What are the main challenges in architecture algorithms of machine learning? You see Mitri, thank you very much. I think we may be starting with limited generalization because you know when a kid and he's or she's being shown the photos of a tiger or a cat, they can discern them one from another and the the networks will have thousands or dozens of thousands of images to understand that. So to bring this to the level closer to the human level it's actually one of the challenges and many esteemed experts are talking about that for example lun and the another challenge is the certainty so what LLM give us whether we can trust them how can we check it's certain or not certain but about the results this is especially critical in healthcare for example So these are the are the two challenges which are the most important. Thanks [snorts] a lot dear professor Ban and Jakula. When we met you at spiff at St. and Petersburg forum you repeated one one some of these things you said that there were going to be large scale changes in the architecture and algorithms [snorts] in implementing diffusion models and multimodel systems and then a distributed architecture even in the near future what will happen what will happen in the year during which we will work and and get together one more time and discuss the results. What should be your forecast? My forecast is first as I already mentioned the development of algebra of AI which enable combination of architecture and optimizers for solving different challenges. Then one of the short-term forecast is to develop the adaptive you know and scalable AI system which is enabled for continuous",
        "start": 1096.559,
        "duration": 2491.5990000000015
    },
    {
        "text": "be your forecast? My forecast is first as I already mentioned the development of algebra of AI which enable combination of architecture and optimizers for solving different challenges. Then one of the short-term forecast is to develop the adaptive you know and scalable AI system which is enabled for continuous adaptation. This is very important because by using the continuous learning it's basically the concept of model to learn new things to train on new things without forgetting the old things. This is very important. Another important aspect is domain adaptation. So the models will be able to learn from the source domain and to apply the very same knowledge to the target domain without requiring subceptual or any kind of retraining the model. Also I think it's very important that we are going to integrate the scientific know knowledge into optimizers and architectures to create so-called world models. So now the model is not going to be based just on the data. It's just is going to be based on the scientific knowledge from the physics, chemistry and other domains. So the model is going to adapt better to the new tasks and unseen domains and also there are many hybrid approaches between let's say symbiotic modeling, symbiotic learning than physics systems and datadriven systems. And also I think that there is going to be a rapid change in the symbiotic multi- aent systems which will enable automatization fully automatization of you know machine learning pipelines. So that's that's like our vision. Yeah. If this happens in one year this will be fantastic. It's going to be so cool if we go to the domain approach to the architecture points like algebra for AI and adaptive AI models will happen in the next one or two years but this last three points are like for longer forecast for the next 5 to 10 years I think. Okay. Okay. Thank you very much. Let's give a hand of applause to our guests for the projections short-term and long-term alike. Let's look further beyond the horizon. Let's ask Alexander Vladimir to give a forecast for the longer terms. What's going to be defining for the architecture of algorithms? Well, to make a forecast, we need to get some kind of a training set. At one point it became very important to understand that the extractor of markers would be best done not manually but do a convoluted network that will learn the markers itself and this idea to automate the marking this is the idea to delegate something to AI and this trend is going to be maintained And you know some labs are actually working. It's not just one assistant helping the lab. They are actually a set of assistants. And if it used to be you know designing data for the model and then use the model now it's a more of a symbiosis between interacting agents. Each agent doing some kind of a training job. They",
        "start": 1306.72,
        "duration": 2873.5990000000024
    },
    {
        "text": "one assistant helping the lab. They are actually a set of assistants. And if it used to be you know designing data for the model and then use the model now it's a more of a symbiosis between interacting agents. Each agent doing some kind of a training job. They develop some kind of a process. So it's more of an evolution thing. So my forecast is in that we will be increasingly taking the knowledge available from the synthetic evolution theory how the brain the human brain evolved how we became humans and we will be integrating that into the AI systems which will in turn increasing automate and give us an increasing ar hierarchy of the processes that we encounter in our work and in our creativity actually. Thank you very much Alexander Limarovich. I was actually waiting for you as a scientist and user will remember our micros service multi-tenant platform the only one in the world that is used for both by the government and scientists uniting all our scientific research. That's where we are designing the domain principle. That's why it is called domain science. It's very cool that we're actually talking about this today. Thank you very much. Ahead of applause to you. do rejoin the audience please and I'm asking to come on stage the professor from Brazil the leader from the lab at the University of Kenos Anderson Rosha and the director of systemic programming institute Mr. Artori, you've got very long track records. Gentlemen, I'm actually having to scroll through four pages of achievements. Professor Rashan, you are representing Brazil today at this discussion. Benu, can you hear me? Do you have your earpiece on? Yes. Okay, very warm welcome. You are part of the two top 2% of the top scientists in the world. You have a rare skill set starting from computer vision to all the way to digital forensics digital law. You worked with AI both as an engineer and a research in security and risks. Let's start with a very simple thing but very important nonetheless. you actually was brought up by your predecessors here on stage. Why is it that the topic of confidence in AI, the trust in AI resounds so loudly these days? Thank you for question. It's a pleasure to be here. When we enter a plane, we want it to be safe. We wanting genans to be safe, the fuselage, everything. We want the people that pilot the plane to be also trained, right? So the same is with artificial intelligence. It's here to stay and it's changing everything that we do from decision making to healthcare to energy to solving different problems. So when we have a technology that changes everything, we need it to be safe. We need to go as a requirement to have it safe, sound, transparent, we need to be we need it to be explainable. So when we have that, then we're going",
        "start": 1501.919,
        "duration": 3262.9600000000005
    },
    {
        "text": "to solving different problems. So when we have a technology that changes everything, we need it to be safe. We need to go as a requirement to have it safe, sound, transparent, we need to be we need it to be explainable. So when we have that, then we're going social acceptance, it needs to be reliable. When you have a tool like that to help you detect diseases in the hospital, you want it to explain the decision and actually help the doctor and not just say yes there is a tumor and the likelihood is 99%. Okay, but where why? So when we have that step further then people will trust it more and use it more. So we need to move from the real tools that are being developed. That's very good. We are here for that and we need to go to the next step the explanability. Thank you very much for your response. Today the development of AI is moving from the chase of productivity to ensuring the transparency and matching the values of society. What would be your assessment of this transformation of priorities and what are the main drivers here? Well, hello everyone. , thank you for the opportunity to speak. I think this is an indicate of maturity for the technology. The penetration of a lot of spheres. We're very much at the outside of the road, but then the implementations really play security on top. And it's important to say that this is not the conventional understanding of security. The social social and humanitarian aspects of security are coming to the for as well. And giving just a tech answer to this is not enough and you know superimposing protections again will not be sufficient. Security must be inside by design starting from the starting point of development. I will not be responding to your question, you know, in 2 minutes. It's a vast question. The important thing is to set the priorities right for the next couple of years going forward. Yes, secure by design. And for this to happen, we need to agree on the standards, the principles, and what they must be in line with the common values. For sure. There's there's one danger lying herein. It's good that we are discussing this internationally because some countries want to build in their own values and as IT people as engineers we are saying that we need to get technologies that will verify and the values the values will be you know area specific in medicine it will be a bit more diff different in terms of ethics in politics totally diff different but technologically we must give the tools for the policy makers or healthare professionals or other professionals must realize that must impose implement that with area specific characteristics. We have got actually a presidential decree 809 to the effect that the values are complied with. We need to look at this together with the AI alliance",
        "start": 1706.96,
        "duration": 3636.3200000000006
    },
    {
        "text": "tools for the policy makers or healthare professionals or other professionals must realize that must impose implement that with area specific characteristics. We have got actually a presidential decree 809 to the effect that the values are complied with. We need to look at this together with the AI alliance the values that do not contradict each other. We should start with that value set. My question my question now is to professor Rashan. We certainly want to hear your projection your forecast. What do you think ways for us in the next in in in this sphere in the next couple of years? As you yourself mentioned a few minutes ago, one year is already very difficult to predict, right? I used to say to my students in Brazil, one year in AI is like a decade. So here we did an exercise. what's going to happen likely from 25 to 28 that's the time that we need to discuss standards we need to discuss regulation it might be in a year or two but we need to do that because otherwise AI will swallow us it will be present anyhow so regarding do we do it or not I think we should do it then what's next we need to since now focus on fighting abuses. There are many people that go online that use technology for abuse to take advantage of others. So we need to develop the technology and the regulation to fight that and it needs to happen now as well. Looking further, we need as it was mentioned before to design the theory to improve the theory to make better models more models that are safer and transparent and I think that until the year 2032 we need to have that in place. Thank you. Thank you very much. Let's remember this forecast. We're going to discuss that in a year. Mashkarovich, you mentioned healthcare where the price of an error is obviously very high. What do you think the most important criterion is to apply AI in medicine securely and safely? You know, it's very important to identify the risks and jeopardies in every specific case and use AI depending on that. Sometimes unfortunately we will not be able to give it autonomy without the humans and the regulation the right regulation is crucial here. At some point IT community considers this to be a limitation but this is not so and here we are actively working with the medical community with the healthcare community. we RNA vaccine was announced. We are doing with the academician the reasoning thing. Ivan is is sitting in the audience. That's obviously the crucial thing to do because sometimes it people do not understand the limitations imposed by the area specific professionals. If we only are driven by our own knowledge that will be a limitation. I think going together is the right path. Okay, thank you very much. Do rejoin the audience. Now",
        "start": 1901.519,
        "duration": 4001.361000000001
    },
    {
        "text": "thing to do because sometimes it people do not understand the limitations imposed by the area specific professionals. If we only are driven by our own knowledge that will be a limitation. I think going together is the right path. Okay, thank you very much. Do rejoin the audience. Now the volume of regulation here and the U Vietnam professor Anuan and from schooltech and the director from mega faculty of ITMO Mr. Alexander Bukhanovski. Please join us on stage. Do not spare applause. Do let's give some encouragement to the speakers. The next area of the foresight, computation for AI. As you will know, computation includes the development of both new computing architectures and the software tools that ensure effective use of computation. Mr. Huan, you lead several projects with Huawei where you are rationalizing AI starting from compression of models and accelerating models all the way through architectural adaptation. What do you think lays the foundation for computation in AI? So thank you very much for the introduction and I'm really really like honored to be here. So this is second time for me. So I attend the conference the session they hosted by the deputy pride minister. So I'm very honest to so again so regarding the questions so what is the fundamental for AI development? Yes. So you see here that's the the scale of the models is really important. So we see the small model from like 10 years ago and then very big model deliver almost every year. the mic please. yeah then more importantly that we see here the scale of the model and then the architecture does can support the model to run to train and to do finetuning and another important the architecture is also very important to I mean the hardware also very important to specialize to improve this the the speed of the model and also to reduce the energy. So that's one of the more important factors. Yeah, thank you very much Alexander Valerich. All the experts convene in the opinion that the main bottleneck for the next 10 years is the computing power. Obviously the stake on scaling GPU will not be vindicated. Nvidia are following this path. They recently got some luck. The bubble did not burst. But are there any alternatives? Yes, admit. Actually, there are alternatives. And it goes without saying that using GPU supercomputers is a very expensive thing. But we should remember that the quickest thing is the light. So we should go back to the opto electronic and photonic neuromorphic computers. Unfortunately, systems like that as often as not are one act theaters. So they can only perform one transaction, say transformation of markers. They do not cover the entire length of model performance. But you can use them as hybrid systems. You can use them as boosters, as accelerators. you can merge them with classical architectures perhaps weaker cheaper but that symbiosis will give you a winning",
        "start": 2089.44,
        "duration": 4423.6010000000015
    },
    {
        "text": "one transaction, say transformation of markers. They do not cover the entire length of model performance. But you can use them as hybrid systems. You can use them as boosters, as accelerators. you can merge them with classical architectures perhaps weaker cheaper but that symbiosis will give you a winning cover the things that the GPU systems could do. Thank you. Very interesting Mr. which lead to fun how do you treat the symbiotic systems quantum photonic systems with the combined with the with the common GPU systems. Yeah, thank you for the question. So again so and this to ask some a few comments. So the development of AI system so we see the how GPU develop like every two year 3 years. So new generation it come and it support us not only to accelerate the computation but the the thing it does it now come to like reduce the computational more efficient the energy. So about the quantum computing. So in this no many people believe us that the the benefit of quantum computing will come in the next 10 year around 10 2030 or 2040s and definitely you see that the the benefit from quantum computing is not for everyone. So it might it belong to some big company and some national lab it really have high resource and and we worry about that this can maybe lead to some like the risk that AI might not be opened from the public so for research scientist educator or maybe some or some small company so there another way that we think about some like open AI not open AI so I open for everyone so sorry about So it mean that how to modify some existing model using the available resource computing to adapt some to some specific application. So it happen here that the model is released and then you you want to use the model for some spec specific application you train you find that and the performance that you have chased it not the same as the model that a public claim in in the original paper. This is because the the architectures the the hardware you use it not comparable to our original one. So somehow we think about that okay how can we use the how can we deploy the some existing model on the hardware that we have to achieve compatible performance so that it not really reduce the significance very diplomatically. Thank you professor. 2030 2040 very diplomatic but maybe we should remember your your turn of phrase you know instead of open AI AI for everyone was that the was that the thing you said yes thank you Alexandra Valerich perhaps very briefly what would you what would be your projection about this startup that launches a data center into the space you know energy consump consumption going down tfold etc. Well, energy consumption will definitely go down because in in space cooling is",
        "start": 2307.119,
        "duration": 4799.3610000000035
    },
    {
        "text": "said yes thank you Alexandra Valerich perhaps very briefly what would you what would be your projection about this startup that launches a data center into the space you know energy consump consumption going down tfold etc. Well, energy consumption will definitely go down because in in space cooling is cost of the enterprise is not in cooling. It's about taking it into orbit the right way using it the right way and then utilizing disposing of it the right way. No one really knows whether this is the right marketing marketing move or whether it's going to be worth anything. Okay, let's observe. Let's wait and observe. Do rejoin the audience now. And I'm now asking the deputy dean of SA University in India, Ajit Abraham and the state scientific research institute of aviation system researcher Yuri Vizelter. Abraham, Dear Mr. Abraham, great to welcome you. When we spoke the last time at the St. Petersburg Economic Forum, you shared your vision of the architectures and ML machine learning. It would be great to hear your opinion as one of the most cited experts in data science on this track data for artificial intelligence. Please sir, what do you think? Good afternoon. First of all, I would like to thank the deputy prime minister Dimmitri Chennishenko for all his leadership and for the guidance during the last several months for having various foresight sessions summarizing the whole event. On behalf of all the participants, I again would like to thank you for your leadership and this energy back home I tell my leaders that we can also learn from the administrators in Russia the way they do things lead the things guide the scientific community. Thanks to your wonderful leadership. It's a very interesting area. It reminds me 30 years ago when I started AI research. So I remember this very interesting analogy chicken and egg which comes first whether it is data whether it is AI. So in the case of artificial intelligence, we can build models but without data and without any practical applications without making an impact to the community. To me such models are just good in scientific papers will not have any practical implications and we should stress and strive hard to do the best we can to innovate new technologies, new methodologies to make data accessible and available at all times and all means because recently I would say that during the last 3 years as I see it lot of enterprises I would say countries which are economically privileged having a upper hand in taking forward this domain. I feel like the field is being hijacked by few enterprises and I think there is a big need for scientific cooperation. [snorts] There is a huge challenge for all of us to balance this what I call as data asymmetry and there could be lot of various challenges facing this. First of all, there could be regulatory issues,",
        "start": 2501.68,
        "duration": 5268.040000000002
    },
    {
        "text": "few enterprises and I think there is a big need for scientific cooperation. [snorts] There is a huge challenge for all of us to balance this what I call as data asymmetry and there could be lot of various challenges facing this. First of all, there could be regulatory issues, data is curated at some places, for example, you want to access data from Antarctica definitely, then we need to think about in some other perspective. But the way the field is moving and the way we have the frameworks coming up, we need to look at the whole field in three different broad domains. I think there is a need for developing benchmarks because that is how we usually build AI models. So we need to understand the performance metrics by which a model is evaluated and for that we need the best possible data available and associated benchmarks. Data forming and maintenance. How we get this data? whether the data is of good quality and whether it is reliable and maintaining this because many of times users come in and go and then some data may get corrupted and some data could be used for some other purposes. So we need to assure that ensure that this data is maintained and preserved very well and finally confidentiality is another major challenge especially related to specific problem areas. At the same time data protection many times I guess the previous pillar mentioned about government, healthcare, finance. So these data we cannot afford to simply leak out of any cloud or any platform. So we need to ensure that we balance this in the best possible way. Thank you very much Mr. Vice Chancellor Yuri. after the speech of Ajit, I would like to hear your understanding of how requirements for data is changing and what benchmark they set for data for AI. yeah, thank you. I think there are two main things in play here. First is how fast the AI solutions are changing. In spring there was a research by the metro group that showed that in the last six years every seven months the [snorts] level of complexity of tasks solved by AI doubles. So every time we need new and new benchmarks which are capable of estimating these new tasks this new level of AI that is always being raised and raised. There are also new classes of tasks the ones that were mentioned in foresight multilanguage character working in the open world collecting data for body ties what's required for robotics and the professional competencies. So I think today the strongest frontier here is the data for professional competence. As an example, I can mention the wall GDP wall benchmark published by open AI. GDP is is using AI in the economy and it includes the examples of solving professional tasks for 44 professions from nine areas of the economy which the experts with big experience created and these are the benchmarks that set the",
        "start": 2754.4,
        "duration": 5704.9990000000025
    },
    {
        "text": "the wall GDP wall benchmark published by open AI. GDP is is using AI in the economy and it includes the examples of solving professional tasks for 44 professions from nine areas of the economy which the experts with big experience created and these are the benchmarks that set the and now I have question to Ajit Abraham [snorts] the there's an understanding that the data is being limited the synthetic data do not give the variability and it sort of leads to a closed circle and we risk getting into a digital echo and losing or even getting the the lack of efficiency curve. What do you think about that? Yes, I guess as President Putin mentioned on the first day, there is a need to secure data and develop own curation methods specifically when you deal with high level sensitive data for various applications. Of course, it is a big challenge because data nowadays is considered as an asset and many a times getting this data from nowhere is it brings lot of challenges and typically in practice what we do for many applications is we use so-called data augmentation. We try to curate data using various genetic AI means but again nowadays because of the availability of several platforms we don't know what is authentic even the differences are very small for example if you look at the text generated from LLMs it is very difficult for us to make out whether it is from from LLM or it is generated by humans so looking at some highle features some statistical measures We can of course categorize them as curated or synthetic but again for images for medias I think there should be means like watermarking is one way to to understand whether it is coming from some generated platforms. At the same time we need to ensure that these data are not misused by some other stakeholders. So employing standards for example GDPR and ISO standards are I think is mandatory moving forwards because nowadays absolutely there is no control is absolutely chaos because we are dealing with data in a very big scale. I remember 20 years ago we could do data analysis analytics in a lab but nowadays everything is in the cloud and we are seeing that thirst it's like drinking water from a fire hose reel and the data comes in streams from various sources could be videos could be signals could be healthcare data could be text we also need to handle all this variety of data and also veracity sometimes you don't know this data is coming from this authentic source could be someone is injecting something to cause problems or confuse the model. So there are several layers we need to ensure that u security is in place so that we are able to protect and offer the necessary confidentiality for the various stakeholders. Thank you. I absolutely agree with you. It's good that you remembered our",
        "start": 2977.599,
        "duration": 6104.930000000005
    },
    {
        "text": "cause problems or confuse the model. So there are several layers we need to ensure that u security is in place so that we are able to protect and offer the necessary confidentiality for the various stakeholders. Thank you. I absolutely agree with you. It's good that you remembered our it's true that the standards are obligatory for us to be able to talk to each other especially in data usage. Yuri, what are the breakthroughs? What do you think your forecast? What do you expect in working with data? I think the main breakthrough can be awaited in working with synthetic data because it's also the main challenge that we're working with because in many areas we have the situation of the so-called wall of data where the majority of data that could have been gathered is has already been used for learning. This is one of the challenges for the modern AI. Can we create new data for learning? [snorts] If we can validate it well for example in coding we have very good progress that we're seeing in the last years and it can go on and go on and in cases where we cannot validate it very well for complex tasks. Here is the question is whether we can generate the synthetics is a more of a philosophical question whether a teacher a person can teach the the pupil which is the AI something that he himself cannot do it because you know the learner must overcome the teacher some time we'll learn if it's true when we work with synthetic data well if it's based on bad quality synthetic data and if they're going to mislead feed or hallucinate or generate additional new data and then train someone around and and making the data worse. It's the matter of validation. This is a task for all of us to prepare for the next year. [snorts] Thank you very much. Please take your seat. And I now invite the professor from Anho University here at Ten and chairman of the laboratory and transport of the fist lab of modeling Ditri Yudin. Professor Professor Ten, I think your name is known to many people who work with optimization and specific [snorts] computing methods. You are called as the best youngest scientists in AI in China and you became one of the most quoted Chinese researchers and we're very happy to welcome you here at this stage. In foresight, you're representing the area of AI for narrow tasks, specific tests. And following the forecast, the narrow AI will be 95% of the economic viability of this. What is your the future of this area? What do you think? What are the approaches that can set up the tempo for the coming years? Thank you very much, dear Prime Minister. Thank you very much for your introduction and the invitation. It's my great honor to be here to discuss with you the future development of artificial",
        "start": 3183.599,
        "duration": 6459.0100000000075
    },
    {
        "text": "do you think? What are the approaches that can set up the tempo for the coming years? Thank you very much, dear Prime Minister. Thank you very much for your introduction and the invitation. It's my great honor to be here to discuss with you the future development of artificial for me I think the core function of artificial intelligence is to reduce the human workload of and to improve the efficiency of industries and I think currently the neural networks will still be the mainstream technologies for narrow AI in the near future including the for example phony connected neuronet networks convolutional networks transformers and diffusion models with their applications in computer vision, natural language processing and other industrial scenarios. Also, as pointing as pointed out by the president on Wednesday, currently the large language models and gener content generation models would be the most popular AI applications and both of these two applications are also based on neural networks. In the future, we may shift from the scanning to architectural diversity and with this we can innovate some hybrid and also multifunctional models. But this is still under the framework of neuronet networks and the paradigm of narrow AI development will not be changed in the near future. Ditri as an expert as an expert what's your view on the development of narrow AI on the international level including the embodied AI what may hinder moving from the lab research to the existing solutions thanks for this question actually the narrow AI is about practical models and the methods which very are very well and organically ally used for robotics for self-driving cars and even in robotics I must say not just the delivery robots the walking robots that one of them was presented yesterday at air [snorts] journey these are medical robots and other types of service robots and I must say that what must we do what for for that first of all we must support open joint projects, international projects which can integrate modern engineering methods and develop them in Russia. They are meetups even in this community are used. There are international big projects which integrate the technology of self-driving cars. for example Apollo [snorts] from BU or autoware from their association and also big projects and their creation and support of them it seems like it's very very prospective and we can develop them in addition to that what is important the development of the AI the that could be aware find itself in 3D scenes and now language models cannot do nicely and so the modern methods for narrow AI could help do that and raise this awareness. Professor Tan question to you. Now the difficulty begins where the system must see and understand and as well as understand how to act. So moving from just getting the information to acting what's your thought on this? Thank you very much for the problem. for me I think this conclusion is",
        "start": 3376.559,
        "duration": 6885.650000000009
    },
    {
        "text": "question to you. Now the difficulty begins where the system must see and understand and as well as understand how to act. So moving from just getting the information to acting what's your thought on this? Thank you very much for the problem. for me I think this conclusion is development of narrow AI currently under the framework of neuronet networks under the based on the supervised learning paradigm I think AI can learn the mappings between input and output for example the images and its labels the description and the generated content the biological sequence and the analysis results. For this goal, we should have a large number of data sets to deeply train the neural networks so that it can work. But in many scenarios, especially those in science and engineering, we cannot obtain such a large number of data sets for each scenario. It's not a big data but a small data. In this case, AI should are are expected to be able to reason, plan and act in the complex real world scenarios by themselves without the supervision of human experience. I think it's possible it can be achieved by reinforcement learning, intelligent optimization and other technologies other than supervised learning paradigms. Thank you very much. What's your thought on the realistic trajectory of the development of AI, a narrow and smarter AI up to the end of next year? To the end of next year, I must say it's not a simple task. I think the trajectory is as follows. So the academia the research organizations will create new fundamental models small [snorts] ones for the computer vision or natural language processing and then going on companies will use them and we will get feedback from them and then we'll correct this algorithms also we'll get a better quality the economy or maybe positive applicable effects even in healthcare and robotics and all this up to the end of next year small movements yes we'll do we'll be able to do them we'll track we'll track that thank you very much please take your seats and now I invite professor of the engineering college RMK and a specialist in AI nilakandan subramani and director of the center of bioelectric interfaces of the high school of economic Alexe Oachi, Mr. Subramanyan, among your scientific interests that define the technical foundation of interaction between AI and humans is the infrastructure that makes systems more responsive, more [snorts] personalized, more secure in human to AI interaction. The tech foundation and user experience are directly related. What are the challenges in your area do you see to be the key ones? Thank you for your question. Actually the human being human computer interaction how the people are interacting with the technologies by using some machines. You know day by day even we are developing a huge number of technologies that is the only purpose for interacting with the human being and",
        "start": 3599.28,
        "duration": 7288.0870000000095
    },
    {
        "text": "Thank you for your question. Actually the human being human computer interaction how the people are interacting with the technologies by using some machines. You know day by day even we are developing a huge number of technologies that is the only purpose for interacting with the human being and otherwise it is no meaning for developing a new technologies. And here the key challenges for the future human computer interactions take a brain computer interface and actually brain is not a static one. It changes over a time and for this brain computer interaction carous for changing over period of time. We cannot predict how the neural code is working behind of that. That is an biggest complexity here and also the blending of physical and digital world technologies like using virtual reality, augmented reality and 3D environment and these are the biggest challenges when you focus on cyber sickness in terms of healthcare and other things. To overcome this nowadays we are interacting with like emotional classifications and text based emotional classification voice based recognition system and text based recognition system but in the future how we are going to integrate all these model into a single picture that's what we can say multimodel AI so these are the key challenges I'm facing I'm seeing this and also in terms of a ethics like the developer A model how it is an how we can justify whether the A model is correctly developed or not the prediction of developed A models also a huge question mark here in terms of explainable AI thank you professor neuro interfaces they can read the signals of the brain rebuild some functions of the brain that have been lost when Is this going on mass or is this still committed to laboratory going forward? Thank you very much for the question. The neuro interfaces, they're perhaps split into invasive and non-invasive. Non-invasive are obviously those that read brain activity from the surface of the of the scalp of the skull. And it might seem that the devices that could use that technology have been in operation for a long time. You're looking at my scalp with some particular interest. Well, you know, devices like that could accompany meditation, you know, track human emotions, etc. If you talk about further development of technology, we should not perhaps listen to the brain per se, but we should register the activities of autonomous neuros neurosystems. You know, following eyeballs, whether they are diluted, they are a good indicator of how immersed people are in the situation. That might be an area of development. You don't require very strong AI. You just need some ergonomic devices to register those parameters. Talking about invasive interfaces, well, invasive so far they have remained committed to the lab. Yes. And they probably will for a while but a spectra of such solutions will be expanding. So far we have had very successful trials of the",
        "start": 3817.039,
        "duration": 7687.205000000013
    },
    {
        "text": "need some ergonomic devices to register those parameters. Talking about invasive interfaces, well, invasive so far they have remained committed to the lab. Yes. And they probably will for a while but a spectra of such solutions will be expanding. So far we have had very successful trials of the eye stimulation of the periphery vision you know retina stimulation that is a good promising technology reinstatement of speech capability. Some systems are are able to rebuild the speech capability without those interfaces. speech is pretty much unintelligible. So invasive interfaces yes still the domain of the medicine professional surgeries but they are going to become cheaper and more accessible non-invasive if it's not just about electrodes if you talk about the autonomous things skin reactions eyes heart rate reading we are going to hit the new level of processing for the data new level of devices well thank you very much wish you every success do take notice of what Verikov is doing in the brain institute of the academy of sciences. Yes, we are very much involved. Dear professor, your colleague spoke of emotions. What do you think? it's going to be the time when machine starts reading emotions correctly. When are we going to learn to sense the humans? Actually the human machine interaction the a model and machine will always read the human brain. Okay. Now we can see the people how many of you sitting with the stress and anxiety and depression. We can easily identify by seeing your facial in facial expressions and this is also one of the model we can identify the human emotional states and these emotional states as well as that sentimental classifications also will be the future in integration of a single model and the critical questions for here in the ethical issue the model which you have developed it should be in reliable one for the future world and also the if the data If you are feeding into the A model, if it is not a reliable one, then it will be a chance to bypass the human interactions because the error rate will be very high. So it is our responsibility of the AI engineer to feed the correct data and to develop an AI model for the human machine interactions and also the model which you are developing and that should be fit to the social impact and social development and for the betterment of human being. So it's our responsibility to develop an ethical guidelines and ethical framework and it should be reliable and transparency. Thank you very much. What are your plans for the next year? What are you going to showing us in about a year? Well, I would very much like to stop to transition from registering brain activity to high density matrixes. If you look at this line in front of the stage, that's what 1 cm of the human brain looks like. Right now, we are",
        "start": 4021.599,
        "duration": 8066.167000000013
    },
    {
        "text": "to showing us in about a year? Well, I would very much like to stop to transition from registering brain activity to high density matrixes. If you look at this line in front of the stage, that's what 1 cm of the human brain looks like. Right now, we are are about the size of my palm. Hopefully, we can use electrodes that are going to give us dozens of spots per per square millimeter. the interfaces that we have about the systems that are pretty much breaking down this wonderful matrix. They are building into the cortex. These are sort of needles. So the desire would be to use the surface electrodes. Yes. And we are doing a partnership with Sinqua University initiated by spare. Hopefully we can advance in this direction in a year. Thank you colleagues. Do rejoin the audience. And I'm now inviting on stage secretary general of the international AI alliance, the managing director of Sperbank Andre Vladimir Namov and the researcher of center for international security at Sinua University, Mr. Song B. Andre Vladimir at 2021. The National Ethics Code in AI was developed and open for accessing accession by sighting. Do we do we run the risk that a critical number of [snorts] nations might actually join this code? Is that a probability? Well, we're very much hopeful that this is going to happen, but that has not come to pass. UNESCO adopted the recommendation. Yes, we have not yet achieved that. UNESCO in 2021 adopted the recommendation on the AI ethics, but the implementation has been lame so far. struggling. Why? Because the ethics of AI is inaliably inalienably related to the culture of civilization that is something that we studied at the science foresight. Right now most propositions really translate the ethics of the western countries. So together with the Sinua University we are studying the other types of ethics that we should probably note as we develop the global AI ethics so far in Russia and the country is friendly to Russia we have been largely successful in doing this for for instance the Russian code of ethics was exceeded to by about 150 signatures we've got about 35 members So there's demand for that and hopefully we can develop some kind of a global ethics code under the opaces of the international alliance. Mr. your research of the Russian region Chinese foreign policy allow us to view not just AI but AI is a factor that changes the rules for global competition cooperation and then there's dilemma either AI is enhancing structural asymmetries between the countries or it is an opportunity for a more balanced international environment thank you very dear Mr. Cherenko, I will try to speak Russian. I'm not the best of the Russian speakers, but still I'm not the best Russian speaker, but I did study Russian. I think we live in a world where technologies penetrate all all spheres of human life and",
        "start": 4219.52,
        "duration": 8517.812000000013
    },
    {
        "text": "thank you very dear Mr. Cherenko, I will try to speak Russian. I'm not the best of the Russian speakers, but still I'm not the best Russian speaker, but I did study Russian. I think we live in a world where technologies penetrate all all spheres of human life and social compact that would include AI a society AI by compact. We are facing very serious challenges. Technology has been enhancing the gaps between the nations. Some countries are running ahead. Some countries are getting left behind. the AI governance is just about as important. So what we think is that the entire world needs to transition from statements to actions and ensure equal opportunity for all nations. I think we should create an international governance mechanism for AI. That's my answer. Thank you. Thank you very much, sir. Andre Vladimir, this July, the global index to assess AI governance was published, the AI governance evaluation index where Russia came 30th of the four 40 members. Yep. We showed a pretty pretty high index of regulation of AI, although we do not regulate AI. state. What do you think should happen for us to come higher in this index? Yes, this is a very paradoxical situation. We actually did come ninth of the 40 countries in the quality of governance. That is about both the laws and the lack of barriers, the ethics, technical standardization. We're actually in the top 10 although we completely falling through on all the other directions. We are pretty much next to zero on publications in AI governance. AI governance is generally written on by lawyers. We've got several PhD thesis in Russia. Not all of them target Russia. A lot of thesis have been published in in the world on all kinds of things. And we have the metrics on the number of publications. In Russia, we've got zeros here. So the important thing is to start for the scientific community is to start paying attention to these topics. you know together with Sinqua counterparts we have been doing a lot on the on the area you know researching the law studying the law. in some points the index does not have anything about the opinion on AI in Russia and the surveys place the overall public opinion on a much more positive level with respect to AI versus other countries. So we've got every chance to go higher in in that index but hopefully the scientific community joins us on it on this. Shall we raise this index? I hope people are watching us on the internet. Couple of dozens of thousands or maybe more hundreds. Thank you very much for that Mr. Sumbo. We're talking about ethics of AI. There is AI code voluntary UI code and participants are joining on the international stage. Do we see that there is an intention I mean a trend for a responsible AI? What do you think are the principles",
        "start": 4483.679,
        "duration": 8935.811000000007
    },
    {
        "text": "very much for that Mr. Sumbo. We're talking about ethics of AI. There is AI code voluntary UI code and participants are joining on the international stage. Do we see that there is an intention I mean a trend for a responsible AI? What do you think are the principles the foundation of our approaches in ethics? Well, what I think unfortunately frankly speaking I don't have the right answer. I think that I actually liked a lot the speech of the esteemed president of the Russian Federation two days ago here. He said that it was a very interesting thing that children only want only to press a button instead of thinking and doing something on their own. I think that in in China there's also this kind of situation that how we solve it there are companies that create a new system and in order to make children not just press buttons do something else. This is not the right path. I think we must create a new principle that would correspond to everything that the the M president of Russia said. I think that in the future we need to be protected the humans from losing their cognitive capabilities and we need to make people and especially children think themselves. I found a quote I found even a quote of Mr. of president she Xi Jinping when he when our president visited Beijing, he said that according to the initiative all countries irregardless of their wealth must have an equal participation and equal opportunities in the global governance. We must raise the democratization of the international relations and expand the voice of developing countries and that's what we are going to do. Follow our leaders. Thank you very much. Take your seats. I invite to the stage director of Singo University of Science and Technology Duo Wang and director of Sko Institute of Science and Technology Yini Bernay. , Professor Wang, Professor Wang, your work on stoastic configuration networks and computational intellect are dedicated to how intelligence can identify complex patterns in data and adapt to changing conditions. What are the breakthroughs that you see in industrial AI? And can we say that lightweight training models can be the best groundwork for decision-m on AI basis? Okay. first of all I thank you very much for the good in start introduction my job. Okay. Stocastic configuration network. I created these concepts in 2017. Okay. And then I deeply believe so this lightweight learning model will play the key role in the future especially for industry AI. Okay. because we have a real time requirements, we have limited power, we have limited computing results. So in such scenario we can't rely on the wheel now training algorithm for example very well nowation but resulting a very complex neuron nets whatever is a deep structure single layer but when we think about this how to use this learning model in age computing based application. So",
        "start": 4732.8,
        "duration": 9492.247000000007
    },
    {
        "text": "So in such scenario we can't rely on the wheel now training algorithm for example very well nowation but resulting a very complex neuron nets whatever is a deep structure single layer but when we think about this how to use this learning model in age computing based application. So my understanding. Thank you very much. Yini Brunay at your session with the participation of the president he said that smart assistants intelligent assistants need to be integrated in more and more managerial processes which kinds of technology do you think are the best suited now for scaling and what are the barriers that you see for them to become the norm what Mr. Wang was talking about is an absolutely crucial part of this process. Speaking of industrial systems, when a model is sitting on the equipment, the that model being lightweight is absolutely vital. Such a model can only handle a specific function. Oh, if we talk about the management of the entire process, we will need a combination of models. Some of the models will be lightweight, some of the models will be in the cloud or on premise on local servers. So, we're talking about a multi- aent system managing the whole process. Of course, there is a certain trend. [gasps] These systems are being developed. we are recognizing their value. They are becoming more and more adaptive thanks to u visual language models, large language models. The main problem with deployment is this. First, there is no established regulation for their installation on existing systems especially when it comes to critical functions. Then with the growth of investment, we are getting more and more frameworks of multi- aent systems. But the problem is that they are to certain extent fragmented. we do not have some established best practice based on them. And then when we explore the interaction among different agents when different nodes are located in different spaces so messages are transmitted over a significant range. We need to ensure reliable channels and keep the whole process secure. And also if in the system there is an LLM or or similar model generative model this becomes a very sophisticated tool when you're raging some answers for example the language model can behave differently when answering certain questions when you have the ranking not to mention a multi- aent system. These are the challenges that we will need to face but there are certain ideas so the industry is developing very rapidly. Thank you very much. This gives me a hint for another question for Mr. Mang. We are discussing not even the autonomous nature of agents but their ability to learn from each other. when one system borrows a strategy from another system and then starts improving itself and we it's very hard for us to keep track. So the question is how do you think we should manage this environment where agents have learned to communicate with each other sometimes in",
        "start": 5045.84,
        "duration": 9882.927000000018
    },
    {
        "text": "each other. when one system borrows a strategy from another system and then starts improving itself and we it's very hard for us to keep track. So the question is how do you think we should manage this environment where agents have learned to communicate with each other sometimes in in an environment where models create their own rules. excuse me I'm not working in the field probably can answer this question. Okay, maybe the manager can answer this. Regarding your question, I can say this. If [clears throat] processes in a multi- aent system are slow, a human being can of course control certain things can get involved. But if the processes are very fast and the system is very complex, then the person can only do something outside of the cycle. And the only way about this is to combine different tools. Of course, you always need to test the system for vulnerabilities. , next you need to have some send boxes, barriers where the process would stop altogether when you go beyond the barriers. And then the the person needs to have access to the button that that holds the whole system. And there should be gates in between the different systems that can be closed down, shut down if needed to prohibit transmission of data. And also the two two key solution when you need to once again stop data from being transmitted and this is what's being developed now. How can you regulate this with which document which framework? Europe is currently developing such regulatory framework and we are following suit. We have different documents, different regulations for autonomous systems. we still have these standards for different machines equipments. It's just that this is a a new level for IT systems. Thank you, Professor Wang. For forecasting, we use deep models with a huge number of parameters. to which extent and which solutions do you think will be adaptable for actual industrial tasks? that's a very good question. I think recently I got involved in for real world industry from industry projects. Okay. I think people are looking for some explanable model. then the models should be knowledge informed rather than simply training from so-called deep learning algorithm but people don't feel safety when they use the model for industry process okay then I think explainable is one issue And also I again address this the lightweights. so I think we traditional learning algorithm has a big issue. Okay. so that's I think now somebody told me we had long distance from academia of China engineering. So he said in the future we should have pay more attention on these advanced machine learning aggressive so that can produce a real optimal lightweight model. Okay. So this is for industry AI rather than for generative large scale model for entertainment or information processing. This is my understanding next generation I truly believe industry I will play the key role in the world.",
        "start": 5249.36,
        "duration": 10360.928000000014
    },
    {
        "text": "machine learning aggressive so that can produce a real optimal lightweight model. Okay. So this is for industry AI rather than for generative large scale model for entertainment or information processing. This is my understanding next generation I truly believe industry I will play the key role in the world. forecast. please take your seats in the audience and I now invite the final pair for today. the laboratory head of fusion prey laboratory of bankandre and I and Ivanett also from Mr. Kit, you are a renowned experts expert in Genaii. You're co-founder of Kandinski models. We congratulate you with your release. Thank you very much. How's it going? By the way, is it gaining popularity? Well, yes. The research of the product team show that the results are great. Thank you. In May this year you have haded a joint lab of Gene that was created by a andopoulos. What are the outlooks for the gen AI model as part of our foresight? Yes, it is true. The genai models are going to the next level of multimodel architecture that where text is the basis around the text a lot of types of data are being built with which the model learns how to work. This year we went to the new era of reasoning and the possibility of self editing and selfcorrection of the model. And as part of our efforts inopolis, we learn how to adapt these models for the industrial applications and for the industrial using them for industrial data and engineering. This year we showed some great solutions for reverse engineering in heavy machinery and construction. For example, our quadrill model is developing greatly and shows fantastic results. you can see that geni overall starts to converge and get is intersecting with the in industrial applications which is very important. Thank you very much. It is my great pleasure to give the floor to Russian mathematician CEO of area the professor of Russian Academy of Science Ivan Oelis. He's in the top 20 researchers in the world in terms of the num number of citations. you are one of the visionaries of foresight by the way and you started working on it before it went global and in your latest interview you said that it is not possible to develop super intelligence and strong intelligence. Well, now you have to explain us why do you think that way? could you tell us what is the stage of AGI development? Thank you very much. Well, it's good that I'm red including the interview is red but first of all you have to create AGI. You said that it's a buzz word but and something that we're there but we're not there. Although the way the science is going and the industry is going is pretty understandable. We're talking about the scaling of transformers with a large number of GPUs and something that happened in February this year with Risenin and we're talking about dips.",
        "start": 5495.6,
        "duration": 10763.486000000015
    },
    {
        "text": "that we're there but we're not there. Although the way the science is going and the industry is going is pretty understandable. We're talking about the scaling of transformers with a large number of GPUs and something that happened in February this year with Risenin and we're talking about dips. doesn't work. Some other agents are doing that. Anyway, I'm going to talk without the slides. Let them just slide away by themselves. Anyway, reasoning and deepseek, two major things. the models that reason for a long time with a large context. At the same time, the cost of inference went down because you have to work with large context but at the same time the cost of one tok to token went down 10fold. So this is an in innovative development. The quality of the model improves all the benchmarks can went through quickly. it's actually right there on the slide. Thank you very much. Yeah, that's true. Yeah, I remember. Yeah, that's that's written there. The the other story that is related to the robot that we have showed, you know, that's the embedded AI AI going to the physical world. This is a vision language models, VLMs that are at the this emerging state. I mean without that true AI is not possible. self-reflection something that was already demonstrated and the interaction with humans. I think for sure what we have to do. We have to have a proper assessment system, not the statical benchmarks that you know people just make repetitive tasks and train the model on them and then they report 90% and at the same time complicated tasks like finding new medications or working in healthcare or resolving some construction issues they don't do that. So to create a real strong intelligence AGI we need to resolve at least one task that humanity cannot solve by itself. Thank you very much. And to conclude I'd like to end with a question. what is your the leap through that leap forward that you expect the creation of fundamental models for robotic systems one of them but for foresight not only in your area? What is what what is your forecast when we reconvene a year after this conference? What leap through are you going to discuss? I think for sure we can talk about moving closer to the better understanding on the physics of the world and the time and space connections because a large number of content is not only text but video and this sequences the temporary sequences with the various links. It's a major challenge because it opens up a new wave of the synthesis of data that is needed in robotics in driverless cars and driverless vehicles with out of distribution situations or dev deviations in the behavior and understanding physics understanding the laws of the environment is a very important task that we are going to go to. You know, it's like building zeppelins right now. People thought that",
        "start": 5710.96,
        "duration": 11134.207000000017
    },
    {
        "text": "robotics in driverless cars and driverless vehicles with out of distribution situations or dev deviations in the behavior and understanding physics understanding the laws of the environment is a very important task that we are going to go to. You know, it's like building zeppelins right now. People thought that zeppelines to transport more people and then planes were invented. It's like here, you know, maybe some architecture, some new architectures will be discovered that work differently. Well, immortality is something that we were that we were discussing for a long time, you know. Well, you need to you need to work out the mathematics first. Okay. So, the immortality is not on the table for this for now. Thank you very much. A round of applause. Now in the end please scan the QR code and select the best name of our platform of our uniting platform. 52 ideas of the names. the table was given with the names was given to Giga Chat. We uploaded the file together with the report on our foresight. rag worked it out and the prompt was the following. You are the expert in communications and in naming from 1 to 10 rate the proposed names for the foresight research and in about the future of the fundamental technologies. So I would ask you to give us the top seven of the names and we're going to see the best option in live mode. All right. So maybe I have influenced the the audience. AI horizons or maybe it's just a very beautiful name. Nine out of 10 51% of the votes. Brain OS second option for future site singularity AI optim AI international platform and global sprint. Right. So I guess Horizons, right? Yeah. Okay. Everyone's voted for that. Thank you very much. The first name AI Horizon has won. Let's have a great flight together. We're moving to the next sections. Thank you very much to for organizing the event and see you next year. A round of applause for the participants of the plinary session. Would like to thank all the scientists, globally renowned scientists as well as the experts in AI. And a huge thanks to Dimmitri Cheroshanka for moderation and summarizing the one year of foresight on AI. And now let's have a small break and prepare for the AI journey. We are reconvening in 10 minutes. [music]",
        "start": 5901.04,
        "duration": 11489.668000000014
    }
]