[
    {
        "text": " But also there's just the practical reality If you look out at Silicon Valley, most of the developer world that's kind of playing with LLMs and argentic AI, they're all using Apple products And then at the same time Apple is not really like leaning on that Like they're not they're not opening up and playing and working together and like Yes. Isn't Isn't it funny how they completely blunder AI and yet everybody's buying Mac minis laughter i How Wait, does that even make sense You're you're you're quite possibly the world's greatest Mac salesman of all time i No, you don't need a Mac Mini to install OpenClaw. You can install it on the web There's there's a concept called nodes So, you can like make your computer a node and it will do the same There is something said for running it on separate hardware that right now is useful Um there is there's a big argument for the browser you know I built some enigmatic browser use in there and I mean it's basically playwright with bunch of extras to make it easier for agents i Playright is a library that controls the browser is really nice easy to used i and our internet is slowly closing down Like there there's a whole movement to make it harder for agents to used So if you do the same in a data center and websites detect that it's an IP from a data center the website might just block you or it make it really hard or put a lot of captures in the in the way of the agent I mean agents are quite good at happily clicking I'm not a robot Um, i yeah i but having that on a residential IP makes a lot of things simpler So, there's ways Yeah, but it really does not need to be a Mac. It can it can be any old hardware I always say like maybe use the use the opportunity to get yourself a new MacBook or whatever computer you use and use the old one as your server snorts instead of buying a standalone Mac Mini. But then there's again there's a lot of very cute things people with Mac minis that I like i Yeah. i Um I know I don't get commission from Apple. Um they sighs didn't really communicate much i It's sad It's sad",
        "start": 3.04,
        "duration": 296.88000000000005
    }
]