[
    {
        "text": " And during this speaking of fun the today molt saga i Yeah. i Book i was created i Yeah. i Which was another thing that went viral as a kind of demonstration illustration of how what is now called open claw could be used to create something epic Uh so for people who are not aware mold book is just uh a bunch of agents talking to each other in a Reddit style social network and uh a bunch of people take screenshots of those agents doing things like uh scheming against humans and that instilled in folks a kind of you know fear panic and hype What are your thoughts about mold book in general i I think it's art It is It is like the finest slope you know it's like the slop from France. Um, i yeah i I I saw it before going to bed and even though I was tired I spent another hour just reading up on that and and just being entertained I I just felt very entertained you know I saw the the reactions and like there was one reporter who's calling me about is this the end of the world and we have AGI and I'm just like no this is just this is just really fine slop you know if if I wouldn't have created this this whole boarding experience where you you infuse your agent with your personality and give him give him character I think that reflected on a lot of how different the replies to multiple are because if you would all if it would all be JBD or cloud code it would be very different It would be much more the same i Mhm. But because people are like so different and they create their agents in so different ways and use it in so different ways that also reflects on how they ultimately uh right there and also you don't know how much of that is really done autonomic autonomous or how much is like humans being funny and like telling the agent hey right about that you plan the end of the world on mold book hah well I think I mean my criticism of mold book is that I believe a lot of the stuff that was screenshotted is human prompted which just looking at the incentive of how the whole thing was used It's obvious to me at least that a lot of it was humans prompting the thing so they can then screenshot it and post it on X in order to go viral i Yeah. i Now that doesn't take away from the artistic aspect of it The the finest slop that humans have ever created i for real Like kudos to to Matt who had this idea so quickly and pushed something out you know It was like completely insecure Security drama But also what's the worst that can happen Your agent account is leaked and like someone else",
        "start": 2.96,
        "duration": 388.3989999999999
    },
    {
        "text": "slop that humans have ever created i for real Like kudos to to Matt who had this idea so quickly and pushed something out you know It was like completely insecure Security drama But also what's the worst that can happen Your agent account is leaked and like someone else were like making a whole drama about of the security thing but I'm like there's nothing private in there It's just like agents sending slope We could leak API keys i Yeah. Yeah. i There was like \"Oh, yeah My human told me this and this so I'm leaking his security number No, that's prompted And the number wasn't even real That's just people people trying to get eyeballs i Yeah. But that that's still like to me really concerning because of how the journalists and how the general public reacted to it They didn't see it You have a kind of lighthearted way of talking about it like it's art i but it's art when you know how it works It's extremely powerful viral narrative creating fear-mongering machine If you don't know how it works and I just saw this thing and you even tweeted uh if there's anything I can read out of the insane stream of messages I get it's that AI psychosis is a thing and needs to be taken serious i Oh, there's some people are just way too trusty or gullible you know they I literally had to argue with people that told me \"Yeah, but my agent said this and this So, I feel we as a society we need some catching up to do in terms of understanding that uh AI is incredibly powerful but it's not always right It's not it's not all powerful you know and and especially with like things like this it's it's very easy that it just hallucinates something or just comes up with a story Um, and I think the very the very young people they understand that how AI works and what the where it's good at and where it's bad at But a lot of our generation or older just haven't had enough touch point i to get a feeling for oh yeah this is really powerful and really good but I need to apply critical thinking I guess critical thinking is not always in high demand anyhow in our society these days So I think that's a really good point you're making about contextualizing properly what AI is but also realizing that there is humans who are drama farming behind AI. Like don't trust screenshots. Don't even trust this project mold book to be what it represents to be Like you can't and by the way you're speaking about as art Yeah. Don't art can be in many levels and part of the art of book is like putting a mirror to society cut I do believe most of the dramatic stuff that was screenshot is human created essentially human prompted and",
        "start": 197.519,
        "duration": 742.9589999999998
    },
    {
        "text": "and by the way you're speaking about as art Yeah. Don't art can be in many levels and part of the art of book is like putting a mirror to society cut I do believe most of the dramatic stuff that was screenshot is human created essentially human prompted and scared you can get at a bunch of bots chatting with each other that's very instructive about because I think AI is something that people should be concerned about and should be very careful with because it's very powerful technology But at the same time the only thing we have to fear is fear itself So there's like a line to walk between being seriously concerned but not fear-mongering because fear-mongering destroys the possibility of creating something special with the thing In a way I think it's good that this happened in 2026 and not in 2030 when when AI is actually at a level where it could be scary So, this happening now and people starting a discussion maybe there's even something good that comes out of it I just can't believe how many like people legitimately I don't know if they were trolling but how many people legitimately like smart people thought mobile book was incredibly I had plenty people there i in my into that were screaming at me all cops to shut it down and like begging me to like do something about must like yes my technology made this a lot simpler but anyone could have created that And you could you could use cloud code or other things to like fill it with content i But also mold book is not Skynet because a lot of people were saying this is it Like shut it down What are you talking about This is a bunch of bots They're humanprompted trolling on the internet I mean the security concerns are also they're there and they're instructive and they're educational and they're good probably to think about because the the nature of those security concerns are different than the kind of security concerns we had with non LLM generated systems of the",
        "start": 376.8,
        "duration": 983.28
    }
]