[
    {
        "text": " I mean I have to ask you just curious I I know you've probably gotten huge offers from uh major companies Can you speak to who you're considering working with Yeah. So, to like explain my thinking a little bit right I did not expect this blowing up so much So there's a lot of doors that open because of it There's like I think every VC every big VC company is in my into and try to get 15 minutes of me So there's like this butterfly effect moment I could just do nothing and continue and I really like my life Valid choice almost Like I considered it when I deleted wanted to delete the whole thing I could create a company been there done that Um there's so many people that push me towards that and yeah like could be amazing i Push to say that you would probably raise a lot of money in that i Yeah. i I don't know hundreds of millions billion I don't know It could just got unlimited amount of money i Yeah. It just doesn't excite me as much cut I feel I did all of that and it would take a lot of time away from the things I actually enjoy I same as when when I was co I think I I learned to do it and I'm not bad at it Um partly I'm good at it But yeah that path doesn't excite me too much And I also fear it it would create a natural conflict of interest Like what's the most obvious thing I do I I productive it up with like a version safe for workplace And then what do I do I get a pull request with a feature like add audit log but that seems like an enterprise feature So now I feel I have a conflict of interest in the open source version and the closed source version or I change the license to something like FSL where you cannot actually use it for commercial stuff would first be very difficult with all the contributions and second of all I I like the idea that it's free as in beer and not free with conditions Um, yeah there's ways how you how you keep all of that for free and just like still try to make money but those are very difficult And you see there's like few and few companies manage that Like even Tailwind, they're like used by everyone Everyone uses Tailwind, right And then they had to cut off 75% of the employees because they're not making money because nobody's even going on the website anymore because it's all done by agents and just relying on donations Yeah, good lucky Like if a project of my caliban if I extrapolate what the typical open source project would get um it's not a lot I I still lose money on the project because I made the point",
        "start": 2.96,
        "duration": 410.56200000000024
    },
    {
        "text": "because it's all done by agents and just relying on donations Yeah, good lucky Like if a project of my caliban if I extrapolate what the typical open source project would get um it's not a lot I I still lose money on the project because I made the point except Slack. They're a big company They can they can they can do without me But all the projects that are done by mostly individuals Um so like all the right now all the sponsorship goes right up to my dependencies and if there's more I want to like buy my contributors some mercy you know i So you're losing money i Yeah. Yeah, right now I lose money on this i So, it's really not sustainable i Uh, I mean it's like I guess something between 10 and ask a months Um, which is fine and I'm sure over time I could get that down Um, Open is helping out a little bit with tokens now and there's other companies that have been generous but yeah we're still losing money on that So that's that's one pass I consider but I'm just not very excited And then there's all the big labs that I've been talking to And from those um meta and open eyes seemed the most interesting i Do you lean one way or the other i Uh yeah I'm not sure how much I should share there It's not quite finalized yet Um, let's let's just say like on either of these my conditions are that the project stays open source that it maybe it's going to be a model like Chrome and Chromium. Um, I think this is this is too important to just give to a company and make it theirs it This is we didn't even talk about the whole community part but like the the thing that I experienced in San Francisco like at Clawcon, seeing so many people so inspired like and having fun and just like building [ i ] and like having like robots and lobster stuff walking around like the people told me like they didn't experience this level of of community excitement since like the early days of the internet like 10 15 years and there were a lot of high caliber people there I was like um I was amazed I also like was very sensibly overloaded because too many people wanted to do selfish But I love this like this needs to stay a place where people can like hack and learn But also I'm very excited to like make this into a version that I can get to a lot of people because I think this is the year of personal agents and that's the future and the fastest way to do that is teaming up with one of the labs and I also on a personal level I never worked at a large company and I'm intrigued",
        "start": 212.4,
        "duration": 791.043
    },
    {
        "text": "a lot of people because I think this is the year of personal agents and that's the future and the fastest way to do that is teaming up with one of the labs and I also on a personal level I never worked at a large company and I'm intrigued I like it I don't know Um, but I want that experience and I'm sure like if if I if I announce this then there will be people like \"Oh, it's sold out blah blah blah But the project will continue Um, from everything I talked to so far I can even have more resources for that Like both both of those companies understand the value that I created something that accelerates our timeline and that got people excited about AI. I mean can you imagine like I installed open claw on one of my I'm sorry dormie friends I'm sorry about but he's just you know like he's i dormie with love Yeah. He he like someone who uses the computer but never really like I use some chat GBT sometimes but not very technical wouldn't really understand what I built So like I'll show you and I I paid for him the the 90 buck 100 buck I don't know subscription for entropic and set up everything for him with like VWSL Windows. I was so curious would it actually work on Windows, you know it was a little early And then within a few days he was hooked like he tested me all the things he learned He built like even little tools He's not a programmer And then within a few days he upgraded to the $200 subscription um or euros because he's in Austria and he was in love with that thing That to me was like a very early product validation was like I built something that captures people And then a few days later Entropic blocked him because based on their rules um using the subscription is problematic or whatever And he was like devastated And then he signed up for Minimax for 10 bucks a month and uses that And I think that's silly in many ways because you just got a 200 buck customers You just made someone hate your company and we are still so early Like we don't even know what the final form is Is it going to be cloud code Probably not You know like that seems very it seems very shortsighted to lock down your product so much All the other companies have been helpful I'm in Slack of of most of the big labs kind of everybody understands that we are still in era of exploration in the area of the radio show is on TV and not and not modern TV show that fully uses the format I think I think you've made a lot of people like see the possibility non sorry not nontechnical people see",
        "start": 412.56,
        "duration": 1173.5240000000001
    },
    {
        "text": "that we are still in era of exploration in the area of the radio show is on TV and not and not modern TV show that fully uses the format I think I think you've made a lot of people like see the possibility non sorry not nontechnical people see love with this idea and enjoy interacting with AI and that's a that's a really beautiful thing I think I also speak uh for a lot of people in saying I think you're one of the the great people in AI in terms of having a good heart good vibes humor the right spirit And so it would in a sense this model that you're describing having an open-source part and you being part of u uh also building a thing inside additionally of a large company would be great cut it's great to have good people in those companies i You know what also people don't really see is I made this in 3 months I did other things as well you know I have a lot of projects like this is not Yeah, in January, this was my main focus because I saw the storm coming but before that I built a whole bunch of other things Um, I have so many ideas Some should be there Some would be much better fitted when I have access to the latest toys Uh, and I I kind of want to have access to like the latest toys Um, so this is important This is cool This will continue to exist my my short-term focus is like working through those uh is it is it 3,000 PR now by now I don't even know Like there's there's a little bit backlog but this is not going to be the thing that are going to work until I'm I'm I'm 80. You know this is this is a window into the future and going to make this into a cool product Um but yeah I have like I have more ideas i If you had to pick is there a company Yolene? So, Meta Open AI, is there one you lean towards going with i I spent time with both of those And it's funny because a few weeks ago I I didn't consider any of this Um, and it's really [ i ] hard Like, i yeah i I have some I know people at OpenAI. I love that techs I think I'm the biggest Codex advertisement shill that's unpaid and it would feel so gratifying to like put a price of all the work I did for free And I would love if something happens and those companies get just merged cut it's like is this the hardest decision you've ever had to do No, you know I had some breakups in the past that feel like at a similar level i relationships you mean i Yeah. i Um, and I also know that",
        "start": 606.48,
        "duration": 1512.2869999999996
    },
    {
        "text": "happens and those companies get just merged cut it's like is this the hardest decision you've ever had to do No, you know I had some breakups in the past that feel like at a similar level i relationships you mean i Yeah. i Um, and I also know that cannot go wrong This is like i right i this like one of the most prestigious and and and and largest I mean the largest but like they're both very cool companies i Yeah. They both really know scale So if you're thinking about impact some of the wonderful technologies you've been exploring how to do it securely and how to do it at scale such that you can have a positive impact on a large number of people They both understand that i You know both Ned and Mark basically played all week with my product and sent me like \"Oh, this is great Oh, this is [ i ] Oh, we need to change this are like funny little anecdotes and people using your stuff is kind of like the biggest compliment and also shows me that you know they actually they actually care about it and I didn't get the same on the open air side Um, I got I about to see some other stuff that I find really cool and they lure me with I cannot tell the exact number because of NA, but you can you can be creative and and think of the cerebra steel and how that would translate into speed and that was very intriguing You know like you give me source hammer Yeah. Um been lured with tokens i So yeah i So it it's funny So So Mark's sort of tinkering with the thing essentially having fun with the thing He got he like when he first when they first approached me I got him in my in my WhatsApp and he was asking yeah when we have a call and I'm like I don't like calendar entries let's just call now and he was like yeah give me 10 minutes I need to finish coding i Well I guess that gives you a streak credit It's like like he's still writing code you know he's i he didn't drift away in just being a manager He gets me That was a good first start And then I think we had a like a 10-minute fight What's better Cloud Code or Codex? i Like that's that's the thing you first do You casually call i Yeah, that's awesome i Someone with like the that owns one of the largest companies in the world and and you have a 10- minutes conversation about that i Yeah. i Uh and then I think afterwards he called me eccentric but brilliant But I also had some I had some really really cool discussion with Sam Alman. Uh and he's he's very thoughtful Um brilliant and",
        "start": 783.92,
        "duration": 1859.3270000000002
    },
    {
        "text": "world and and you have a 10- minutes conversation about that i Yeah. i Uh and then I think afterwards he called me eccentric but brilliant But I also had some I had some really really cool discussion with Sam Alman. Uh and he's he's very thoughtful Um brilliant and little time I had Yeah. I mean I know some people vilify both of those people I don't think it's fair i I think no matter what the stuff you're building and the kind of human you are uh doing stuff at scale is kind of awesome I'm excited i I am super pumped And you know the beauty is if if it doesn't work out I can just do my own thing again Like I I told them like I I don't do this for the money I don't give a [ i ] I i Yeah. i I mean of course of course it's a nice compliments but I want to have fun and have impact And that's ultimately what made my decision",
        "start": 974.0,
        "duration": 1954.8490000000002
    }
]