[
    {
        "text": " You mentioned that a lot of the apes might be basically made obsolete You think agents will just transform the entire ape market i Yeah. Uh I noticed that on Discord that people just said how the like what they build and what they use it for and like why do you need my fitness pal when the agent already knows where I am So, can assume that I make bad decisions when I'm at I don't know Waffle House, what's around here or or brisket's in Austin. i There's no bad decisions around brisket's but yeah i No, that's the best decision honestly laughter Um, i your agent should know that i But it can like it can modify my my gym workout based on how well I slept or if I'm if I have stress or not like it has so much more context to make even better decisions than any of the ape even could do i Mhm. i It could show me UI just as I like Why do I still need an ape to do that Why do I have to Why should I pay another subscription for something that the agent can just do now And why do I need my my eight sleep ape to control my bed when I got to tell the tell the agent to know the agent already knows where I am so you can like turn off what I don't used i Mhm. i And I think that will that will translate into a whole category of apes that are no longer I will just naturally stop using because my agent can just do it better I think you said somewhere that it might kill off 80% of apply i Yeah. i Don't you think that's a gigantic transformation effect on just all software development That that means it might kill off a lot of software companies i Yeah. Um i it's a scary thing So like do you think about the impact that has on the economy on um just the ripple effects it has to society transforming who builds what tooling It empowers a lot of users to get stuff done to get stuff more efficiently to get it done uh cheaper i There's also new services that we will need right For example I want my agent to have an allowance like you solve problems for me Here's like a 100 bucks in order to solve problems for me And if I tell it to order me food maybe it uses a service Maybe it uses something like rent a human to like just get that done for me I don't actually care I care about solve my problem Uh there's space for for new companies that solve that Well, i maybe don't not all apes disappear Maybe some transform into being API. So basically apes that rapidly transform in being agent facing So there's a real opportunity for",
        "start": 2.96,
        "duration": 385.35800000000006
    },
    {
        "text": "I don't actually care I care about solve my problem Uh there's space for for new companies that solve that Well, i maybe don't not all apes disappear Maybe some transform into being API. So basically apes that rapidly transform in being agent facing So there's a real opportunity for today It's companies like this of which there's many who gets there fastest to being able to interact with Open Claw in a way that's the the most natural the easiest Yeah. And also apes will become API if they want or not because my agent can figure out how to use my phone I mean on on the other side it's a little more tricky On Android that's already people already do that and then it will just click the order Uber for me button for me Um or maybe another service or maybe there's there's a there's an API call so it's faster Uh I think that's a space we're just beginning to even understand what that means and I again I didn't even that was not something I thought of something that I that I discovered as people use this and we still so early but yeah I think data is very important like apes that can give me data but that also can be API. Why do I need the Sonus ape anymore when I can when my agent can talk to the Sonus uh speakers directly Like my cameras there's like a crappy happy but they have they have an API. So, my agent uses the API now i So, it's going to force a lot of companies to have to shift focus and it's kind of what the internet did right You have to rapidly rethink reconfigure what you're selling how you're making money i Yeah. And some companies were really not like that For example there's no CLI for Google. snorts So I had to like do have to do anything myself and build Gogg that's like a CLI for Google. And at the yeah at the end user they have to give me the emails because otherwise I cannot use their product If I'm a company and I try to get Google data Gmail, there's a whole complicated process to the point where sometimes startups acquire startups that went through that process So they don't don't have to work with Google for half a year to be certified to being able to access Gmail. But my agent can access Gmail because I can just connect to it It's still crappy because I need to like go through Google's developer jungle to get a key and it's still annoying but they cannot prevent me and worst case my agent just clicks on the on the website and gets the data out that way i to browser i Yeah, I mean I I watch my agent happily click the I'm not a robot button uh and there's this this whole that's",
        "start": 194.879,
        "duration": 727.4400000000002
    },
    {
        "text": "they cannot prevent me and worst case my agent just clicks on the on the website and gets the data out that way i to browser i Yeah, I mean I I watch my agent happily click the I'm not a robot button uh and there's this this whole that's heated You see companies like uh Cloudflare that try to prevent not access and in some ways that's useful for scraping but in other ways if I'm I'm a personal user I want that you know sometimes I I use Codex and I I read an article about modern React patterns sighs and gasps and it's like a medium article I paste it in and the agent can't read it because they block it So I have to copy paste the actual text or in the future I learned that maybe I don't click on Medium because it's annoying and I use other websites that actually are agent friendly So there's going to be a lot of powerful rich companies fighting back So it's a really you're at the center you're at the catalyst the leader and happen to be at the center of this kind of revolution where it's going to completely change of how we interact with uh services with with web And so like there's companies like Google that are going to push back I mean there's every major companies you could think of is going to push back Even yeah even search um and I use I think Perplexity or Brave as providers because Google really doesn't make it easy to use Google without Google. I'm not sure if that's the right strategy But I'm not Google. i Yeah, there's a there's a nice balance from a big company perspective because if you push back too much for too long you become Blockbuster and you lose everything to the Netflixes of the world But some push back is probably good during revolution to see i But you see that like this is something that the people want i right i So i yes i if I'm on the got I don't want to open a calendar happy I just I want to tell my agent hey remind me about this dinner tomorrow night and maybe invite two of my friends and then maybe send a send a WhatsApp message to my friend And I don't need I don't want the need to open apes for that I think that we passed that age and now everything is like much more connected and and fluid if those companies want it or not And I think we'll the right companies will find ways to jump on the train and other companies will perish",
        "start": 370.479,
        "duration": 1016.9600000000003
    }
]