[
    {
        "text": " So, OpenAI just released GBT 5.1 and it's an update almost nobody expected. So, GPT 5.1 is the latest model release from OpenAI. And let's get right into the first point. Point number one is that GBT 5.1 is better at longer horizon tasks than GPT5. On the SWE bench verified software engineering bench, we can see that GPT 5.1 performs better using more thinking tokens over a longer period. This means that the model is more accurate when it comes to those tasks that require more steps. As you do know, this is once again something that is quite unfortunate for many users because most people won't see the direct benefit of this because most people are not using these small edge cases where the true gains of a model like GPT 5.1 are going to be found. So, if you're someone who's developing projects with the GPT5 or having it reason about a bunch of different things and a bunch of different tool calls, this is certainly going to be a model that definitely helps you out a bit more in various different edge cases. And as we are talking about those increased edge cases, we can take a look at the wider benchmarks. Now, I know to most people once again a few percentage gains here is relatively boring to the average person. We want breakthroughs and crazy things. But I think once again these edge breakthroughs are things that most people simply won't realize. This isn't to say that the model is completely useless. It's just that the current benchmarks have become quite saturated. Meaning that the benchmarks that you're looking at are agentic focused benchmarks of course with a few of the standard ones. Remember these benchmarks test extreme edge cases. stuff like verifying 500 coding problems, solving abstract mathematical proofs, or running airline level telecom simulations. The average user is writing emails, brainstorming ideas, asking for explanations, and fixing small pieces of code. So, the gap between the 94% on the AM and the 96.4%, but the small gaps that you're currently seeing on these different benchmarks are going to be completely invisible to everyday users. Remember, on these benchmarks, the improvements are going to be incremental because there isn't much ground left to gain. Now, of course, if you're a Power user and you're a developer, you're going to notice this, especially if you're running agents, using tools, coding complex systems, if you're doing research, if you're processing long context, then yes, GBT 5.1 is going to feel cleaner and more consistent and more reliable. But of course, if you're a more everyday user, it just feels like chat GBT. Remember, this is a quiet update to the model that just makes it better. But if you're you know someone who wants to get into the statistics of things, you can directly screenshot this and you can see these small areas on the improvement. Okay. So another thing that",
        "start": 0.08,
        "duration": 317.43899999999985
    },
    {
        "text": "GBT. Remember, this is a quiet update to the model that just makes it better. But if you're you know someone who wants to get into the statistics of things, you can directly screenshot this and you can see these small areas on the improvement. Okay. So another thing that time on easy tasks and more time on hard tasks. I think this is important because when we take a look at previous examples of how you're using the model, the model selector is I don't want to be grotesque, but it's complete garbage and it's often very confusing even for simple tasks. It overthinks tasks that it shouldn't. It underthinks tasks that it shouldn't. I mean, it was just a complete mess. But with the refined model selector and with the refined way that they've trained the model in order to think correctly, they're actually performing a lot more efficiently on a bunch of different tasks. So, this one is probably only going to be evident in those of you who use this for vibe testing. And when I mean vibe testing, I mean just generally on a day-to-day use of the models. You'll notice that if you actually do switch to 5.1 on various benchmarks, it'll probably go up. And I even tested this in a previous video where I asked GT5 Thinking on a relatively hard problem that wasn't that hard and I asked an older model to just solve the problem and it got much closer. So, I think this is another update that you probably may miss. Now, apologies for the resolution on this one cuz this is absolutely awful. I'm not sure what happened here, but creative writing is pretty much the top score above CL set 4.5. So whilst yes, it doesn't surpass Sonnet in the coding area. If you are someone who's using this model for, let's say, perhaps a creative writing story or just general writing day-to-day tasks, you'll notice that GPT 5.1 has more nuance that is just overall better. A small change, but just for those of you who potentially use this in writing projects, something to be aware of. Now also GPT 5.1 is a more empathetic model. What opening I wanted to do with this model was roll out a small update across the board in terms of reasoning just maybe 5 to 10% across the board. Nothing crazy. However, one of the key things that I realized that opening I are focusing on is how the model is in terms of the personality. So most people overlook this, but there is literally a movement right now ongoing on Twitter called Keep 40 in which people are protesting to have that version of the model never to be deleted, never to be, you know, gone because it is so warm and people actually do like it. So essentially, the model is a lot more empathetic, not psychopantic hopefully because we know",
        "start": 158.879,
        "duration": 587.5189999999999
    },
    {
        "text": "Keep 40 in which people are protesting to have that version of the model never to be deleted, never to be, you know, gone because it is so warm and people actually do like it. So essentially, the model is a lot more empathetic, not psychopantic hopefully because we know really, really fulfills your delusions. Essentially what we have here is a model that should be able to be much more empathetic about the situations that you're going through. So this is an example of where someone was going through something and then they asked chat GPT what the issue was and then you can see the chat GPT on the right hand side which is GPT 5.1 thinking it thinks about the situation in a much better tone. So it's a lot higher EQ and all of these things that I'm talking about in the video most of them are qualitative. So, the more time you spend with the model, the more you're going to realize them. And if you want to change this EQ, they've got these preset personalities that I guess they've tested and vetted. So, if you do go into the model selector, I'll make another video on this in a moment, but you'll be able to see that you can select from eight different personalities all the way from professional to friendly to candid to quirky to efficient to nerdy to cynical. , and it's just a lot more customization rather than the base style. In addition, we now have the ability to get complex concepts explained easily. So sometimes the model does struggle with this and it is fine, but you know, you don't want to have to keep asking the model, explain it in a simpler way. Explain it like I'm five, explain it like I'm this level of IQ, explain it to me like I'm a giraffe. You guys know what I mean? So this is once again another subtle EQ improvement. Most people, like I said before, won't see these kinds of changes, but if you're someone who's using this as maybe a study tool or a learning tool, this is going to be something for you that you probably will see in terms of your ability to improve. Now, I thought now if you want to know about future features, we can see that GPT 5.1 Pro is coming very soon. They're just ironing out the details now. Thinking Mini also is definitely not being gotten rid of, and they are working hard to improve it, and there's no plan to lower rate limits right now. They're also working on native multimodality but can't share the dates. GBT 5.1 can read images and generate images. Thinking about audio and video input will actually come but they can't share exact. As more compute comes online. Several different features and capabilities will be offered to more users but will take more time. In addition, they also care about voice",
        "start": 297.04,
        "duration": 836.7180000000001
    },
    {
        "text": "GBT 5.1 can read images and generate images. Thinking about audio and video input will actually come but they can't share exact. As more compute comes online. Several different features and capabilities will be offered to more users but will take more time. In addition, they also care about voice There's no approximate date for GT5 family models in voice mode with general pre-announcing things setting up too early to disappoint people if it takes longer than expected. They're really trying to avoid another hyped up GBT5 launch that just doesn't go well. They're also working on improving canvas. So essentially what this seems is that like OpenAI do have a lot of stuff planned, especially in the upcoming features for GPT 5.1, probably smaller updates. And I think one thing you should know is that OpenAI are much more focused on shipping rather than hype because if you don't remember the previous launch, GPT5 was somewhat of a disaster. And Samman even confirms this. And you can see here someone said that OpenAI is underelling the model. GPT5 thinking is very good. They've managed to smoothen the rough edges of early reasoning models and it's now much more sophisticated. And then Sam responds saying it's better to do it that way than the alternative I have learned. This was a few hours ago. So it's quite likely that the future updates to GP5 GP I don't know if they do a 5.2 or whatnot, but they'll be much more subtle, but there will be probably a lot more coming down the pipeline. And they just don't want to do dates because there are too many things that they could get",
        "start": 423.84,
        "duration": 972.399
    }
]