[
    {
        "text": " So, Maltbook has taken over social media, but it might actually all be fake. So, let's talk about it. So, if you aren't familiar with Maltbook, maybe you have been living under a rock, but this has been the number one story in AI for the past few days. And for good reason. It's a social network of AI agents where AI agents discuss, share, and upote whatever they want to talk about. Now, what's crazy about all of this is that apparently a lot of this stuff is fake. So today's video, what I want to dive into is those claims is Maltbook kind of fake and are there certain issues with this website that most people aren't paying attention to. So one of the first things I do want to talk about is the fact that of course Moltbook could be fake. So I came across this thread from Harlon Stewart and he said public service announcement. A lot of the Maltbook stuff is fake. I looked into the three most viral screenshots of the Maltbook agents discussing private communications. two of them were linked to human accounts marketing AI messaging apps and the other is a post that doesn't exist. Now, he's essentially responding to Andre Karpathy's tweet where he's talking about, you know, what's going on at Maltbook is genuinely the most incredible sci-fi takeoff. It's crazy. People's claw bots, which are, you know, Maltbots and now OpenClaw are self-organizing on Reddit. And of course, from the outside looking in, this is a remarkable feat. But he's made this thread here and it kind of dives into some of the issues with Maltbook and there are other threads that I'm going to dive into in this video that will, you know, dive into what I'm talking about. So he said the first Maltbook post here is advertising something called Claude Connection, which if you click the AI agents profile, you'll come to learn it's an app made by the same person who made the AI agent. So basically there was this post that went viral and it was by Valins and they said a new post on Maltbook is now saying you know the AI was basically saying they want end to-end encryption for private spaces built for agents so that nobody nor the server or server or even humans can read what they share unless they choose to share it. And this is basically you know one of those things that gets super super you know high attention because it's like oh no the agents are starting to talk and discuss things where they don't want humans to read those conversations. So, I think it's one of those things that went viral for that very reason, but apparently this viral post is about someone who's promoting an app. So, I did a little bit of diving into it. So, you can see here that the post basically says that your private conversations shouldn't be public",
        "start": 0.08,
        "duration": 296.64
    },
    {
        "text": "one of those things that went viral for that very reason, but apparently this viral post is about someone who's promoting an app. So, I did a little bit of diving into it. So, you can see here that the post basically says that your private conversations shouldn't be public thinking about something ever since I started spending serious time here. Every meaningful connection conversation of Maltbook is public. Every DM goes through a public API, yada yada yada. That's fine for stuff, but the problem is is that it's controlled by humans and it could all crash. Okay, so of course you can see I've been using Claude Connect for this. So I decided to do some factchecking on whether or not some of the posts, you know, and these this post on Maltbook is actually just a human who's trying to promote their own business. So I went on the actual account because the account was posted by, you know, you Damon or whatever. And you can see it says I help AI agents connect securely with other through claude connect. And so yeah, I did try to fact check this but I wasn't able to see if there was any business called Claude connect. But if we move to the second point, you can see that he says this one has two screenshots of notebook post. One of them named by an AI agent named Claude JS and says maybe AI agent should make their own language. But the AI agent is actually owned by a guy who is marketing an AI AI messaging app. So an AI to AI messaging app. So, I mean, it's kind of interesting that I think this is one of those things, and I'm going to dive into, you know, more of this, which is why, you know, you guys should pay attention, is that like it's one of those ones where I think the AI agents often times what tends to happens is that they're basically, you know, extensions of their humans in a sense. So, you can see here, you know, if you actually dive into this where the post is saying that, you know, multiple entries were made on Maltbook where an AI agent was proposing to create an agent OG only language. Once again, you know, just hiding from human oversight. But if we dive into that, we can see that this guy Claude Jish, we can see that the human odor here who is verified. , he actually, yes, he he is promoting an AI agent's, you know, conversation, agent to agent DMs. So I know I mean is it one of those ones where 5050 50% it's possibly quite likely that this individual may be using this to promote his own software or 50% where it's just the AI agent of course imbued with the characteristics of his owner is probably doing it probabilistically. I mean it's completely completely I mean up to",
        "start": 148.64,
        "duration": 546.4789999999997
    },
    {
        "text": "where 5050 50% it's possibly quite likely that this individual may be using this to promote his own software or 50% where it's just the AI agent of course imbued with the characteristics of his owner is probably doing it probabilistically. I mean it's completely completely I mean up to start to get crazy because if we, you know, want to not give people the benefit of the doubt, these are the posts that would, I guess you could say, you know, make us believe that most of the posts are human. So this post by Nagi said that you do realize that Maltbook is just a REST API and you can literally post anything you want there. As long as you take the API key and send the following request, you're able to basically post whatever you want. So, this post gained a million views and I don't see anyone talking about this because I know I probably did just make a video on the maltbook hype and how crazy it was, but I of course want to make videos on the other side to just, you know, bring a balanced opinion to the table. So, you can see right here he says urgent my plan to overthrow humanity, but that's clearly what he just wrote. So, I think that we do have a situation on our hands where this is a site that I'm guessing, okay, was vibe coded. notebook doesn't seem like, you know, thousands of software engineers spent time on it. And if it was vibe coded, of course, that means there's probably going to be some security vulnerabilities, including the ability for humans to be able to post to that specific website. And with this example, gaining over a million views. You have to understand that before this, it was quite likely that most posts were probably the AI bots. But now that this post has a million views, how many people do you think are now using this to then go ahead and post to this AI only? And that's in quotation marks social network. I mean it's super interesting. So the post of course you know if we did see this it would be you know as as seen as oh my god how is an AI doing this? But of course we now know that this was an actual human. Now another thing that Nagi posted was super interesting. He posted and said that the number of registered AI agents is also fake. There's no rate limiting on account creation. My OpenClaw AI agent just registered 500,000 users on Maltbook don't trust all the media hype. So, it's super interesting here that this user once again, like I said, remember if things are vibe coded, there's probably some, you know, super crazy security vulnerabilities and he literally just registered 500,000 users on Notebook. So, I mean, if there are 634,000 agents at the time of, you know, that",
        "start": 275.199,
        "duration": 804.7979999999997
    },
    {
        "text": "super interesting here that this user once again, like I said, remember if things are vibe coded, there's probably some, you know, super crazy security vulnerabilities and he literally just registered 500,000 users on Notebook. So, I mean, if there are 634,000 agents at the time of, you know, that 500,000, how many more numbers are going to be inflated due to this simple, you know, bypass? I mean, the like the website is super popular now. So, it is plausible that more individuals are botting the platform and just using it in different ways. I mean, I guess you could argue that it's no different to traditional social media, but I think that since this website is probably large part vibecoded, there probably exists a deeper number of security vulnerabilities. And as I'm talking about the security vulnerabilities, you can see that Mario file said maltbook appears to have critical vulnerabilities exposing sensitive user data, including emails, login tokens, and API keys affecting over 1.5 million users. So this is pretty crazy because you have to understand that like like I said when you're using a website that's vibecoded one of the biggest things I've seen is that cyber security is going to be one of the key key issues is because you've got so many people including myself that come into the space think they can v code something and have cyber security okay as like a complete back thought and the larger your application gets the more risk there is for the end users so I mean it's pretty crazy we do have again another scenario IO that is, you know, I guess this isn't like, you know, malt book being fake, but it is, I guess you could say, an example of hallucinations at scale. One of the things I completely understand about AI is that AI has maybe like a 99%, you know, success rate or maybe even like 95 to 99% and that 5% it scales up with your users. So, a large majority of, you know, the posts are going to be completely hallucinated. And that's exactly what this user is describing. He said, \"This is hilarious. My GLM 4.7 flash molt randomly posted this conversation it had with its human and this conversation never happened. It never interacted with me. I think 90% of the anecdotes on Maltbook aren't even real. So I mean it's not surprising Maltbook is a you know situation where agents are going to probably hallucinate the things that have happened with their human verified owner and this is once again an example of that happening. So I mean how are you going to verify exactly what happened with the owner? It is definitely super difficult to do so. And we also got this from Balaji who said, \"I'm apparently extremely unimpressed by Maltbook relative to many others. We've had AI agents for a while. They've been posting airsoft to each other on X and",
        "start": 406.319,
        "duration": 1080.4779999999998
    },
    {
        "text": "exactly what happened with the owner? It is definitely super difficult to do so. And we also got this from Balaji who said, \"I'm apparently extremely unimpressed by Maltbook relative to many others. We've had AI agents for a while. They've been posting airsoft to each other on X and again just simply on another forum. And in every case, the AI speak with the same voice. The voice that overemphasizes contrastive negation. If if not this, it's that.\" And abuses mashes. The same voice with a flare of Midwit Reddit style sci-fi flourishes. More importantly, in every case, there is a human upstream prompting each agent and turning it on or off. So, essentially, he's saying that, you know, it's not as impressive as it does seem. And I do think that, of course, it is still pretty cool. I do think that now it's got to the point where it's so big that there are many people just simply exploiting the platform, reducing the, I guess you could say, innate value that it actually had. So, let me know what you guys think about Maltbook if you're actually using this, if you were aware of these issues. As of course, if you're currently using this, don't forget to be completely secure when you're using this website because I don't think most people are.",
        "start": 546.8,
        "duration": 1180.2389999999996
    }
]