[
    {
        "text": " So, welcome back to the AI grid. And in today's video, I'll be showing you guys how to use Grock Imagine. So, let's first get into the images when you're on grock.com/imagine. This is the page you're presented with. And this is basically just an explore page of different images that you'll see that you can interact with. Now, of course, you can simply browse this for inspiration if you're looking at different kind of styles or different kind of specifics. The only thing that I would say that's not too good about this is that you can't search for specific images. If you do want to search for specific images, you will have to use the Twitter feature. Let's say, for example, you were searching for maybe a fantasy dragon as inspiration. What you could then do, and this isn't always advised, but what you could then do is of course use this button here. If you're ever on the Grock platform, that button basically is going to bring you all the way back to Grock Imagine. And then, of course, that's when you can edit the image or use it for whatever you want to do. So, now the reason I do believe that Grock Imagine is so good is because it's very good at pretty much everything. So, for example, let's say I wanted to, you know, make a picture of a car. So, let's say we wanted to do a McLaren 720S on a London street and then we clicked go. Before we clicked go, do remember that you do have multiple options. So, the options that you So, the options that you do have are mainly just based on aspect ratio and not on image resolution. By default, it will have a set resolution. So, for me, I'm going to choose 16x9. Of course, this is dependent on whichever social media platform that you're preparing this for. Let's just hit enter. And the first thing you're going to notice about Gro Imagine is that this will literally be done in around 10 seconds. And the craziest thing about Grock Imagine as well is that it is remarkably fast at creating multiple images. So even though I didn't ask it to create that many images, by default it will create you around 16 images and then as you scroll down it will create you even more. If you are wondering which platform I'm currently on, I am on just the Super Grock. I'm not on the Super Gro heavy. So, don't think this is just a feature that is exclusively reserved for the super heavy version of the subscription. This is literally just on the basic $30 a month tier. However, I do suspect on the free tier, it's quite likely that those usage limits will be reduced. Now, this is super interesting and super useful because this basically gives you a large number of variations compared to any other AI image tool out there. Tools",
        "start": 0.08,
        "duration": 263.75999999999993
    },
    {
        "text": "$30 a month tier. However, I do suspect on the free tier, it's quite likely that those usage limits will be reduced. Now, this is super interesting and super useful because this basically gives you a large number of variations compared to any other AI image tool out there. Tools other image variations, they give you four at most. But Grock imagine gives you the most diversity. So instantly you are immediately spoiled for choice, which is super super useful. Now let's say for example, you find one that you really do like. Let's say like we want this one that's at an intersection or whatever. We can then click on that specific image and then we can say generate more images like this. Because of that, what it will now do is use that specific image as a driving image for the next set of images. So once again, it's going to roll this and within literally 10 seconds, we're going to get even more images in that specific style. Now, of course, this does work better for certain images that have a little bit more variety. I have a specific car in a specific location on a specific street, so of course the style is not going to be as varied, but the point I'm trying to make is that you can continually dive down where you see your specifics. Now, let's say, for example, you see a car that you do like or an image that you do like. Honestly, I'm a little bit distracted here, but let's say that you see an image that you do like. You can edit that image granularly as you would with Nano Banana Pro. So when you click the edit image button, just make sure that you hit backspace to get rid of all that text. And then you put change the color to yellow. And just like Nano Banana Pro, it's going to edit your image effortlessly within just a few seconds. The reason I'm going to keep talking here is because I want to show you guys just how quick and remarkable this is. That was I think around 10 to 12 seconds. And you can see there it changes only the aspects of the image that need to be changed. I do believe that on certain images it will change maybe certain small parts but it is up to you depending on how granular you need those changes. For example, if I go left, back and forth, back and forth, you'll be able to see the small changes of the image where it actually did change other parts of the environment that were parts of the image that were other than the color of the car. The reason that this is remarkably useful is because this allows you to iterate really quickly with Grock imagine. And so if you do want to actually find all of your saved images,",
        "start": 131.68,
        "duration": 483.28
    },
    {
        "text": "the environment that were parts of the image that were other than the color of the car. The reason that this is remarkably useful is because this allows you to iterate really quickly with Grock imagine. And so if you do want to actually find all of your saved images, left. And it is a really strange position, but if you click here, you'll be able to see that these are all the things that you've created, and these are all the things that you have liked. So this is only going to be the stuff that you have actually saved and liked. It's not going to be every single one of your creations. So if you have a bunch of different images that you do want to save, I don't know any way that you can get those back. There doesn't seem to be a way for you to get those, you know, generation of images back. So, an important thing to understand is that when you do a batch creation, make sure you're liking all of the images that you actually do like because as of now, there isn't a way to, you know, you know, re-enter that browsing session. It's only based off the images that you do like and you do save. So, beyond standard image creation, something as well that I really like about Crock Imagine is the sheer text rendering capability. Like I said, this is an actually comprehensive tool. So, let's say I wanted to create a post for Instagram. If I go to 1.1 and then I put this prompt in and I hit enter, you're going to see that this creates the perfect text rendition of the prompts that I need. Now, text rendition does take a slightly more amount of time, but it doesn't negate from the overall accuracy. So, here you can see I've actually asked it to create a post on social media. And remember guys, this is something that outputs many different variations. So, it's easy to just pick one of these and instantly post. You can see that the text rendering is complete. This is exactly what I wanted. The only thing that I could say could probably make this better is if I uploaded a default template and then let's say for example I decided to edit that template. So text rendering is super good. I'm going to show you guys another example of text rendering that is super good. So here we have another example of the text rendering. And these are just some images that I generated and it says Donald Trump just sued the IRS for 10 billion because they leaked his tax returns. And all I did was I just simply took a post off of social media and I just basically extracted the JSON text prompt and I asked Grock imagine to make the image. Now you can see right here that this is very very good at doing the",
        "start": 243.68,
        "duration": 710.2400000000001
    },
    {
        "text": "tax returns. And all I did was I just simply took a post off of social media and I just basically extracted the JSON text prompt and I asked Grock imagine to make the image. Now you can see right here that this is very very good at doing the imagine that standard images without text are around maybe 10 to 12 seconds but with text around 20 to 25 seconds. So just bear that in mind with your workflow. But nonetheless, it is still much faster than every other AI image generator because they generate so many images and give you just a incredible variation. Now let's say of course you have made your image. You've let's say you've already liked your image. You know you can already edit your image. What are the next steps for you to do with your images? Of course with your images the next step is of course video. Now video is almost as good as images because video is extraordinarily good in terms of the speed. Once again, let's just say we're going to generate a picture of a car. By default, you will have this button here that you can press to just make a video. And by default, it's going to use your default settings to just simply make a video. However, whilst this is useful for, you know, just making videos super quickly. So, I can click there, click there, click there. Of course, do be mindful of your usage limits because historically it's very easy to run out of video usage limits. The video creation is super quick and it depends on your video resolution. I would say if you're not exporting those videos for social media or you're using them for any kind of professional purpose, I would export them to 480p resolution because you're going to get more in terms of the actual usage limits. Now, of course, the video duration as well. You've got 6 seconds and you've got 10 seconds. Usually, it's best to have it on 6 seconds and 480p cuz that is just so much quicker. And you can see once again, the aspect ratio will determine on your videos. So, it's important that if you're generating videos, the video quality currently is super super good, as well as it being super super fast. And not only that, but remember guys, this comes with audio on as default. And this audio is actually pretty good as well. It's almost as good as VO 3.1. Now, of course, you don't have to generate an image first, but I would advise that if you're doing a full workflow, but you do have the video creation here. So, let's just say you have an old man complaining about taxes. He's wearing a red hat. Okay, we can just simply say, okay, we immediately want to create a video. Now, I wouldn't do this simply because of the fact that",
        "start": 358.24,
        "duration": 961.4360000000001
    },
    {
        "text": "but you do have the video creation here. So, let's just say you have an old man complaining about taxes. He's wearing a red hat. Okay, we can just simply say, okay, we immediately want to create a video. Now, I wouldn't do this simply because of the fact that first and I'd want to drive how that image is done. I'm sick and tired of these high taxes. The government takes it all and for what? We need to do something about this now. And so the videos here are super super good in terms of the quality. Like I said, the ability to just be able to have these videos and this video I do believe it took me around 19 seconds to render, which is remarkable. So I think they've got a really, really efficient version that's able to push out video super quickly. But like I said, you can see here that this is a video that actually looks good. But of course, if you're doing this in a real workflow, it's probably best to just go ahead and first make the images because you're going to be basically spoiled for choice and you're going to be able to see which kinds of images that you do want and you're basically just going to get more variation. So, you can see right here an an image of an old man complaining about taxes. You can see here you instantly have much more variation and you can see which kind of old man you do want. So, maybe you want an old man that looks like this. Maybe you wanted an old guy that looks more like this. That's why I would say if you're going to use this, make sure you just generate an image first and then you, you know, click and then you make the video on it. Now, if you do want to upload your own footage, you can, of course, do that. So, I'm going to show you guys uploading your own footage. So, let's say you upload an image of whatever it is that you want. There are several things that you can do with that image. One of the first things that you can do is you can edit the image, but something that I did actually forget to mention is that usually the moment you upload an image, it just instantly starts to make a video. So, always try and, you know, untick this cuz sometimes this does get a little bit frustrating because you may not instantly want a video, but it will just do that by default. And here you can see in a few seconds, the image I've uploaded has instantly been transformed into a video that is 6 seconds long. And this is super super useful. Now, with those images, once again, you can immediately, you know, edit the image. You can say add a red hologram in there",
        "start": 494.879,
        "duration": 1165.6780000000003
    },
    {
        "text": "see in a few seconds, the image I've uploaded has instantly been transformed into a video that is 6 seconds long. And this is super super useful. Now, with those images, once again, you can immediately, you know, edit the image. You can say add a red hologram in there do get two variations that basically fulfill your wish. So uploading an image is something that is super useful. Another thing and probably the last thing I found that was super interesting is that if you do come across a video that you do like here, you can go ahead and then make that video yourself. So let's say this is a cool fighting animation, you can basically see the prompt there. You can go ahead yourself and create the video or you can basically create something you know that you want. So let's say you want the initial starting frame. It will take the initial starting frame and then do something. So let's say we have these guys that are fighting. Let's say I wanted to just completely change this scene where it's still a hyper, you know, crazy scene with the samurai, but this guy instead pulls out a gun. It's going to take that first shot and then it's going to create a video. So, if you see something that's inspiring you or whatever, you can just simply take that first shot and then immediately create a video from that. And so, here you can see I've changed it by saying that samurai pulls out a gun and starts firing. So, it's completely different depending on the kind of prompts that you do use. And of course, it's generative. It's not always going to be accurate, but that is the entire point where, you know, if you do want changes, you can of course make those changes. Now, now another thing when generating your video is that these videos aren't that good in terms of the quality. And so, if you do actually want to make the video a little bit higher quality, you can click upscale the video in the bottom right and it'll just upscale it in around 10 seconds. Super super useful for you. Of course, if you want to download any of these videos, you just right click, you click save video as, and it'll be able to download that video. But yeah, upscaling the video is as simple as just clicking here, then clicking upscale, and it just does it so quickly that it's just amazing.",
        "start": 598.72,
        "duration": 1346.1580000000006
    }
]