[
    {
        "text": " So Elon Musk's Groc is probably going to get banned in a ton of countries, so we need to talk about it. So in case you missed it, there has been this bikini nonsense that has been going on all over X, and I finally got around to making a video. So basically, the problem is is that Grock released a new feature which is called image edit. Now, if you have any image on Twitter, you can edit that image with basically a Grock version of Nanab Banana Pro. And of course, Elon Musk decided to promote this all throughout his platform to showcase exactly what has done. Now, in his defense, I don't think he intended for what was to come. But due to the nature of this image editing tool by various different users, there were some unintended consequences. Because of this, many people are now considering a complete ban of Grock images. I'm going to, you know, try and dive into this as much as I can without saying too much because of course I don't want to get the video demonetized, but if you do a quick Google search, you'll know exactly why this is the case. So, of course, you can see here that Elon Musk is saying, \"Hey, Grock changes to Elon Musk.\" And there was basically a really super popular, I guess you could say, meme about bikinis and putting people in bikinis. And on 50% it was just light-hearted people having a fun. And then on the other 50% there was a really dark side to it. But like I said, there were many countries saying that look, we are just going to ban Grock because what it's able to do with the image edit feature is that there are essentially no guardrails. And I think you can understand where I'm going with this. The image edit tool basically was abused by many users who wanted to create essentially adult content without many users consent. And the thing is is that usually with AI tools, this isn't really possible. So many countries just decided that look, Grock aren't doing anything about it. So we are. Indonesia decided to temporarily ban Grock. Japan decided that they're going to probe Grock because it's able to create images without of people without their consent, putting them in certain places, deep fakes, and doing things that they didn't essentially want to do. And then, of course, you can see that California is now investigating X and Grock over AI deep fakes. The avalanche of reports detailing the non-ontentual adult content that Grock has produced and post online in weeks is shocking. This material, which depicts users in certain situations, has been used to harass people across the internet. This is currently unaccessible and will use all our tools to keep Californians safe. Now, the point I'm trying to make here, guys, is that other tools don't even allow you to do this. So, for people",
        "start": 0.16,
        "duration": 301.441
    },
    {
        "text": "users in certain situations, has been used to harass people across the internet. This is currently unaccessible and will use all our tools to keep Californians safe. Now, the point I'm trying to make here, guys, is that other tools don't even allow you to do this. So, for people have a, you know, a bit of a different opinion. I do think that yes, the users are the ones that do the bad things. But if you can and you do have in your power as a company to be able to limit what the user is able to do, then I think it's up to you once you realize that there is a growing problem to at least fix that problem as quickly as you can. Google Gemini, Chatt, and other AI image generators simply won't allow you to edit images of people, putting them into potentially adult situations. They just simply block it. And the problem/qu question for the most part is that if XAI knew about these issues, why didn't they act sooner? Now, of course, eventually they did decide to act, they decided that okay, well, enough is enough. We are going to change this to paid only. And they said that we've implemented some technological measures to prevent the group account on X globally from allowing the editing of images of real people in revealing clothes such as bikinis. And this restriction applies to all users, including paid subscribers. image creation and the ability to edit images via the at@ crook account on X and now available only to paid subscribers go globally. This adds an extra layer of protection helping to asssure that individuals who attempt to abuse the Gro account to violate the law or our policies can be held accountable. Now I do think that this is a good change of making it paid. You can see that certain individuals that are trying to put people in certain situations are now getting hit with this. you actually need to, you know, edit this and pay for this feature. But I think the main problem with XAI in the entire fiasco was that they simply took too long to act. I think it was probably around an entire week from the actual issue to start raising red flags before they actually decided to act. that in some cases, users who were actually talking about this topic, their accounts got unverified and subsequently banned, which is of course not the kind of thing that you want to see from a company that's supposed to be protecting you when it comes to certain images. Like that doesn't seem like a responsible company. So, it's very very bad in terms of what we're seeing from XAI, at least from a public PR kind of standpoint, because even if they're not complicit in this, failure to act and acting slowly is just super super strange. Now, they also said that they're going to geoblock",
        "start": 150.56,
        "duration": 561.441
    },
    {
        "text": "So, it's very very bad in terms of what we're seeing from XAI, at least from a public PR kind of standpoint, because even if they're not complicit in this, failure to act and acting slowly is just super super strange. Now, they also said that they're going to geoblock is illegal and the ability of all users in those locations to generate images of real people in bikinis and other attire. They're basically just going to geoblock them. And you can see that Elon Musk said that anyone using Grock to make illegal content will suffer the same consequences as if they upload said illegal consequences. And remember, this isn't the first time this has happened. Grock has been spewing some very, very weird text stuff. So, I'm not surprised this has happened. And I think this is the problem when you have an AI that is too free. People will either abuse it or there will be guard rails that aren't set. And you can see that I'm not the only person that was a little bit frustrated that this took too long. You can see that someone else responded to the safety tweet that said, \"It is actually very absurd that it took this long. Every single one of you should be ashamed of yourselves.\" And the reason that I say that it took this long is because there were a lot, and I mean a lot of viral tweets calling this out for this to be banned. And I don't think it takes that long for them to implement guardrails. I've seen chat GPT and Google to be able to implement guardrails almost immediately when something goes wrong. So I'm not sure what was going on at the XA headquarters, but it definitely shouldn't have take a week. Now, some individuals are arguing against it, saying that overregulation is more dangerous than underregulation. take action against those who really do post inappropriate content but don't throttle the whole image genen and I do understand where they're coming from but at a certain point you do have to limit things so that overall harm is reduced and I did ask a few people in my school community and some of them and I did ask some people in my free school community where I just talk about video ideas and stuff like that and some people said that this was also blatantly absurd of course if you want to join the free school community don't forget to leave a link don't forget to click the link in the description it's completely free it just has a few AI resources discuss future video ideas in there. Now, the thing that I think about this that I think is one of the most interesting things that most people haven't discussed is the fact that regulation was always coming. So, what the UK is doing, and this is of course where I live, is that they're bringing force a",
        "start": 283.52,
        "duration": 800.2410000000004
    },
    {
        "text": "the thing that I think about this that I think is one of the most interesting things that most people haven't discussed is the fact that regulation was always coming. So, what the UK is doing, and this is of course where I live, is that they're bringing force a non-consensual intimate images following wide concerns over Elon Musk's Grock. And the craziest thing about the statement that they said is that X could lose the right to self-regulate. If X cannot control Grock, we will. and they plan to, you know, unveil the legislation to make it illegal to supply online tools to create such images. Now, the point I'm trying to make here, guys, is that this is pretty bad because if governments decide that AI companies aren't regulating themselves, they're going to step in and have some crazy kinds of regulation. The problem with that is that governments don't usually understand how the tech works. So, they're probably going to implement some draconian laws that are going to just slow the tech down and just push the industry back further. And this is the crux of the issue here. X should have been regulating themselves pretty well. And because they clearly haven't, you can see that multiple different countries and jurisdictions have tried to regulate the platform. And this is the problem with AI development. If companies aren't able to, okay, at least be honest and authentic about certain issues and restrictions, even if it does hamper their growth, they're going to just do the entire industry a complete disservice. And I think the XAI probably does need to do a better job of that. I'm not saying they're not going to create amazing tools in the future. I'm just saying that when it comes to admitting mistakes, they clearly need to do a bit of a better job. If you guys enjoyed this video, I'll see you on the next",
        "start": 404.72,
        "duration": 966.6410000000003
    }
]