[
    {
        "text": " So something is going wrong with XAI and I think everyone just left. We need to talk about it. So Elon Musk's startup X.AI just had not only two co-founders leave but a slew of high-profile individuals who worked at the company have just completely quit. And this has caught everyone off guard. So let me show you guys exactly what I'm talking about. So you can see here that today or you know a few hours ago Tony Woo which is the significant technical leader at XAI and this guy's known for mathematical reason he works on agents program synthesis and you know he did work at Google brain and Google deepmind before joining XAI and he literally said that I resigned from XAI today company that we we all became will stay forever I'm going to miss everyone but sorry I'm leaving and then I came across this tweet as Well, actually, I think 1 hour ago that said, \"I left XAI today. It was truly rewarding to contribute to Grock video. Imagine series 0.9 then 1.0. I see a mix of humble craftsmanship, yada yada yada. Thank you to everyone who made this journey unique and memorable.\" And then I also saw this Jimmy Bar and Jimmy Bar is a prominent AI researcher and another this is another co-founder of XAI and this guy's particularly well known in the deep learning community for his foundational work on layer normalization. Adam optimizer basically a lot of widely used techniques in modern neural networks and co-founders leaving isn't usually a good sign. If employees leave that is okay because of course employees can leave a company for various different reasons but co-founders who have started I mean the timing of this is pretty incredible because not only do you have people who were there when it started probably you know well in sync with the vision you have the technical credibility loss. This guy Jimmy Bar brought serious academic credentials and deep learning expertise to XAI. So this departure removes a key technical leader. And the craziest thing about all of this as well before we dive into the entire list of people who left is that his tweet is suggesting that he sees 2026 as a transformative time where AI development's coming in 2026 have 100 times productivity and recursive self-improvement loops. And that means that maybe he even sees bigger opportunities elsewhere or XAI's direction didn't align with the vision for AGI development. But take a look at this. This is where I managed to get a list and I didn't create this list. I came across this list because a lot of people were discussing this on Twitter. You can see that there are over 13 to 14 individuals within the last 48 hours, okay, that have left XAI. And this is a pretty remarkable feat when your company is from the outside at least doing pretty well. So, I mean, you know, there",
        "start": 0.08,
        "duration": 344.7999999999999
    },
    {
        "text": "discussing this on Twitter. You can see that there are over 13 to 14 individuals within the last 48 hours, okay, that have left XAI. And this is a pretty remarkable feat when your company is from the outside at least doing pretty well. So, I mean, you know, there Bar's departure, half of XAI's founding team have left, and we need to get into why people have left XAI because it's a little bit concerning given the recent timelines and of course considering what Elon Musk has been getting up to. So, we need to dive into this. So, one of the first things I found, okay, was this old tweet that was like talking about the working culture at XAI and this was super interesting. So there was a discussion I think around January time and we're going to revisit this in a moment but Satia Nutella is you know a parody account of Sadia Nutella. Basically this guy tweeted in response to Elon Musk and he was saying you are no longer attracting top talent. Everyone knows that the best AI researchers are not at XAI top talent need an honorable vision. Be a soldier in my empire not a let's make Grock edgy and be in Twitter. And so with this point here, it's like why would people leave XAI? And I'm guessing the tweet is about the perception of Grock being that of an edgy chatbot. So if you aren't familiar with it, the, you know, common perception, at least right now, at least 50% of people just see Grock as an edgy chatbot. Some people see as a truth bot. I mean, the perception isn't great because it has had many, many mistakes in the past where it has said things that it hasn't meant to. It's been this whole Mecca Hitler thing. If you haven't seen it, I mean, you can go watch documentaries on it because AI researchers have made them. It's super interesting. But I think what I'm trying to show you guys by this tweet is saying that, you know, top talents need an honorable vision, which is very true. If you are an esteemed AI researcher who has tons of citations and you're doing real world research, of course, you're going to be wanting to work on the cutting edge. Now, we're going to dive deeper into this because I think the culture at XAI, and I'm not saying that like I work there or know people that do, but working culture definitely does matter. And one thing I've started to realize is that there have been numerous articles that have shown XAI's working culture to maybe not be the best. You can see here this is a article from Business Insider and it says the top lawyer for Elon Musk's XAI just quit after saying he doesn't get to see his kids enough. It says I'm leaving XAI. I love my two toddlers and I don't get to",
        "start": 173.2,
        "duration": 617.92
    },
    {
        "text": "the best. You can see here this is a article from Business Insider and it says the top lawyer for Elon Musk's XAI just quit after saying he doesn't get to see his kids enough. It says I'm leaving XAI. I love my two toddlers and I don't get to Working with Elon on his tech at this time was the adventure of a lifetime. Although there's daylight between our worldviews, his vision, commitment, and smart blew me away on the daily. I couldn't keep riding. I couldn't keep riding those two horses at once. The family and the job. Time to pick one. I don't know what's next. I'm just grateful and way more capable than I was 16 months ago. So, you have to understand that this is the culture of XAI as far as I'm concerned. And I think the reason that the culture is so hightens is because not only are XAI behind in the AI race, they clearly want to lead. If you haven't remembered XAI, I think they started in around I think it was 2024, but they started late in the game. And fair enough, they have made tremendous progress. But I do know that I saw a few tweets and I'm even going to show you one now of individuals just saying how much dedication they have to XAI in terms of just basically giving it their all, like just working just all the time. Look at this tweet. You can see here it said, \"Last night I left the XAI office after 36 hours of working with no sleep. Although I was dead, I was also super energized. Incredibly grateful to be a part of this team. Happy Thanksgiving.\" So, this is what it's like working at a Frontier AI lab in one of the most competitive industries in the world. this is what XAI seems to have at their culture because I mean like I said they are behind and so considering the you know stake of what is potentially going to be in the future of course Elon Musk doesn't want to lose that and of course Elus's employees to work as hard as possible now I'm not saying that this is modern-day slavery I'm sure these individuals are probably being compensated for their roles very well but you have to understand that I don't think every other AI company out there is going to be having individuals work this many hours to cases where individuals are working 36 hours without no sleep. And trust me, we're going to get into other reasons that people potentially have left. I mean, take a look at this. This is from another article that I found. It says that someone who left for OpenAI, which is of course Elon Musk's Nemesis company, they were claiming that he had been working more than 120 hours per week. Okay, so this is something that is once again super interesting and this is what I'm",
        "start": 311.68,
        "duration": 894.7219999999998
    },
    {
        "text": "article that I found. It says that someone who left for OpenAI, which is of course Elon Musk's Nemesis company, they were claiming that he had been working more than 120 hours per week. Okay, so this is something that is once again super interesting and this is what I'm I'm sure they're working extremely hard to not only catch up, but to try and lead the Frontier AR race. And to be fair, Grock 4 when it released was state-of-the-art. But of course, things have changed since then. So, they're probably under tremendous pressure considering just how fast every other lab is moving. And not even just that, you've got Meta, OpenAI, you've got Anthropic, you've got the Chinese labs. I mean, it seriously is incredible. Now, this is where I think potentially the main reason why this company is probably falling apart. I think if we look at the timeline, you start to get a clearer picture of where XAI is probably headed. So, you can see that on February the 2nd, Space acquired XAI. There was a merger. And if you aren't familiar with why the merger was, essentially the merger was probably because of XAI's financial issues. So XAI, if you weren't familiar, they had a cash burn of $7.8 billion in the first 9 months of 2025 with a net loss of $1.46 billion in the September quarter compared with a billion in the first quarter. Now the financials are not, you know, completely there yet, but XAI is, you know, raised a new $20 billion in funding round, and their revenue is not up to scratch. It's a little bit lagging. It's still pretty good for a new company, but it is lagging behind the metrics. So, when you look at the timeline, which is February the 2nd, you have SpaceX acquiring XAI in a merger valued at $1.25 trillion and then Tony Woo announces his resignation and then Jimmy Bar announces his resignation. It's pretty clear that this you know exodus of talent from XAI has something to do with the fact that the companies are being merged and I think that is something that most people are missing. So one thing that happens when you get a merger is you have two companies colliding and often times that means two cultures clashing. So there is evidence to support this as well. You do have this tweet from someone who used to work at XAI and this says that XAI prides itself on move fast and break things flat hierarchy act first ask questions later and it isn't fully this but it tries to be and he says okay this is the guy who used to work at XAI and I have a hunch many XAI people will hit a culture shock with SpaceX and that is what he wrote so it's quite likely that maybe the cultures are completely different I mean there are two different companies",
        "start": 452.08,
        "duration": 1200.4809999999995
    },
    {
        "text": "okay this is the guy who used to work at XAI and I have a hunch many XAI people will hit a culture shock with SpaceX and that is what he wrote so it's quite likely that maybe the cultures are completely different I mean there are two different companies individuals have already left. Now, this isn't the first time that individuals have left Tesla and XAI. I mean, some people would site Musk's behavior. I mean, in this article, they said that, you know, they're fleeing because Musk has become increasingly erratic. Elon's behavior is affecting the morale, the retention, and recruitment. Now, I'm not sure if I agree with that wholeheartedly. I don't know. I wasn't there. But at the end of the day, there are just clearly multitudes of factors which as to why individuals may leave a company. And of course, if you have a CEO who is super super dedicated and super super, you know, not budging on that vision, I think it's definitely hard for some people to adjust to that work. I mean, I found this on LinkedIn where it says, you know, Elon Musk reportedly instructed, you know, all XEI employees to submit a one-page summary detailing what they had accomplished over the past 4 weeks, giving them only 48 hours to complete the task. And it says the directive, okay, and this is what people are saying is that this has been widely perceived as an extremely demanding, strict, reflecting Musk's famously high expectations and hands-on management style. And some people are saying that this is good. he wants clear, concise transparency, but some people are saying that this is, you know, contributing to stress, burnout, and whether or not these tactics will actually work long term. So, I mean, when you have all of these factors going on, it makes sense to understand why individuals may want to leave. Now, you can see here that in that article where they were talking about Musk's character, they were saying that his ruthless demands, the chaotic decision-making, and deteriorating public image are driving away senior leaders and rank and file talent, many of whom are fleeing to Musk's biggest rivals. So, one of the biggest issues about all of this is that the problem is that like it's not that people are just leaving XAI. The problem here is that all of these individuals, they're going to companies like Anthropic, OpenAI, Meta, Google, and those are companies that you're competing with. You don't want people who are working for you to suddenly leave you and then all of a sudden be working for your rivals or your competitors. And this is a clear issue for XAI. You can see here it says Elon Musk is fuming that workers keep ditching his company for OpenAI. his blood feud with Sam Alman rages on and literally you see here that it got to the point where you know Elon Musk has",
        "start": 607.44,
        "duration": 1489.12
    },
    {
        "text": "this is a clear issue for XAI. You can see here it says Elon Musk is fuming that workers keep ditching his company for OpenAI. his blood feud with Sam Alman rages on and literally you see here that it got to the point where you know Elon Musk has because he's claiming that OpenAI is targeting individuals with knowledge of Xi's key technologies and business plans including XAI's source code and operational advantage in launching data centers and then and then inducing those employees to breach their confidality agreements and other obligations to XAI. through unlawful means. So Elon Musk was like, \"Okay, well this is okay bad, but if you guys are going to keep leaving my company and going to my competitors, then of course I'm going to have to sue you.\" And I think this is probably just a wider symptom of Elon Musk's feud with OpenAI. This lawsuit that has been ongoing is one of many where Elon Musk and I mean now to be fair to Elon Musk, this lawsuit is completely fair. the previous one where he claims that OPAI abandoned their mission because technically they kind of did. But I do think that this one may not have the same grounds because individuals leave other AI companies all the time. So I'm not sure that OpenAI would be foolish enough to actually go ahead and you know get people to go and steal secrets from that company. So I mean it's pretty interesting but this is clear that you know XAI is facing a real real issue when it does come to employee retention. Now you can see here that someone tweeted that okay clearly XAI within the last year attrition has been over 50% and this is where someone else had left XAI and this was literally in January. You can see here that Elon Musk has said there are very few regretted departures and we are accelerating faster than any other AI organization on earth despite being a much smaller team. Now whilst yes that is true that is very true that they are probably accelerating faster than any AI company out there. I think that maybe yes there may not be regretted departures. I think it's one of those things that is clearly interesting when you compare XCI to other AI companies such as Anthropic and OpenAI. And what I wanted to do was show you all just how different the culture is at these other companies because then by comparison you can understand where AI potentially falls short and why the company might be falling apart in the short term. Now, if we look at Anthropic, okay, this was a video where they are talking to their co-founders and this is a conversation called building with Anthropic. A conversation with our co-founders. It's on YouTube. They're basically sitting around a table and they're just talking about, you know, how they built the company, what",
        "start": 753.279,
        "duration": 1789.6809999999996
    },
    {
        "text": "at Anthropic, okay, this was a video where they are talking to their co-founders and this is a conversation called building with Anthropic. A conversation with our co-founders. It's on YouTube. They're basically sitting around a table and they're just talking about, you know, how they built the company, what why work on AI is a refreshing conversation to understand where things are headed. And the thing here is that if you aren't familiar with why I'm using Anthropic, it's because they are basically the gold standard of how companies retain AI talent. And if you aren't familiar with this anthropic, you know, retention in terms of how many employees they keep, it's around 80%. 2-year retention and 80% is pretty crazy. And it's basically because they have strong mission alignment, careful hiring, and a comparatively low chaos culture. But if you think about that compared to XAI, they are constantly in the media. There's a lot of high attention. There's a harsh operating environment. They're under, you know, a lot of deadlines. And I mean, it's clearly a different culture. One of the things I also wanted to show you is that we all know what anthropic is like. We just understand the vibe, the culture. It's all around this honesty, transparency, helpfulness. And you can see that the comments, you know, really embody that. The comments are like, \"Oh, I can see why Claude is so awesome. you know, after watching this video or this meeting, I believe you're the most trustworthy company of all of the AI companies. I've just signed up to Claude. You guys all have wonderful human qualities. And then the top comment says here, I really want Anthropic to continue to do well. I love their models and their attitude towards safety and what they aim to accomplish. And you know, if if you aren't familiar, it was literally Anthropic, which is the company that was like having individuals leave OpenAI and go to Anthropic so that they could actually focus on safety research. And so remember guys, this is a super super competitive industry. The reason I'm talking about anthropic compared to XAI is because you have to understand that like the reason that sometimes individuals leave these AI companies and we've seen individuals leave OpenAI despite them having high salaries is because culture is something that matters a lot to these people. These are some of the, you know, world's, you know, most talented individuals, some of the most brightest minds. They clearly want to work on big goals. And for a lot of companies, I don't think they realize that it is more than just a huge paycheck. I mean, if you remember Meta, they just had the most insane talent wars. They were throwing $2 million salaries around, you know, even billion dollar paydays for certain specific talents. And the problem was is that Meta didn't even have the kind of retention that Anthropic had despite spending probably",
        "start": 906.32,
        "duration": 2060.7199999999993
    },
    {
        "text": "mean, if you remember Meta, they just had the most insane talent wars. They were throwing $2 million salaries around, you know, even billion dollar paydays for certain specific talents. And the problem was is that Meta didn't even have the kind of retention that Anthropic had despite spending probably said, I'm comparing this to XAI because XAI was certainly having a significant amount of compensation. So, it's like if you're having all of this compensation, surely individuals would stay. But I think the clear thing here is to have a company culture that actually makes you want to stay at that company. And like I said, we've seen that happen from OpenAI where, you know, a large swath of individuals left that company to go to Anthropic. So when you see this, the fact that like top AI researchers are choosing Anthropic over Meta despite the huge offers, I think it's clear that Anthropic has that huge mission culture and perceived long-term upside more than any other company out there. Xi when you compare to it, you know, they are probably still doing things well in terms of the raw AI understanding and the models and the LLMs and the agents and the video and image models. But I still think that when you compare this across the board to many other AI companies, the reason that they're struggling is because the culture, I think it's very difficult to be in for someone who's in AI. And I think that individuals who are working at that company probably feel like they might be under tremendous pressure. Maybe they're not feeling that they're working on a goal that's big enough. I mean, employee retention is one of those things that is notoriously difficult to get right. But think about it like this. OpenAI and Anthropic do have currently the best employee retention. So, it's clear that we probably should be looking at them as the gold standard. Now, I do have to be honest, okay? Just because the company might be going through a rough patch where it looks like it's imploding, okay, and it looks like it's going down, it doesn't mean that the company is going to completely fail. They did just have the merger. So it is probably going to be one of those times where maybe they're thinking okay I was probably leading a smaller lab but of course if I'm part of a B but of course if I'm part of a bigger organization maybe this merger is going to shake things up maybe I'm not going to have as important as a role maybe my role might be shifted so maybe those who didn't want to stay on for the merger have simply left maybe it could be that but we did see individuals leave prior to this merger so it is of course a little bit worrying to see individuals continue to leave So the reason I've got this screen on is",
        "start": 1043.839,
        "duration": 2318.3189999999986
    },
    {
        "text": "didn't want to stay on for the merger have simply left maybe it could be that but we did see individuals leave prior to this merger so it is of course a little bit worrying to see individuals continue to leave So the reason I've got this screen on is is that you should never bet against Elon Musk. As Peter Teal would say, and this is his quote and this is a quote that I, you know, remember quite a lot is that like Elon Musk has an incredible track record and an ability to, you know, accomplish seemingly impossible goals. So Peter Till, if you don't know, this guy's a legendary venture capitalist and co-founder of PayPal where he worked with Musk and he basically saying that during his experience with Musk, Inner Musk has constantly proven his doubters wrong. So when people say like something can't be done and they bet against Elon Musk succeeding, he always finds a way to make it happen. I mean the guy built PayPal, Tesla, SpaceX, Neurolink. I mean those are things that were previously, you know, considered impossible like the reusable rockets, making electric cars mainstream, persevering through near bankruptcy moments and then coming out stronger. This is of course something that Elon Musk is good at. So this is why I say despite all of the facts that yes within the last 2 weeks you can see that there are up to 14 15 highprofile XAI employees that have left maybe just maybe despite all of this employee departure Elon Musk is about to come out of this somehow even stronger even better of course I don't know but when your co-founders are gone and the vision gets a little blurry and other companies are stealing talent I mean it is pretty difficult to say what happens next. Let me know what you guys think about this. I think this is super interesting. I don't think XAI will implode, but I do think right now it is, you know, very close to, which is why they probably had to get that merger across the board. But let me know what you guys think and I'll see you guys in the next",
        "start": 1175.36,
        "duration": 2498.799
    }
]