[
    {
        "text": " So yes, this is what Sachinella did say. He did warn that people need to do something useful with AI before it loses public support. And it's pretty crazy because I think like I said in my previous video where I spoke about this, AI hate is just at the tip of the iceberg. So this is a screenshot from the subreddit called anti- AI. It's basically a subreddit for people that aren't embracing AI and just I guess you could say have taken this stance that AI is a net negative for society, which is fair enough. And you can see that they've said duck do go w which is doc.go is winning because of course they've added this you know search privately without AI. So they removed AI images they removed AI assisted answers. And I think what Satinadella's statement shows here is that of course the public conversation around AI outside of the tech and AI Twitter bubble including spaces like my YouTube channel are ones that are highly negative if you're looking directly at the public. Now, if you want to know about that, the growing AI backlash, I actually made a video on this 3 weeks ago. It basically just talks about the fact that outside of, you know, the spaces that we're talking in now, most people have a net negative on AI. And it's completely understandable because I think one of the key issues with AI is that these companies just saw dollars in their eyes like those cartoons. They really didn't see how this was going to progress with users. And in so, they dropped a product. And because they didn't put users first, which is of course the thing that you have to do if you're building any kind of business, eventually people just got really upset. People felt betrayed. People felt that the tech was intrusive. And overall, it just led to the sentiment being overwhelmingly negative to the point where even if some tech is good, people were just refusing to use it because of the stigma that AI has gotten. Now essentially what he's saying here in the deeper context is that yes AI boom it's going to you know fall off if there isn't the wider adoption. The main point that you know I want to inject here is that I mean if the public doesn't get on board with AI then the AI equation doesn't make sense for the large scale. Think of it like this guys. So he's clearly saying here that look the AI boom is going to fail without wider adoption. And it makes sense. Think about it. The AI tech industry is supposed to, you know, change and revolutionize the lives of, you know, eight billion people. But what if, you know, six billion people are like, \"No, we don't want to use this because the sentiment is so negative.\" Well, all of those data centers, all of those",
        "start": 0.16,
        "duration": 284.00100000000003
    },
    {
        "text": "tech industry is supposed to, you know, change and revolutionize the lives of, you know, eight billion people. But what if, you know, six billion people are like, \"No, we don't want to use this because the sentiment is so negative.\" Well, all of those data centers, all of those results because you're not going to have any customers. The only companies that are probably going to survive are the companies that are B2B doing businessto business transactions. That's my personal opinion, but I think, you know, it certainly could play out that way if AI doesn't have enough juice to keep on going. So, let's dive into this a bit more. And he says that AI risks becoming a speculative bubble unless it spreads beyond the big tech companies and wealthy economies. And he said that the long-term success of fast developing technology would depend on it being used by a broad range of industries as well as on uptake outside of the developed world. And this does make sense. AI is not going to be something that is just super basic. The key thing with AI is that AI is not supposed to be just another tech fad. AI is supposed to be like the internet. Right now, the internet is something that you use probably every single day. When your internet goes down, you can feel it. It's almost like an essential thing that you use every single day. Almost, you know, basically not as essential as humans needing to survive as water. I wouldn't put it on that level, but it is something that you do kind of need to get on with your day-to-day and to function in the economy. Like if you don't have internet, it is a very very big disadvantage. So the entire thing thesis that these companies, you know, are looking at is that look, AI needs to be like the next internet kind of moment. And so if it's not going to be that moment and if it's not going to be broadly used in a broad range of industries outside of you know just the developing world beyond you know the current products and range of services that we do have then we're really running the risk of just putting all of this investment into something that doesn't yield the returns it's supposed to. And I believe that I think Sachin Nadella is finally starting to, you know, see, not that I I was even foreseeing this, but finally starting to, you know, maybe take a look at things and say, okay, well, AI is good. It's certainly helping out the economy in certain areas, but it needs to actually be a widespread technology in order for the bubble not to pop. Now, of course, you can see it says for this not to be a bubble by definition, it requires that the benefits of this are much more evenly spread. and he noted",
        "start": 142.4,
        "duration": 517.0390000000001
    },
    {
        "text": "areas, but it needs to actually be a widespread technology in order for the bubble not to pop. Now, of course, you can see it says for this not to be a bubble by definition, it requires that the benefits of this are much more evenly spread. and he noted bubble would be only if tech groups were benefiting from the rise of AI rather than other companies and other sectors. Now I do agree with this. I think that you know this is a really interesting take because I think I don't want to say it's too early to see but I do think that it is too early to see because when you think about widespread technology adoption I do think that the curves they go for around maybe 10 years. So you've got like the you know early adopters, the you know early majority, late majority and then you've got the lagards. So I don't think that that is going to happen any faster than any other technology cycle. For example, you know, you had like the internet and mobile phones and that kind of technology. It still did take a while for all of that technology to diffuse across the world. But I do think it will be interesting to see how [music] AI does go because right now there is a ton of resistance. A lot of people don't even want to use the product if it's good. And there are just weird edge cases where you know it just fails. Now of course remember AI isn't just generative AI but I think that is you know one of the key areas that people are probably talking about because and that's where a lot of the money is currently going at the moment. So generative AI and that kind of AI it does kind of make sense. So I think another thing as well just to show you guys the current state of how AI discourse has evolved online. I think since 2023, the discourse has evolved from, okay, this is a really cool tool that's, you know, going to help us out in our daily lives and we can ask it questions to AI is terrible. It's just something that nobody wants to use. And the public discourse is one of just disdain for this technology. So, this tweet there were several reactions to this tweet that were pretty bad. They were pretty bad in terms of an AI discourse if you're just managing the sentiment. And so, one of them literally said, \"Well, I'm doing my part. this is how you should embrace Copilot AI. And they're hitting the uninstall button. And that had a lot of retweets and a lot of likes. And the thing is that I don't even think this is performative because Copilot is one of those tools where unfortunately I think the tool is probably good, but the marketing and how it's being pushed towards consumers.",
        "start": 260.639,
        "duration": 764.3210000000001
    },
    {
        "text": "And that had a lot of retweets and a lot of likes. And the thing is that I don't even think this is performative because Copilot is one of those tools where unfortunately I think the tool is probably good, but the marketing and how it's being pushed towards consumers. they feel like they have to use. Especially currently in this day and age when AI is being forced down your throat. It doesn't feel like a natural way to engage with a product. It almost feels forced. Like if someone says that you have to use this product, here you go. There's no way to use this product without, you know, this AI feature, then the AI feature becomes a burden. I think, you know, stuff like this should be a choice to the point where if you choose to use it and it makes it better, good. But if you want to use the same old, you can. And I'm not saying that Microsoft are completely pushing this out on people, but it's just like I think they're under significant pressure from investors to probably show AI delivering results. And so it's just created this horrible feedback loop of, you know, push the product out into, you know, existing products. It gets forced into users, users hate it. There's more there's more negative sentiment and it's just, you know, spiraling downwards at the moment. So it got so bad at one point that a lot of people started calling you know Microsoft Microsoft as the company continued to add co-pilot features to the operating system. So someone actually created a chrome extension that you know replaced Microsoft with Microsoft across the internet and copilot and windows originally appeared as you know a sidebar feature. Now Copilot is a part of Paint. It's a part of Notepad, Microsoft Office and many other areas of Windows. So Microsoft strategy, you know, you can see in this tweet here, is hurting the AI race more than helping it, which is, you know, like I said, you know, they're adding this stuff to areas where it's not necessarily needed, and that's going to cause even more of a push back. So it's it's it is a tough position. It is a very, very tough position to be in. I do wonder how this entire thing is going to play out. You can see here it says, \"I uninstalled Copilot yesterday. Thank you to the base Twitter user who informed me about being able to uninstall it.\" And I mean, I think these public reactions are not as uncommon as you think. As I, you know, browse Twitter, I start to see more and more of these. And it's super interesting to see the divide just get wider and wider because genuinely, guys, if you've been on Twitter, on one side, you got people using clawed code and going crazy, and on another side, you literally got people saying, \"I'm never",
        "start": 386.24,
        "duration": 1006.2390000000001
    },
    {
        "text": "see more and more of these. And it's super interesting to see the divide just get wider and wider because genuinely, guys, if you've been on Twitter, on one side, you got people using clawed code and going crazy, and on another side, you literally got people saying, \"I'm never to touch that thing.\" So, it's super super polarized at the moment. It is It is super weird. So, you can see someone else here said, , Notepad is not available in your account, yada yada yada. And then someone said, you want a basic text editor that's been around since 1983. Screw you. We're Microsoft. So, I don't think this is good for the company. Of course, it's not good. I think you need to be able to, of course, change the narrative, you know, work with people, see what people actually do want. Maybe the stats are good. Maybe these tweets are just performative. I don't have access to Microsoft's real-time data. Maybe people are using co-pilot, but him saying that, you know, if we don't get good use out of this, the bubble is going to pop, that doesn't seem like a good sign. So, yeah, I mean, I think this is going to be one of those ones where I think companies will eventually just start to focus on the customer and say, \"Okay, what does a customer want?\" And I think more companies are going to lead towards anthropic approach because anthropic I think they're the only company that thought thoughtfully about what the actual customer wanted and and they of course realized that their customer wanted coding products. So I mean it's super interesting and this is why I say this is how anthropic is winning like anthropic could be one of the major major winners and so I want to show you guys this tweet. So, someone tweeted, \"How did Anthropic ship this before Microsoft 365 Copilot?\" And I mean, it's true. Okay, you have this tool here from Claude where you can literally say, \"Clean up this table's data, yada yada yada, and it will literally edit, you know, this Excel sheet.\" So, I think it's pretty crazy that Anthropic were able to get a tool like this before Microsoft, the creators of Excel. , and as far as I'm aware, you know, please correct me in the comments, there's no feature like this in Copilot where you can have an agent that edits absolutely everything. There is a feature, of course, for Copilot and Excel, but it just isn't as comprehensive as the anthropic features as far as I'm concerned. So, this is why I say it's important that Microsoft talk to their customers as much as possible and actually talk to the community to see what users actually want because like I said, I think Anthropic is the only company that is focusing on what users actually want. I see them regularly having discourse with users",
        "start": 509.199,
        "duration": 1255.6800000000005
    },
    {
        "text": "important that Microsoft talk to their customers as much as possible and actually talk to the community to see what users actually want because like I said, I think Anthropic is the only company that is focusing on what users actually want. I see them regularly having discourse with users other social platforms and interacting with with with communities and stuff like that. And because of that, they're able to get a faster feedback loop on what people actually want. I don't know if Microsoft has feedback groups or what not, but it just seems like Anthropic is the only company that sees what, you know, people actually want and is able to gain such a crazy mind share. Now, like I said before, this is of course purely speculative. Maybe it's just my opinion, but it will be interesting to see how the facts and figures come out in terms of AI adoption in the future. And another thing that I wanted to add as well is that Microsoft renamed Office to Microsoft 365 Copilot app and 400 million users became AI users overnight. Now, I do think that Microsoft will likely turn this around. I do think this is just a blip in the road. Companies do have, you know, hiccups and the AI revolution so far has of course not been a very smooth one. It's very hard to predict the unknown unknowns. So, let me know if you guys use Microsoft 365 Copilot, how good it is, and I'll see you guys in the next",
        "start": 635.44,
        "duration": 1362.0810000000001
    }
]