[
    {
        "text": " It is becoming extremely hard to tell whether or not an image is AI generated. So, I'm making this guide so you can understand 100% the very best methods to actually check whether an image is AI generated or not. I'm actually going to start with the best methods all the way up to the cuttingedge techniques for more advanced power users. So, let's not waste any time. So, one of the first ways you can actually do this is by using Synth ID. Synth ID is a technology developed by Google DeepMind that basically puts these watermarks that are completely invisible into all AI generated images and these watermarks are detectable even after modifications like cropping, filtering or compression. Let me show you guys how you can use this and exactly how it works. This is the first method. So, make sure that you are in Google Gemini because this is going to be how you actually access this tool. Then what you want to do is you want to hit the settings and help. Then go on over to the apps. Make sure you click the apps, then scroll down all the way to the bottom and make sure that synth ID is ticked on. You can see right here it says this is a tool to verify if medias are made with Google AI or not by detecting the synth ID watermark. Now let's go back to the chat. Let's click new chat. Then when you have your AI generated image, just copy that image or upload that image. Then click paste and then ask Gemini, is this image made with AI? Use synth ID. So all you're asking it to do now is to use that tool so it can check if that is made with synth or not. So now remember this is completely free. Google's Gemini is actually free when you choose to use this. So you don't need to upgrade to a paid membership or subscription. So you can see right here that it actually detects that most or all of this image was likely generated or edited with Google AI. And while the tool flags it is AI generated, it tains some visual elements that do look real. But you can see right here that this is clearly an AI generated image. It says that synth ID detected that most or all of this image was likely generated or edited with Google AI. The reason I've shown you guys this first method is because most AI generated images now that are photorealistic are coming from Google AI. So if you want to check about the most realistic photos, this is the method that you should be using. Even if you screenshot an image and I'm going to show you guys here, this was the image that I actually took from Google AI. Actually asked it. There was a super crazy prompt going around. And what I'm",
        "start": 0.08,
        "duration": 265.03799999999995
    },
    {
        "text": "realistic photos, this is the method that you should be using. Even if you screenshot an image and I'm going to show you guys here, this was the image that I actually took from Google AI. Actually asked it. There was a super crazy prompt going around. And what I'm print screen. So that means I'm going to screenshot this image just like a part of the image. And I'm going to show you guys that even if you screenshot the image or crop it, it's still able to detect it's AI generated. So let me just screenshot this. Let's say for a profile picture. Now let's open up a new chat. And then let's say is this image AI generated? So all I've done is just crop the image. So let's say maybe you were online and you saw a profile picture. Now it's going to say you know use synth ID and it's going to check if this image is AI generated or not. So now you can see once again it says I have analyzed the image and I found a digital watermark indicating that most or all of it was edited using Google AI. So once again even though the image was screenshot on a different platform you can still see that you're still able to use Google Gemini's service to be able to tell whether or not an image was AI generated. It's really effective at this. So that's why if you see any photorealistic image and you're unsure just head on over to Google Gemini and use this method. This is the first and the best method for photo realistic images. Now the second method is once again using a very very effective piece of software called content credentials. So this is the pretty state-of-the-art software that allows you to see the actual origin of images and it's a little less good than the first method but nonetheless it's still a very good image because it allows you to tell exactly where that image has come from. So, Google is probably the best, but I'm going to show you guys why this tool is also really, really good as well. So, if you head on over to the link on screen right now, you can see that this is a completely free tool that essentially allows you to drag content to verify and inspect where that content has actually come from. So, let's say I took the image that I made before. You can see that it actually has the metadata from that image. So, I've actually downloaded that image and let's say someone downloaded an image and uploaded it to a website. You can see that on the content summary, it says that this image was generated with an AI tool. You can also see that the Apple device use is Google Media Processing Services. So, you can also see issued by Google LLC. You can",
        "start": 132.959,
        "duration": 512.478
    },
    {
        "text": "and uploaded it to a website. You can see that on the content summary, it says that this image was generated with an AI tool. You can also see that the Apple device use is Google Media Processing Services. So, you can also see issued by Google LLC. You can also has the time of the creation of this asset. And it's really really interesting because it actually shows us where that image has come from. So if your image has a lot of metadata or it's you know been running around the internet, sometimes content credentials can have that information on it. Now that doesn't always happen. Sometimes it just doesn't work because it doesn't have the metadata. But let me show you guys another image with chatbt and what will actually happen. So I actually asked chatbt to create a image that was AI generated and of course I use the other one as pretty much a driving image because it was so realistic. So let's say we have a different image. Now I know that this image is clearly AI generated. It looks pretty AI generated. But let's say we want to test this anyway. So what I'm going to do is I'm going to hit save on this image. Then what I'm going to do is I'm going to upload this to content credentials. Once again you can see that immediately it tells us that this image was issued by OpenAI. It says that it you know is used in chat GPT. And if you go down to the content credential it once again it says OpenAI. So this is really good in terms of generating the data about that image. So you can see it immediately pops up OpenAI and it shows us all of the history used when we're looking at the image. Now a drawback of this platform is that if you do have a screenshot, remember the screenshot that we made before, you can see that the screenshot just doesn't work. This is why I said this method does work if you do have the metadata. But sometimes if you just have a screenshot, content credentials is not going to be able to show you exactly where that has come from. So it's not very good at verifying screenshots. But if you have an image downloaded from that device, this is going to be something that's going to allow you to tell exactly what platform and where it came from. Now, let's move on to the third one. So, the third one is another piece of software that's really, really good. And this is Hive AI. And this is, you know, something that uses an API to scan images, video, text for clear confidence scores. And it's really, really effective even with some kinds of screenshots. So, I'm going to show you guys exactly how this works. So if you just so if you just head on over to",
        "start": 258.0,
        "duration": 758.2370000000002
    },
    {
        "text": "you know, something that uses an API to scan images, video, text for clear confidence scores. And it's really, really effective even with some kinds of screenshots. So, I'm going to show you guys exactly how this works. So if you just so if you just head on over to you can see down here I've already input the image and it will show us exactly how much of that image is AI generated. So you can see right here it comes back immediately with a score. It says AI generated score 0.99 and it's a confidence interval between 0 and one. So you can see right here GPT image 1.5. This image was actually generated with GPT image 1.5. So if you're using images from OpenAI, it will be able to do that. I don't know why it says Quinn right here. And you can see all of these other tags. You can see 00 values. Once again, if we take that other guy, the other image that we did have, you input that image. You can see once again it comes up with AI generated. This input is likely to contain AI generated or deep fake content and it also comes up with the GPT image_1 tag. And this is actually the GPT image model. So this is something that is remarkably effective. But once again, remember how I said that cropping an image of a screenshot does show us that sometimes we get edge cases. This is the same profile picture used on Hive AI on Hive Moderation. And on the previous images where we did have that, you know, confident score, we can see that this one which we know is AI generated. And while it does look real, you can see here that it says the input is not likely to contain AI generated deep fake content. So if you have an image that is somewhat cropped that it you know looks like the image wasn't you know entirely done or it might be a little bit you know blurry even if you put it into you know either content content credentials or you put it into Hive AI those two systems won't be able to tell the only system that will be able to tell is of course Google synth ID. So if you have an image that looks like this one that is somewhat cropped and you're unsure of the resolution you can get a false confident score. So if you're on the edge, you cannot trust that image 100%. Even if it says 8.2%. But once again, it isn't 8.2%. So it isn't, you know, you know, extremely extremely high. We can see here that this is just what you could say a false confidence score. Now, one of the fourth methods that just isn't talked about that well is, of course, reverse image search. Now, I'm not going to talk about this for too long, but this is a very",
        "start": 382.479,
        "duration": 1008.5580000000003
    },
    {
        "text": "can see here that this is just what you could say a false confidence score. Now, one of the fourth methods that just isn't talked about that well is, of course, reverse image search. Now, I'm not going to talk about this for too long, but this is a very should be in the public eye that aren't in the public eye. An adverse image search allows you to basically quickly check the origin of that image. And I find it's really useful because sometimes you'll find, you know, a random profile of a real person or something where you can just basically tell that the image is real. So basically, you want to come over to Google images search and then you want to hit this search by image. Then you want to upload whatever images is that you have. Now, of course, if I upload this image, you're going to see that nothing appears. And this is where you can see that, you know, results for this people are limited. So, it's quite likely that this person is fake. Of course, this isn't, you know, the best method to check if an image is AI generated or not, but if you're talking with someone that is maybe has a bit of notoriety, maybe they seem like they're a public figure, it really should be having some exact matches or some references that should show you where the origin of that image is. Usually, if you have an image, it will show you where that image is from and the fact that that image is not AI generated. So if you see an image online of a celebrity or something that claim claims to be real but you put it into here and there is no kind of you know origin story for this image then it's quite likely that when you get zero results it probably means that that image is AI generated. So whilst visually it can be difficult to check if there are no exact matches or visual matches then it's quite likely that the image is probably AI generated. So do be careful about that. Now, the next one here is relatively easy, but it's also something that most people miss, and this is blurred object or text. Now, for most of you guys, what you're going to want to do is to check the text because blurred objects sometimes are difficult to distinguish because not everybody has a perfect rendition of how an object is supposed to look in an image. So, what you ideally want to do with images is you want to scrutinize the details. I'm going to show you guys exactly how we can do that with Try GBT and GBT image one. So, this is an image that I generated with Nano Banana Pro, Google's image model. And I said, generate an image of New York's Times Square billboards. And now, if we actually",
        "start": 509.68,
        "duration": 1250.7990000000013
    },
    {
        "text": "going to show you guys exactly how we can do that with Try GBT and GBT image one. So, this is an image that I generated with Nano Banana Pro, Google's image model. And I said, generate an image of New York's Times Square billboards. And now, if we actually going to be able to see that. Okay, this looks pretty cool. Now, there's actually an issue that most people would realize. So, if I rightclick this and open image in tab, it's going to give me a higher resolution of the image. Now, if I want a complete resolution of the image, I can download the full thing. But if I'm on Instagram or if I'm on Twitter, most people will just look at an image and then scroll past. If there is any kind of text or objects in the back, ideally, what you want to do is zoom in as much as possible. So, when we zoom in, I'm going to show you guys now. What tends to happen is things tend to break down. And so, when we look at the images here, we can see that the text here starts to blur. All of these, you know, individuals, they start to blur together. But if you zoom out, it does look fine. But as soon as you zoom in and you start to scrutinize that text, it just doesn't make any sense. So here, this text is not legible. It doesn't make any sense. The only thing that does make sense is of course the big numbers, happy new year. So you can see right here as well, if we zoom into this text all the way over on the right, we can see that once again, this text just doesn't make sense. So you have to understand that once you zoom into these images, they start to break down and they're not like traditional images that make sense at a granular level. AI generated images, they just blend things together. They don't kind of really understand all the time. So it's important to understand that if you're really trying to gauge whether or not an image is real, if there is any sort of text or objects, zoom into them and then on the microscopic level, they should still hold up. And I want to show you guys that even with the highest resolution, I downloaded the 4K version and even if you zoom in, I think it's even worse. So, with this high resolution, we can zoom in and we can see that that text, it doesn't even make any sense whatsoever. Even the faces, you can see that they're a bit, you know, just messed up and blurred. You can see that, you know, what is this? Is this merging with the text that's coming out of the, you know, screen there. A lot of it is just absolute nonsense. And I, you know, deliberately chose this",
        "start": 632.8,
        "duration": 1477.359000000002
    },
    {
        "text": "that they're a bit, you know, just messed up and blurred. You can see that, you know, what is this? Is this merging with the text that's coming out of the, you know, screen there. A lot of it is just absolute nonsense. And I, you know, deliberately chose this chaotic. There's a lot going on. So, of course, in certain images, it's not going to be as easy, but in certain images, it very well is going to be easy once you see all of the finer details. Like, you can see someone's finger here, it just goes missing. You can see that if you look at the, you know, traffic light here, it just doesn't make sense. There's also something random here. This text doesn't make sense. I mean, of course, this is an image that, you know, if you're scrolling by, you might think is real until you zoom in and you check the details. Now, the last one here I'm going to give you guys is basically skin texture and image composition. So, one of the things you can do is you can zoom into images and you can essentially look at the skin and if it is too smooth across the board, it is quite likely air generated. So, if I actually just open this image in a new tab. Now, if I basically zoom in here, you're basically going to see flawless skin and often times human skin is never perfect. Now, I do know that of course some, you know, Photoshop campaigns or whatever online, people are going to airbrush their pictures or yada yada yada, but the point here is you're trying to distinguish whether or not an image is completely AI generated. Now, in this specific example, it's probably not a good example because it's a photo shoot. But the point here is that most people have some sort of imperfections, some sort of tiny tiny giveaways. If you look back to the earlier picture, the reason that we can tell that this picture is just AI generated is because often the skin just looks super super smooth and uncanny. Often what it just is as well is that you will see pictures, especially after looking at many AI generated pictures, you'll be able to train your brain. Now, of course, this isn't like a thing that you're going to always be able to do in the future, but often times most of those cheap AI generated photos, they just have really, really poor skin texture. So, try to look at the smooth bits just to seem a little bit way too smooth and a little bit too airbrushed for a standard photo. And that's going to help you out a",
        "start": 747.76,
        "duration": 1706.6390000000024
    }
]