[
    {
        "text": " How do you know if an image is AI generated? Yesterday, Google released Nano Banana Pro and it blurs the line between artificial intelligence and reality. So, in this video, I'll show you guys exactly how you can detect whether or not those images were generated by AI or are actually based in reality. So, in this video, I'll be showing you guys exactly how you can use Sinth ID, which is essentially Google's AI watermark detection tool, which is built into every AI generated image that comes from Google's products. Note that this will only work for AI generated images that comes from Google products and it can't necessarily verify images that come from other image generation services like OpenAI or other open-source alternatives. I came across this image prompt online and it's really cool. It shows you a picture of a girl that is actually AI generated. Now, we know this because we have the entire prompt here, but there are tons and tons of images that are flooding social media that we don't know whether or not they're AI generated. And sometimes we have to do a double take. So we can always check that. So we can copy the image and of course we want to be signed into Google Gemini. So when we paste in the image, this is where we are then going to input the prompt. We're going to ask Google Gemini, is this image AI generated? Now in order for you to actually get the right response, it doesn't matter if you have fast or thinking through with pro, but you do need to be signed in so that you can access synth ID. I'm not sure why this is the case, but just make sure that you're signed in so that way it will work properly. Now, if we hit submit, what you're going to want to do is just give it a second. Now, we can see that it actually tells us that this image is AI generated. If we hit the quick dropown menu, we can see that it says analysis query successful and synth ID query successful. So, the synth ID query is essentially it's running it through Google's watermark software detection system. That's going to ensure that the images are quickly checked for that digital watermark before providing back the response. It's not just going to do a fundamental image analysis. it's actually going to use the software that Google made and essentially put into every image. Now, what's important to note that this even works if you screenshot the image. It even works if people try to edit that image. So, this is a really robust tool. So, I would say considering the internet is moving at an incredibly fast pace, definitely add this to your arsenal of things that you probably do want to be doing, provided you're spending an extended amount of time on the",
        "start": 0.16,
        "duration": 274.1599999999999
    }
]