[
    {
        "text": " So, Anthropic just fired shots at OpenAI and we have to talk about this. So, Anthropic released this advertisement saying that ads are coming to AI but not to Claude. Keep thinking. And this was super interesting because this is arguably one of the first times that we're visually seeing Anthropic, another major AI lab, take shots at OpenAI. So, this is just one of the clips that they posted. And I'm not going to lie, it is a pretty funny ad on how ads could be in chat GPT and other AI platforms. But, this is something that I want to show you guys. They released, I think, four different versions of these, but I'm just going to show you one and then I'm going to dive into all the information you need to know. How do I communicate better with my mom? Great question. Improved communication with your mom can bring you closer. Here are some techniques you can try. Start by listening. Really hear what she's trying to say underneath her words. Build conversation from points of agreement. Find a connection through shared activity, perhaps a nature walk. Or if the relationship can't be fixed, find emotional connection with other older women on Golden Encounters, the mature dating site that connects sensitive cubs with Roaring Cougars. What would you like me to create your profile? What's the difference between me and you? And you of course as you know this is a direct shot at OpenAI because they're saying that ads are coming to AI but not to Claude. The only other company that said that they're adding ads to AI is of course OpenAI. And they literally said, you know, I think two weeks ago that in the coming weeks, we're starting to test ads in Chat GBT in the free and go tiers. And we're going to share our principle on how those ads are. Now, like I said, this is super interesting because now, like I said, this is super interesting because for the first time, we're seeing a company like Anthropic actually fire shots, and they seem to be, you know, a little bit of a tame company, but now it seems like they're actually going on the offensive coming at OpenAI. Now, the reason I've included this screenshot in here is because, of course, Anthropic is basically marketing this, saying that look, if there are going to be ads on your AI platform, that AI platform is going to just be absolutely terrible, and of course, you clearly don't want to use it. However, OpenAI have clearly stated that ads in their platform are going to be pretty interesting. They've said that they're not launching ads yet, but they do plan to start testing them in the current weeks for logged in adults in the United States on the free and go tiers. And they're basically going to be at the bottom of the response. And they state,",
        "start": 0.16,
        "duration": 298.79799999999994
    },
    {
        "text": "interesting. They've said that they're not launching ads yet, but they do plan to start testing them in the current weeks for logged in adults in the United States on the free and go tiers. And they're basically going to be at the bottom of the response. And they state, labeled and separated from the organic answer. So, of course, the advertisements basically make it seem like, you know, in the middle of your answer, you're probably going to get your conversation manipulated in a way which just tells you what product to use, but that isn't in reality how advertisements are actually going to pop up. If you actually want to know how chat GPT ads are going to pop up, this is exactly how they are going to pop up. So, let's say for example, you have a query. And by the way, this is just how they're rolling out now. Of course, this is all subject to change. It's all all, you know, it's all in the air of of how things are because as we know AI when it's rolled out, we know that it's literally the first time. So, it could be changed multiple different times. And so, this I think is actually good because if you roll out ads any other way, it's just going to have a complete backlash because people are just going to not trust it at all. So, rolling out like this where it's at the bottom and it's just related to your conversation. I think this is something that is probably pretty useful that most people can use and at least for the sake trust that it's not, you know, manipulating their conversation in any absurd way. Now, you can see here that, you know, I'm not the only one stating that shots are fired at OpenAI. The Verge literally said that, of course, although OpenAI isn't named, the ad is a clear jab at the company, which recently announced that it would bring ads to Chat GBT. And OpenAI I'm I'm intrigued to know what OpenAI's own Super Bowl ad is going to be. Now, Anthropic didn't just do this out of nowhere. They actually released a blog post in which they explain exactly why they are doing this and they explained exactly what the ads are for in terms of like why they're not adding them to the platform. And they say there are many good places of advertising, but a conversation with Claude apparently is not one of them. Now, they also say here that, you know, in you know, it's basically incompatible with what Anthropic want to do. They say including ads in conversation with Claude would be incompatible with what we want Claude to be a genuinely helpful assistant for work and for deep thinking and that sounds really honorable. They also say that conversations with AI assistants are meaningfully different. The format is open-ended. The user often shares",
        "start": 159.04,
        "duration": 531.2769999999999
    },
    {
        "text": "including ads in conversation with Claude would be incompatible with what we want Claude to be a genuinely helpful assistant for work and for deep thinking and that sounds really honorable. They also say that conversations with AI assistants are meaningfully different. The format is open-ended. The user often shares in a search query. This openness is part of what makes conversations with AI valuable, but it also is what makes them susceptible to influence in ways that other digital products are not. I do agree with that. Now, I think one of the things that they're basically saying here, okay, as you continue to read this, is that it's basically just doesn't align with their values. They're essentially saying that look, we understand that ads might be a profitable business, but in order for us to keep our end of the deal and our brand intact, we [music] cannot introduce ads. You can see here it basically says that look, your conversations are extremely personal and those are the conversations that you would have with a trusted adviser. And of course, because of that, the appearance of ads in those contexts would feel inongruous. and in many cases appropriate. And so here's where they're basically saying that look, users are probably going to second guess whether an AI is genuinely going to be able to help them or quietly steering the conversation towards something monetizable. I think what Anthropic are doing here, they are basically putting their bet on longevity of their brand. Basically saying that look, open eye are going to rush ads and sure maybe they might make a bit of money, but we are going to stay the number one app that you can trust and you can use that you know is going to give you the actual answer. And slowly but surely over time as people continue to eventually use Claude and stick with Claude eventually they will win in the endgame. That is what I believe they are doing. And they're basically saying that look as long as we prioritize the customer which is I think a great company policy. If you've read certain business books you know that Amazon is one of the most you know idolized companies because all they really did was they focused a ton on the customer. That's all they ever did. And at one point they were the most you know valuable company in the world. And I think companies that just focus on the customer experience, those are companies that usually do win in the long term. So they're basically saying that look, we don't want users second guessing our queries wondering whether or not the query is leading towards them something that is monetizable. And that does make sense. And they're basically saying that look, if we, you know, introduce ads, it's basically going to keep people on the platform for longer. And that basically means that it's going to have",
        "start": 277.52,
        "duration": 761.5980000000002
    },
    {
        "text": "whether or not the query is leading towards them something that is monetizable. And that does make sense. And they're basically saying that look, if we, you know, introduce ads, it's basically going to keep people on the platform for longer. And that basically means that it's going to have introduce an incentive to optimize for engagement over clarity. And we've already seen what happens when you do that with the psychopanty of the chat bots. And so I think of course they don't want to run that risk again. And so if you're wondering, okay, so Anthropic are basically saying that look, we're not going to make money through ads. How do they make money? They said that look, we generate revenue through enterprise contracts and paid subscriptions and we invest that revenue into improving Claude for our users. And this choice is a trade-off and we respect that other AI companies might reasonably reach different conclusions. Now, if you're wondering what you know if this is a good business choice, I mean it is incredibly risky. The reason that I will say that this is incredibly risky and the text it doesn't mean to say perverse incentives, but the reason I think this is incredibly risky, I mean short-term is because of course [music] these companies are, you know, currently at the moment not making as much money as they should be. That's fair enough. The companies are fairly new and the industry is fairly new. But I will say that if there is a way to introduce ads into the platform that is, you know, fine and people actually like it. How are anthropic going to be able to then justify that in the future? I'm not saying they're going to add ads. I'm just saying that like, you know, running this ad campaign where you're like, you look, we're never going to add ads. We're so much above ads. That's a bit risky because we don't really know what the future of the holds and maybe there's going to be certain ads that people actually might even want. Okay? Okay, I know that sometimes when I use, you know, Instagram and I'm looking for certain things, I've actually found products that have actually helped my daily life and it's been tremendously useful. And another thing that I was wondering, okay, I was basically wondering, okay, so what is the math on all of this? Because all of these companies at the end of the day, their goal is to turn a profit, right? And the thing is, okay, is that if Open actually does turn on ads, they're actually going to be a money printer. And this is why I'm saying, okay, that maybe Anthropic may change their mind. Now, of course, I could be completely wrong about this prediction. Of course, it is just a prediction, but I think that OpenAI could make an insane amount of money from ads. Think about like this, okay?",
        "start": 394.8,
        "duration": 976.2390000000004
    },
    {
        "text": "this is why I'm saying, okay, that maybe Anthropic may change their mind. Now, of course, I could be completely wrong about this prediction. Of course, it is just a prediction, but I think that OpenAI could make an insane amount of money from ads. Think about like this, okay? there are so many different tech companies, okay? And Google and Meta completely dominate the space. But if projections go correct, okay, OpenAI could pull in $88 billion a year in ad revenue. And you have to figure out how the customers are. So, Facebook makes $50 per year per user from ads, okay? And Google search makes even more per year per user because people are typing in exactly what they want. But think about like this. OpenAI ads could be even stronger because when you ask what's the best laptop for editing, OpenAI is not going to guess. You literally tell it what to sell you. So that is going to make ads more useful, more likely to get clicked and more valuable to advertisers. Which means that advertisers are going to pay more per ad than on Facebook. And if you do some simple money math, okay, Open Air has a billion users, 900 million C ads, that makes $60 per user. If we just say that it's a little bit more than meta, that's 50 plus billion a year from ads. And if they nail it like Google, that might be in the bull case to 90 billion a year. Now, think about it like this. If OpenAI gets it right, the ads wouldn't just be shown. They could book flights. They could buy software. They could hire services. Ads could become entire actions and not just banners. So, think about it. OPAI could actually have less users than Meta and Google, but they could make money more per user than anyone else because they've got Google level ads with an incredible amount of scale. Now, of course, this is all, you know, hinged on whether or not OpenAI is actually growing their user base and people actually do trust the platform. That is, of course, the big thing. And if you're wondering about what people are saying, people are saying that, wow, they are going for the jugular. That's, you know, talking about anthropic going for OpenAI. And of course, someone says, and so you can see here, Alex Finn said, the most savage commercial I've ever seen. It dismantles open air in so many ways, attacks their psychiat, and the blatantly silly move of putting ads into chat. All while Opus has been the best air model for a full cycle now. Anthropopic are on a generational",
        "start": 504.0,
        "duration": 1190.5600000000002
    }
]