[
    {
        "text": " Nvidia is going big on quantum computing, so let's talk about it. So, I'm not going to give you guys a crazy quantum physics lecture, but I'm just going to try to explain this as quick as possible in a way that actually makes sense. So, most people might not know the details of why quantum computing is important and why Nvidia are actually moving into this paradigm. And I'm going to give you guys this quick explanation. So, you know how the computer that you might be watching this on now, your phone, your laptop, whatever, all of these things works on bits. And these bits are basically the smallest piece of information that a computer can handle. And it's either basically a zero or a one. And it's like a light switch. It's either on or off. And your computer does billions of these little switches flipping back and forth every second. And to do, you know, they need to do these things from streaming to running that spreadsheet that your boss keeps asking about. Now, quantum computers, they use something called cubits. And this is the craziest thing. A cubit can be 01. And this is the craziest part. It can be both at the same time. Now, I know it sounds like nonsense. But how can two things be same at once? Well, let me give you guys the perfect analogy so that you'll understand quantum computing completely. And why in videos doing the craziest stuff they are? Imagine you're trying to find your keys. With a regular computer, you're searching your house one room at a time. In the kitchen, no, it's not there. In the living room, no, it's not there in the bedroom. There they are. And that actually takes time because you're checking each room one by one. Now, a quantum computer is like having a clone of yourself that can search all the rooms at the same time. And then you find those keys way faster because you're checking everywhere simultaneously. That's the power of being in multiple states at once. And it's what scientists [music] call a superp position. But here's the catch, and there's always a catch, right? Cubits are incredibly fragile. Like really fragile. They're so so sensitive that if you look at them wrong, they basically fall apart. They need to be kept at temperatures colder than out of space. We're talking -450° F. That's colder than the vacuum of space between stars. One little vibration, one tiny bit of heat, and boom, your calculations are garbage. And this is where Nvidia comes in with their new thing, NVQ Link. But we'll get to that in a minute. Let me explain why we even want these quantum computers in the first place. Well, why quantum computers matter? The problems they can solve. So, why are we going through all of this trouble with super delicate, super expensive quantum computers? What is even the point? Well,",
        "start": 0.08,
        "duration": 263.04
    },
    {
        "text": "in a minute. Let me explain why we even want these quantum computers in the first place. Well, why quantum computers matter? The problems they can solve. So, why are we going through all of this trouble with super delicate, super expensive quantum computers? What is even the point? Well, computers, even the most powerful supercomputers, we have basically suck at. These problems would take regular computers thousands or even millions of years to solve. But quantum computers could potentially solve them in hours or days. Let me give you guys some real world examples. Well, drug discovery. Imagine you're trying to design a new medicine. You need to figure out how the different molecules will interact with, you know, each other and your body. The number of possible combinations is pretty insane. We're talking trillions upon trillions of possibilities. A regular computer would take forever to simulate all of this. But a quantum computer could test all these combination at once. remember searching all random rooms at the same time. This could literally mean curing diseases faster and saving lives. There's also climate modeling. If we want to predict how climate change will affect specific regions over the next 50 years, regular computers can give you rough estimates. But the weather and climate systems are so complex with so many variables that perfect predictions are basically impossible. But quantum computers could process all those variables simultaneously and give us much better predictions, helping us prepare for and maybe even prevent the disasters. And of course, quantum computers can help with banks and investment firms with mind-bogglingly complex calculations every single day. Portfolio optimization, figuring out the best way to invest money across thousands of different assets. It's actually incredibly hard. And quantum computers could optimize these portfolios in real time, saving billions of dollars. And the best thing, okay, and I don't know why I didn't talk about this first, but this is of course AI. Okay, training models like Chat GBT and the AI that recommends you your Netflix show requires processing massive amounts of data. The bigger and better we want our AI to be, the more data we need to process. Quantum computers could potentially train AI models much more than what we have now. We're talking about AI that could solve scientific problems, design new materials, or understand human language in ways that we can't even imagine yet. The big problem, why quantum computers are basically useless without help. So, remember how we just discussed that cubits are fragile? Well, that fragility creates a huge problem. Quantum computers make mistakes. They make a lot of mistakes. Like, imagine if every time you typed your keyboard, there was a 1% chance that the wrong letter would appear. That might not sound like much, but if you're writing a novel, you'd actually end up with total gibberish. For quantum computers, these errors pile up fast. Scientists call this quantum error correction, and it's one of the",
        "start": 131.68,
        "duration": 530.64
    },
    {
        "text": "keyboard, there was a 1% chance that the wrong letter would appear. That might not sound like much, but if you're writing a novel, you'd actually end up with total gibberish. For quantum computers, these errors pile up fast. Scientists call this quantum error correction, and it's one of the To fix these errors, you need to constantly monitor and correct what the cubits are doing. And we're not talking about checking once a second. We're talking about microsconds. That's millions of a second. But here's the thing. Quantum computers aren't good at correcting their own errors. It's like trying to proofread your own essay. Well, you wrote it, so you might not notice the mistakes. What quantum computers need is the help from regular computers. Really [music] powerful regular computers to watch what they're doing to fix those errors in real time. And not just any computers. We're talking about AI supercomputers, the kind that run advanced AI algorithms to predict where errors will happen and correct them before they ruin everything. This is where things have been stuck for years. Scientists have had quantum computers over here doing their quantum thing and AI supercomputers over there doing the AI thing. But there wasn't a good way to connect them both. It's like having a Formula 1 race car and a worldclass pit crew, but the pit crew is in a different state. The car can't perform without the pit crew making adjustments. But if the car has to drive to another state every time it needs an adjustment, it's never going to win that race. What we needed was a way to connect a quantum computer and AI supercomputers so tightly, so quickly that they could work together as if they were one single system. The errors needed to be caught and fixed in microsconds, faster than the blink of an eye. And that's what Nvidia just built. Enter Nvidia's NVQ Link, the game-changing bridge. On October the 28th, 2025, Nvidia CEO Jensen Hong stood on their stage at the GTC conference in Washington DC and unveiled something he called the Rosetta Stone of Computing. He called it NVQ Link. Now, before your eyes glaze over at another tech acronym, let me explain what this does in plain English. We now realize that it's essential for us to connect a quantum computer directly to a GPU supercomput so that we could do the error correction so that we could do the artificial intelligence calibration and control of the quantum computer and so that we could do simulations collectively [music] working together. the right algorithms running on the GPUs, the right algorithms running on the QPUs and the two processors, the two computers working side by side. This is the future of quantum computing. NVQ link is basically a super highway connection between quantum computers and Nvidia's AI supercomputers. But it's not just any connection. It's insanely fast and incredibly smart. Think of it like",
        "start": 266.72,
        "duration": 820.24
    },
    {
        "text": "QPUs and the two processors, the two computers working side by side. This is the future of quantum computing. NVQ link is basically a super highway connection between quantum computers and Nvidia's AI supercomputers. But it's not just any connection. It's insanely fast and incredibly smart. Think of it like game, but every time you press a button, there's a 5-second delay before your character moves. That game would be unplayable, right? Now, imagine that delay is cut down to a thousandth of a second, so you don't even notice it. That is what NVQ Link does for quantum computers. So, here's what makes it special. It's got lightning fast communication. NVQ Link connects quantum processors directly to Nvidia's GPUs with incredibly low latency. And latency is just the fast word for the delay. In this case, we're talking about microcond delays. This means that the AI supercomputer can monitor the quantum computer and fix the errors almost instantly. There's also real-time error correction. This is the secret source. Nvidia's GPUs are running sophisticated AI algorithms that watch the quantum computer like a hawk. The moment an error starts to happen, even before it fully happens, the AI can step in and correct it. It's like having a spell checker that fixes typos as you're typing them and not after. And it's also open and universal. Now remember this isn't just one type for one type of quantum computer. It's an open platform that works for different quantum technologies. There are companies building quantum computers with superc conducting cubits, others using trapped ions, some using photons and others using completely different approaches. NVQ link works with all of them. Nvidia announced that 17 different quantum computing companies and nine major US national laboratories are already on board and it also combines the best of both worlds. Quantum computers are great at certain type of problems. Remember that searching all rooms at once thing, but they're terrible at others. Regular computers are the opposite. And NVQ Link lets researchers write programs that seamlessly use both types of computers for different parts of the same problem. It's kind of like having a toolbox where you can easily switch between a hammer and a screwdriver depending on what you need. Jensen Huang said something that really stuck with me. In the near future, every Nvidia GPU scientific supercomputer will be hybrid, tightly coupled with quantum processors. What he's saying is that the supercomputers of tomorrow won't just be quantum or regular. They'll both be working together as one unified system. Why this matters right now? Okay, so Nvidia built this fancy bridge between quantum and AI computers. Cool. But what does that actually mean for the real world? What can we do with that that we couldn't do before? Well, remember how we talked about certain things in the beginning, like drug discovery? Well, researchers at places like Berkeley Lab and MIT are now able to use MVQ Link to stimulate",
        "start": 413.44,
        "duration": 1097.6800000000005
    },
    {
        "text": "that actually mean for the real world? What can we do with that that we couldn't do before? Well, remember how we talked about certain things in the beginning, like drug discovery? Well, researchers at places like Berkeley Lab and MIT are now able to use MVQ Link to stimulate interact. This might sound boring, but protein folding is the key to understanding diseases like Alzheimer's, Parkinson's, and cancer. With NVQ Link powered systems, they could potentially discover new treatments in months instead of decades. Better AI models. A team at Yale University used Nvidia's quantum AI hybrid system to create something called a quantum transformer. Don't worry about the name. What it matters is just what it does. They're using it to generate new molecules with specific properties. Imagine being able to design a material that's stronger than steel but lighter than plastic or a new battery material that makes your phone last a week on a single charge. The AI can now explore possibilities that were literally impossible to compute before. There's also climate science. Pacific Northwest National Laboratory and Oakidge National Laboratory are using NVQ Link to run climate models that are way more detailed and accurate than anything we've had before. This could help us understand exactly how climate change will affect different regions and what we can do about it. What this means for the artificial intelligence revolution. All right, so this is where things get really exciting and maybe a little bit scary. Let's talk about what NVQ link and quantum AI hybrid systems mean for artificial intelligence. [music] You see, right now AI is everywhere. It's in your phone. It's in your car. It's in your smart home devices, the websites you visit, the ads you see. Chat GBT can write essays. Darly can create images. AI can diagnose diseases from medical sands and so on. But here's the thing. We are actually hitting some AI wars. Training large AI models requires an insane amount of computing power and energy. Training GPT4, for example, reportedly cost tens of millions of dollars and used enough electricity to power a small town for weeks. And to make AI better, we need to make it bigger, which requires even more computing power, which costs even more money and energy. This is not sustainable. We can't just keep building bigger and bigger data centers and consuming more and more electricity. We need a more efficient way. Enter quantum AI hybrid systems powered by things like NBQ. This could give us exponentially faster training. Certain parts of AI training like processing huge data sets or finding patterns in complex data are exactly the type of problems quantum computing excels at. With NVQ Link connecting quantum processes to AI supercomputers, we could potentially train AI models in hours that currently take weeks or months. And this doesn't just save time and money. It opens up possibilities for AI models that are way more sophisticated than what we have",
        "start": 553.68,
        "duration": 1380.8780000000006
    },
    {
        "text": "computing excels at. With NVQ Link connecting quantum processes to AI supercomputers, we could potentially train AI models in hours that currently take weeks or months. And this doesn't just save time and money. It opens up possibilities for AI models that are way more sophisticated than what we have handle massive data sets. Right now data we can feed into AI models for training. More data usually means better AI, but at some point, regular computers just can't process it all efficiently. Quantum computers can process enormous amounts of data simultaneously. Imagine training an AI on every medical research paper ever written, every patient record, and every clinical trial all at once. The medical AI we could create would be incredible. The concerns, it's not all sunshine and rainbows. Now, I'd be lying if I said that this was all positive. Whenever we have a major technological breakthrough, there are always concerns and potential downsides. So, let's actually just address these head-on. Well, one of the first ones is job displacement. And we've spoken about this numerous times on this channel. If AI becomes exponentially more powerful, it's going to be able to do basically any job that humans could do. We're not just talking about routine tasks here. We are talking about creative work, analytical work, scientific research. This could displace a lot of researchers and a lot of jobs. And history does show us that technology creates new jobs and there's always a transition that can be extremely rough for people. But this time might be different. The rich are going to get much richer. Right now, quantum computers cost tens of millions of dollars. And Nvidia's GPUs aren't cheap either. And this technology is going to be accessible to big tech companies, governments, and major research institutions, but not everyday people or small businesses, at least not at first. And this could widen the gap between those who have access to cutting edge technology and those who don't. And there's also security risks. Now, this is a crazy concern. Like [music] remember, quantum computers can potentially break encryption, and it's still a big concern. Once the quantum computers become powerful enough, they could potentially crack the encryption that protects everything from our bank account to government secrets. And scientists are actually working on quantum resistant encryption. But that's actually a race against time. Now, here's another thing. We don't fully understand it yet. You know, even this is an uncomfortable truth. Even the scientists working on the stuff don't understand all the implications of quantum hybrid systems. We're essentially building tools that are more complex than our current understanding. It's like giving a toddler a chemistry step. Sure, they might make something cool, but they also might cause an explosion. And there's also the timeline confusion. Jensen Huang himself has said that practical large scale quantum computing is still probably 15 to 30 years away. So whilst NBQ link is a major breakthrough in connecting quantum",
        "start": 697.279,
        "duration": 1658.1590000000006
    },
    {
        "text": "step. Sure, they might make something cool, but they also might cause an explosion. And there's also the timeline confusion. Jensen Huang himself has said that practical large scale quantum computing is still probably 15 to 30 years away. So whilst NBQ link is a major breakthrough in connecting quantum to see quantum computers replacing your laptop anytime soon. There's a risk of overhyped disappointment if people expect miracles overnight. That said, I don't expect that these concerns should stop us from developing",
        "start": 838.16,
        "duration": 1683.3570000000007
    }
]