[
    {
        "text": " So, Opus 4.6 is arguably the best LLM right now, and I'm going to be showing you guys every way that you can get the most of this as a complete beginner. So, let's dive in. Now, one of the first things that you need to do is you need to hit your account, then hit your settings, then you want to go down to usage, and then once you're on usage, you want to be able to claim your free $50 worth of credits. Most people haven't realized that Anthropic is sort of running a promotion where you can claim some credits with the new Opus 4.6. So, make sure that you claim these before you start using the Opus 4.6. Another thing is that Opus 4.6 as well. There's of course two versions. If you've got Opus 4.6 standard and Opus 4.6 extended thinking. Of course, if you're a beginner using extended thinking, it's basically the method where the AI is going to take extra time to plan, reason, and doublech checkck the work before giving you an answer. As a beginner, you should not use extended thinking to do everyday tasks because it is just more expensive in terms of token usage. You know, for simple facts, creative brainstorming. For everyday usage, just use Haiku 4.5. But Opus 4.6 extended thinking that is for where you have complex coding, multi-step planning, math and science, and you've got high stakes with accuracy. If you need to get something completely right, and that is more important than your actual speed for the task, for example, legal analysis or financial modeling, the extra time reduces the chance of hallucinations making things up. So, in this guide, understand that extended thinking is basically the most extreme version of Opus 4.6. And those are the instances where you would likely benefit from the extra raw intelligence power. Now, I've done some research and I have found that Claude Opus 4.6 actually takes the number one spot on the EQ bench. And this is a significant milestone because it means we understand now what kind of things we should use for Claude Opus 4.6. And the EQbench essentially means and it measures the active emotional intelligence. It forces the AI into challenging multi-turn role plays like involving a heated relationship conflict or mediating workplace dilemma. And this scores on empathy. Does it genuinely understand how someone is feeling? Social dexterity, psychological insight. Does it understand and recognize the underlying reasons behind a charact's behavior? Now, you have to understand that when you're using Opus 4.6, this metric is super useful for beginners because you might think that emotional intelligence is just therapy for AI bots, but this actually means that certain everyday tasks are going to be much more effective. Before we dive into coding, because it does make the coding a lot better, one area that it's going to perform really well at is, of course, advanced creative writing. Standard AI",
        "start": 0.0,
        "duration": 283.91900000000015
    },
    {
        "text": "for AI bots, but this actually means that certain everyday tasks are going to be much more effective. Before we dive into coding, because it does make the coding a lot better, one area that it's going to perform really well at is, of course, advanced creative writing. Standard AI writing stories, but with a high EQ bench, this enables OPU 4.6 to write characters with realistic, complex emotions rather than one-dimensional stereotypes. In addition, for those of you who want to use this in your day-to-day work life, this can be extraordinarily useful for professional communication. IEQ makes the AI a better collaborator in your career. So, for example, use Opus 4.6 standard if you want to draft an email. If you need to send a particularly difficult email like a delicate resignation or a firm rejection, a high EQ model is much better at hitting the right tone. Firm but respectful so you don't burn bridges. And of course, you can describe a realworld problem that you may have to the AI and it can help you see the other person's perspective, helping you prepare for a tough conversation. And considering that Opus 4.6 is now number one in this category if you do have any difficult and I mean extraordinarily difficult social interactions at work or in your career this is probably going to be the model that you do want to use. So for beginners Opus 4.6 for professional communication for conflict resolution for nuance and advanced creative writing this is going to be the number one creative model. Now if you're a beginner and you do want to code such as vibe coding I would suggest that you do use lovable. And the reason I would suggest that with Opus 4.6 Six is because Lovable have added Opus 4.6 to their platform. And if you don't know what that platform is, it's basically a complete factory that turns your ideas into live products. When you code directly, even with AI help, you have to manage a development environment. And this involves installing a code editor, setting up a terminal, and managing files. You have to learn how to use Git. But because of course you might be a beginner or someone who's completely non-technical, Lovable allows you to have a completely hosted platform where you type in a prompt and you instantly build live URLs for your app. It manages completely everything backend, database, and hosting automatically behind the scenes. And so whilst yes, you can actually do this in the standard chat window, it just simply isn't as flexible as lovable. So I'm going to show you guys with Opus 4.6 how I can quickly vibe code something. You can see here I've said build me a landing page that is for my brand called the AI grid. It's for an email list. Delivers AI news without the bluff. Black background, grid background, purple theme, tech, but minimalistic. And now Opus 4.6 is",
        "start": 142.56,
        "duration": 546.8000000000002
    },
    {
        "text": "can quickly vibe code something. You can see here I've said build me a landing page that is for my brand called the AI grid. It's for an email list. Delivers AI news without the bluff. Black background, grid background, purple theme, tech, but minimalistic. And now Opus 4.6 is you up something within around 1 to 2 minutes. So, here you can see it vibe coded this simple landing page. And I know that this isn't the most complex thing for and I know that these and I know that this isn't the most complex thing. I could have done a lot more to make this a lot more complex, but I just wanted to show you guys that as a beginner, you can of course do this in the simple chat window, but using something like lovable is just going to get you a step further. And if you are a complete beginner who's nontechnical, this is going to be something that is just super useful to you. Now, Anthropic recently released a swarm feature. Now, if you're a beginner, you probably won't use this feature, but for those of you who are a little bit more technical, this moves beyond a single AI chat towards a coordinated group of specialized agents working together. So, in traditional AI, you used to talk to one brain, but in swarm mode, you basically act as a team lead who manages several independent clawed agents simultaneously. You've got parallel power, and instead of doing one task, task A, then task B, then task C, a swarm handles all of them at once. So, in this video that McKay Wriggley posted to Twitter, it basically shows a head-to-head race between the swarm mode and the regular mode. And you can clearly see that there is a lot more speed and efficiency. Agent Swarms completed the project in a 7 minutes while the regular version took 18 minutes. And so for complex projects in Clawude Code, if you're wondering about the Opus 4.5 capabilities, of course, the agent mode where you have swarms, this is going to be probably a little bit more effective. And the video also mentions T-Mox, which is a tool used in terminal windows to split your screen into multiple panels. And in swarm mode, each agent gets its own panel, and it allows you to watch every single teammate work in real time. And of course you can step in if an individual agent gets stuck. Now this example was a single note page taking app just to show that even simple tasks benefit from this architecture. So for a beginner the message here is that don't let AI do everything in one long thread if you're using clawed code. Breaking it up into a team prevents the mediocre performance seen in the regular mode. Now another thing that most people don't realize is that Claude Opus 4.6 is absolutely incredible at Excel. In a moment I'll",
        "start": 276.16,
        "duration": 787.2000000000003
    },
    {
        "text": "let AI do everything in one long thread if you're using clawed code. Breaking it up into a team prevents the mediocre performance seen in the regular mode. Now another thing that most people don't realize is that Claude Opus 4.6 is absolutely incredible at Excel. In a moment I'll to understand what this is able to do. Now, this is released to all Pro Max team and enterprise brand subscribers in late January 2026. Now, this is designed to help you analyze, build, and debug complex spreadsheets without leaving the app. So, it has a few core capabilities. Unlike a standard chatbot, it can read multiple tabs, follow complex formula chains across sheets, and recognize the relationships between data sets. Now, you can ask Claw to automate or update your assumptions, change inputs, and it will modify the relevant cells while automatically preserving all your existing formula dependencies. It can also do error debugging so Claude identifies common Excel errors such as ref and value. And it can explain exactly where the logic breaks and suggesting precise fixes. It can apply professional styling such as blue inputs and blank formulas and create Excel native objects like pivot tables and charts. Now for those of you who might not be Excel wizards, this integration is going to lower the barrier to highle data work. Let me show you guys how you can actually get started with this. So you want to come to this link. I will leave a link in the description. But if you scroll all the way down, you can see Claude Excel listing on the Microsoft marketplace. Now, this is just for Microsoft. You can see right here, you can click get it now. Once you click get it now, you're going to then basically install it. And then once it's installed, it will bring you over to Excel. And essentially once it's all installed, you'll be able to see it on the right hand side. You'll also see this button right here where you can open Claude on the right hand side. Now, another thing as well is that you can of course, like I said before, click Opus 4.6. So, from the drop-own menu, you do have Opus 4.5, Opus 4. Sonet 4.5 and of course Opus 4.6. So here you can actually have the model do a lot for you. Remember guys, even if you aren't an Excel wizard, this integration just lowers the barrier to highle data work. So you don't need to, you know, know the entire complex syntax. You can simply say create a 12-month budget for a coffee shop with adjustable rent and labor costs. And so once you put this in, Claude is then going to start getting to work. And so here is where we start to get into the details. Of course, you can just understand the specifics of what you're trying to build. So, we can say, I'm just going to",
        "start": 398.0,
        "duration": 1023.0390000000001
    },
    {
        "text": "And so once you put this in, Claude is then going to start getting to work. And so here is where we start to get into the details. Of course, you can just understand the specifics of what you're trying to build. So, we can say, I'm just going to minutes, Claude will essentially build you something in Excel. So, here you can see it literally made all of this within just around 2 to 3 minutes. And of course, if you're a beginner, you can simply ask questions about this. You can understand what this is for. I mean, this is super super useful for business owners. So, like I said, Opus 4.6. This is really advanced and it really does excel at these kind of tasks. So understand that this is of course a tool that is super useful that no other AI does. So of course if you want to access this and use this don't be afraid to do so. You'd be surprised at just how easy this is. Now another feature that was added was the Claudin PowerPoint. This is an AI that adds the professional co-author directly inside the Microsoft PowerPoint app. Now in this one I essentially asked it to do a creator economy report in 2026. And the reason that this is good is because this directly works in Microsoft PowerPoint. This is able to read your slidem. It's able to read your fonts, your colors, your schemes, and this ensures that any new content that it creates actually matches the template and the brand guidelines. So instead of just generating terrible AI generated pictures or images, it actually generates native PowerPoint objects, meaning that you can directly edit the text. You can move the shapes or change the data in the charts that it produces. You can select a specific side element. You can then give it specific instructions and it can turn bullet points into professional flow diagrams, bar charts or native PowerPoint diagrams. Now, it's really cool because this is something like I said before, it's quite like Copilot in the sense that it's able to be there natively in the app and it's able to do stuff for you. And for me, this is a tool that I found remarkably useful. The PowerPoint that it did create was of course based on the information that is searched from the internet. So, I was actually able to pull that information from the internet and actually put that into the PowerPoint presentation. I'm going to show you guys once again how you can actually use this. If we actually go over to PowerPoint, you can see here this is exactly the PowerPoint I just created. You can see that I'm actually able to edit all of these values. So even if something is wrong or hallucinated, you're able to immediately change that. This is something that is super useful. Like I said before, it's not like other PowerPoints that are",
        "start": 517.519,
        "duration": 1265.278
    },
    {
        "text": "the PowerPoint I just created. You can see that I'm actually able to edit all of these values. So even if something is wrong or hallucinated, you're able to immediately change that. This is something that is super useful. Like I said before, it's not like other PowerPoints that are sure that you've got the drop-own menu selected to Opus 4.6 because this is the model that was specifically designed for these tasks. So, even as a beginner, if you're not that great in PowerPoint and presentation, you literally now have a co-pilot that's going to be helping you with",
        "start": 639.92,
        "duration": 1294.7199999999998
    }
]