[
    {
        "text": " So, Apple is losing the AI race and we need to talk about it. You remember when Apple was that company that make you felt like you were living in the future? When Steve Jobs pulled the first iPhone out of his pocket in 2007? People literally gasped. It was like watching a magician perform a trick that nobody knew was possible. A phone with no buttons that you can control by touching a screen. Come on. That's basically witchcraft. For years, Apple had this superpower. They take technology that already existed, MP3 players, smartphones, tablets, even wireless earbuds, and make them so good, so easy to use that you'd forget other companies made similar stuff first. [music] Apple didn't, you know, invent much, but they perfected everything. And here's the thing, that trick is getting harder to pull off. And nowhere is this more obvious than where AI is right now. When companies like Google, Microsoft, and Facebook are racing ahead with AI that can write essays, create images, code software, and have surprisingly human conversations, Apple is they're they're just struggling hard. And we're not talking about a small hiccup. We are talking about a company that might be watching competitors build the future while it fumbles around trying to make Siri understand basic questions. [music] So, what the hell happened? How did the company that revolutionized personal computing get left behind in the AI revolution? And more importantly, what does this mean for the future of your iPhone, your Mac, and Apple as a whole? You might want to buckle up cuz the story is wild. The Siri problem. Let's start with Siri because this is where Apple's AI problems became impossible to ignore. When Apple introduced Siri in 2011 with the iPhone 4S, it actually felt like the future. You could talk to your phone, ask it questions, tell it to set reminders. It was like having a little robot assistant in your pocket. For about 5 minutes, Siri was the coolest thing in tech. Fast forward to 2025 and Siri is the punchline. You've probably experienced this yourself. You ask Siri a simple question and instead of answering, she says, \"Here's what I found on the web.\" And shows you a bunch of search results. Thanks for nothing, Siri. I could have just Googled it myself. Meanwhile, you can ask Chat GBT complex questions like, \"Explain quantum physics to me like I'm five. then write me a bedtime story about a quantum particle and it will do it perfectly within seconds. The Google Assistant, well, it can understand context across multiple questions. You can say who won the Super Bowl and then who was their quarterback and Google knows you're still talking about the Super Bowl winner. Siri loses that thread immediately. We've even got Amazon's Alexa. It controls your entire smart home, remembers your preferences, and can carry on somewhat natural conversations. Siri can barely set two timers without getting confused. Here's",
        "start": 0.08,
        "duration": 312.48
    },
    {
        "text": "was their quarterback and Google knows you're still talking about the Super Bowl winner. Siri loses that thread immediately. We've even got Amazon's Alexa. It controls your entire smart home, remembers your preferences, and can carry on somewhat natural conversations. Siri can barely set two timers without getting confused. Here's ahead of the pack. And in 2025, she's trailing so far behind that Apple is literally considering replacing her with someone else's AI. According to reports, Apple has had discussions about using Google's Gemini AI or OpenAI's Chat GBT to power a future version of Siri. Let that sink in. Apple, the company that prides itself on controlling every aspects of its products, is so desperate to fix Siri that they're considering outsourcing the brain of their voice assistant to competitors. That's like Gordon Ramsay admitting he can't cook steak and ordering Door Dash instead. Enter Apple's intelligence, which [music] isn't that intelligent. In June 2024, at Apple's big developer conference called WWDC, Apple announced that they had this big AI play, Apple Intelligence. The name alone should tell you everything. Apple couldn't even bring themselves to call it AI because that would mean admitting they're playing catch-up. So, they created their own unique branding called Apple Intelligence. Apple Intelligence was supposed to be Apple's answer to track GBT, Google Gemini, and all other AI tools that had been blowing people's minds. It was supposed to show the world that Apple wasn't behind, that they were just being careful, thoughtful, and privacy focused. And the features they promised sounded pretty good. AI that could rewrite your emails to sound more professional. Smart photo editing that could remove unwanted objects. Notification summaries that would condense your alerts. A smarter Siri that could actually understand context. An AI that runs on your iPhone instead of the cloud for privacy. Except most of these features didn't actually arrive on time. Apple promised all of this stuff in summer 2024. Some features trickled out in fall 2024. More came in early 2025. And the advanced Siri features, well, those are delayed until 2026. As Forbes reported, this failure to deliver on WWC promises seriously damaged Apple's credibility. But even worse than the delays, some of the features that did launch were bad. Like embarrassingly bad. When your iPhone starts spreading fake news, this is where things start to get genuinely concerning. One of the Apple's intelligence features is notification summaries. The idea is pretty simple. Instead of getting 20 separate notifications from a group chat or a news app, the AI reads all of them and gives you one summarized notification. It sounds useful, right? Except Apple's AI started making stuff up. In late 2024 and early 2025, [music] Apple intelligence notification summaries started generating completely fake news [music] headlines. We are not talking about minor errors. We are talking about fabricating stories that never happened and slapping the BBC's logo on them. The BBC itself even complained publicly and Reporters",
        "start": 156.959,
        "duration": 626.7199999999999
    },
    {
        "text": "up. In late 2024 and early 2025, [music] Apple intelligence notification summaries started generating completely fake news [music] headlines. We are not talking about minor errors. We are talking about fabricating stories that never happened and slapping the BBC's logo on them. The BBC itself even complained publicly and Reporters organization, called Apple's AI feature out of control and demanded that Apple withdraw entirely. One false notification claimed that Luigi Manion, the suspect in a CEO murder case, had sought himself. However, he didn't. The AI just made it up. Another fake summary suggested that Raphael Nadal, the tennis player, had come out as gay. Also completely false. just AI hallucinating headlines. [music] Apple eventually paused the notification summary feature for news apps, but the damage was already done. An AI feature that's supposed to help you stay informed was literally spreading misinformation. And here's the thing, this isn't a new problem in AI. ChatBT, Gemini, and other AI systems sometimes hallucinate. That's the technical term for when AI confidently makes up facts. But those companies knew this was an issue and built safeguards. Apple apparently didn't. For a company that prides itself on polish and it just works, shipping an AI feature that spreads fake news is kind of unforgivable. Why is Apple so far behind? Okay, so we've established that Apple is struggling with AI. But why? This is one of the richest, most powerful tech companies in the world. They have unlimited money, brilliant engineers, and a decade long head start with Siri. What actually went wrong? Turns out there are several reasons, and they all add up to a perfect storm of failure. The number one problem is Apple's culture of secrecy. Apple is famously secretive. Employees sign NDAs that would make the CIA jealous. Different teams working on the same project don't often know what each other is doing. And this works great for preventing leaks about the next iPhone. However, it's terrible for AI development. Modern AI, especially large language models like Chat GPT, benefit massively from open collaboration. OpenAI, Google, and Microsoft regularly publish research papers, share findings, and let their AI researchers work with a broader community, and this speeds up research for everyone. Apple, well, they keep everything basically locked down. According to Bloomberg's deep dive into Apple's AI problems, this culture of secrecy meant that Apple's AI teams were working in silos, duplicating effort, and moving slowly. Problem number two is not enough investment. Here's a shocking stat that you won't believe. Apple spends less than 10% of its revenue on research and development. That sounds like a lot until you realize their competitors are spending way more on AI specifically. In just the third quarter of 2025, Microsoft spent nearly $35 billion on AI infrastructure. Google spent $24 billion. Amazon and Meta also spent tens of billions. And Apple, they're spending a fraction of that. While other companies are building massive data centers full of AI chips",
        "start": 317.52,
        "duration": 923.9979999999999
    },
    {
        "text": "on AI specifically. In just the third quarter of 2025, Microsoft spent nearly $35 billion on AI infrastructure. Google spent $24 billion. Amazon and Meta also spent tens of billions. And Apple, they're spending a fraction of that. While other companies are building massive data centers full of AI chips buying back its own stock and paying dividends to shareholders. To be fair, Apple is making some AI investments, but we're talking billions versus hundreds of billions. That's like bringing a knife to a tank fight. Problem number three is the privacy promise. You see, Apple has built its brand on privacy. What happens on your iPhone stays on your iPhone. It's the real marketing slogan that they use. And to be clear, this is admirable. Privacy does matter, but this is a huge problem for AI. Modern AI, the kind that powers Chat GBT, Gemini, and Alexa, learns from analyzing massive amounts of data. billions of conversations, searches, photos, and interactions. The more data that these systems see, the smarter that they get. And Apple doesn't want to collect all that data because it violates their privacy promise. So, they're trying to build an AI that runs on your device called ondevice AI without sending your data to Apple server. Now, this is technically impressive, but it does mean that the AI is learning from way less data than the competition. It's like trying to become a master chef by only cooking in your home kitchen while your competitors are out training in restaurants serving thousands of customers a day. Problem number four is Siri's messy foundation. You see, this is a dirty little secret. Siri wasn't even built by Apple originally. It was made by a different company that Apple acquired in 2010. And when Apple bought Siri, they had to integrate it into their existing systems, which were never designed for voice AI. Over the years, Siri became what programmers call technical debt, which is a mess of old code, patched together systems, and quick fixes that make it incredibly hard to improve. Bloomberg reports that multiple Apple executives wanted to completely rebuild Siri from scratch, but the company kept choosing band-aid solutions instead. Imagine you want to renovate the house, but every time you open a wall, you find it's best, bad wiring, and a family of raccoons. Eventually, it's going to be easier to just bulldoze the entire house and start over, but Apple just keeps trying to renovate the house. Problem number five is that they were late to the party. When OpenAI released ChatBT in November 2022, it was a wake-up call for the entire tech industry. Suddenly, everyone realized the AI had just reached a tipping point. It was actually useful and not just a research product. Google panicked and rushed out their own AI. Microsoft even partnered with OpenAI and integrated chat GBT into everything. And even Facebook's Meta ported billions into catching up. And Apple, they were",
        "start": 468.479,
        "duration": 1194.56
    },
    {
        "text": "the AI had just reached a tipping point. It was actually useful and not just a research product. Google panicked and rushed out their own AI. Microsoft even partnered with OpenAI and integrated chat GBT into everything. And even Facebook's Meta ported billions into catching up. And Apple, they were time they announced Apple Intelligence in June 2024, they were 18 months behind the competition. And in AI, 18 months might as well be a decade. What does this mean for your iPhone and Apple's future? So, Apple is behind in AI. Why should you even care? You bought an iPhone because it works well, it has good cameras, and your messages are blue instead of green. Who even cares about AI? Well, you should care because AI is going to be built into everything over the next few years. And if Apple cannot keep up, your iPhone might start feeling old-fashioned real fast. Your iPhone's brain is just getting dumber. Right now, if you have a new iPhone, you might not notice Apple's air problems too much. Your phone still works great for calls, texts, photos, and apps. But look at what is coming. Google's Android phones are getting AI that can screen your calls automatically, transcribe voice messages, help you write better emails, edit photos like a pro, and even predict what app you want to open before you think about it. Samsung Galaxy phones with Galaxy AI can translate phone calls in real time, making international communication seamless. [music] They can search through photos by describing what's in them, not just by date, and even edit video with air assistance. If Apple cannot match these features, the iPhone, the once cutting edge smartphone, might start feeling like the most basic option. The App Store might lose its magic. And here's something that most people don't think about. The future of apps might be AI. Instead of downloading different apps for different tasks, you might just talk to an AI assistant that can do everything. Want to order food, book a flight, edit a video? The AI just simply handles it. And if that's the future, and Siri sucks, then Apple has a problem. Why would developers build for iOS when Android has a better AI that can make their services even more useful? The next big thing might not be an Apple thing. Apple is reportedly working on AR glasses, which are basically smart glasses that project information in front of your eyes. [music] Robots and other devices. According to Bloomberg, all of these depend on advanced AI to work. You see, if Apple cannot crack AI, those future products may never launch, or they might even launch and suck. Meanwhile, Meta is already selling Quest VR headsets with pretty good AI integration. Google has been working on AR for years. [music] And if Apple's next big product category depends on AI they haven't figured out yet, they might miss the boat entirely. Your privacy",
        "start": 605.68,
        "duration": 1449.6
    },
    {
        "text": "might even launch and suck. Meanwhile, Meta is already selling Quest VR headsets with pretty good AI integration. Google has been working on AR for years. [music] And if Apple's next big product category depends on AI they haven't figured out yet, they might miss the boat entirely. Your privacy uncomfortable reality. Apple's privacy first approach to AI might mean you have to choose between your privacy and having the best AI features. Want AI that understands you, remembers your preferences across your apps, and get smart over time? That might require you sending your data to the cloud, which Apple doesn't want to do. Want to keep your data private and on device. You might have to accept AI that's dumber than competition. Now, this isn't a criticism of Apple's privacy stance. It's genuinely important, but it does mean that there might be a trade-off that other phones don't force you to make. The competition isn't waiting. While Apple has been fumbling, the competition has been sprinting. Microsoft and AI are the power couple. You see, Microsoft invested $13 billion in Open AI and immediately integrated AI into everything. Windows has copilot AI built in. Microsoft Office has AI that can write documents, create presentations, analyze spreadsheets. Even Bing search has AI chat. The result is Microsoft is suddenly cool again for the first time since the 1990s. Google, the AI veteran, is also fighting back. Google has been working on AI longer than almost anyone. They bought the AI research lab Deepmind back in 2014. And when Chachi make them look bad, they came back swinging with Gemini, their own large language model that is now pretty impressive. Google's AI is now in Gmail, Google Photos, Google Search, and Android phones. And they're spending over $90 billion on AI infrastructure in 2025 alone. Meta is going allin. So Meta decided to make their own model Llama completely free and open source. And this means anyone can use it, modify, and build on it. And this strategy is paying off. Developers are building amazing AI tools using Llama, which makes Meta's AI ecosystem more valuable. And Meta is spending tens and billions of dollars on AI data centers to stay competitive. Even Samsung is beating Apple. Samsung, whose phones used to be seen as cheap iPhone knockoffs, now has a Galaxy AI features that make iPhones look ancient. Real-time call translation, AI photo editing that Apple cannot match. And of course, all the integrations with Google's AI that give Samsung the real advantage. But can Apple catch up? Here is the billion-dollar question that everyone is asking. Can Apple actually fix this? Well, the good news is that Apple has some serious advantages. Money, money, and money. Apple is one of the richest companies in human history. They have nearly $200 billion in cash sitting around. And if they wanted to, they could buy every AI startup on Earth and still have enough left over to buy a",
        "start": 735.6,
        "duration": 1731.9200000000003
    },
    {
        "text": "Apple has some serious advantages. Money, money, and money. Apple is one of the richest companies in human history. They have nearly $200 billion in cash sitting around. And if they wanted to, they could buy every AI startup on Earth and still have enough left over to buy a Apple makes the iPhone, the chips inside the iPhone, and the software that runs on the iPhone. This vertical integration means that they can optimize AI to run efficiently on their devices in ways that Google or Microsoft can't. This is why Apple is betting big on ondevice AI. AI that runs on your phone chip instead of on the cloud. If they can make this work well, it could be a genuine advantage. Apple also has something that no other company has. A customer base that's almost cultlike in their loyalty. Even when Apple screws up, millions of people will give them the benefit of the doubt and keep buying iPhones. And this gives Apple the time to fix their problems that other companies wouldn't get. But there are serious Apple problems. Despite those advantages, Apple faces some really tough challenges. The technical gap is huge. OpenAI, Google, Microsoft, all those companies. They've been training large language models for years. They have infrastructure, expertise, and institutional knowledge that Apple just doesn't have. Catching up isn't impossible, but it's really, really hard. The culture also needs to change. Apple's secrecy, slow decision-m, perfectionism, and work great for hardware. They're disastrous for AI, which moves at breakneck speed and requires rapid iteration. Changing company culture is one of the hardest things a business can do. Just ask any company that's tried to do it. And remember, time is running out. You see, every month that goes by that Apple is behind in AI, the competition gets further ahead. Neural networks and AI models have network effects. The more people use them, the better they get. and Apple is letting their competitors build insurmountable leads. The future scenarios. So, you might be wondering, well, what happens next? Well, here are the most likely scenarios. Well, scenario one is the obvious. It's the comeback. It's unlikely, but it's possible. See, Apple could surprise everyone. Maybe they've been working on some secret AI breakthrough behind closed doors. Maybe their ondevice AI approach will prove superior. Maybe they'll acquire an AI company or talent that leapfrogs the competition. Tim Cook, Apple CEO, is very good at long-term strategy. And maybe this is all part of the plan and Apple will pull a rabbit out of the hat at their next big event. My probability for this is 20%. Scenario two is the partnership. Now this is most [music] likely Apple realizes that they can't win the AI race alone. So they partner with someone who can. They're ready and talks with OpenAI and Google about powering Siri with their AI. In this scenario, Apple focuses on what they do best, beautiful",
        "start": 878.56,
        "duration": 2007.1200000000001
    },
    {
        "text": "the partnership. Now this is most [music] likely Apple realizes that they can't win the AI race alone. So they partner with someone who can. They're ready and talks with OpenAI and Google about powering Siri with their AI. In this scenario, Apple focuses on what they do best, beautiful let someone else provide the AI brain. The iPhone stays premium, but Siri is secretly Chat GBT or Gemini under the hood. This is probably what we'll see. It's pragmatic. It saves face and it gets Apple competitive again quickly. My probability for this is 60%. Here's scenario three, the slow decline. Now, this is possible. If Apple keeps trying to build their own AI and they keep failing and slowly loses market share to Android phone with better AI features, the iPhone becomes like the iPod. Once dominant, then increasingly irrelevant. This would take years, maybe decades. Apple's ecosystem is so strong that people wouldn't leave quickly, but the drift would start, especially with younger users who care more about features than brand loyalty. My probability for this is around 15%. Now, scenario four is the pivot. This is the wild card. Apple decides that AI assistants are dead anyway and invest in some completely different approach to computing. Maybe spatial computing with their vision pro headset becomes the focus. Maybe they pioneer BCIs, brain computer interfaces. Maybe they invent something that we just can't imagine yet. This would be the most Apple move. Ignore the game everyone else is playing and invent a new game entirely. However, my probability for this is 5%. So, what does this all mean for you? Well, if you've made it this far, you probably want to know what on earth is going on. Okay, Apple is struggling with AI, but I just want my phone to work. Should I switch to Android? Well, here's my honest take. In 2025, let's be honest, it doesn't really matter that much yet. Right now, for most people, Apple's AI problems are more of a future concern than a present crisis. Your iPhone takes great photos. It runs smoothly and has access to all the apps you need. Yes, let's be honest, Siri is still kind of dumb. Notification summaries, spread fake news, and Android phones have some cool AI tricks, but these aren't deal breakers for most users. In 2026 is 2027, it might start mattering. This is when the gap could actually become obvious. If Google, Microsoft, and others continue advancing while Apple spins its wheels, the feature gap will become impossible to ignore. Imagine a world where Android phones can summarize hourlong meetings with perfect accuracy. Edit videos with simple commands. Translate any language in real time with no apps. Understand context across all your apps and services. Actually answer questions instead of showing web results. Meanwhile, your iPhone still has the same Siri from 2020. That is the point where people start switching. Now, here's my personal advice. If you love",
        "start": 1018.32,
        "duration": 2270.239
    },
    {
        "text": "any language in real time with no apps. Understand context across all your apps and services. Actually answer questions instead of showing web results. Meanwhile, your iPhone still has the same Siri from 2020. That is the point where people start switching. Now, here's my personal advice. If you love have time to fix this. The ecosystem is strong and the phone is going to keep working great for years. Pay attention, however, to what Apple announces. If they keep denying or delaying AI features, or if reviews say that Apple intelligence still sucks in a year time, that is going to be a big red flag. Be open to alternatives. I'm not saying switch to Android tomorrow, but don't be so loyal to Apple that you know you miss out on the better options. Tech should work for you, not the other way around. And manage your expectations. If you're expecting Siri to become suddenly as good as Chachi, you might be a little bit disappointed. Apple is years behind and catching up does take time. You need to think about what matters to you. If privacy is your top priority, then Apple's approach might be worth the AI trade-offs. If you want the cuttingedge features, Android might serve you better.",
        "start": 1151.679,
        "duration": 2363.0389999999998
    }
]