[
    {
        "text": " So AI backlash has reached a tipping point and I'm pretty sure it's time to talk about it. So AI backlash is essentially the growing consensus that AI is a nothing burger and it is destroying our society. And this is the I guess you could say large public opinion that is held by the majority of people who most likely aren't viewers of the channel. So, I'm going to show you in this video why people hate AI so much and some of the concerning trends around this [music] AI backlash. So, we can see here that there is this tweet that says it's pretty obvious to anyone paying attention that the AI backlash in 2026 will be up the charts. And they're currently citing three separate articles where AI is essentially fundamentally doing something or aiding something that we actively don't want. But the story of air backlash is a lot more deeper than people realize. And I do believe that this trend is going to get worse and worse in 2026. And I wanted to highlight these problems. Now, first I'm going to show you guys this tweet because this is a tweet that garnered a decent amount of attention. And it summarizes a few key points. One of them being the fact that AI is being forced into everything. Nobody wants co-pilot being everywhere, all at once in Windows. And nobody wants AI in every task they do for every place they go. I think this one is one of the main ones as well, is that we feel like AI is no longer a co-pilot, but more something that's being shoved down our throats by companies that just see dollar signs instead of products that could actually help users. And the second point they talk about is the fact that the real issue is when jobs really start to go in large numbers. If there is no perceived benefit ready to offset this, there will likely be civil war unrest in the streets. And I most certainly am going to come back to this. Now, one of the clearest examples where a tweet garnered a lot of views, which was literally 2 days ago, was that you can see this tweet here. Someone said, \"It's amazing that in the last 6 months, almost every single outspoken person on the topic of AI, who are not the owners or employees of an AI company, have turned against said AI, which is super interesting if you ask me.\" This is a video from Linus Tech Tips where the title I haven't actually watched the video, but he's discussing the fact that I'm guessing co-pilot just isn't as effective as it needs to be, yet it persists in many different areas. Clearly saying go away copilot, and it's understandable. Copilot has the potential to be one of the most revolutionary products, but I think Microsoft have just failed on their implementation of actually making it",
        "start": 0.16,
        "duration": 309.59899999999993
    },
    {
        "text": "just isn't as effective as it needs to be, yet it persists in many different areas. Clearly saying go away copilot, and it's understandable. Copilot has the potential to be one of the most revolutionary products, but I think Microsoft have just failed on their implementation of actually making it other tweet which cites an article where the CEO of Khan Academy believes that AI will displace workers at a scale that most people don't yet realize and his prescription from companies is to devote a percent of the profits to retrain workers or else there's going to be some tremendous backlash. They talk about the fact that once autonomous vehicles dominate ride sharing, delivery routes, and long haul trucking, they won't be far behind. And in the coming years, robotics are likely to reduce the level of human labor needed in occupations. even in diverse areas like warehouse work and software engineering and we're already seeing the disruption of software engineering through the recent AI tools and all of these things are probably going to happen relatively soon. Now, one thing I want to talk to you guys about and this is genuinely a point that I really need you to understand is that the backlash has genuinely reached tipping point. This is no longer a speculation on do people hate AI. This is true. Like people have a visceral hate for AI and not the kind of like okay AI is annoying. There is a sheer hatred for current AI systems that [music] I'm struggling to wrap my head around in certain extreme parts. I completely understand why people don't like AI. There are several different reasons which I'll just dive into a moment. But time and time again as social media continues in 2026, we are going to see more tweets like this where individuals are saying that they do not desire to see technology advance any further. And I think what they're talking about is not you know healthcare and stuff that's going to health help us but of course the technology that's you know AI images AI slop platforms where you can't trust what you see and of course the massive job loss. Now one of the clearest examples of this was Mark Cuban. So Mark Cuban made a tweet and this is one of the most concerning tweets exchanges that I've ever seen that just perfectly highlighted how the average person feels about AI. And the thing is is that this isn't just me looking and reading at tweets. This is me genuinely going to speaking to standard people who are just having their day-to-day lives just asking them their honest opinions about AI. And honestly the responses that I got were shocking. And you're going to see in this exchange from Mark Cuban to the average person on Twitter just how bad it is. Now remember in this video I'm not saying that these people are wrong. I'm just saying people don't understand",
        "start": 155.36,
        "duration": 576.6399999999996
    },
    {
        "text": "And honestly the responses that I got were shocking. And you're going to see in this exchange from Mark Cuban to the average person on Twitter just how bad it is. Now remember in this video I'm not saying that these people are wrong. I'm just saying people don't understand individuals. So Mark Cuban tweeted that creators should love AI. AI doesn't make uncreative people creative. It allows creators to become exponentially more creative. Creative iteration that used to take hours, days, or weeks can happen in minutes. the different skill routes that you wanted to take but didn't have money or the skill to do now you can do the number of gatekeepers dropped every day and eventually it will hit zero. If you know how to tell a great story, you will love AI. And he basically talks about, you know, everything is going to change and that the people who should hate AI are those that try to control distribution and creative processes because they are the ones that control platforms and [music] tools. Now, I think this is a hilariously bad take because I think he completely leaps over the main problems that people are facing and take a look at some of these responses and then I'm going to show you guys a really concerning response. So, you can see right here that it says, \"Read the room mark. This is why people feel disconnect from the rich and powerful.\" And remember guys, Mark Cuban's tweet only got around, I think, a,000 to 2,000 likes. And this response has garnered over 7,000 likes. So, it's a complete ratio on that aspect. So he says, \"You guys have business minds, not creative minds. The people in power only care about profit growth. People who are creative don't care about that. People create out of passion, not because it earns them an extra billion every year. And people love the feeling of perfecting a craft and learning to get better and better. Typing in words on a machine that does 95% of the work for you is literally the absence of creation. It's mindless slop. And only the people who like AI are non-creatives. You can argue this as much as you like, but most people despise AI for stealing art and taking away the essence of what it means to create. And they're not wrong. AI did steal from thousands of artists and didn't even pay them back and is now poised to literally take their careers. Now, you can see a lot of the tweets here are complete ratios. Not just ratios by a small amount, but a large large amount. Some of the responses are saying, \"Creatives should love the praise robot for making them unemployed.\" Serious question. Artist to billionaire. Are you really this out of touch? 29,000 likes and you think the goal of being creative here is to save time. Mark 10,000 likes. Another person",
        "start": 290.16,
        "duration": 829.5999999999996
    },
    {
        "text": "large amount. Some of the responses are saying, \"Creatives should love the praise robot for making them unemployed.\" Serious question. Artist to billionaire. Are you really this out of touch? 29,000 likes and you think the goal of being creative here is to save time. Mark 10,000 likes. Another person depths. I know it's hard for billionaires to end up in spaces where you're working with regular artists, but I hope that someday you are freed from this bubble that your money has built. Another 6,000 likes.\" Now, one thing that I found that was particularly concerning, and I don't like this trend whatsoever, because this says that we are headed towards a very dark time in society where there's probably going to be a complete rift in terms of people who use AI and those who dislike AI. So, a quote tweet that I found actually had a video of Mark Cuban getting shot. Of course, I'm not going to play the full clip here, and of course, it isn't a real video. It's a fictional video from a movie where they shot Mark Cuban. But what surprised me was that when the post and quote tweeted this, it implied something that was deeply unsettling. It implied that violence against an individual for a different opinion is okay. And I'm all for sharing your opinion on what you believe, but I don't think violence is the answer here. Now, the sheer amount of support that this tweet got is definitely super super concerning. And I think this deep trend is quite concerning because it's clear that society is rifting and people of course have every right to be upset that something trained on all their works and is literally poised to take their job. But I think that this is going to evolve into a much deeper and darker trend. Hopefully it doesn't. But it seems like that's the road we're heading down. And I'm not sure if some of you guys have seen this interview clip from E-Mad Stack where he basically says that look, AI is going to be the next wave of complete hatred. People are going to completely hate AI CEOs and this is just the beginning. And that's why some AI CEOs have completely disappeared from the public radar because the public backlash is too much. I made a video on this a few weeks back, but take a look at this clip because it's very relevant to this recent point. Is this kind of looming disruption why the billionaires are building bunkers? yes actually it's one of the reasons generally it's what they do but I know a lot of AI CEOs now who've canled all public appearances especially in the wake of Charlie Kirk and things like that they think that that's going to be the next wave of anti-AI sentiment next year cuz next year is the year the AI models go from not being good enough the",
        "start": 419.68,
        "duration": 1087.0389999999995
    },
    {
        "text": "AI CEOs now who've canled all public appearances especially in the wake of Charlie Kirk and things like that they think that that's going to be the next wave of anti-AI sentiment next year cuz next year is the year the AI models go from not being good enough the people listening to this will be like yeah the AI is not good enough then overnight it becomes good enough and then the job losses start and we don't know where they end. Then of course we have the fact that this is probably going to change politics. One of the major concerns I have is that AI is becoming deeply unpopular in America. Silicon Valley is losing the battle around AI. Doomers are now scaring people about jobs. They think all these job cuts that are going on in America are the result of AI. And number two, they're seeing their electric bills go up and they think that's also the result of AI. I've talked with a lot of Republican senator and House members who say they are afraid to mention the words AI because their popularity ratings go down. We need to get on the other side of that because that is a losing proposition for America. If what takes hold here is that, you know, it's politically popular to push back against AI, then David, I think that's what you're seeing at these state levels with Republican governors as well. I think both of those are false narratives, but we need to get on the other side. in China, they're not going to slow down. So, if we do an own goal here and slow down because [music] we think somehow that this is the the the path to greater economic growth, it's going to be a real problem both national security as well as economic security. Now, I think it's also important to see the wider discourse as I've been scouring Twitter and I've consistently found people, you know, with tweets like these. I mean, you can honestly pause and read these kind of tweets. I think yes, it's understandable that you need to probably understand that AI isn't in the best interest of everyone. I completely understand that and they probably need to change that. But saying that you are going to kick someone's ass is that if you use generative AI, I think that might be a little bit too far just because someone uses an LLM or a generative AI to generate art for their own pleasure. And then of course you have individuals gaining large amounts of support saying that they believe that they are better than individuals who use AI. You can see that this tweet where someone says, \"What's your most pretentious opinion?\" And someone says, \"I do think I am better than people who use AI.\" And this tweet has around 200,000 likes, 20,000 retweets, which of course again is super super interesting.",
        "start": 549.839,
        "duration": 1342.798
    },
    {
        "text": "than individuals who use AI. You can see that this tweet where someone says, \"What's your most pretentious opinion?\" And someone says, \"I do think I am better than people who use AI.\" And this tweet has around 200,000 likes, 20,000 retweets, which of course again is super super interesting. billionaires need to do a much better job of rolling out AI in a way that is actually useful and not competitive with humans. For example, Twitter's new update actually allows anyone to edit any image with an AI edit. So, if you upload any image to Twitter, there's a simple button where you can say add a fancy hat, change the color, and you can completely do it within seconds. Now, of course, this is probably bad because it enables plagiarism on a scale that is pretty incredible. And of course, I guess you could say that, well, people could download the pictures anyway, so what difference does it make? But I think the point is is that from a user experience point of view, you're just massively affecting a large amount of AI artists and individual who wouldn't want their content to be immediately editable by absolutely anyone on the internet. And you have to understand that this tool, it doesn't really add value to Twitter to the point where they needed to add it. It just upsets a large majority base of users. So this point here is where someone literally made a tool where they said, \"Hello, I hate Twitter's new AI update.\" So I made a little tool that converts your images into GIS so that Twitter won't show the edit image option on your post anymore and it's completely free and supports the use of mass downloading and uploading. So the point is is that a lot of these, you know, individuals at these companies that are making these products, they are completely disconnected from the real world reality. And I do think that that change needs to happen. And like I said, it's not just me stating this. This isn't just my own findings. I've seen countless of articles where it says there are new polls findings that Americans loathe AI. A new poll by the Pew Research Center found that Americans are getting extremely fed up with AI in their daily lives. 53% of just 5,000 US adults pled in June think that AI will worsen people's ability to think creatively and 50% say AI will deteriorate our ability to form meaningful relationships, while only 5% believe the reverse. They talk about the fact that this poll highlights the growing distrust and disillusionment with AI. Most Americans are concerned about how AI tools could stifle human creativity as the industry continues to celebrate the automation of human labor as a cost cutting measure. The generally pessimistic options about AI are significantly much more widespread than they were before the advent of Open Ice Chat GBT. And of course, this disconnect",
        "start": 678.399,
        "duration": 1605.0379999999996
    },
    {
        "text": "how AI tools could stifle human creativity as the industry continues to celebrate the automation of human labor as a cost cutting measure. The generally pessimistic options about AI are significantly much more widespread than they were before the advent of Open Ice Chat GBT. And of course, this disconnect Now, I didn't want to make this video just to be like an AI doomer to say that, okay, these people are out of line. They're just crazy or saying that, you know, the billionaires just have no idea what they're doing. I believe that there is a future where AI [music] can exist in a way that actually makes sense. And so, this article sums it up perfectly. So, it talks about the fact that the disconnect will only grow harder to ignore in 2026. As we head into 2026, Silicon Valley needs to read the room. The disconnect between how AI is framed by its [music] builders and how it's experienced by the public isn't being properly addressed, but it will only grow harder to ignore in 2026 with increasing societal and political backlash. They also leave a link to a tweet right here which basically summarizes what needs to change. I do believe that, you know, the AI roll out was completely messy. They just sort of rolled this out and didn't really care about the consequences and just focused on profits and users as much as possible. But take a look at this tweet here. So, Sebastian Caleri says that folks in text do not appreciate that the entire country is polarized against tech. Bernie wants a data center ban. Bannon seems close to calling a butlerian jihad. The only thing that AI seems to offer most Americans is job loss and more billions for billionaires. We need a better story. A better story about how AI is actually good for America that we both believe and will see through. People do not care about competition with China [music] when they can't afford a house and healthcare is bankrupting them. If you are in tech, it is part of your job to help address some of these concerns in society. If you want the industry to flourish and you earnestly believe you'll be better off in 5 years by embracing AI, you need to start showing ordinary people a reason to believe you act quickly. In my opinion, this is very true. The rollout has been completely messy and companies have just been absolutely profit hungry rather than focusing on the wider impacts of their technologies release. In my opinion, moving forward, companies need to do a better job of mitigating those downstream effects that are going to negatively impact many people worldwide. Failure to do so is only going to result in the gap widening between those who actually want to use AI and those who are affected by it on a day-to-day basis. In my honest opinion,",
        "start": 812.48,
        "duration": 1865.8380000000006
    },
    {
        "text": "of mitigating those downstream effects that are going to negatively impact many people worldwide. Failure to do so is only going to result in the gap widening between those who actually want to use AI and those who are affected by it on a day-to-day basis. In my honest opinion, act now. I'd love to know what you guys think about the situation, and I'll see you guys in the next one.",
        "start": 944.8,
        "duration": 1876.4780000000007
    }
]