[
    {
        "text": " So, Jen Tangen Huang said a statement that has been going absolutely viral recently and we need to talk about it. So, this is the statement. This is the statement. Jen Sang Huang said, \"Nvidia will win the AI race with the United States.\" So, this is crazy, okay? Because you have to understand that this is the CEO of the world's most valuable company saying that the west is essentially going to lose to China in one of the most important races of our lifetime. So this is actually from the financial times [music] and he basically said that you know the country is nanoconds behind America and he he's essentially warning that you know US policies restricting AI chip exports could backfire by cutting off access to half of the world's AI developers most of whom are in China ultimately weakening America's long-term position and he basically emphasized in the article which I'll get into more in a moment he emphasized that for the United States to win it must race ahead head and ensure the global AI ecosystem, okay, including China is built on American technology like Nvidia stack. And you have to understand that like this is, you know, like geopolitical stuff because of course US policy under President Trump is pushing the exact opposite. And he said that the black wall AI chips should be reserved exclusively for United States customers and maybe less advanced chips could be sold to China. So this is pretty crazy because we've got a situation on our hands and it's I think there's a little bit more at stake here because on one side you do have Jen Sen Huang who wants to be able to sell Nvidia chips to China that's that's of course going to add an incredible revenue stream but of course you've got the United States who are trying to you know win the AI race and by any means necessary do what they can do to prevent China from racing ahead. So, you know, he said China is going to win. And I think, okay, that this statement is pretty crazy, okay? Because you have to realize that most statements that you know people make public statements when they make those public statements, especially if you are the CEO of the world's most valuable company, they realize that you can't say something that is absolute. like you can't say okay this is going to win or this is going to work or that's not going to work because people take it verbatim and in this example it's been doing the rounds on Twitter the rounds on social media because most people are looking forward ahead and they're wondering are the United States actually going to win now of course like I said you can't really state things like this verbatim because they have you know ripple effects and literally it was only I think a day after there was a",
        "start": 0.16,
        "duration": 316.64099999999996
    },
    {
        "text": "people are looking forward ahead and they're wondering are the United States actually going to win now of course like I said you can't really state things like this verbatim because they have you know ripple effects and literally it was only I think a day after there was a Twitter and he literally says that you They reiterate the point that basically says look as long as I've said China is nanoseconds behind America in AI and it's vital that America wins by racing ahead and winning developers worldwide. Essentially saying that look we want Chinese developers to be building on American you know architecture because some people are considering the fact that maybe they may build on a different stack that is going to be fundamentally on China's architecture and if that architecture is ahead then they're going to be behind. Now, of course, there is some drama. Now, Jen Sen Huang essentially said that, you know, that is not what I said. Now, I can't play for you guys the full clip here because I'm not sure which news show this is from and they're quite likely to, you know, copyright the video and probably take it down. So, I'm only going to play you guys a short audio snippet. But the gist of what he's saying here is, look, wait, wait, wait, wait, wait. That is not what I said. What I said was is that China is very good at AI technology and they have many AI research and in fact most people don't know this that 50% of the world's AI researchers are in China and they develop very good technology. Now take a listen because you're likely going to want to hear this for yourself. That's not what I said. what I said was that China has very good AI technology. They have many AI researchers. In fact, 50% of the world's AI researchers are in China and they develop very good AI technology. In fact, the most popular AI models in the world today are open- source models are from China and so they're moving very very fast. United States has to continue to move incredibly fast and otherwise otherwise the world is very competitive. So we have to now it's really fascinating to see what he has said there. I mean, he said many different things. And one of the things that I saw, and I quickly want to just add this in because I made a video on this already, but this one was pretty surprising, and it's about the China's AI race. Now, I'm going to get into some more of Jensen Wang's statements. He actually said quite a lot. But there was this and this was pretty crazy because when you look at the AI race and you search around and you try to find out what people are saying about the AI race, Fortune dropped to this bombshell that was around I think one or two",
        "start": 160.4,
        "duration": 594.4810000000001
    },
    {
        "text": "a lot. But there was this and this was pretty crazy because when you look at the AI race and you search around and you try to find out what people are saying about the AI race, Fortune dropped to this bombshell that was around I think one or two that look, China's energy grid is ahead of the United States and it basically means that they'll also win the AI race. So, China keeps apparently an electrical reserve capacity of 80 to 100% of actual energy needs. And China's state-owned energy enterprises invest in long-term projects with no pressure for immediate return on investments. And United States AI companies are struggling to source energy to power their data centers to the [music] point that they may have been forced to build their own power plants. And that means no economies of scale and lot of duplicate infrastructure. Whereas China finds it data center buildout convenient to soak up all the supply they've been saving for investment driven gold rushes such as this. And the United States city grids are weak, barely operating with 15% reserve capacity leading to shortages and blackouts in cities like Texas and California. So essentially what they're saying here is that China was prepared for this. they are prepared for and they've got like tons and tons of excess energy to be able to power this air revolution. But the United States might be [music] playing catchup. And these experts when they went over to China, they were just looking at, you know, everything comparing it to the United States and they were like, \"Wow, well, you know, this is pretty crazy that the United States is so far behind.\" Now, currently, it doesn't seem like the United States is that far behind. There's of course many different things you can talk about in terms of models and you know different pieces of software but take a look at this as well because this is a video about Jensen Huang and he also said okay this he also said this now this was on the 2nd of May 2025 and he was asked is China behind and I made a video on this as well but I wanted to jog your memory on what he said because a lot of people at the time were basically stating that look China's behind China's behind and Jun Singh Wang he was like listen China are not behind. No matter what you think, they are doing what they need to do. They're working hard. They're building companies, making models. Take a listen. Like, how far behind do you think China is? , China is not behind, right? Anybody ahead of you? I China's right behind us. I mean, they're we're very very close. But remember, this is a long-term this is an infinite race. There's no, you know, in the in the world of life, there's no those, you know, there's no twominut",
        "start": 301.28,
        "duration": 875.2010000000004
    },
    {
        "text": "is not behind, right? Anybody ahead of you? I China's right behind us. I mean, they're we're very very close. But remember, this is a long-term this is an infinite race. There's no, you know, in the in the world of life, there's no those, you know, there's no twominut such thing. And so, we're going to compete for a long time. And just remember that this is this is a country with great will and they have great technical capabilities. 50% of the world's AI researchers are Chinese and and so this is a this is an industry that that we will have to compete. Now, there was also this interview where Jen Sang Huang told the truth about China. In this clip on the podcast, he talks about the fact that China are working extraordinarily hard. They are pretty much right behind America and most people should not underestimate China because remember guys, it only takes one or two consecutive breakthroughs in order for them to be leading in the race. Now, I personally believe that, you know, America are going to stay ahead because of the companies that they have and the innovation and the culture, but it's still going to be very close. China has some of the best entrepreneurs in the world because they came from some of the best STEM schools in the world. We're up against a formidable, innovative, hungry, fastmoving, underregulated. Okay, people don't realize this. They are very lightly regulated. Some of the things I I heard, they could never build AI chips. That just sounded insane. Two, , that China can't manufacture. China can't manufacture. If there's one thing they could do is manufacture. And three, they're years behind us. Is it 2 years, 3 years? Come on. They're nanconds behind us. Nanc. Yeah, they're nanconds behind us. And so, we've got to go compete. So, yeah, you heard it here first. China is well, maybe not here first actually, but you heard him say that China is nanoc behind. Now, that's a clear statement that look, China are not far behind at all. and China are very very close to the US in terms of what they can do. Now remember, China are working extraordinarily hard and they understand what is at stake here. Now, additionally, I've looked at various different interviews. One of the interviews that I've looked at previously was the interview with the former Google CEO. Now, this was a really interesting interview because he essentially says that China will win the AI race unless we decide to act now. Now you have to understand that it's imperative that the United States becomes a leader in AI because the way that the world may be if China becomes a you know leader in artificial intelligence achieves AGI achieves ASI manages to you know just literally outclass America completely the world could be a completely different place. It's going to be really interesting to",
        "start": 444.08,
        "duration": 1166.9600000000005
    },
    {
        "text": "a leader in AI because the way that the world may be if China becomes a you know leader in artificial intelligence achieves AGI achieves ASI manages to you know just literally outclass America completely the world could be a completely different place. It's going to be really interesting to former Google CEO, kind of gives you that extra information you need because I've seen I've seen a ton of [music] interviews with this guy and he's, you know, extremely educated on the subject matter. And even he was surprised by where China is in terms of their capabilities, which led him to, you know, at least in this clip basically said that look, the United States need to get their act together. So take a listen because it's important that you realize that this is not a game anymore. We are in an I guess you could say an arms race but at least in an AI race. China is doing exactly what you said. as a result of the incredible success of Deep See the Chinese government which has largely been asleep on this has decided this is another national priority. They're pouring billions of dollars into this and the Chinese model is to be taken very seriously. They're very smart. They work really hard and although they don't have the advantage of some of the chips we have, the constraints that we put them other cause them to invent new algorithms such as what you see in DeepSeek which are impressive. So never underestimate the Chinese competition here. So for people who don't really care about everything else I've said, China is going to win. I want to be very clear here. China is going to win this race with enormously negative effects unless we get our act together. the new team is getting confirmed and my sense is that they'll be focused on the China threat which is a legitimate one and what I hope they do is they come back with a statement that which I did when I did the National Security Commission on AI a few years ago is that it's imperative that the winner in AI win using American values and not Chinese values. The American traditionally liberal values of freedom of speech, freedom of expression, freedom of movement. If you were to put China in charge of those, those values would not be front and center. they would be forgotten or omitted. Now, do you want to know what the craziest thing about all of this is? Literally, while I was making this video, Kimmy K2 was released. Now, if you don't know what this model is, this is the model that is currently state-ofthe-art in several different cate. Now, understand it's not state-of-the-art by just a small margin. It's state-of-the-art by a very decent margin. And surprisingly, okay, it only cost $4.6 $6 million to train according to a source familiar with the matter.",
        "start": 591.839,
        "duration": 1428.799000000001
    },
    {
        "text": "model is, this is the model that is currently state-ofthe-art in several different cate. Now, understand it's not state-of-the-art by just a small margin. It's state-of-the-art by a very decent margin. And surprisingly, okay, it only cost $4.6 $6 million to train according to a source familiar with the matter. know, I pay attention to AI releases all the time, but seeing a model not just be state-of-the-art, but state-of-the-art by 10 to 20% in some cases was a real shocker because it goes to show that even when models do catch up, sometimes they can actually surpass Americanmade labs. And I'm not sure whether, you know, companies are now getting laidback. They think that, you know, we're now on this scurve growth, what the situation is. But this was a wakeup call to all of the Frontier Labs in America because most people that have used this new model, Kimmy K2 thinking, and I'm sure you potentially, you know, seen this model probably if you've been on Twitter or maybe on I'm on the channel. I'm not sure if I've uploaded it today or tomorrow, but the model is incredible. Like genuinely incredible. Like I've used this model and it compares to set and chatbt even better in some cases and it's a whole lot cheaper. So you have to understand that it's super super competitive at the moment. So if you think that okay you know China had their deepseek moment and Deepseek which you know crashed the stock market and all of this was just a one-time thing. Kimmy K2 thinking was there and that one was incredible. That was only a couple of days ago. And then we also had Quen thinking which is another model that I use and it's also really good as well. Not just like you know nonsense good. This model is actually very good. Like I split tested these models and across a wide range of benchmarks I can't tell the difference sometimes. Now additionally what I do want to show you guys as well is [music] how these labs are taking it. So we looked at you know Dario Amade and in a recent interview he kind of says it doesn't matter when it comes to open source models. He actually says that essentially all he cares about and this is like a a weird freeze frame but all he cares about is whether or not the open source model is good or not or whether or not the Chinese labs have a good model or not. You know I've I've actually always seen it as a red herring when I see it when I see a new model come out. I don't care whether it's open source or not. Like if we talk about deepseek, I don't think it mattered that deepseek is open source. I think I ask is it a good model? Is it better than us at at you know the things",
        "start": 724.079,
        "duration": 1684.000000000001
    },
    {
        "text": "a new model come out. I don't care whether it's open source or not. Like if we talk about deepseek, I don't think it mattered that deepseek is open source. I think I ask is it a good model? Is it better than us at at you know the things about it? It it actually it actually doesn't doesn't matter either way. Now while that is all crazy, there are some talks about China's new vision for AI and what that might actually look like. So of course we've got China's different vision for AI. You know, we've got multiple different ways that the AI race could play out, but this is one of them. So, there was this article by Jos Chin, and it's pretty interesting. They talk about with growing fears of an AI bubble, Beijing is charting a pragmatic alternative to Silicon Valley's pursuit of artificial super intelligence. , and I found this one to be pretty interesting. So, they talk about the fact that the leader Jing Jinping is, you know, recently had a little to say about AGI. Instead, they're focusing on pushing the country's tech to be strongly oriented towards applications, building practical, lowcost tools to boost China's efficiency and can be marketed easily. And the diverging visions represent a head-to-head bet with significant stakes. If China's gamble turns out to be wrong, it could find itself lagging far behind the United States and the most consequential piece of technology. basically saying that look, China, you know, in some areas they're not as risky as the United States, you know, banking on AGI, you know, being achieved. They're kind of just working with what does work and just doubling down on that, making their economy much more efficient. , we can also see the fact that, you know, they see highly impactful AI applications not as something to theorize in the future, but as something to take advantage of here now. So, they're all on, you know, implementation of artificial AI. I don't know why I said artificial AI artificial intelligence right now. So you know they talk about you know China's equivalent of MIT is rolling out an AI powered hospital where human doctors are going to be assisted by virtual colleagues with the latest data on diseases intelligent robots being deployed to run automotive dark factories essentially where factories just completely run you know autonomously. So, United States is, you know, essentially funding billions of dollars into, I guess you could say, artificial super intelligence, but China's, you know, going to focus on efficiency and factories and streamlining the entire economy to ensure that they move fast. And I guess you could say this is, you know, a really really interesting interesting strategy because it's like they're focusing on something that is a guaranteed return, but the United States seems to be focusing on something that the return is like infinite if it is achieved but that you know potential for",
        "start": 854.72,
        "duration": 1968.5600000000006
    },
    {
        "text": "could say this is, you know, a really really interesting interesting strategy because it's like they're focusing on something that is a guaranteed return, but the United States seems to be focusing on something that the return is like infinite if it is achieved but that you know potential for to happen. So we also talk about the fact that you know China will be in a position to steal a march on its global rival in ringing out the most of AI in its current form and spread those applications worldwide. Now in addition there was also this and the the timing of this is really really interesting. So we had the Palenteer CEO say that a surveillance state is preferable to China winning the AI race. So talented CEO Alex Cobb appeared on the Axio show and he reiterated the belief that the United States must lead the world in AI even if that means embracing surveillance and risk. [music] And he argued that a surveillance heavy America is preferable to China dominating AI saying that the United States must absorb a lot of risk to stay ahead. And in his view fears about surveillance are overblown since Americans should have far fewer rights if America is not in the lead. Now, of course, he's going to say that. I mean, he owns Palunteer. Like, I mean, so many statements that I'm seeing from so many CEOs are, I don't want to say selfish, but clearly rooted in their own best interests. I mean, in this interview, he, you know, when when he was pressed on AI dangers, he downplayed existential threats, saying that the real risk is social instability and crazy populist movements like governments running grocery stores. And he insisted that AI dominance is worth the trade-off, even if it means reduced privacy and growing surveillance. And I don't know, I I'm not sure I agree with increased surveillance. I think we've, you know, already got enough and the future is going to be incredible, if not not incredible, in a good way if surveillance increases anymore. So, I mean, what do you guys think about this? Do you think that Jen Sen Huang is correct that the United States is going to lose to China, or do you think maybe his statements were a bit overblown by the media and other individuals? I personally think it's going to be close, but I think the US is going to clutch it in the end, provided they continue to focus on this area.",
        "start": 999.12,
        "duration": 2190.9600000000005
    }
]