[
    {
        "text": " So Google Genie is here and it literally just broke the stock market. So let's talk about it. So Google Genie is Google's latest playable world model that lets you literally design an environment and a character and then you can literally create your sketch, create your world, and you can just immediately jump in and play whatever game you want. Now, this hasn't broken the internet, and it did break the stock market, which we'll talk about later. But this is definitely a really cool piece of technology, and a lot of people are looking at like, you know, what is this? What does this do? what what do we want to do with this? And I mean, I don't think you guys should, you know, dive that deep into it. I think this is a really cool piece of technology and the many use cases will become evident in the near future. World models are something that are remarkably useful because they allow, you know, AI agents to potentially train in virtual worlds and that's something we're going to touch on later. But essentially, this thing just allows you to use any image where you can literally just interact with your environment, not your environment, in the environment or whatever character you do want to do. And this is super interesting because you have a vast array of different, you know, environments that are possible. And it's super super intriguing to see what individuals cook up with with all of their custom images, with all of their, you know, very, very thoughtful ideas. And this is something that has, you know, previously we thought Google would never release a product like this. I mean, currently now, currently now, this is something that is actually available for ultra users. So, if you do have the highest subscription tier on the Google AI plan, you are actually able to use this. and it doesn't even take any AI credit. So, this is something that once again we didn't think that we would get so soon, but it does seem that this has become, you know, a remarkable way from the Genie 1 days. Now this thing is really really interesting because I don't know how much compute it does cost to run this but I cannot imagine that this would be cheap to run because it is a real-time world model and we already know that video models actually do cost a very large amount of compute in order to use them. So I can't imagine that this is not going to be any somehow different. And the interesting thing about this is that like you can only play this for 60 seconds. So, if you do want to actually, you know, use this and try this out, you do have to be in the United States of 18 years of age. And as I already said, on the Ultra plan, but like I said, when",
        "start": 0.08,
        "duration": 266.6409999999999
    },
    {
        "text": "can only play this for 60 seconds. So, if you do want to actually, you know, use this and try this out, you do have to be in the United States of 18 years of age. And as I already said, on the Ultra plan, but like I said, when you 60 seconds. So, they do cap your compute time. And I am guessing that you probably aren't able to play this all day. And there are probably usage limits. So, as this does go more viral, I'm guessing that maybe there probably might be even more usage limits, you know, implemented into this entire thing. Now, I really do wish I could try this. I actually did release a video yesterday on how you can actually, you know, dive into this. I've looked at all the flaws and everything that this software offers. So, if you do want to watch that video, you do have access. You are a Google AI Ultra subscriber. You can watch my previous video. But, we need to dive into just some of the flaws of this. Not to say that this is bad at all, but just so you guys understand what's going on. And when I dive into the flaws, I'm going to show you guys why it was so crazy that this thing managed to crack the stock market. Now, of course, before I dive into all of that, I want to say congratulations to Google because this is a tremendous feat. I haven't seen any other company manage to do something like this. And when I'm talking about companies, I'm talking about, you know, some of the big four like OpenAI, Anthropic, X.A.I., Google's the only one that seems to be pushing world models as forward as they are. Now, there are some other companies that are doing world models, but they aren't actually on the level of Google, so I won't talk about them just yet. So, Genie 3 is super super intriguing. Now, if you're wondering, is this some completely incredible simulator that's completely, you know, perfect? No. I was reading this tweet from S SWYX, and he said, I finally paid for a Gemini Ultra subscription, and here's an unsolicited review. It has obvious flaws, but it's a real-time playable video world model. And he says, \"The flaws are that it clips through a lot of terrain, which is particularly worse than a game engine. If you know game engines, they usually have hard physics. So when you walk up to a wall, that wall is usually completely solid. So you weren't able to be passing through that. And usually if you do clip through a wall, those are like glitches in the game. And you do ideally want to remove those glitches. And he also says, \"Only too late do I discover that you can use space bar and jump on things.\" And he says it sometimes does error out. You",
        "start": 133.68,
        "duration": 489.3609999999999
    },
    {
        "text": "do clip through a wall, those are like glitches in the game. And you do ideally want to remove those glitches. And he also says, \"Only too late do I discover that you can use space bar and jump on things.\" And he says it sometimes does error out. You seconds, which is like what I've discussed. And he says it feels like some Black Mirror storyline. And he says that nothing else moves, ruining your immersion. Why does every model lack physics? And that is somewhat true. I've seen some worlds where some cars move and some worlds where things are completely static. I do think it is dependent on your complete prompt. We will have to see how that is from time to time. And he does say prompt to prompt editing can have bad side effects like adding a thing removes a previous thing you like. So yeah, this this is the problem with generative AI is that generative is not you know binary. It's not zeros and ones. I mean it is but it's not like you know complete deterministic piece of software. It's completely generative meaning that you don't know what you're going to get. It's very probabilistic. So, of course, I think that is a good thing in some instances, but of course, it's a bad thing in some instances because it means the replayability is pretty rough. And yeah, I mean, those are the only flaws, but I got to be honest, I do think that they probably will fix the majority of these. It will be interesting to see how this software evolves. Now, here's where we get on to the crazy stuff because this was what was going on on Twitter. We had Mini say, \"Holy moly, Genie3 just created this mock 3D game mode from Breath of the Wild. How I did it and prompts in the comments.\" Now, I wanted to show you guys this, you know, screenshot, but I do think that this was removed from copyright by Nintendo. I'm not sure if that is true, but I know that Nintendo copyright stuff all the time, and I did see something on his account about something getting copyrighted, but the long story short is this gameplay right here. It looked really, really impressive. Okay, now I want to show you guys this. Okay, so this is Genie 3 and this looks like I think it looked like Dark Souls. Okay, and this is Genie 3 and it does look like gameplay. Okay, now here's the problem. Okay, that happened and it was just crazy. So, the problem is is that these gameplay videos were gaining quick virality. Now, as you know, some people when virality does happen in AI and on social media, some people just hop on the bandwagon with lies. One of those lies was this. So, so there was this video which was fake news. So, someone tweeted out, you know, this Zuma guy",
        "start": 247.04,
        "duration": 719.7609999999997
    },
    {
        "text": "Now, as you know, some people when virality does happen in AI and on social media, some people just hop on the bandwagon with lies. One of those lies was this. So, so there was this video which was fake news. So, someone tweeted out, you know, this Zuma guy was made in minutes with Google AI. Short all gaming studios. It's over.\" Now, this gameplay video here isn't actually Genie 3. This was an actual footage of GTA 5. And then what the person did was they used some software. I think it's runway video to video where they converted GTA V gameplay into realistic gameplay. This happened almost a year ago now. And you can, you know, look up GTA V gameplay on YouTube. , and type in realistic Call of Duty gameplay, realistic GTA V gameplay, you'll see that this gameplay does exist on that website. And so, you might be thinking, okay, well, a piece of fake news went viral. The problem is, okay, the problem is is that this fake news went viral to the point that it did not crash the stock market, but crashed a bunch of gaming related studios. Now, it's crazy because they said short all gaming studios, it's over. And then you can literally see here video game stocks are suddenly crashing today with the launch of Google's Project Genie as investors think games will start be being made with AI. You can see that major major stocks, I think it was Take to Interactive and a bunch of other gaming studios, you can see Roblox It's it's crazy. Like genuinely, this is crazy. Okay, now this is a textbook example of emotional panic-driven market behavior because think about it. Investors are seeing that, okay, AI can make video games and they're immediately just hitting the sell button and that's a, you know, 8 to 20% drop across the board. But this ignores the obvious realities of the, you know, gaming industry. Okay, Nintendo, take two. These are companies that are not sitting around helpless. These, they have the resources and if anything, AI tools are probably going to make these companies more valuable. And remember that IP and communities matter. People aren't going to stop playing Mario, GTA, and Roblox just because someone can now generate a basic game with AI for 60 seconds. You have to understand established franchises have decades of brand equity, polish experiences, and lower communities. I don't believe that even if G3 gets marginally better, people are going to be playing this over GTA 6 when it releases. So that kind of stock price decline doesn't make sense. Like genuinely, if you've ever played a video game, I know some of you guys might not be gamers, but it doesn't make sense. Okay? And the worst thing about this is that this is such a crazy timeline dis disconnect that even if Project Genie does manage to disrupt gaming in a big",
        "start": 363.36,
        "duration": 981.682
    },
    {
        "text": "ever played a video game, I know some of you guys might not be gamers, but it doesn't make sense. Okay? And the worst thing about this is that this is such a crazy timeline dis disconnect that even if Project Genie does manage to disrupt gaming in a big if it does that, this isn't going to happen tomorrow. This is going to take a very long time for that to happen. And you have to understand just how complex the gaming industry is. There are so many good games out nowadays. To be able to actually get a game that people like and enjoy, I mean, this is, you know, pretty crazy. So, I think once again, this is just human human fear. I'm not trying to give you guys any sort of financial advice, but I just think it's so interesting that a that Gen3 being released by Google just erased millions or even billions of dollars from some stocks, okay? Just to show you guys how crazy this, you know, AI hype is. Now, I think the main use case of this, okay, and most people probably won't think this is the main use case. This is my honest opinion, is that Gen3 is probably huge for robotics. So most people don't realize that you know it allows simulated training at scale. Robotics has always faced a data problem which is one of the biggest problems they they're facing and it's data collection. Okay. So data collection for robotics is is expensive. It's time consuming and it's risky to train robots in the real world because they can make mistakes, they can break all that stuff. But Genie 3 can generate unlimited diverse environments from check prompts. If you want to train a warehouse robot, you can generate 10,000 variations of warehouse layouts, lighting conditions, and obstacles. And unlike static 3D environments, Genie3 does simulate physics and interactions in real time. So the robot can experience how objects move, how surfaces respond, contact to gravity, all of that stuff. And that's critical for manipulation tasks. So if you want to see if your robot's going to fail in certain environments and in certain edge cases, this is basically the perfect, you know, kind of thing. So I wouldn't be surprised if they kind of maybe licensed this software, some kind of robotics testing round rather than an AI generated video game software. So, for me, I think this is probably going to be the most interesting application of this. I don't know. I could be wrong. If you're a robotics researcher down there, of course, let me know down below. Leave a comment in the free community, but I do think that this is one of the, you know, most interesting things I've seen so far because when you look at the cool examples, you'll realize why this does feel like a reality simulator in 2026. And that's super crazy. So, let's take a",
        "start": 496.08,
        "duration": 1222.8010000000002
    },
    {
        "text": "the free community, but I do think that this is one of the, you know, most interesting things I've seen so far because when you look at the cool examples, you'll realize why this does feel like a reality simulator in 2026. And that's super crazy. So, let's take a was browsing Twitter and I saw some really cool examples. For example, let's take a look at Riley Goodides controlling a discarded pack of cigarettes. Here you can see he's on the underground metro controlling a pack of cigarettes and looking around and changing the camera angles. You can see surprisingly all of the physic remain intact. And this is a perspective that you wouldn't usually be able to get. Or let's take a look at Matt Schumer's skiing adventure. Here you can see he's controlling a skier as they ski down the mountain. And this also includes the realistic physics as well as being able to jump and control the skier as they ski down the mountain. This is really cool as it does manage to simulate gravity really well as well as colliding with the snowy objects in the terrain. And here is one of my favorites. You can simulate body cam footage with Genie Free. Take a look at this footage by Chris First. Once you get a little bit, you can control the entire environment from this super specific camera angle that does look super realistic. This is a very simple prompt and due to the nature of body cam footage, this looks incredibly realistic. It really does just does just depend on what your creativity is or where your limits lie.",
        "start": 618.32,
        "duration": 1347.6799999999996
    }
]