[
    {
        "text": " So, the AI industry just snapped and we need to talk about it. If you don't know what this is, cuz right now you're seeing a screenshot and you're thinking, \"What on earth is this?\" But this is a screenshot from a AI music generator tool called Ude. And Udio essentially allows you to generate music from a simple text prompt. You can literally type in whatever style or mood you want and it spits out a song with instruments or vocals completely made by the AI. And this tool has been incredible in terms of the growth that the platform has had. [music] And there is a problem though. There is a very very big problem. Yo AI was trained on music from the internet and some of that music was copyrighted and owned by record labels like Sony and Warner and those guys weren't having any of it. They were super super upset about all of this because a lot of people were making songs and they're basically saying that a lot of the times the AI is making similar songs and the AI kinds of is essentially stealing the likeness of their artists. So it's crazy because the thing that happened today is that Universal Music Group actually settled the major AI lawsuit after these theft claims. Now why is this important? Well, I think the reason this is so important is because we know that pretty much every large AI company is facing massive lawsuits at the moment because in order to make the AI systems, these generative systems, there is of course the you know training process in which you have to show the model tons and tons of examples and usually they don't go to the extent of getting those in the best ways. And so what we have here is the settlement which is pivotal [music] because this sets the president for other AI companies. So this landmark ruling is set to ripple throughout the industry. Now in response to this settlement, the craziest thing what we got to see is that YO decided to ban all downloads from the platform. So this is the message that people were granted with on the morning of October the 30th. This is the message that people saw when they logged into Yuio. In preparation for the next evolution of music creation in partnership with Universal Music Group, downloads from the platform are no longer available. Soon, you'll be making tracks inspired by the artists you love. As a thank you for your support, you'll receive some monthly credits and a onetime grant of non-expiring credits, which is pretty incredible. The long story short is that they're trying to not shut the platform down, but change the platform and move it in a way where the artists are compensated in a way that they weren't before. Now, you have to understand this is pretty crazy. Imagine you've been making music for",
        "start": 0.08,
        "duration": 322.718
    },
    {
        "text": "long story short is that they're trying to not shut the platform down, but change the platform and move it in a way where the artists are compensated in a way that they weren't before. Now, you have to understand this is pretty crazy. Imagine you've been making music for creating some simple music for whatever uses that you may have and all of a sudden you log into a platform and you can't download anything. Now, you have to understand this made people furious. So you can see someone said that I'm a paying pro user here. I spent 10 plus hours every day for 15 months building a catalog. 300 plus songs over 2 minute longs, 21 finished soundtracks and hundreds of shorter works. All created before the download freeze. And I'm not asking for credits or refunds. I'm asking for a time limited full export window for all legacy projects. No extra fees for files I already created. Preserve the data. provide a public timeline and confirm ownership and future access. He says that, you know, my clips are rooted in my songs. And that's one of the things you can do with you. You able to, you know, upload certain things and kind of adjust how the song was generated. And this is pretty crazy. Imagine you were vibe coding an app and then it's like, wait a minute, we can't allow you to download the code anymore because when we train the model, all of the code we trained on was kind of copyrighted. So, it's pretty crazy that this has happened. And of course, users are furious. People went as far as to say that this is a disgusting move by Yio and you're now no longer allowed to download your own created songs and you're just getting a shoddy pop-up. To be fair to Yuio, they are in a bit of a tricky position and it's pretty incredible. This crazy backlash from multiple users has actually prompted Yuio to give a response to the community and they've actually changed. They said, you know, we hate the fact that we cannot offer downloads right now. We know the pain it causes you and we're sorry [music] that we have to do this and we're trying to operate in an incredibly complex and evolving space and we believe that partnering directly with artists and songwriters is the way forward. And in order to facilitate that partnership, we had to disable downloads. And while the transition period is still necessary, we're going to give you access to your creations, we are going to give you a 48 hour period for all users to download their existing songs. And this window will begin on Monday the 3rd of November. So if you are someone who needs to download your songs, you definitely want to mark that date in your calendar. I think, you know, this is pretty crazy because not giving people a notice beforehand, like, okay,",
        "start": 161.599,
        "duration": 597.9990000000001
    },
    {
        "text": "songs. And this window will begin on Monday the 3rd of November. So if you are someone who needs to download your songs, you definitely want to mark that date in your calendar. I think, you know, this is pretty crazy because not giving people a notice beforehand, like, okay, almost immediately. And one of the craziest things I did see is that there was several users who literally just purchased a annual plan moments before this announcement. Now, credit to Yu-Gi-Oh. They are offering full refunds for those plans. But I think the story most certainly goes incredibly deeper. This is a really, really big story because, like I said, this sets the precedent for many other companies. And most lawyers may even cite this as a landmark ruling and say, well, look at what happened into this scenario. Now, remember how I said users have been furious? Some users are even opting out of this. Some users are having this template and they're sending it over to uo.com to formally opt out of this arbitration clause and this class action waiver. You can see many people are liking and retweeting this and essentially it's the updated terms of service that people didn't agree to. Now what people are trying to do is of course fight against this because a lot of people who made music tracks didn't really infringe on copyright in the sense that they didn't you know find an artist songs input it into the system and then come up [music] with their own slightly adjusted. They've made fully independent soundtracks that I guess you could say in some ways because the model is entirely derived from copyrighted works. It's essentially copyright but they were just using the platform [music] as a standard user. And so when you have a platform like this, when you've got a lot of work uploaded and you can no longer download it, it puts you in a really strange position. And I've even seen some users manage to still download those files with a bit of workarounds if you use the Google Chrome browser. Now, the biggest thing that most people are wondering is what on earth is going to happen next. This is certainly a landmark ruling and it certainly caught everyone offguard. Well, essentially they state that they are going to still allow the platform to move forward, but the platform is going to move very differently. It's going to be, you know, completely differently moving forward. You know, moving forward, it's no longer going to be the wild west. And from now on, AI music tools will need to pay rights to holders and only use licensed content, meaning that artists get compensated. But there's going to be much less completely AIdriven songs. As far as I'm concerned, it says that, you know, you can create an artist's voice and style. Artists will set permissions for what and how you can create, allowing you to make",
        "start": 301.36,
        "duration": 875.7590000000007
    },
    {
        "text": "licensed content, meaning that artists get compensated. But there's going to be much less completely AIdriven songs. As far as I'm concerned, it says that, you know, you can create an artist's voice and style. Artists will set permissions for what and how you can create, allowing you to make artist do you want to create with first? You've got the remix and reimagine your favorite songs with AI. You can remix your favorite song in a new genre. And you can take your favorite artists and songs and combine them in novel ways and many more features that will transform how you connect with music. And there's going to be more and more features. Now, this all looks pretty interesting and it sounds somewhat good for the artists. I do think that, you know, rights holders should be compensated. If I was someone who was a musician and they completely ripped off my work and people were able to make money off that, I certainly wouldn't feel good about the situation. However, I do think that this is a very tricky scenario for Yu-Gi-Oh to be in because there was one tweet that I saw that perfectly illustrated why this could be going down the wrong path. Whilst yes, it's good to have users be able to essentially use certain styles and certain artists and then of course be able to compensate that artist when you actually make that song. There is a bigger problem that most people didn't see. So I found this tweet from Utah Teapot and it says here that the point is that the copyright protections and the anti- AI art movement, what they're essentially calling for is, you know, allowing companies to copyright the output of generative systems if they get the rights to the inputs. And once that happens, a company with massive compute can just start the process of copyrighting every possible combination of music notes that isn't copyrighted yet. And then they can unleash search algorithms to match them to any music they find on the internet and then automatically DMCA you. Now, I think that is a really, really dystopian scenario and one that most people wouldn't consider. And when we look at this 20 years down the line, I think that this is a plausible scenario given how people abuse systems in the past. For example, I'm not sure if you're familiar with patents, but oftent times conglomerates manage to find a way to mint these easy patents to protect their proprietary technologies, but sometimes they really go too far and they end up ruining progress in many different industries because if they use the patent, then nobody else can use it without paying them an absurd fee. And with digital soundtracks, this could be on a scale which we've never seen before. Imagine you decide to make a song and then you get a copyright claim that oh, we made this song on our",
        "start": 441.84,
        "duration": 1163.5200000000004
    },
    {
        "text": "patent, then nobody else can use it without paying them an absurd fee. And with digital soundtracks, this could be on a scale which we've never seen before. Imagine you decide to make a song and then you get a copyright claim that oh, we made this song on our and they just are able to completely own that. I mean, it's pretty incredible what could happen. Now, hopefully there's going to be some legislations to stop that, but this scenario was certainly something I didn't consider. Another thing I also didn't consider as well, and I think most people aren't considering, is that how is this going to compare to open- source tools? Right now, open source tools aren't that great. But what happens in the future when those tools are matching or even surpassing paid tools. How will copyright work then when it comes to those tools being freely available? Now, of course, UIO aren't the only company on the hook. There is also Sunno, and they are still in the middle of a massive lawsuit brought around by, you know, major record labels like Universal Music Group and Warner. And this fight is louder than YO because they actually haven't settled yet. So, the courts haven't decided what's going to happen. [music] And Sununo's AI was trained on millions of real songs. And these labels are just claiming that Sunno ripped music straight from YouTube and Spotify, and they used crazy tools to bypass the protections designed to stop illegal downloading. Now, of course, these companies are going to deny these claims, but it's going to be interesting to see how this [music] case pans out now that YO has essentially pivoted to something that is partnering with these creators. And I think it's also quite interesting because this situation is similar to Anthropic because Anthropic recently had to pay out $1.5 billion to settle the book piracy lawuit. And they said that the settlement could be pivotal after authors claimed the company took pirated copies of their work to train the chatbots. And it's really interesting because both these scenarios, Anthropic and UDO and these music companies are facing major lawsuits from copyright owners who are claiming their consent was used to train models without authorization. And these companies are having to part ways with billions of dollars in cash. Now, I think on one side you're going to have the anti-AI crowd who are going to say, \"Yes, this is good. These companies should completely die.\" But on the other side, there are those who certainly find these tools extremely useful because if you're trying to start something, whether that be a business, whether that be a media company, whether that be something that just helps people, often times these tools remove the, you know, high barrier to entry that would otherwise be there, enabling more competition, which in turn results in better products for everyone. Now, I",
        "start": 588.24,
        "duration": 1452.6400000000006
    },
    {
        "text": "whether that be a business, whether that be a media company, whether that be something that just helps people, often times these tools remove the, you know, high barrier to entry that would otherwise be there, enabling more competition, which in turn results in better products for everyone. Now, I exaggeration, but think about how the future is going to be changed with vibe coding. And of course, I believe that in the future, it's going to be much easier to create a business. And all of these AI tools kind of stem from that very fact. So, what do you guys think about this situation? I think this situation isn't that [music] bad. I do think the fact that you're not going to be able to download songs is a bit of an extreme one. Maybe in the lawsuit, they probably said that that is what needs to be done to further remove any infringement. But I do believe that this will just maybe slow down things and not completely stop them. I think open source tools would likely proliferate throughout the smaller parts of the internet and those who really just want to use those tools will simply do whatever they please. So I think yes this is good for the rights holders because they are probably going to get compensated. But on the other hand, if you are someone who's just trying to maybe create like a short film or you're like a student, this is of course a big blow to something that would otherwise have been pretty helpful. Let me know your thoughts. I'd love to know what you guys think.",
        "start": 735.2,
        "duration": 1571.9990000000003
    }
]