[
    {
        "text": " Coding is about to change completely in 2026. Pay attention because we have to talk about this. So, if you've been living under a rock, you may not have realized the Opus 4.5 was recently released. And what this did is fundamentally change the trajectory of AI expectations in terms of where it will be in 2026. This benchmark Opus 4.5 across a range of those that are, you know, software development heavy really did change many perceptions. And in this video, I'll dive into what some of the top minds, some of the top AI companies are actually saying is coming in 2026. So here you can see these benchmarks. If you're familiar with Opus 4.5, this is of course the latest model from Anthropic, and it exceeds all prior models in terms of coding. What makes Opus 4.5 so impressive, however, is that it really is the standout model and the developer's choice for coding due to its ability to edge out all the other models. You can see that on Aentic coding, the Gentic terminal coding and all those other, you know, specific computer benchmarks, Opus 4.5 edges out the competition at least four to 5%. Which might not seem like a huge margin, but considering Anthropic's singular focus on coding, it is a huge, huge bet. Now, why did I make this video? It's not just about the benchmarks. It is about what top Lecherville executives have been saying. So, I bring you Adam Morph. So this is the guy who's working on Claude Code at Anthropic. I'm sure you're probably all familiar with Claude Code. This is Anthropics. Claude Code is the command line terminal tool from Anthropic that actually lets you work with Claude AI directly on your local codebase using natural language. But he recently said something that has a lot of people concerned about where AI is going to be in 2026 for software developers and coders. So, of course, it starts with this recent tweets where, you know, claw tweet out that our engineers have found that Opus 4.5 handles ambiguity and reasons about trade-off without handholding, you know, and they tweet more about the recent Oppus 4.5 and just how good that model is. And then we see Adam say that this new model is something else. Since Sonic 4.5, I've been tracking how long I can get the agent to work autonomously. With Opus 4.5, this is starting to routinely stretch to 20 or 30 minutes. And when I come back, the task is often done simply and idiomatically. So, it seems like the length of task that Opus 4.5 is able to do autonomously is increasing. But not just that, this isn't the major statement that had everyone confused. This is the statement that had everyone somewhat concerned. And it was his statement stating that software engineering is done. He said that I believe the new model in claude code is a glimpse of the future we're hurtling",
        "start": 0.32,
        "duration": 340.6380000000001
    },
    {
        "text": "just that, this isn't the major statement that had everyone confused. This is the statement that had everyone somewhat concerned. And it was his statement stating that software engineering is done. He said that I believe the new model in claude code is a glimpse of the future we're hurtling of the next year software engineering is done. Soon we won't bother to check generated code for the same reasons we don't check compiler output. Now this is where he's comparing AI written code to compiler output. You don't read machine code a compiler produces. You trust it. It works and you just build on top of it. And he's basically saying here that AI code will reach the same level of unquestioned reliability. Now understand that this is not a small statement. This is an industry veteran saying that this part of engineering is about to vanish. Now the tweet might seem like it only has 32,000 views, but it was relatively popular on Twitter with the tweet gaining over, you know, a million impressions, a lot of discussions, and this isn't a hyper merchant. This guy is a, you know, meta director of engineering, a CTO level leader. This is someone who you know manages thousands of engineers and when he says that software engineering is done people take it seriously. Now of course we do dive deeper into this because there is a lot to dive into. So he you know still adds that I love programming and it's a little scary to think that it might not be a big part of my job. But coding was always the easy part. The hard part is the requirements, the goals, the feedback, figuring out what to build and whether it's working. There's still so much left to do and plenty the models aren't even close to yet. Architecture, system design, understanding users, coordinating across teams. It's going to be continuing to be fun and interesting for the foreseeable future. So, you know, most people misunderstand this. Coding is basically translating your idea into syntax and then engineering is deciding what those ideas are. Coding is essentially mechanical. Engineering is conceptual and AI is swallowing the mechanical part and the conceptual part is probably going to remain very human. Now this kind of lands hard with anyone in tech. Writing code is somewhat straightforward once you know the direction. But the defining the direction is where 80% of the engineering time goes. Tasks AI still struggle with is of course requirements gathering, trade-off decisions, constraints planning, ambiguous goals, user empathy. All of these things are pretty hard and this is why you know the senior's engineers think a lot longer. Essentially what he's stating here is that humans are likely to move up the abstraction ladder where AI becomes the builder and humans become the architect. Now of course some people argued against this and he said that aren't all of those aspects of software engineering",
        "start": 170.319,
        "duration": 618.958
    },
    {
        "text": "think a lot longer. Essentially what he's stating here is that humans are likely to move up the abstraction ladder where AI becomes the builder and humans become the architect. Now of course some people argued against this and he said that aren't all of those aspects of software engineering tweet versus software engineering? And he does clarify that yes I should have said coding and not software engineering in my second tweet which does make sense. Someone else also says I preface it to coding is done. Software engineering as we know it has already evolved but it is still much a very core job function that is needed to ship software. Every software engineer should be shipping at 10 times the velocity of 2023 today with 100 times in the next year. And he says yes it depends on how broadly you think of software engineering versus systems engineering but you've got the idea. The writing the code pub will of course be automated. Now, of course, in his tweet, he does say that, you know, quite likely by the mid 2026, it's likely to be automated. And so, I decided to draw up a chart of where, you know, the SWE bench verified, which is where you have AI coding performance, where that will be in, you know, 2026. And the future projections do show us that we are quite likely to get there at least by the end of 2026. And it basically shows that AI coding performance is doubling every few months. AI can perform at or above a mid-level engineer on SWE bench. And this isn't a toy benchmark. This is the gold standard for real world GitHub bugs and tasks. And you can see how we literally went from 2% to 80% automation in under 18 months. I think you have to understand that that's pretty crazy and the last 20% is going to happen even faster. And that's why he said that look if you just look at this kind of trajectory we can see that it's quite likely that very soon software engineering is going to be well at least the coding part is going to be largely automated. I mean look at it the 1st of October 2023 claw 2 scored 1.96%. AI couldn't even code. It was basically useless for real engineering work. Then in August 2024 the models jumped to 33%. This was the first shock. 17 times improvement in under a year. And most people actually thought this pace would slow down, but it didn't. Then early 2025, the mid-level engineer moment happened. Claude 3.5 sonnet hit 49%, Claude Story, the Midwood agent hit 62% and Claude 3.7/SODITE 4 hit 70%. And this is where AI became basically the engineer. And we can see that mid to late 2025 all of the models started to get around 80% to 77%. So when you look at that forecast zone of 2026 to 2027",
        "start": 312.479,
        "duration": 911.0380000000002
    },
    {
        "text": "agent hit 62% and Claude 3.7/SODITE 4 hit 70%. And this is where AI became basically the engineer. And we can see that mid to late 2025 all of the models started to get around 80% to 77%. So when you look at that forecast zone of 2026 to 2027 to 95% this is where software engineering as we know it today breaks the future estimates show that you know there's going to be 95% plus which is basically human irrelevance territory and it makes sense. So what you have to understand is that we often underestimate how quickly AI tools can advance and we underestimated AI coding. We thought it would take maybe a decade. It took 12 to 18 months and we're already at mid-level engineer performance. So the final stretch is likely to be faster than the first and this is where entire job categories are going to flip. So where engineering shifts from typing code to specifying intent and this disruption is going to arrive by 2026 to 2027. And we can see that this forecast which actually used AI to do this. I used Gemini 3, I used Claude and I used GBT5 Pro. All of them had this similar prediction. Now, he's not the only one that has said this. Some of you might think that, okay, this is someone that has the incentive, considering that they work at Anthropic, to sort of hype up their own products and to basically say that, look, this is the end, it's the end, yada yada yada, because of course, there is somewhat of an incentive. However, he isn't the only CEO/ you know, person in this industry that has said that. I did a video a year ago where Amazon's [music] cloud chief tells employees that most developers could stop coding as soon as AI takes over. And I do remember this video. It went pretty viral because the conversation was actually a leaked internal meeting. So, we had the article from Business Insider. I'll give you guys a quick brief. And there's other CEOs I'm going to get to in a moment. So it was a leaked audio from AWS CEO Matt Garin and he was basically saying that Amazon were fully preparing for a world where human coding largely disappears within 24 months and he says that most developers may not be coding at all in 2 years. Coding is just a language and not the real skill. The real value and skill will be in innovation, product thinking and understanding customer needs. You can see here where this is where he said that if you go forward 24 months from now or some amount of time I can't exactly predict where it is. It's most possible that most developers are not coding and this prediction was made in August 2024 and 24 months after that is August 2026. So [music] that's why if we look at 24 months, let's look at where",
        "start": 459.599,
        "duration": 1186.0769999999989
    },
    {
        "text": "some amount of time I can't exactly predict where it is. It's most possible that most developers are not coding and this prediction was made in August 2024 and 24 months after that is August 2026. So [music] that's why if we look at 24 months, let's look at where is basically lining up with the actual projections of Q3 moving on towards Q4 of 2026 where Agentic scaffolding breakthroughs take these benchmarks to 90%. And of course, if you have models that are at 90%, we could argue that yes, there are going to be most individuals that aren't coding. Now, it's important to understand that his prediction is somewhat right [music] in, you know, we can see here it says that his tone was, you know, optimistic, suggesting more creative opportunities for developers. He said that AWS was helping employees continue to upskill and learn about new technologies to increase their productivity with the help of AI. Being a developer in 2025 may be different than what it was to be a developer in 2020 and we could probably say the same thing about being a developer in 2026. Additionally, remember when Nvidia Jensen Sen Huang said that anyone can be a programmer. He said that anyone can be a programmer and has closed the digital divide. This is where he basically said that you know anyone can talk to computer and you just have to say something because AI lowers the barrier to coding to almost zero. you no longer need traditional programming skills. Natural language instructions are enough. And he says that this marks a new era of computing similar to previous generational shifts and is enabled by Nvidia hardware powering systems like chat GPT. Now this was from quite a while back so it's not that up to date but his prediction was basically spoton. Now of course I'm not going to get into all the bugs with vibe coding but for the most part the statement is pretty relevant. And in addition, I will add that there is also Mark Zuckerberg who said something rather similar. Mark Zuckerberg, and this wasn't that long ago. I believe it was earlier this year where he said that, you know, AI could soon do the work of Meta's mid-level engineers. Mark Zuckerberg basically told Joe Rogan on a podcast that Meta will begin automating the work of mid-level software engineers in 2025 using an eternal AI system that can write production quality code. And as a mid-level engineer, you know, Meta and these other tech giants are building these, I guess you could say, replacement tools. I mean, it's pretty crazy for them because if you know, at these high, you know, earning tech companies, mid-level engineers can earn mid6 figure salaries. So, replacing them with AI, unfortunately, it's actually quite economically attractive, which goes to show the wider industry trend. Now, of course, some people are saying that this doesn't make sense. You guys",
        "start": 599.519,
        "duration": 1471.676999999998
    },
    {
        "text": "you know, at these high, you know, earning tech companies, mid-level engineers can earn mid6 figure salaries. So, replacing them with AI, unfortunately, it's actually quite economically attractive, which goes to show the wider industry trend. Now, of course, some people are saying that this doesn't make sense. You guys jobs up for grabs, but I do think you have to understand that yes, software engineers are still going to be needed, but the job change is going to just, you know, be quite different than what it is now. Take a look at what Dario Amade said in his, you know, interview, but now getting to kind of the job side of this. , I I I do have a fair amount of concern about this. , on one hand, I think comparative advantage is a very powerful tool. If I look at coding programming which is one area where AI is making the most progress what we are finding is we are not far from a world I think we'll be there in three to six months where AI is writing 90% of the code and then in 12 months we may be in a world where AI is writing essentially all of the code. He basically said that you know AI is going to get to the point where AI is going to write 90% of all code and I think that that's a fair statement. He basically is talking about the total volume of code types by humans. Meaning that you know developers using AI autocomp completion and agentic refactoring 50 to 80% of that code is often AI suggested even today. And this you know 90% of code written by AI claim is not about the capability completeness it's about the productivity distribution. He did have a pretty optimistic timeline, but I think if we extend it by, you know, maybe one or two years, it's largely correct.",
        "start": 745.519,
        "duration": 1628.4769999999983
    }
]