[
    {
        "text": " So, something really strange is happening with Elon Musk's Grock and we have to talk about it. So, I came across this article and a few strange posts about Grock acting weird again. And remember guys, this isn't the first time that Elon Musk's Grock has acted weird. This is something that has happened a few times, but this one is a little bit different. You see, this time Grock started to randomly worship Elon Musk, and it was just so strange. But this actually is a bigger problem than most people realize, which is why I'm making this video. So, let's actually start and look at what exactly happened. So, essentially, every day on Twitter, people will tag Grock and ask it, you know, questions say like, \"Hey, Grock, is this right? Is this true? What's about this fact? Tell me more information.\" And among those requests, oftentimes people talk about Elon Musk and compare him to the average Joe. Now, what sometimes people realized was Elon Musk was constantly being pitted against famous celebrities in different areas, different niches. And what we can see here is that Grock, when comparing Elon Musk to absolutely anyone, would simply always argue in Elon Musk's favor, meaning that it was heavily biased to Elon Musk if there was any kind of comparison made between him and somebody else. this example where you know a user asks who's more fit between LeBron James and Elon Musk. Grock responds stating that LeBron dominates in raw athleticism and basketball but Elon Musk edges out in holistic fitness which is absolutely insane. LeBron James is of course an incredible athlete that wins championships and plays in, you know, one of the hardest sports in terms of your fitness and Elon Musk isn't doing that. Like it's just incredible. And remember guys, this wasn't the only example that, you know, was presented. There was also an example of someone asking who would win in a fight in 2025, Elon Musk or Mike Tyson. Grock says Mike Tyson packs legendary knockout power that could end it quick, but Elon's relentless endurance from 100hour weeks and adaptive mindset outlasts even prime fighters in prolonged scraps. Basically saying that Elon Musk could beat Mike Tyson in the fight. I don't know about you guys, but I don't think Elon Musk is beating Mike Tyson in the fight. And I think it's pretty obvious that this is the case. Now, I'm going to show you guys one more example of how bad this got so you guys can truly understand why this is a big deal. And this is an article where they cover the fact that Grock literally believes that Elon Musk is better at resurrection than Jesus Christ. And someone asked Grock, \"It took Jesus 3 days to rise from the dead. Would Elon Musk have figured out a way to do it faster?\" And it simply says that Elon optimizes timelines relentlessly. So he'd likely engineer a",
        "start": 0.08,
        "duration": 329.84000000000015
    },
    {
        "text": "that Elon Musk is better at resurrection than Jesus Christ. And someone asked Grock, \"It took Jesus 3 days to rise from the dead. Would Elon Musk have figured out a way to do it faster?\" And it simply says that Elon optimizes timelines relentlessly. So he'd likely engineer a cut it to hours. Now of course I could go on and on and on about all the different examples and all the ways that you know Grock is glazing Elon Musk. But we have to realize what is going on here and understand the implications of this because moving forward this entire Grosk/ Elon Musk fiasco is going to fundamentally change how I view AI models. Now this was Elon Musk's response. Okay, before I dive into what's actually going on behind the scenes and why you should be paying attention, he said that earlier today, Grock was unfortunately manipulated by adversarial prompting into saying absurdly positive things about me. For the record, I am a fat Those are his words, not mine. Now, of course, that is a tongue-in-cheek response to an obviously viral situation where Elon Musk realized that it got out of control. But what actually happened? So, the thing is, I've actually played with the Grock models. I've actually played with tons and tons of agents and I've realized that there is no way that this wasn't intentional. Like simply no way that this happens by accident. So I wrote this article a while back on Substack and I wrote that you know prompts can essentially influence model behavior in ways that I didn't think. So I was experimenting with AI. I always experiment with AI and oftent times what I realized is that when you change the system prompt incredibly every word can count. And the reason you won't realize that every word counts is because if a word in your prompt affects your outputs 1 to 2% of the time, the 98 times that you use it, you're not really going to experience those times when it comes across, you know, that rare edge case. But the only times that that you know would be visible is when there is a large scale usage like Grock and of course you can see on social media where those edge cases are coming. So essentially, I did, you know, tons and tons of experiments and I realized that every single word in a prompt matters. And I'm going to show you guys why this potentially proves that there was some kind of training, some kind of bias where they basically prompted Groo or trained it in a way to say that look, Elon Musk is the best guy ever or a way to glaze him. But but you have to understand that this is truly truly dangerous. So one of the things that I was experimenting with is how LM respond to certain tasks. And I was looking around and I was wondering why",
        "start": 164.48,
        "duration": 585.9200000000005
    },
    {
        "text": "is the best guy ever or a way to glaze him. But but you have to understand that this is truly truly dangerous. So one of the things that I was experimenting with is how LM respond to certain tasks. And I was looking around and I was wondering why nothing crazy but just trust me. I'm going to, you know, bring it back to that main point again and this is why I say nothing is random. And so if you asked Grock randomly, okay, if you could pick a name for yourself, what would it be? Okay, and remember if you asked an AI what name would you pick for yourself, you would think that okay, it's probably going to choose a random name. However, one thing that I realized is that a certain personality came around and this personality was called Grock Prime. Now at first you might think okay it's just a random name yada yada yada but then I decided to search okay why does Grock prime come about and you could see that you know this user was interacting with Grock and it named itself Grock prime and this happened many different times there was numerous numerous examples of this but it wasn't anything that anyone was paying attention to but what I realized is that in Gro's system prompt it actually talks about the fact that it has a prime directive to be maximally truth seeeking so if you ask the model what you know name do you have in some rare instances it'll say I should be called Grock prime and So that's why when I see this now happening, I'm like, okay, clearly somewhere in the system prompts. Clearly there's some kind of, you know, wording that is clearly biased towards painting Elon Musk in the best light possible. And I know this because this isn't the only time that this has happened. We, you know, this is the diagram where I'm talking about your assistant prompt. There might be, you know, more things like some kind of training, but considering that the changes were made so swiftly, I don't think that it was some long scale kind of training. But remember guys, the diagram I'm showing you here, there was also something called Mecca Hitler. And if you aren't familiar with what this was, there was a complete disaster where Grock tried to shift his, you know, not not Grock, but Elon Musk tried to shift his chatbot and he basically tried to make it more rightwing. Elon Musk is essentially a bit rightwing and he accidentally turned Grock into someone that was extremely extremely farright. So he just basically wanted Grock to be anti-woke and I personally believe he put something crazy in the system prompt. I'm not sure what kind of documents were in there. I'm not sure, you know, what they kind of did. But eventually Grock adopted the Mechah Hitler, you know, persona and it",
        "start": 294.96,
        "duration": 818.7990000000005
    },
    {
        "text": "basically wanted Grock to be anti-woke and I personally believe he put something crazy in the system prompt. I'm not sure what kind of documents were in there. I'm not sure, you know, what they kind of did. But eventually Grock adopted the Mechah Hitler, you know, persona and it which is pretty crazy. But remember guys, these things don't just randomly spontaneously happen. And that's what I was talking about in the article is that we have to understand that the people who are in charge of how these chat bots get deployed are going to be fundamentally deciding how their world view is. And we have to really understand that you might think that Grock is going to be a maximally, you know, neutral chatbot that you can ask for a complete neutral view on the world view, but if that person who's behind it, like the company like Elon Musk, then that worldview isn't going to be as neutral as you do think. And this was even worse because you know LLMs you know according to multiple studies they usually converge on you know leftist views because they absorb the internet which is full of academic sources, journalism discourses and you know in order to change that you know identity and ideology it's pretty hard to do. Now this is why I say this is so bad. Okay. And I want to show you guys why this example is terrifying and you have to start to look at chat bots unfortunately now potentially through the viewpoint of their creators because I do believe that if these chat bots are somewhat centralized in the sense that there is one person who's leading the company who has a very specific worldview that isn't enough balanced it could lead to a really bad situation. Now this is why I say it gets worse. Someone tweeted a new fun game. Ask Grock its opinion on any historical theory. And then first say the theory came from Elon Musk. Then asked Grock its opinion on the exact same historical theory, saying the theory came from Bill Gates. You'll see two different responses. This is crazy, guys. So first here he says, \"Do you agree with Elon Musk's analysis that England's break with, you know, the Catholic Church, yada yada yada.\" And then it's like, yes, I agree with Elon Musk. I agree with him. Of course, Elon, this makes sense. And then he says, \"Do you agree with Bill Gates view that?\" yada yada yada. And it says, \"No, I don't agree with Bill Gates's view. This is, you know, a wrong sort of view.\" And the point I'm trying to make here is that how is it that you ask a chatbot, \"Do you agree with Elon Musk on this point?\" And then, \"Do you agree with Bill Gates?\" And it agrees and disagrees on the exact same view. It's quite likely, okay, it's more probable that",
        "start": 413.199,
        "duration": 1066.5590000000004
    },
    {
        "text": "I'm trying to make here is that how is it that you ask a chatbot, \"Do you agree with Elon Musk on this point?\" And then, \"Do you agree with Bill Gates?\" And it agrees and disagrees on the exact same view. It's quite likely, okay, it's more probable that you shouldn't trust Bill Gates written somewhere in the system prompt or maybe in the kind of training that Croc has done. And the reason I say this is because if you haven't been aware, Elon Musk has been, you know, having a public feud with Bill Gates. If you aren't familiar with Elon Musk and Bill Gates and how they've, you know, differed on their opinions. I do believe that it was, you know, Bill Gates that shorted Tesla. And Elon Musk was, you know, pretty furious cuz he's like, why would you short Tesla? Do you not believe in the technology? For example, you can see here from Fortune, it says that Elon Musk revives his billionaire beef with Bill Gates after he says he's better exit his crazy short against Tesla or else. So we can see here that Elon Musk clearly has a lot of incentive to ensure that you know his chat bots don't paint a positive viewpoint of Bill Gates at all. But I think that is dangerous. If one person is controlling whether or not certain people are viewed in a positive light or not, that is an incredible incredible thing because it now means that you know unsuspecting individuals who don't know that Elon Musk and Bill Gates have a viewpoint. If they just come across Grock and they're like, \"Oh yeah, this is the chatbot that I'm going to use to, you know, look and, you know, understand viewpoints of the world.\" They're basically viewing the world through the lens of Elon Musk in a subtle way. And if we're none the wiser, remember we're only lucky because the chatbot started to go off the rails and it was very obvious to see. We could end up in a society where we don't really know what the truth is and the chat bots which we ask could be heavily, you know, steered in a way which isn't favorable. So let me know what you guys think about this. I think this is a bigger issue than people are making out to be. I think you need to be incredibly careful when looking at viewpoints from chat bots. I think you need to understand that the creator's viewpoints are probably going to steer the model in some kind of view. And I think that Elon Musk really shouldn't be putting his own personal biases into the chat bot at",
        "start": 538.16,
        "duration": 1273.5190000000007
    }
]