[
    {
        "text": " Did you know that there is currently an ongoing boycott to boycott Chat GBT from many different users? So, let's dive into it. So, on Instagram, there is this post that is going viral and it is quickly gaining steam across social media. This is called quitgptt.org. So, the post essentially says, \"We're launching an international boycott of chat GPT for financing Trump and giving tech to ICE.\" If you're unaware of the political landscape right now, it is very politically divisive at the minute. A lot of people don't agree with what's going on in America. And because of that, a lot of things are happening. Now, the viral post here says that breaking chat GBT is Trump's biggest donor, and they're not stopping. OpenAI's president gave Trump $25 million in 2025, and OpenAI is collaborating with ICE. Now, here's the thing, guys. I don't want this video to turn into a video about politics. So, just for your full disclosure, I'm only going to focus on the business aspects of this story because I think this is a very intricate topic. Now, here's the thing. I did actually want to fact check this stuff and before I dive into more of the different slides of the post, you can see here that it does say that OpenAI exec becomes top Trump donor with $25 million gift. Greg Brockman, the chat GBT's makers president, is helping fund Republicans congressional fight. So, that is actually true. And I also found an article that says the United States Department of Homeland Security has released a new database revealing how its immigration and customs enforcement agency relied on AI tools from Sam on Open Eye and Palanteer. The immigration agency has been at the center of criticism after federal agents have engaged in certain activities and according to the database is using an AI assisted ré screening tool powered by open GPT4 sold by another company. Now what's interesting about this is that the disclosure is coming days after open Ice Multman CEO actually criticized ICE and in an internal Slack message to its staff he actually said that the agency's approach has gone too far and they need clearer limits. Now if we go back to the viral Instagram post you can see here that they're essentially trying to screw over Chat GBT and it says that Chat GBT and trust me guys when I when I dive into the actual comments on this post it just gets even crazier. So the post clearly says that Chat GBT is vulnerable to a boycott. OpenAI is in deep debt and their only advantage is that they have the biggest brand name. We can screw them over just by switching to another free chatbot like Gemini or Claude and you can join now at quickgbbt.org. And they're essentially saying, look, join the boycott, delete JBT, cancel your subscriptions, take the pledge, and send this post to 10 friends. Now, you might",
        "start": 0.08,
        "duration": 312.40000000000003
    },
    {
        "text": "name. We can screw them over just by switching to another free chatbot like Gemini or Claude and you can join now at quickgbbt.org. And they're essentially saying, look, join the boycott, delete JBT, cancel your subscriptions, take the pledge, and send this post to 10 friends. Now, you might this going viral? Are people even talking about this? Well, for one, I haven't actually seen people talk about this on Twitter. The only person I actually saw post about this was AI safety memes, which is how I came across this. And other than that, I don't think people seem to be boycotting Chat GBT. However, on other platforms, it does seem like there is something wrong. Now, let me show you guys what I'm talking about before we get into comments on this post because it's an entirely different issue. There are a few posts on Reddit of people saying that they're going to actually join this boycott. So you can see here that there is a post on Reddit and if you go onto the subreddit where chatbt is this is literally the first post that you will see. The first post literally says that look openai Gregs Brockman gave 25 million to Mara in 2025. They gave Trump 26 times more than any other major AI company. I screening resume tool is powered by OpenAI's GB4 and they're spending $50 million to prevent states from regulating AI. They're cozing up with Trump and many people have quit opening eye because of its leadership lies, deception, and recklessness. A friend sent me this quit boycott GBT site, and it actually inspired me to do something about this. They want to make us think we're powerless, but we can stop them. If we make an example of chat GBT, we can make CEOs think twice before they get in bed with Trump. And it says, if you need a chatbot, just switch to Claude, Gemini, or open source models. It just takes seconds. People think Chat GBT is the only name in the game and they don't know that it's Trump's biggest donor. It's time to change that. And what's crazy about this is that like this is, you know, not something that, you know, people are downvoting. A lot of people are agreeing with this. And the crazy thing is that this is not the only post in that subreddit. Okay, there's another post that says, \"I just canled my Chat TBT Pro subscription. Discovering Greg Brockman gave 25 million to Trump's inauguration fund was the last straw of many. I've had Gemini and Chat TV for a while now. Gemini is, you know, similar, sometimes better quality with not much difference, yada yada yada. However, the last few years, all the scandals have piled up, and I've always had a horrible feeling about Sam Alman. I feel like he's super evil, and I never realized that Greg Brockman was",
        "start": 156.16,
        "duration": 553.8389999999999
    },
    {
        "text": "Gemini is, you know, similar, sometimes better quality with not much difference, yada yada yada. However, the last few years, all the scandals have piled up, and I've always had a horrible feeling about Sam Alman. I feel like he's super evil, and I never realized that Greg Brockman was clearly starting to spill over into other social media channels. And the most interesting thing about this, okay, is that there are like three different sides right now. On one side, I think you've got people that just don't care that this is happening. They just want to use chatbt. On the other side, you've got people who are actively saying, \"Look,\" you've got people who are basically saying, \"Look, we are going to boycott Chat GBT. We are going through with this.\" And you can literally see here that as of recording this video, the current amount of people that have taken part in this is 112,000. Now, just to show you guys how minuscule that number is, I think, you know, OpenAI's user base is 900 million weekly users or 800 million. So, this is pretty a drop in the ocean. But, nonetheless, this is not a good kind of PR stunt. This is really isn't good because I think people don't realize that, you know, your personal politics can affect your position of your company. It can it can really really affect, you know, how well your company does. But you can see, you know, there's just a lot of stuff where they're talking about organizing it, you know, the different alternatives that you can use. And it literally says right here, thankfully, hardly anyone uses Grock anyway, but yes, please don't use Grock because apparently their AI company is way worse. Now, I want to get into some of the comments on this original post because I think this just goes to show you the levels of AI and how different it is. So, because the public, you know, reactions were surprising even to me. So, what I found was that it says you could just boycott all of AI since it's all destroying the environment and draining our already depleted and finite water sources. And this is crazy because it literally, you know, is someone saying that look, this is okay, we want to boycott AI, but someone's like, no, we don't even care about AI at all. They're just grouping all AI together. Now, what's crazy about this entire thing is that it doesn't seem to just be one person. It seems to be absolutely everyone. If you look at more comments, it says, \"Don't switch. Just use your brain instead of the AI slot machine.\" And someone else says, \"No switching. Just [music] stop using it.\" Which is pretty crazy when you think about it. And if we look at more comments, more people are saying, \"Please just stop using AI at all. You don't need to use Gen AI. You don't need",
        "start": 278.639,
        "duration": 779.999
    },
    {
        "text": "slot machine.\" And someone else says, \"No switching. Just [music] stop using it.\" Which is pretty crazy when you think about it. And if we look at more comments, more people are saying, \"Please just stop using AI at all. You don't need to use Gen AI. You don't need It's just all of AI, which is pretty crazy if you ask me. Like, it's not even like people are like, \"Okay, we see a problem with it.\" People are just like, \"Okay, we don't even want to use AI. Full stop.\" So, what I think is going on here is that people are going to have any reason to not use generative AI. And if you're wondering why people are so furious with AI at the moment, you need to watch my video on the surprising AI backlash that people aren't talking about. Currently, there is a tremendous AI backlash because most people don't benefit from AI in its current format. other than a chatbot that you can quickly use. And people aren't too hyped about the fact that AI is going to replace them, take their jobs, steal creatives careers. I mean, there isn't really much in it for the average person. So, most people have a disdain towards AI. And I know you might not think that, but if you're watching this channel, you're in the minority of people who actually enjoy AI, watch AI, consume AI content. Most people are not like that. And like I said, if you guys thought that it was just on Instagram, if you go on to Reddit, there's another post. are literally all the top posts are literally just people just canceling chat activity subscriptions. You can see here it says you've canceled your chat subscription and it says how many of you have done this. This one has 4,000 up votes. 4,000 up votes is a decent amount of up votes guys. There's another post here that says there's a mass cancellation party hosted by Gemini and Grock. And it says join us to celebrate the massive wave of subscription cancellations for Chat GBT and OpenAI. Let's toast the new AI era. Gemini and Grock are special guests. Basically saying RIP OpenAI. I mean, honestly, guys, this is super super fascinating because you would not have thought that this backlash would have got to the point where people are looking at the situation and going, \"Okay, we're now going to start canceling our subscriptions.\" As I was making this video, there was actually another video posted by the account and this one is gaining a little bit more steam. Now, I've watched this video and I do have to say that I think that this probably might become a bigger problem for OpenAI than they do think because I don't think you realize how much these kind of things spread. So, like I said, I'm not here to discuss the politics of what's",
        "start": 394.24,
        "duration": 1014.557
    },
    {
        "text": "video and I do have to say that I think that this probably might become a bigger problem for OpenAI than they do think because I don't think you realize how much these kind of things spread. So, like I said, I'm not here to discuss the politics of what's going to be super interesting the fact that OpenAI is now being put in a more vulnerable position. Now, of course, I own an AI channel. I'm more for AI than anyone else. I do think that Genai has used to be good. I do think that other companies are, you know, promoting Gen AI in a good way and I do think that it can be a co- tool. But this kind of situation that OpenAI is in, I think it puts them in an even trickier position because OpenAI is facing a multitude of different problems. And now you have the essentially large amounts of the population, they're probably not going to be too happy with them in terms of how they've involved themselves in politics. I mean, I think I might play a small segment of this video. Like I said, I'm not trying to focus on the politics here, but if we look at this just from an AI landscape, how is OpenAI going to survive if millions of people start to cancel their subscriptions? I already know that OpenAI did already admit to messing up the recent version of Chat TBT. And that's personally a reason that myself, I've already stopped using it for most of my day-to-day tasks. And that's not me just saying that for the video sake. It genuinely hasn't become that useful unless you're doing some really advanced engineering or mathematics. So, take a listen to this. Let me know what you guys do think about this. And of course, I'd love to know what you guys think about Chat GPT and exactly how OpenAI are going to survive this. One of the most impactful things you can do today to fight ICE and stand up to Trump is to cancel your Chat GPT account. I know that sounds bizarre, but by the end of this video, you're going to want to do exactly that. Open Ice President Greg Brockman recently gave $25 million directly to Donald Trump. That's more than any other tech company in Silicon Valley. The friendly chatbot you use every day, well, its co-founder is Trump's biggest donor. this cycle. But it gets much worse. ICE just started using opening eyes technology to screen job applicants. The same company that makes Chad GPT is now helping ICE decide who to hire for deportation rates. And they're not stopping there. Open AAI helped launch a $100 million super PAC to make sure no state can regulate AI. They're attacking any politician who tries to pass safety laws. They want Trump and only Trump to write the rules for the most powerful technology on",
        "start": 513.839,
        "duration": 1260.2369999999994
    },
    {
        "text": "deportation rates. And they're not stopping there. Open AAI helped launch a $100 million super PAC to make sure no state can regulate AI. They're attacking any politician who tries to pass safety laws. They want Trump and only Trump to write the rules for the most powerful technology on OpenAI because of its lies and its recklessness. Did you know that the company was actually founded as a nonprofit to make AI for the benefit of all of humanity? Well, they recently abandoned that goal to make as much money as possible.",
        "start": 638.399,
        "duration": 1287.197999999999
    }
]