[
    {
        "text": " So Google's AI CEO just called out OpenAI on their recent decision and we need to talk about it. So on the big technology podcast, we can see that Demis called out OpenAI for essentially putting ads in their product. Now it's not just about the ads. It's about the fact that if AJI was around the corner, why do you need to sell ads inside of your product? So take a look at the statement and then we'll dive into more what's going on. I think actions speak louder than words. Going back to the original conversation we were having with, you know, Sam and others claiming AGI is around the corner. why would you bother with ads then? In that statement we can clearly see that in that statement we can clearly see that why would you bother with ads then? And this of course begs the question why would you bother with ads if AGI is around the corner? Now you have to understand this isn't like some kind of jab at other companies. Google doesn't need to jab at OpenAI but the question is if AGI is around the corner why are OpenAI fumbling around with ads and this is why I said in my previous video this is why Google has won. Because when you look at the difference between companies like Google and OpenAI, Google doesn't need to, you know, start ruining the product or implementing ads into their chat GBT. Their chat GBT which is Google Gemini is just a simple core offering. Take a look at what Demis says for the future of Google Gemini in terms of ads. So that is I think a reasonable question to ask. but I I I think look from our point of view we have no plans at the moment to to do ads if if you're talking about the Gemini app right specifically I think we are going obviously we're going to watch very carefully what you know the outcome of what Chhatri are saying they're going to do I think it has to be handled very carefully and so yeah what he's saying is extremely true it does have to be handled very very carefully because of course one of the things you are concerned about is your privacy. Now, the clip that I've got on screen right now is floating around the internet because not just are people questioning Chat GBT's recent choices, not because the company's going through many different struggles, which I've spoken about, they're questioning them because of the statement that the CEO made last year. So, I think it was actually two years ago now, but in 2024, Sam Alman made a statement and he basically said, well, think about it like this. If we produce ads, that would be a last resort. And that would be like, you know, saying that the company is kind of in trouble. But in this interview clip,",
        "start": 0.16,
        "duration": 273.52
    },
    {
        "text": "now, but in 2024, Sam Alman made a statement and he basically said, well, think about it like this. If we produce ads, that would be a last resort. And that would be like, you know, saying that the company is kind of in trouble. But in this interview clip, weird because at the moment, he's saying that the company is still doing fine despite everything, but they're placing ads. And he previously said that if they're placing ads, the company's clearly not doing that well. I mean, take a listen for yourself, judge for yourself. I kind of think of ads as like a last resort for us for a business model. [music] , I would do it if it meant that was the only way to get everybody on the world in the world like access to great services. But if we can find something that doesn't do that, I'd prefer that. So I think it's clear that OpenAI's, you know, financial position has made them reconsider some options that they probably wouldn't have considered before. Now, of course, this happens. It's business, it's strategy, and I personally do think that this is super interesting because I hope this doesn't become super dystopian. So the crazy thing as well, I'm going to show you guys one more clip of where Sam Alman, you know, says this again, okay? And this is why it's like a problem because most people already don't have a lot of trust in Saman on OpenAI because of all the history between him and Elon Musk and you know how the company was founded. You know there's a huge debacle huge lawsuit what's going on there. But the main thing okay is the fact that this wasn't just a one-time thing. Okay so of course you can say you know you can see right here that it says you know we're not going to accept money to influence the chat answers chat gives you and we keep your conversations private from advertisers. I'm not sure if I'm going to believe that entirely. I'm sorry, but I think the incentive for them is just too high. And I think one life principle I've always stood by is that if you show me the incentive, you'll show me the outcome. I, you know, and I don't remember where that's from, but it's not my quote. And I'm pretty sure someone famous said it. I just can't remember off the top of my head. And so, if you look at the incentive for OpenAI, if they're able to deliver the very best ad business in the entire planet, they could become monster business. Because most people don't realize this, but Meta, okay, Mark Zuckerberg's company, their ads are phenomenal. And I genuinely don't know how it works because every time I go on their app, there's an ad and I click most of their ads because their ads, it's like someone's reading my brain and",
        "start": 136.959,
        "duration": 496.15999999999985
    },
    {
        "text": "people don't realize this, but Meta, okay, Mark Zuckerberg's company, their ads are phenomenal. And I genuinely don't know how it works because every time I go on their app, there's an ad and I click most of their ads because their ads, it's like someone's reading my brain and genuinely want to buy. So Meta's ads are extraordinarily good and they print money from them. They print billions of dollars a year. So if OpenAI can do something that is even better than Meta, they're going to be sitting on a pile of cash. Problem is, if they need to do that, the only way that they could do that is by of course having the user data. And how do you manage that data? Now, the reason that people probably won't trust OpenAI to manage their data is because look at this. Okay, so someone asked Grock, okay, and they said that Grock, what was Samman's quote about ads in Chat GPT? And Samman in 2024 called ads integrated into Chat GBT a dystopian idea. It's easy to imagine dystopian visions of the future where you ask Chat GBT something and it replies, you should think about buying this product, you should go here for this vacation or whatever. And so if he said that this is a dystopian vision, are we truly living in this dystopia? Now, here's the clip from Lex Freedman so you guys can see this for yourself. I mean, it it's surprising. Okay, it is very very surprising, but at the end of the day, this is, you know, what he said. Okay, I'm not taking anyone's word out of the mouth. This is exactly what he said. Yeah. What about the ads side? Have you ever considered monetization? You know, I kind of hate ads just as like an aesthetic choice. , I think ads needed to happen on the internet for a bunch of reasons to get it going, but it's a more mature industry. The world is richer now. I like that people pay for chat GPT and know that the answers they're getting are not influenced by advertisers. There is I'm sure there's an ad unit that makes sense for LLMs. And I'm sure there's a way to like participate in the transaction stream in an unbiased way that is okay to do. But it's also easy to think about like the dystopic visions of the future where you ask Chachi BT something and it says, \"Oh, here's, you know, you should think about buying this product or you should think about, you know, this going here for or vacation or whatever.\" And I don't know, like we have a very simple business model and I like it and I know that I'm not the product. Like I know I'm paying and that's how the business model works. And when I go use like Twitter or Facebook or Google or any other great product but ad supported great product.",
        "start": 250.64,
        "duration": 775.0379999999999
    },
    {
        "text": "a very simple business model and I like it and I know that I'm not the product. Like I know I'm paying and that's how the business model works. And when I go use like Twitter or Facebook or Google or any other great product but ad supported great product. worse not better in a world with AI. So now I didn't want to make this a video you know entirely about ads and stuff but in their tweet they do state that you know ads do not influence the answers chat activity gives you. Instead ads are optimized you know answers optimized based on what's helpful to you and then ads are always separate and clearly labeled. Now, I think it might start like that, but how long are they going to, you know, resist pressing that button, which basically is somewhat like an infinite money printer. I mean, honestly, the reason I don't believe that, you know, this company would do it is because, not that they've lied in the past, their trust is kind of breaking down in the past just based on numerous things I've heard from other company and, you know, so many people have left. The main issue is is that even if they do this, they're not going to face some scandal. I mean, Facebook had some crazy data scandal and Facebook literally has, I think, 5 to 10 billion a year. Don't quote me on this. This is just a completely guesstimated figure, but they make few hundred million at least every year from fraudulent ad clicks, literally from scammers targeting people and they make so much money they just, you know, turn a blind eye to it. So, if Meta can just pay a small fine and continue running that for years on end. What makes me believe that another big tech company isn't just going to do the same when it comes to, you know, advertising, isn't just going to have some kind of loophole? I don't know. That's just my personal opinion. They're saying that, you know, they're not going to do that. I just believe that longterm it's going to be really hard to do that considering that the company's hemorrhaging cash at the moment and they need to generate a return. So I mean it's going to be completely interesting to see what people say. Member of my commu member of my school community if you guys ever want to discuss and get free resources in terms of AI discount codes you know AI agent templates all that stuff. Nate Harour says I don't care for ads. I pay premium for most services but how will they know what to show me? Will they use my memory against me? This is the real question. And I do agree. This is the real question. Will they use your memory against you? I mean, of course, if you want to, you know, make some comments",
        "start": 391.199,
        "duration": 978.8769999999997
    },
    {
        "text": "but how will they know what to show me? Will they use my memory against me? This is the real question. And I do agree. This is the real question. Will they use your memory against you? I mean, of course, if you want to, you know, make some comments forget to check out the community. But I think the point here is is very, very true. How will we know what they're doing? It's going to be really interesting. I mean, going to be super super interesting. And in terms of AGI, you know, claims of AGI are very far-fetched because AGI is pretty hard to do. You're trying to recreate the human brain. So, I think a lot of people are now looking at Open AI saying, \"You guys have claimed AGI, AI, AGI.\" But it doesn't look like that is the case. So the biggest questions of course that we do have is will users leave? So someone said goodbye chat GBT and you can see Ramp Capital you know said this and this was over 2.5 million views 59,000 likes and you know it's interesting because I wonder if advertisements are going to ruin the free experience of Chat GBT. I don't know. I think most people use Chat GBT for very very basic tasks. So it's going to be super interesting to see. But they do have a massive massive user base. So, it will be interesting to see if users leave or just use Google Gemini because it's free and there's no ads in it. So, I think what they're going to have to do is they're going to have to prioritize user experience in the most seamless way possible because if they don't and people start getting any sort of friction towards chativity, then they're going to be out the door because free users don't typically pay for stuff and I just believe that it needs to be a really seamless and decent opportunity. Now, some users did see this coming. it was pretty interesting. This guy tweeted 7 months ago saying, \"Leave zero sum quant finance and come build the machine god. They're going to have a rude awakening when it turns out they have to work on ads, ads, and more ads to pay for it [music] all.\" And he says, \"Seven months later, this is surprising no one.\" And so, let me know what you guys think. If you guys enjoyed this video, I'll see you in the next",
        "start": 495.199,
        "duration": 1158.4769999999992
    }
]