[
    {
        "text": " So, there's been an AI Tik Tok trend that has been popping up recently. It's the hairstyles trend. These videos are getting millions of views, and in just a few short minutes, I'm going to show you guys how you can do this for 100% free. So, in order to start this tutorial, make sure you head to the link on screen right now. This is essentially Google's Gemini app. It's quite similar to Chat GPT, except it has a lot more features in terms of you being able to use the model in a way that you wish. Now, this is completely free and even when you do run out of credits. I will show you how to get more if you do want more. So, all you need to do is you need to first of course get your image which is either your selfie. Now, when you do upload your image, it's going to have create content from images and this says make sure you have the necessary rights. So, you just want to click okay because of course you want to make sure that you do have the rights and if it's your image, it's going to be completely fine. I'll show you how to do that. So, now you can see I've actually got my image here. So this image is just a selfie of a man, but it's completely AI generated. So if you actually want to get started, what you ideally want to do is you want to say to Gemini, list a bunch of hairstyles that would look good on this man. The reason we're doing this is because we want to firstly have Gemini analyze the image. Then we want to have Gemini basically give us the different styles that we can then use on this person. So we can see right here that this is our selfie and now it's given us eight different styles. Okay. So what we now need to do is once again use the same image. And in fact this is actually pretty cool. It actually already generated an image for us in a completely different style. So it doesn't usually do that but sometimes it will because it's a generative system. But you can then go ahead and save this one here. Now if you do want to have your own specific style that you do know, you can of course input the image and then what you can say is change this style to a man bun. Okay. So then we're going to put that in there. And make sure that when you're creating these images, you have this feature on. This is called the create images feature and it's called nano banana. So make sure that box is ticked. Otherwise, you may get an issue. So now you can see right here it says here is the man with a man one hairstyle. So now that's pretty",
        "start": 0.0,
        "duration": 252.08000000000007
    },
    {
        "text": "this feature on. This is called the create images feature and it's called nano banana. So make sure that box is ticked. Otherwise, you may get an issue. So now you can see right here it says here is the man with a man one hairstyle. So now that's pretty make sure you copy this image, paste it back in, and then of course ensure that this is ticked. So tools, create images. And you want to do that every single time. That way you won't get any errors. And that way even if the AI does mess up, it's much more less likely to. So we can then go back to here and we can say with these other images right here or these other styles, what we can then do is we can then say an undercut with longer top. So we can just literally copy this. We can come down to here and say give this man an undercut with longer top. And the reason we want to do that is because we don't know every single hairstyle that exists. So we're going to go ahead and just ask for this one. It's only going to take a few seconds now. And then of course we've got 2.5 flash coming in. And then of course we can see there we go once again another image. So we can then go ahead and save this. Now all you want to do is just simply repeat the process. Ensure you're using the standard image first. Paste it in. And then of course you can say give this man a half up half down. And then once again it's going to give us the half up half down. Now this is useful because we now know what the AI thinks the hairstyle is best on us. Now there's also some more steps that we can take if we want to actually get some you know interesting different hairstyles. So so now that we have these hairstyles of course they are just purely text based. You might be a visual person and you might not initially understand what these hairstyles looks like. So what you want to do is you'd want to potentially go into Google and then grab the hairstyles from there. So, ideally, if you go on over to Google and you search men's hairstyles, there will be a variety of different hairstyles that you can see and visually pick from. Now, this is a lot easier because this is going to allow you to really look at what hairstyles are popular, what hairstyles people actually have because a lot of these images aren't going to be AI generated, and it's going to be easier to see which one suits your preferences. Of course, you can see you've got different kind of styles here, and this will work for females as well. So, ideally, what you want to do, I've realized that a lot of times people",
        "start": 126.24,
        "duration": 490.558
    },
    {
        "text": "AI generated, and it's going to be easier to see which one suits your preferences. Of course, you can see you've got different kind of styles here, and this will work for females as well. So, ideally, what you want to do, I've realized that a lot of times people celebrities may have. So, even if you grab an image of someone, for example, this image right here, if we grab this image, we can actually use this image as a reference image to then put on our hairstyle. So, if I grab this image here, then what I'd like to do is I'd like to go into a new chat window and say, describe this hairstyle. So, now it's going to give me the description of this hairstyle. And then what I can do is I can then actually grab this text from here. Then I can paste this in and I can go back to the chat window here. I can just grab my image and again and I can say use this hairstyle. Do this hairstyle. Okay. And then I can simply input that in. And now you can see we've actually taken that reference image and we've actually managed to apply that image to this person. The reason you have to do it as a text space and you can't input two images is because Google sometimes acts a bit weird if you try to get a public image or if you're trying to use a celebrity. So the best thing you can do is grab that image, paste it in a chat window, have Google describe that image, and then ask it to apply that image based on that complete text description. So now that we have that text description, we can now see that the hairstyle is correctly applied to the user. Once again, this is something that is remarkably effective and takes only a few seconds. Now, once again, it isn't just hairstyles that you can add. You can actually add beard styles as well. So, if I grab my original image here, and this is an AI generated image. What I can do is I can say, give me a goatee style beard. And then what I can do is just ask it to make that image. Of course, once again, ensuring that you've ticked on this box. And now you can see I've actually added a goatee beard style right here. So you have to understand that once again if you want to not only change the hairstyle but if you want to change your you know facial hair that is also something that you can do because hairstyles and facial hair they definitely do add a different things to the mix. Now this model is of course free for the most part but sometimes what can happen during peak hours is that the model can actually get rate limited which just essentially means",
        "start": 246.799,
        "duration": 735.5189999999998
    },
    {
        "text": "you can do because hairstyles and facial hair they definitely do add a different things to the mix. Now this model is of course free for the most part but sometimes what can happen during peak hours is that the model can actually get rate limited which just essentially means they sort of throttle the free users. So if that does happen and you try to generate an image and it says that your quot has been lit for the day because I know that people are going to want to use this quite a lot. Here's what you need to do. So head on over to aistudio.google.com google.com and you'll see here that Google AI Studio is essentially the same platform except it just has a little less amount of restrictions. So when you come over to this place, what you want to do is you want to click on Nano Banana and I'm going to show you guys that it works as well. So if I paste this in and I say give this man a buzz cut, what you'll be able to do is you'll be able to use this one instead. And this is kind of like a developers platform, but it still gives you the same base raw capabilities that the model does have. And you can say, you know, cancel and use temporary chat cuz I don't want to, you know, save it in Google Drive. But if you do want to save it in Google Drive, which is going to be easier for a lot of you guys who want to just quickly have it automatically save, just enable this and then it will just pop up with your Google account and you'll be able to save it in there. Now, you can see right here that it gave the guy a buzzcut, but not in the way that I expected. But nonetheless, this is going to be a website that is built by Google. It's Google's actual website and it has this nano banana in there. Now, of course, once again, if you want to change different hairstyles, you can say give this man an afro and you can run this and you get a little bit more here. Now, once again, we can see that that works, but it doesn't seem to be as perfect as the previous one. So, only use this is if you know you completely run out. And of course, if you do run out, you can always just switch Google accounts to completely change your free quot cuz every Google account has a different set amount. Now, if you're wondering, yes, this does work for women as well. Just input your starter image and then just say, \"Change my hairstyle to whatever one you may have.\" Of course, if you have a different, you know, hairstyle, you can just say, \"Give me an afro hairstyle.\" And the great thing about",
        "start": 370.479,
        "duration": 967.438
    },
    {
        "text": "yes, this does work for women as well. Just input your starter image and then just say, \"Change my hairstyle to whatever one you may have.\" Of course, if you have a different, you know, hairstyle, you can just say, \"Give me an afro hairstyle.\" And the great thing about enabled it there, but sometimes you make sure, you know, you enable this one right there. But the great thing about Nano Banana is that you don't just have the ability to change your hairstyle. If you want, and this is completely extra, and I'm only adding this because most people don't realize this. If you absolutely want to, what you can do is you can copy this image once again, have the same image because Google forgets, you can completely change the hairstyle. So, you can say, \"Change my outfit to a black dress.\" And you'll be able to see that the model is also not able to just change your hairstyle like in this image right here. It's able to also change your outfits as well. So, if you want to see what your hairstyle looks like in a different outfit, you can see that that also does work as well. So, this is kind of like an all-in-one system where you can do a lot of different",
        "start": 489.599,
        "duration": 1062.3990000000001
    }
]