[
    {
        "text": " So, the AI race is pretty crazy. You've got so many different companies competing, but I'm pretty sure that Google has won the AI race. So, let's talk about it. So, one of the first things I want to talk about, which is why I believe Google has completely won over the consumer side, is just purely based on value and pricing. Right now on screen, you're able to see the companies that currently offer a heavy subscription. And that is a subscription that's in the three figures, so above $100 every single month. Now, unless you're a complete power user, you won't actually be using these subscriptions because you don't just use AI that much to justify this absurd cost. But for some users, it does actually make sense on a day-to-day basis. Now, what I'm showing you here is three different companies that all have these different subscriptions. You can see on the left hand side I've got Chat GBT which has the $200 a month subscription. And in this subscription it's pretty decent. And all of these I'm going to just quickly go through them. All of them are pretty good. But when I show you what Google has to offer, it just doesn't even come close. So for chat GBT you get, you know, pro reasoning with GPT5. You get unlimited messages and uploads, unlimited and faster image creation. You get maximum memory and context. You get, you know, extended access to Sora 1, which most people don't want to use. You get expanded agent. So you basically get more tokens. Okay, super heavy for Grock, you basically get extended access once again. And for Claude Max, you also get basically higher output limits and you basically get more tokens. So the main offering for these other AI companies is simply more tokens and you get early access to new features. Now for the average power user who has to use these tools every single day, yes, it probably does make sense for, you know, Anthropic or maybe in some rare cases Grock. When we actually compare this to what Google has to offer, Google offers Gemini 3 extended credits and you get a suite of different products. For example, not only do you get extended and the highest limits for Gemini 3, you get the highest limits for VO 3.1, you get the highest limits for your agents, you also get 25,000 monthly AI credits, which are used across video generation models. And I'm someone who uses this every day, and I never run out of credits because it costs around 10 credits to make a single video. And so you can make tons and tons of videos every single month and images. You also get access to notebook alm which is a incredible product which most of you guys already know about. You also get access to YouTube premium which which allows you to have YouTube ad free",
        "start": 0.08,
        "duration": 290.15999999999997
    },
    {
        "text": "so you can make tons and tons of videos every single month and images. You also get access to notebook alm which is a incredible product which most of you guys already know about. You also get access to YouTube premium which which allows you to have YouTube ad free get access to 30 terabytes of storage for photos [music] drive and Gmail. And of course you get access to Google's code Gemini CLI. All in all, the point I'm trying to make here is that Google AI Ultra is nearly half the price of these other AI companies, and it offers nearly double of what they're offering, which means just purely based off a singular subscription. Even for the highest tier, it makes no sense to keep these other subscriptions genuinely. And this is not like a sponsored video or anything, I cannot find a justification for having the other subscriptions. And the only one that I could potentially have is Anthropic because that one is a genuine coding product that people can't get enough. Now, another thing that we need to talk about, which is why Google has won the AI race, it's not just about the pricing of the products. It's actually about the fact that Google's AI products are genuinely good. Now, here's the thing that most people do forget. For most of the time, Google's AI stuff was kind of meh. It was just okay. And Google had the technology, but the products were never good as OpenAI. And that was fair criticism. But you have to understand that this has changed big time. Look at Nano Banana Pro. This was Google's breakthrough moment. When they released this technology, it was genuinely revolutionary. The quality was incredible and it showed that Google could compete on pure performance, not just the distribution. And if you want to learn how to use Nana Banana to create something genuinely useful, it's probably wise to listen to today's sponsor. So, if you've ever used AI to build presentation, you'll know the oneshot struggle. Usually, you get the generic outline and then you're going to spend hours fixing it. And that even happens with Chat GBT. Now, today's sponsor, Gamma, just launched a game changer called Nano Banana. This is a custom Google Gemini integrated model integrated into Gamma for free. And this is completely redefining the create and finish workflow. Now, the differentiator is studio mode. While most AI tools stop at generated, Nano Banana in Gamma gets you ready to ship. Using their studio mode, you can go from an idea to a full presentation deck in under 2 minutes. That's five times faster than the competition. You get total control over the audience, the tone, the visual style, all before you even hit generate. There's a reason Gamma is the most popular AI presentation app in the world with over 70 million users, people are creating eight docs every single second. Whether you need to export to",
        "start": 145.12,
        "duration": 546.161
    },
    {
        "text": "get total control over the audience, the tone, the visual style, all before you even hit generate. There's a reason Gamma is the most popular AI presentation app in the world with over 70 million users, people are creating eight docs every single second. Whether you need to export to instantly. The polish is builtin. So stop settling for AI generated and start shipping production ready. Try another banana in Gamma today and see what you can build in 5 minutes. Head on over to gamma.app, that's gamma ma.ap, and get started for free. Then Gemini 3 came out and you know what? It's really good. like genuinely good. Independent tests show that Gemini 3 performs basically the same as GPT5 on most benchmarks. Sometimes better, sometimes about the same, but most often it's definitely in the same league. And for most people, it's genuinely better for coding tasks. A lot of developers are still using Gemini now because the code it generates is clean. You've got a long context window and you get higher rates. And of course, you've got Google's anti-gravity, which is an incredible product that everyone is trying to use. And think about the multimodal aspects. Look at VO3.1. That is an incredible product and currently is the most efficient video creation model that currently exists. There's nothing else that is as cheap, as fast, and as quick as Google V3.1 fast. So, it simply makes no sense to use anything else. If we look at Notebook LM, which most of you guys know is a phenomenal product that everyone knows, that product basically has a cultlike following. And if you look at flow and if you look at Google whisk and you look at the other suite of Google products that are actually upcoming Google's AI products are genuinely good now. And the crazy thing about it is that you know notebookm students love it researchers love it teachers are using it. I mean it's also free by the way. So it's absolutely crazy when you think about the fact that no other AI company currently has these kind of products to offer their consumers. And what's crazy about this is that this isn't just pure speculation in terms of, you know, what people are using. I actually wanted to do a quick poll where I asked you guys, who is your daily driver for AI? So, 2 hours ago, I said, I want to see if the landscape has shifted. And I know this might be a bit biased because I put chatbt and Google Gemini headto-head, but the crazy thing here is that 53% of you guys said that you used Google Gemini and 47% said that you use Chat GPT for your daily driver. Imagine what this survey would have looked like a year ago when it was, you know, Gemini 1.5 Pro versus the Chat GBT. The landscape has significantly shifted. And if you guys do want to take",
        "start": 275.12,
        "duration": 807.3610000000003
    },
    {
        "text": "Google Gemini and 47% said that you use Chat GPT for your daily driver. Imagine what this survey would have looked like a year ago when it was, you know, Gemini 1.5 Pro versus the Chat GBT. The landscape has significantly shifted. And if you guys do want to take are in terms of giving me your comments and thoughts on many different topics, don't forget to check out the free school community where you can chat with me one-on-one and I'm there every single day. Now, what's crazy about this is that, you know, I'm not the only one that's seeing this. You can see that many other people are saying that Gemini appears to be much better than Chat GBT for investing, for work. And someone else says here says, and someone else here says the wakeup call to everyone using chat. Gemini is fundamentally so so much better at writing and synthesis. Just use both side by side for a while. Then you will come to the same conclusion. It's not even close. You can see a user here says that I've been using Gemini every single day since it has launched to help with brainstorming images, infographics, tables, yada yada yada. The only way I can explain the difference. Chat GBT feels like you're using an iPhone 4 in 2025. And Gemini feels like you're using the next unreleased iPhone. It's that good. Joseph Carson says that I was literally a top 1% user of Chat TBT in 2025 and I have a premium account. I also have Gemini Pro and I could guarantee you that I'm a top 1% user of Gemini and I can confidently say without a shadow of a doubt the Gemini 3.0 Pro is better than any of Chhatt's models. In my opinion, they're not even close. The reasoning, the soundness of logic, explanations, how reason the data is, all of it is just better. And in my personal opinion, I honestly have to say the same. Now, one crazy thing as well that people don't realize is that Google's distribution is absolutely massive. This is where it gets super interesting. How do people actually use these AI tools? Think about how you use trackp. You have to open a browser. You have to type in the website in or you have to open the app specifically. It's a separate thing that you have to consciously decide to use. Now, let's think about Google. Google search, 3 billion people use it every single day. And that's not a typo. That's 3 billion with a B. Now, Gemini is baked right into Google search. If you search for something, Google's AI can jump in and help you automatically. You don't need to go anywhere else. Now, for Gmail, almost two billion users and Gemini's integrated directly into Gmail. Now, you can ask it to summarize your emails, write responses, find specific information from your inbox, and it's",
        "start": 407.68,
        "duration": 1046.4020000000003
    },
    {
        "text": "for something, Google's AI can jump in and help you automatically. You don't need to go anywhere else. Now, for Gmail, almost two billion users and Gemini's integrated directly into Gmail. Now, you can ask it to summarize your emails, write responses, find specific information from your inbox, and it's using. Google Docs over a billion users and Gemini's built right in. If you're writing a document, you need help. Boom. AI assistant is right there on the page. No switching, no apps, no new tabs. And YouTube has 2.7 billion monthly users. And YouTube is already starting to integrate AI features. And remember, Google owns YouTube, another amazing distribution channel. Not to mention Android phones, 3 billion devices worldwide. And Google's making Gemini the default assistant on Android starting in 2026. So that means every single Android user in the world will have Gemini built into their phone by [music] default. The Chrome browser, 3 billion users. Gemini being integrated into Chrome as we speak. Google Maps, over a billion users. I mean, I could go on and on. I mean, you guys have to see what's happening here. Google's doesn't need you to go out of their way to use their AI. The AI is already everywhere. Instant email, documents, phone, browser, search engine. It's basically omniresent. Whereas Chat GBT and these other companies, it's just a simple website and a simple app that you have to open and use. This is the key distribution advantage and it's absolutely massive. Google's AI touches billions of people every single day whether they're thinking about AI or not. OpenAI needs to convince people to come over to them and Google's AI is already showing up wherever you are. The crazy thing about all of this is that this is why I think OpenAI are in a specifically rough spot and Google is one of the companies that is positioned to thrive. Unlike other AI companies, Google has billions and billions of dollars in free cash [music] flow every single quarter. They make money from existing AI products and they can just drive the cost of those products down by subsidizing them with their other profits. [music] The problem is is that look at this article. says the amount of money OpenAI lost last quarter will make you choke on a slurpee. So, one thing that people don't realize is that OpenAI is a wildly unprofitable company. OpenAI is burning cash like crazy. And I mean crazy. According to many different financial documents, OpenAI is expected to lose $17 billion in 2026. $17 billion in a single year. They lost about 9 billion in 2025 and it's almost going to double to 17 billion this year. Though the projections show that they'll keep losing money until at least 2028. Well, why do you think they're losing so much money? Because these AI models are incredibly expensive. The computing power needed is insane. And OpenAI is",
        "start": 529.2,
        "duration": 1312.402
    },
    {
        "text": "and it's almost going to double to 17 billion this year. Though the projections show that they'll keep losing money until at least 2028. Well, why do you think they're losing so much money? Because these AI models are incredibly expensive. The computing power needed is insane. And OpenAI is that don't even cover their cost. Sam Alman CEO literally admitted that they're losing money on their $200 per month tier because people are using it more than they expected and each query cost them more money. They didn't price it right. They're bleeding money from their most expensive customers. This is a company that desperately needs to become profitable and they have investors breathing down their necks. They have to show a part of profitability soon or that money is going to dry up. And remember I said if you compare this back to Google, Google has already made over $300 billion in revenue in 2025 and their profit was $70 billion. They are printing money. They're literally one of the most valuable companies on planet Earth. Google can afford to invest $85 billion in AI and cloud infrastructure just this year. And that's, you know, three times or five times more than OpenAI's entire losses. Remember, Google can continue to run Gemini at a loss for years, even if they want to. They can undercut OpenAI on pricing forever. They basically have unlimited resources to throw at this problem. OpenAI is simply fighting for survival while Google is dropping tens of billions of dollars like it's pocket change because they can play the long game. Now, if you didn't believe that more and more people are starting to use Gemini, and you just think it's, you know, people saying it for the fun of it, check the generative traffic share. Similar Web actually came out with a article that was released I think yesterday and we can see a clear increase in terms of Gemini's generative AI traffic share. Look at 12 months ago versus where it is today. We can see that that is a consistent erosion of OpenAI and other AI companies. In fact, we could argue that probably the only company that is losing market share is OpenAI. Now, if we look at it, Chativity's traffic share has dropped to about 64% of all AI chatbot traffic. And that does sound high, but the thing is when we look back, that was nearly over 75%. So we need to think about it in terms of the daily users. That is a massive drop in just 6 weeks. They went from around 200 million daily visits in December down to 158 million in early January. Meanwhile, Gemini would actually staying completely stable at around 55 to 60 million daily visits. And they didn't lose any users while Chad has been losing users, which means that the momentum has shifted and momentum is now with Google. Users are switching. They're trying Gemini.",
        "start": 663.68,
        "duration": 1564.5610000000004
    },
    {
        "text": "million in early January. Meanwhile, Gemini would actually staying completely stable at around 55 to 60 million daily visits. And they didn't lose any users while Chad has been losing users, which means that the momentum has shifted and momentum is now with Google. Users are switching. They're trying Gemini. better and they're sticking with it because it integrates with everything else that they have. This is basically death by a thousand cutable AI. Every single month, they're losing market share and Google is gaining round. And remember, Google already has a massive distribution advantage. So, the numbers here do not lie. Other companies are taking a massive market share. Now, you might have thought that this video is based on nothing, but guys, there was literally a code red declared in December of 2025. Something wild happened. Sam Alman, OpenAI CEO, sent an internal memo to all OpenAI employees declaring a code red. Now, for those of you who don't know, code red for a tech company is speak for drop everything. We have an emergency. All hands on deck. The building is on fire. Now, what was that emergency? Google Google launched Gemini 3 and it was getting incredible reviews. People were switching to Gemini. Chip's traffic was declining and OpenAI panicked. Sam Alman literally told the employees to stop what they were working on and focus on making track better almost immediately. They've since rushed out updates, accelerated their release schedule, and they've pushed out new features as fast as possible. And here's the thing, they are still in code red mode now. This is not a temporary panic. This is sustained fear. When was the last time you heard Google declaring a code red about OpenAI? That was, I think, a year and a half ago. And since then, they've done amazing work to catch up. Companies do not declare code red when they are know they are going to win. They declare code red when they know they are going to lose. Now, of course, one of the things that I wanted to discuss was the other players because, of course, some of you guys don't just use chatbt versus Google. Some of you guys use Anthropic. So, I think Anthropic is a winner here because number one, they have carved out a premium niche by doubling down on reliability and the human-like nuance of the Claude family. Now, the reason I think that Anthropic is going to win here in terms of their own area is because they are the undisputed kings of coding. I mean, this is a product that I literally hear people talk about so much that I can't even get it off my feed. I just hear people say that Opus 4.5 is so good. It's so good. It's so good. And this is a product that, you know, clearly is a winner in terms of its coding ability. Ban other companies from using it because other companies are",
        "start": 792.0,
        "duration": 1804.2419999999995
    },
    {
        "text": "get it off my feed. I just hear people say that Opus 4.5 is so good. It's so good. It's so good. And this is a product that, you know, clearly is a winner in terms of its coding ability. Ban other companies from using it because other companies are which is completely completely crazy. With their constitutional AI framework, they've positioned Claude as the safe adult in the room choice for actual adults who want to use AI. Now, what's crazy about this company is that they're backed by both Google and Amazon. So, even if Anthropic wins, it's actually a win for Google because Google, I think, owns a certain amount of Anthropic. I'm not sure on the exact figure, but I do know that if Anthropic does win, it's definitely going to be a win for Google. And they're actually headed towards a massive IPO this year, which means that those Google shares, which means that even if you're thinking that Anthropic are going to crush Google, Google is still going to win because they're heavily invested in the company. Now, of course, we do have to talk about Deep Seek, which is effectively a wild card that, you know, broke the scaling laws monopoly, proving that we could have frontier level models like R1 and V3, which could rival models like GB40 and 01 in reasoning at a fraction of the cost. And this Chinese powerhouse essentially commoditized intelligence. Now, while OpenAI and you know these other companies are trapped in the race, Deepseek is just one of those efficient companies at the end. Now I think that this company has its own marketplace. They are just the default for developers of the global south and price sensitive markets proving that you know if you want a small cheap cost-effective model that just runs freely for certain applications this is going to be the one. I don't think Google is worried about them at all because they just release models. They don't release products. Now for co-pilot I mean they have incredible distribution with Microsoft but I just believe that they don't really have that much good innovation. I think that this is a product that you know could do a lot better. And I think right now they are in a very [music] weird spot before their products become really optimized. I don't think it's going to take them that long to figure out how to make this a lot better. But once again, it's not that big of a threat to companies like Google because Google already has so much to offer. Now Grock is really interesting. They're like the wild card because they've actually positioned themselves as the uncensored rebel of the AI race. And they're leveraging a unique advantage that even Google doesn't have which is of course the vertical integration with X. Now, what's cool about this is that they actually do have the ability to integrate with X's",
        "start": 913.12,
        "duration": 2034.0819999999997
    },
    {
        "text": "because they've actually positioned themselves as the uncensored rebel of the AI race. And they're leveraging a unique advantage that even Google doesn't have which is of course the vertical integration with X. Now, what's cool about this is that they actually do have the ability to integrate with X's saying that they use Grock on a day-to-day basis. And for a lot of people who just want a simple AI that's going to give them something on Twitter, this is their go-to model. Now, of course, Grock has a huge future ahead of them in terms of the humanoid robots and their future integrations. But I think right now, Grock simply isn't, of course, going to compete with the user base that Google has. Now, I could make the video longer by talking about how Google's, you know, autonomous vehicles like Whimo are simply taking over and how Google's very very poised to take over with new robotics advancements. Even recently, they signed a deal with Boston Dynamics. I mean, honestly, it doesn't seem like Google are going anywhere anytime soon. They've got humanoid robots with Boston Dynamics. They've got humanoid robots with Apollo Robotics. And of course, they've got their vehicles with Whimo. So, I mean, across the stack, I just don't see how Google loses in this AI race at all. And I don't see how other areas where they're going to lose even slightly. With that being said, let me know what your daily driver is. If you enjoyed this video, you want to discuss this video with me, and you want to help shape future videos, don't forget to check out the free school community. It's completely free. I'll leave a link in the description and I'll see you guys in the next",
        "start": 1030.0,
        "duration": 2163.524000000001
    }
]