[
    {
        "text": " Microsoft literally just completely changed Copilot in their latest update. And here's everything you need to know. So, one of the first features that I personally think is really cool is the groups feature. And this is basically where you can actually have a shared chat with a bunch of friends and an AI. Now, this is actually the first time I'm seeing something like this. And I do think that if this does work really well and if you know there's positive feedback, maybe we could see this as a feature in chat GBT eventually. I'm really excited to finally announce after so long of us playing with it and working on it internally that we're bringing groups to copilot. And what this means thank you and and what this means is that when you're working through a question when you are wondering what's going on you can finally bring in other people directly to the conversation that you're having with co-pilot and work on the problem together get something solved and co-pilot as of today is the only place that you can do this and add a friend to a chat with AI. I can't emphasize how different it feels to finally get to use AI with the people that you care about. With that, let's maybe just shift gears and talk a little bit about real connection with ourselves. [music] How can Copilot help you actually connect more deeply with yourself? How can it connect you with your learning, your health, your personal growth? Another feature that Copilot recently added was the memory feature. This makes a ton of sense because of course, if you're actually going to have an AI assistant, you're going to want to need it to remember everything about you. So for me personally, I do believe that Copilot's memory probably will be better than chatbs over time. Well, first off, memory. Memory is what makes Copilot personal because Copilot now can remember you. We think it's absolutely essential for a companion to have memory. With Copilot's long-term memory, it naturally picks up on important details and remembers them long after you've had the conversation. People tell us all the time it's super important for co-pilot to remember specific things about them so it can deliver personalized advice. You can also be more directed. You can say something like, \"Remember, I'm training for a marathon.\" Or maybe two weeks later, \"Scratch that co-pilot. I'm actually training for a 5K.\" [laughter] You're always in control. You can edit, update, or delete memories anytime. This is a simple one, but it's the connections. Now, of course, most people don't realize this. You know, when you're working between a bunch of different apps, connections just make things 100 times easier. Rather than switching between this tab or that tab, connecting your files to absolutely everything makes things so smooth. And I'm actually glad that Copilot finally added this because I think it means now",
        "start": 0.08,
        "duration": 293.2789999999999
    },
    {
        "text": "when you're working between a bunch of different apps, connections just make things 100 times easier. Rather than switching between this tab or that tab, connecting your files to absolutely everything makes things so smooth. And I'm actually glad that Copilot finally added this because I think it means now to use this. Context is super important. Memory helps with that, but you should also have connection to the tools you use every day. With connectors, you can connect Copilot to your Outlook, your One Drive, your Gmail, your Google Drive. It understands your calendar, your files, your contacts. I really like how I can connect C-pilot to my calendar because you know those appointments you schedule like two months in advance. Not at all. [laughter] Well, I can ask Copilot something like bring up the details about my next dermatologist appointment and it just knows. Copilot helped me find my dermatologist. That's amazing. It's it is actually really hard to find a good doctor. It's it's pretty incredible, right? And 40% of our users actually ask a health rellated question every week. 40%. That is wild. Yes. It's super important to people. That's why we've partnered with credible sources like Harvard Health to deliver grounded answers to your questions and help you navigate sensitive medical topics. And yes, Copilot did help me find that dermatologist. Copilot helped me prep for the session with questions that I could ask. It also helped me find a female provider since I just moved to a new city and wanted to find a doctor near me. With Copilot's care navigation feature, you can locate a bunch of doctors in your area, scroll through their profiles, and click into them to see information like their ratings, their education, their contact info, insuranceances that they take, really anything you need to make that decision. This is where we get into the new AI companion, Mo. So, I think this is really cool because this is a new animated voice first avatar designed to make interactions with the AI more expressive and socially engaging compared to previous co-pilot or actual competitors. So, this, you know, AI agent thing, this AI companion actually stands out by offering real-time emotional feedback, adaptive expression, multimodal memory, and just crazy features. So, I think this, you know, friendly shape-shifting visual character that listens, reacts, I think this is going to change how we interact with AI, and I think it's really good that we're actually having this kind of, you know, interaction that feels somewhat warm and natural. And I also think that Microsoft have done something really good here is because they've actually, you know, done this as an embodiment of technology that empowers human creativity instead of something that's just trying to replace humans, like a human AI assistant. It's not really anthomorphicizing a human. It's like this cute bubble that just kind of helps you in your day-to-day life, which I personally feel is going",
        "start": 146.959,
        "duration": 581.2769999999999
    },
    {
        "text": "as an embodiment of technology that empowers human creativity instead of something that's just trying to replace humans, like a human AI assistant. It's not really anthomorphicizing a human. It's like this cute bubble that just kind of helps you in your day-to-day life, which I personally feel is going terms of the actual relationships that humans have with these. And I think it's more healthy. Now, another thing that I personally think everyone is going to overlook is the psychop fancy in terms of co-pilot. One recent AI that I've seen that is just not psychopanty at all is, of course, Claude. And it's been absolutely amazing. Like, this is now my daily driver. And if Microsoft are being honest about what they say when they say it's no more, you know, psychopanty just how like chat GBT usually is, this is probably going to be incredible for a lot of people because when AI challenges your beliefs and actually improves you in a way that you didn't see coming, trust me when I say it's a genuine game changer. Another really cool project that we've been working on is evolving Copilot's personality and tone with a new mode we're calling Real Talk. [music] Real Talk feels more trusted. It mirrors your conversation style, but it doesn't just repeat back everything you say to it. It feels like something that is grounded in its own perspective. That means it might push back or challenge your ideas, not to argue with you, but to spark a new [music] perspective. And I hope that across these different things, you can start to see how we think about our product and how we think about co-pilot that we're trying to deliver to you. It's really focused on real connection. It's really focused on real understanding and it's something that ultimately can put you back in touch with others. Microsoft has always been about accelerating ambition and so now they've also introduced this feature which I personally think is cool where you can literally just say, \"Hey, Copilot.\" And you're literally going to have Copilot be able to instantly pop up and answer any questions you have. It's actually really useful and I was actually surprised at how much I use the chat GBT hot feature on my iPhone. So, I suspect that this will become another easy user integration. And that's why we're reinventing Microsoft's core stack from the operating system to the browser to the whole productivity suite all for the new age. Because the reality is is that nothing says Microsoft more than Windows. Over a billion people use Windows to get things done. And Copilot on Windows was now the way that it was always meant to be. First of all, you can say, \"Hey, Copilot,\" from anywhere on your PC. No clicks, no menus. you'll jump straight back into the cop experience and all of your recent files and the applications you can use",
        "start": 291.919,
        "duration": 846.6369999999998
    },
    {
        "text": "on Windows was now the way that it was always meant to be. First of all, you can say, \"Hey, Copilot,\" from anywhere on your PC. No clicks, no menus. you'll jump straight back into the cop experience and all of your recent files and the applications you can use as soon as you jump in. And so what this means is you finally have this super assistant that is plugged in to all your files, all of your content right there. And with this super assistant, you can now get things done in a way that you were never able to before in the browser wars. And lastly, in the browser wars, we are seeing an absolute change in terms of how AI browsers are being done. And with the co-pilot integration on Edge, I think this is how you do it. And I do think that it's probably going to get much better over time since the team is, you know, completely dedicated and focused on really really making Edge powerful. Truly smart, right? The browser fundamentally has been static for decades, right? Like it's just endless clicking, scrolling, typing, [music] tab hopping. , and so we asked not like how should we how should browsers work, but instead we asked like how do people work? And so, , we designed this AI browser that can do things for you. You can just say what you want, right? Like book this hotel, fill out this form, like summarize this page, and co-pilot mode , just does it for you. It's so exciting that it's finally here. The key thing, like couple of key things actually. One, it's available on Windows and Mac. And the second is that you're always in control. Like with a one click of a button, you can turn it on or off. , [music] so you know, we're rolling these features out very carefully. We really want you to try them. Give us feedback and help us to shape what should come next. So let me know if you're actually going to be trying some of these features. Me personally, I think I will be trying out the AI assistant considering the fact that it's a little bit different to Chat GPT. And I will certainly be making sure I take full advantage of the new browser considering it's free and accessible right now. I'd love to see your comments down in the comment section below.",
        "start": 426.319,
        "duration": 1059.2779999999996
    }
]