[
    {
        "text": " There is an article that basically states that China has done something that we thought was going to be impossible. Now, what you're seeing is not clickbait. It's not even hyperbol. It's the actual headline from Reuters. This is one of the most credible news organizations in the world. And when you see what they're reporting, you'll understand why this single development might be one of the most significant in the war between the US and China. So, Chinese scientists have built what the United States have essentially been trying to prevent, a prototype of a machine that is capable of producing the cuttingedge semiconductor chips that power AI. Now, you need to let that sink in for a second. This is the technology that the entire western export control regime was designed to prevent China from obtaining. We are talking about EUV lithography. The most advanced chipmaking technology on the planet. The technology that powers every single cuttingedge AI chip. The technology behind CH GBT, behind Claude, every Frontier AI model you've ever used. And this is why this is so significant. For the past 6 years, the United States orchestrated the most comprehensive technology blockade in modern history. And they've pressured the Netherlands to ban ASML, the only company in the world that actually makes those crazy machines, from selling them to China. They've implemented a layer of layer after layer of export controls. They've sanctioned Chinese companies. They've threatened secondary sanctions on anyone who even helps China get the technology. And those machines are engineering marvels with each one costing around $250 million, weighing $180 tons, the size of a double-decker bus, and take multiple cargo planes to transport. I mean, if it took ASML 13 years to build the first prototype, and another 10 years to reach commercial production, that's 20 years of development, billions of in R&D, and China was locked out, and it seems like they are about to enter this place. Now, what's crazy about all of this, and the most insane thing is that something was completed in early 2025. So, it's now undergoing testing. So, this is where things get really interesting. This isn't some theoretical breakthrough or some lab experiment. Reuters is reporting that this prototype was completed in early 2025, meaning that just a few months ago, and it's already going testing right now. This machine fills an entire factory floor. Think about that for a second. ASML's machines are massive, but this Chinese prototype is apparently even bigger. They couldn't even replicate the compact design, so they just scaled everything up. And I'm guessing they're, you know, trying to brute force engineer this. And here's the part that should really concern people. This machine was actually built by a team of former engineers from ASML itself. And this is the very company that actually holds the monopoly on this technology, the company that the Dutch government is supposed to be protecting. And they weren't just any",
        "start": 0.16,
        "duration": 349.0380000000001
    },
    {
        "text": "part that should really concern people. This machine was actually built by a team of former engineers from ASML itself. And this is the very company that actually holds the monopoly on this technology, the company that the Dutch government is supposed to be protecting. And they weren't just any about the people who spent years, maybe even decades, building the most advanced lithography systems in the world. People who understood the intricate details of how the machines work. People who knew the secrets that ASML spent billions discovering. And remember guys, this is all linking back to AI. This is all linking back to AGI. Because if China can successfully create these chips, they are going to basically have their own vertical stack that could allow them to produce their own fabs without western control. And the thing is that China just essentially recruited these ex ASML employees. And they started doing that aggressively. It was actually in 2019, China launched a massive talent recruitment drive offering signing bonuses of up to 400K to 700K just to sign on. And they threw in some crazy crazy stuff. And one example that I've seen floating around on Twitter was Lin Nan, ASML's former head of light source technology, one of the most critical components of an EUV machine. He actually moved to China and his team filed eight EUV patents in 18 months. That's the kind of talent that's now working with China. And apparently, according to the sources that Reuters spoke with, reverse engineering these machines would have been nearly impossible without these former ASML engineers. institutional knowledge, understanding of why certain design choices were made, the troubleshooting of experience. You can't just figure that out from patents and papers. And the Dutch intelligence has actually been warning about this for years. They've documented what they call extensive espionage programs where China systematically recruits Western researchers and engineers in strategic technology fields. And clearly those warnings weren't heeded strongly enough. And despite all the export controls that, you know, are in place to prevent them from getting all the advanced parts, somehow they got them. Now, the good news, okay, before we get caught up into the hype is that we need to talk about what this machine can actually do because we're not at AGI yet. The chips aren't being produced yet, but it hasn't produced any working chips yet. So, the prototype is operational, which is still huge. It's successfully generating extreme ultraviolet light at the required 13.5 nanometer wavelength. This is the fundamental physics working. The light source, which is one of the most technically challenging components, is functioning. And to put this into perspective, ASML CEO basically said months ago that China would need many, many years before they could actually build an EUV system. And yet, here we are with a machine that's producing EUV light. That timeline got shattered. But this is critical. It hasn't started producing working chips yet. You see,",
        "start": 174.879,
        "duration": 646.5590000000003
    },
    {
        "text": "ASML CEO basically said months ago that China would need many, many years before they could actually build an EUV system. And yet, here we are with a machine that's producing EUV light. That timeline got shattered. But this is critical. It hasn't started producing working chips yet. You see, actually only one piece of the puzzle. actually using that light to pattern circuits on silicon wafers with precision needed for advanced chips. That's a whole level of complexity. That's like a whole different level. So, you got to think about like this. They basically built an engine that runs, but they have haven't like driven the car just yet. So, there's still work to do on the transmission, the steering, the brakes, and all of that stuff. And this distinction matters because producing EUV light in a lab is very different from using it in a manufacturing environment. You need precise optical systems to focus that light. You need the stage that holds your silicon wafer to be accurate within fractions of an nanometer while moving at high speeds. You need photoresists, the chemicals that react to the light. You need photo masks with perfect patterns. You need an entire system to be in a near-perfect vacuum. And airsmell spent a decade going from we can make EV light to we can reliably manufacture chips at commercial volumes with acceptable yields. That's a lot of engineering refinement. Now, we actually need to talk about just how wrong the experts have been about China's timeline because I am constantly surprised in this AI field about the timelines on what China's doing and what America's doing. I mean, how many times were people surprised by China's open source releases? I'm sure the entire Western world was thrown off by deepseek. And once again, China is surprising everyone. I mean, in April of this year, eight months ago, the CEO publicly stated that they would need many, many years. This wasn't the random analyst speculation, some guy on Twitter hyping it up. This was the CEO of the only company in the world that makes these machines, the company with more knowledge about EUV technology than anyone else on the planet, saying that they were decades away from this capability. And you have to understand that this is the guy that was wrong. This guy, the guy that everyone thinks, or I mean, if you were going to ask, you would have said that he knows the timeline. Like, we're going to take his word for it. So if China may be years closer to achieving semiconductor independence than analysts anticipated, we need to re-evaluate the timeline for United States also. So understand that this timeline has been shrunk by years, not months. So every strategic calculation, every policy decision, every export control measure, they were all based on the assumption that China was at least a decade away from the technology. This was the assumption that",
        "start": 325.44,
        "duration": 916.0800000000004
    },
    {
        "text": "for United States also. So understand that this timeline has been shrunk by years, not months. So every strategic calculation, every policy decision, every export control measure, they were all based on the assumption that China was at least a decade away from the technology. This was the assumption that domestic manufacturing. Time to build a resilient supply chain. And time to maintain the technological edge that underpins military superiority, economic leverage, and AI leadership. And all of that time just evaporated. That gap that everyone thought was secure, it's closing faster than anyone could have predicted. And this is why we should somewhat be worried. We should definitely be concerned because if they were wrong about the prototype timeline, what else are they wrong about? And remember, like I said at the start of this, like I'm literally starting cuz I literally cannot believe this. Everyone was like, \"Oh, China's years behind in AI.\" And then Deep Sea drops running a competitive model at a fraction of the cost, at a fraction of the compute. And then remember also when everyone said China couldn't manufacture 7nm chips without EUV and then SMIC produces them using older DUV equipment through multi-atterning techniques. There is just a consistent pattern of underestimating China's ability to innovate under the constraints. When you lock them out of the global supply chain, they actually don't give up. They throw unlimited resources at the problem. They recruit aggressively, reverse engineer relentlessly, and they move faster than Western intelligence agencies can track. Now, I have to be honest. I'm guessing that the CEO, he probably genuinely believed that China was many years away, which either means that ASML had no idea that this prototype existed, suggesting that China's operational security was far better than anyone thought, or that the prototype from non-functional to operational in just a few months is suggesting that their progress is accelerating exponentially. Either one of those aren't comforting. Like, either scenario is just absolutely terrible. And the concerning part is that this prototype wasn't even discovered through intelligence channels. It was just leaked by a whistleblower. Reuters found out about this because they investigated it and confirmed it independently. How many other projects are happening in secret right now that we have nothing to go on? I mean, it's crazy. The story, it gets even more interesting. Now, we need to talk about the timeline to actual chip production because this is where timeline Now, we need to talk about the timeline to actual chip production because this is where reality meets ambition and the numbers here are absolutely wild. So, China still faces major technological challenges and Reuters does make that clear particularly in replicating the precision optical systems and these are the ones that Western suppliers produce and we're talking about mirrors from cars east that are so smooth that if you've scaled them up to the size of Germany the biggest imperfection would",
        "start": 461.28,
        "duration": 1196.9600000000005
    },
    {
        "text": "challenges and Reuters does make that clear particularly in replicating the precision optical systems and these are the ones that Western suppliers produce and we're talking about mirrors from cars east that are so smooth that if you've scaled them up to the size of Germany the biggest imperfection would level of precision is extraordinarily difficult to replicate. But here's where it gets interesting. Honestly, a little bit concerning. The availability of older parts from older ASML shell machines on secondary markets has allowed China to build this domestic prototype. Let me repeat, all the export controls, despite all of the sanctions, all of those things blocking the technology, China somehow got the parts anyways. They scoured the secondary market. They bought old decommissioned ASML equipment. They salvaged components. And apparently enough of those were good enough to get a working prototype. Now, this is where the timeline gets aggressive, which is of course why I've said just two years. They've set the goal of producing working chips on this prototype by 2028. That's basically 3 years away, but I mean, we're just around the corner from 2026. So, you can call it 2 years away. 2 years to go from we have a machine that makes light to we can make advanced semiconductors. To put this into context for just how terrifying that is, ASML took roughly a decade to make that same journey. But ASML was pioneering the technology. They didn't have a working example to reverse engineer. They didn't have former engineers leading the company in the world. They didn't have unlimited state funding and national prestige on the line. But those close to the project, meaning actual engineers doing the work, say a more realistic target is actually at 2030. That's still a decade earlier than analysts believed it would take to match the western chips. And if the analysts were right, then China wouldn't have a competitive chip manufacturing until 2035 or later. But if the engineers are right and China hits 2030, that's 5 years ahead of expectations. 5 years where every strategic calculation changes. 5 years where the assumed American technological advantage narrows faster than defense planners anticipated. And remember, we've already established that experts have been consistently wrong about China's timelines. So you have to understand just how important this is to China and the scale of this effort because this is no joke. They are calling this China's Manhattan effort. So the project falls under the country's semiconductor strategy which state media has identified being run by Jing Jinping confidant Jingh Jang who heads the Communist Party's Central Science and Technology Commission. Now let me emphasize what that actually means. This is being overseen by someone who reports directly to Jing Jingping who sits on the highest levels of the Chinese Communist Party. This isn't buried in some ministry. This isn't delegated to corporate R&D departments. This is the top of the pyramid national strategic priority. Like when Xing Jingping made",
        "start": 604.08,
        "duration": 1501.0390000000002
    },
    {
        "text": "is being overseen by someone who reports directly to Jing Jingping who sits on the highest levels of the Chinese Communist Party. This isn't buried in some ministry. This isn't delegated to corporate R&D departments. This is the top of the pyramid national strategic priority. Like when Xing Jingping made pillar of China's technological ambitions, he didn't just decide to throw money at the problem. He put his most trusted people in charge and basically gave them unlimited authority. Now, if you remember what the Manhattan Project is from the United States, that basically took the bestest and brightest and of course billions of dollars and basically focused individuals on researching deployable atomic weapons in under four years. There's around 130,000 people across many secret facilities. And it was I think around $30 billion. And this thing succeeded because it basically had unlimited resources and of course unlimited talent. And think about this. Let's say China does the exact same thing, which they're basically saying that they're doing. China has the resources. Their state has hundreds of billions of dollars. They have the talent. They already recruited from ASML, from Western universities. They have massive engineering workforces. They have the secrecy. They've basically got everything they need. And so remember guys, if they're, you know, treating this as a Manhattan project, it means that they're not thinking this is going to take decades. They are planning for a breakthrough which is going to take years, that it's going to fundamentally reshape the AI race. If China does get their hands on it to chips, I honestly don't know what the world is going to look like. And remember guys, the aim is for China to eventually be able to make chips on machines that are entirely Chinese-made. China wants the United States 100% kicked out of its supply chains. Think about what that means right now, okay? And things are going to change. United States has incredible leverage over China because the American technology is basically just embedded throughout the, you know, semiconductor systems. If you need advanced chips, you're buying American designed GPUs with American software with American components. And if you need to manufacture chips domestically, you're dependent on American export licenses, American inspections, yada yada yada. However, China is systematically working to make sure all of that leverage is irrelevant. And they're not just doing it in semiconductors. They're doing it in operating systems. They're doing it with AI models like DeepSeek. They're doing it with satellite navigation. Basically, they want complete technological sovereignty. the ability to say we don't need anything from you and therefore you can't really pressure us on everything. And this is why we should be terrified. Every time we've previously said China can't do X without us, they've shown us that they can anyways. Even though it takes longer or costs more, eventually they do get there. So this machine should show us the latest example. And I",
        "start": 757.839,
        "duration": 1774.9589999999992
    },
    {
        "text": "And this is why we should be terrified. Every time we've previously said China can't do X without us, they've shown us that they can anyways. Even though it takes longer or costs more, eventually they do get there. So this machine should show us the latest example. And I pretty sure most of you guys know about the book called Chip War. So this is you know an additional perspective which is basically the definitive book on the semiconductor industry and geopolitics and this is someone who deeply understands the technological and strategic dimensions of this you know war. Now he basically wrote consider for example what it would take to replicate and by the way this was in 2022 consider what it would take to replicate one of ASML's EV machines which has taken nearly three decades to develop and commercialize. Three decades that's the baseline we're working from. and ASML started serious EV research in the 1990s and didn't achieve commercial production until 2019. 30 years of continuous development, billions in R&D, contributions from suppliers across multiple countries. And they talk about the fact that replicating just a laser in an EV system requires perfectly identifying an assembly of 457,329 parts. An insane number. And remember guys, that's just for the laser, not the entire machine, just for one component. And every single one of those parts have to work perfectly together. A single defect could cause debilitating delays or reliability problems. No doubt the Chinese government has deployed some of its best spies to study ASML's production processes. However, if they've, you know, already hacked into the relevant systems and downloaded design specs, machinery, this complex can't simply be copied and pasted like a stolen file. But this is the critical point that he makes in this book is that the espionage helps. Having the former ASML engineers, this helps. Studying the patents and papers helps, but you can't just download the blueprint and print one. It's the institutional experience. You just need some kind of, you know, knowledge that a book wouldn't just give you. And remember, the crazy thing about all of this, and the reason I actually, you know, added this to the video was because this is where the text cuts off is that he says, he basically says that they lack the decades of experience accumulated by the engineers who developed it. And China basically did it in 6 years. So, not three decades, six years. So they may actually do it sooner from 30 years to 8 years which is just incredible. Now what I find absolutely crazy and something I find really eerie is that if you see this article from 2023 it suddenly looks prophetic. So ASML holding chief officer Peter Wenick said that the USled export control measures against China could eventually lead Beijing to successfully develop its own technology and advanced chipmaking machines. This was in 2023, the CEO of",
        "start": 896.88,
        "duration": 2067.1969999999983
    },
    {
        "text": "is that if you see this article from 2023 it suddenly looks prophetic. So ASML holding chief officer Peter Wenick said that the USled export control measures against China could eventually lead Beijing to successfully develop its own technology and advanced chipmaking machines. This was in 2023, the CEO of they were warning that these export controls might backfire, that instead of stopping China's progress, they're probably just going to motivate them to develop their own alternatives. And here's what he was right. Not eventually, not someday in the distant future, right now, 2 years later, there's a working prototype in Shenzen that's generating EUV light. And he basically said that these you know companies have to compete and so they want to buy non-Chinese machines. And remember he did say that if they cannot get those machines they will develop them themselves and that it will take some time but ultimately they will get there. So remember this was the CEO of ASML the man who understands the technology better than anyone's on earth. And he basically said that you know if you're going to block them from buying our machines eventually they're going to build them on their own. And of course the United States didn't listen. They of course did the export controls and look where we are now. And if we go further on into the article, he clearly says that look, the laws of physics are the same here. The more you put them under the pressure, the more likely it is that they're going to double up those efforts in building those machines that can rival ASML. So I think this is super interesting. If China does achieve true semiconductor independence, they can achieve independence across every downstream technology that depend on advanced chips. And these are huge implications for AI, AGI, and just a whole range of different things. And I think this is the moment we need to realize that China are not playing around anymore. They are clearly in this game to win it. Now, I know this video is just about AI chips. And you might be thinking, okay, well, who cares if China makes chips or what not? But you have to understand that this is a huge, huge deal for AGI because you have to understand that AGI is something that essentially every country is racing towards. So you have to understand what this means because if you build a super intelligence system first that's going to define the rest of human history. So you have to understand that right now the assumption the foundational assumption underlying all of Western AI policy is that the United States and its allies will maintain a decisive compute advantage over China. That even if Chinese researchers are brilliant, even if the algorithms are efficient, they'll be fundamentally limited by access to advanced ships. Now this assumption okay that I'm making in this video here from Reuters it changes everything okay and",
        "start": 1046.0,
        "duration": 2332.717999999997
    },
    {
        "text": "its allies will maintain a decisive compute advantage over China. That even if Chinese researchers are brilliant, even if the algorithms are efficient, they'll be fundamentally limited by access to advanced ships. Now this assumption okay that I'm making in this video here from Reuters it changes everything okay and comfortable towards erasing AGI despite those risks okay and it's why AI safety researchers talked about buying time through compute governance it's why policy makers believe they can regulate China's AI capabilities through export controls on GPUs and chip manufacturing equipment now the assumption just became a lot shakier If China achieves domestic EUV manufacturing by 2028 or by 2030, they can produce cuttingedge AI chips domestically, not the workaround solutions that they're using now with all the nodes and architectural tricks. Actual state-of-the-art chips competitive with whatever TSMC is making for Nvidia, AMD, and others. And this is what this means practically. The compute bottleneck disappears. Right now, Deep Seek showed that China can do more with less. training competitive models on a fraction of the compute that western labs use. Imagine what happens when they don't have to do more with less. When they can just throw the same compute that OpenAI onropic uses at the problem. Think about the timeline here. Most experts and look, expert predictions have been wrong repeatedly. But let's use them as a baseline. Think AGI might arrive somewhere in the late 2020s to early 2030s. Timelines vary wildly, but that's roughly the window where things get kind of interesting. China's realistic target for commercial EV production is 2030, which means we're potentially looking at AGI level capabilities emerging right around the time China achieves full semiconductor independence. And here's a scenario that should probably keep the policy makers up at night. What if China gets to AI first or even gets there roughly at the same time that the United States does, but they get there without any of the safety culture, the alignment research, the debate about responsible development that's happening in Western AI labs. Now look, you can criticize Western AI safety efforts as insufficient captured by commercial incentives as moving too slowly. Fair criticisms, but at least there's a conversation happening. At least there are researchers working on alignment. I mean, look at the, you know, stuff going on at Anthropic. And at least there's at some kind of public discourse about the risks. Where is the equivalent conversation in China? Where are the Chinese AI safety researchers publing researchers about, you know, value alignment? Where are those papers? Where is the discussion about the risks of super intelligence systems? I mean, it's not that they don't care. It's that the entire development process is opaque, controlled by state priorities optimized for strategic advantage rather than safety. And here's the race dynamic that that emergence creates. If both the US and China are approaching Asia level capabilities around the same time and both know that the other is approaching",
        "start": 1180.88,
        "duration": 2640.1579999999994
    },
    {
        "text": "that the entire development process is opaque, controlled by state priorities optimized for strategic advantage rather than safety. And here's the race dynamic that that emergence creates. If both the US and China are approaching Asia level capabilities around the same time and both know that the other is approaching faster, not slower. They're basically going to cut corners on safety to maintain a competitive advantage to deploy systems that might not be fully aligned because being a second slower could mean being irrelevant. And this is the AI race that everyone has been warning about. Except now the timeline is compressing because the assumption of US dominance is eroding. Now, there's another dimension here, too. And honestly, I didn't even want to make this video so long, but this is just so important. What happens to global AI governance if China can manufacture its own chips? Right now, the US has been trying to build an international coalitions around AI safety, around computer governance, and restrictions on certain types of AI development. But those coalitions assume that the United States control the hardware that if you want to build front AI systems, you need American chips made with American technology. China achieving EUV independence just completely breaks that assumption. They can build their own AI infrastructure, their own compute clusters, their own frontier models completely outside of any governant frameworks the West tries to establish. And this is the most uncomfortable question. Okay, I'm going to wrap it up now. What if China's approach to AI development is actually more effective? Not morally better, not safer, not just more just more effective progress. I mean, Deepseek already showed that they can achieve competitive results with less compute through better algorithms and training efficiency. What if removing the compute constraint doesn't just allow them to match our capabilities? What if it allows them to exceed ours? I mean, Western AI labs are constrained by compute cost, by public scrutiny, by safety research, overhead, ethical debates, yada yada yada. Chinese AI development is constrained by compute access and expert controls. Two very different things. And I mean remove that constraint and you have unlimited state funding, top- down coordination, access to massive data sets with no privacy restrictions and researchers who can purely focus on capability advancement without safety or ethics overhead. And I'm not saying that that approach is good and I'm not saying that we should replicate it. I'm saying it might be effective at the specific goal of developing AI systems quickly. And if the race to AGI becomes defined by those who can move fastest rather than those who can move safely, this is a race dynamic where China actually has the advantages. Now remember guys, I spoke about this already. These, you know, entire things were supposed to buy time and this is the worst possible scenario that we're currently in right now. A compressed timeline towards AGI with two superpowers racing towards the finish",
        "start": 1336.64,
        "duration": 2929.1969999999988
    },
    {
        "text": "dynamic where China actually has the advantages. Now remember guys, I spoke about this already. These, you know, entire things were supposed to buy time and this is the worst possible scenario that we're currently in right now. A compressed timeline towards AGI with two superpowers racing towards the finish rather than carefully and neither able to meaningfully constrain the others development through hardware restrictions. This breakthrough it doesn't just change the chipboard. This just changes the entire equation around how quickly we get to Agi. And this now means the race is on and the timeline is shorter than expected. And the assumption that the US could control the pace through computer restrictions just got weaker. So guys, when you see headlines, okay, that China is building an EUV machine, understand what is really at stake here. This is not just about semiconductors or trade policy or economic competition. This is about who builds the most powerful technology in human history under what constraints, with what values, with what embedded systems, and whether anyone has the ability to slow things down if the risk becomes unacceptable. And right now the answer",
        "start": 1484.24,
        "duration": 3031.8379999999993
    }
]