[
    {
        "text": " Open AAI just leaked what might be the strangest AI device we've seen just yet. Not glasses, not a pin, not a pendant, a pen. So now, codenamed Gumdrop, this is an AI powered pen that is set to launch in 2026 or 2027. And this is supposed to be your third core device alongside your phone and your laptop. But the thing is, most people don't realize we've seen this movie before. The Humane AI pin is dead. The Rabbit R1 is basically dead. and both promised to revolutionize how we interact with AI and both crashed and burned spectacularly. So the question is, can OpenAI actually pull this off or is this just another expensive gadget designed for the drawer of forgotten tech? Let's break it down. So what do we actually know about this device? So here's what we actually know about this thing is that the device is being developed under the internal code name Gumdrop. And OpenAI acquired Joanie IV startup IO for roughly $6.5 billion back in May of 2025. Now, this is all stock, no cash, bringing in about 55 engineers, including the designer behind literally every iconic Apple product. Now, according to leaks from industry tipster Pikachu, here's what we're looking at. So, the form factor is supposedly a pen. Think about an iPod shuffle sized without a dedicated screen, and the whole point is to be screenless and minimalist. Now, some of the core features we're looking at contextual awareness through cameras and microphones, handwritten notes converted to text and uploaded directly to chatbt, two-way voice communication with the AI, ability to run OpenAI's models locally with cloud support for heavy task, possibly worn around the neck or carried in pocket. Now, now for manufacturing, they were originally going with Chinese manufacturer Luxure, but OpenAI specifically didn't want it made in China, probably for political and supply chain reasons. So, they've moved to Foxcon, likely manufacturing in Vietnam or potentially even in the United States. Sam Alman has described the device vibe as simple, calming, and devoid of distractions, like a cabin by a lake, and Joanie IV calls it elegantly simple and playful. Now, there are actually three core device concepts under evaluation with the pen launching first, followed by a portable go-to audio device, and none of these are earphones or traditional wearables. These are supposedly entirely new form factors. Now before we dive into this entire pen, we need to talk about okay the graveyard of AI hardware because if we get too excited, we need to remember these things can ultimately fail. So the first thing I want to talk about is the Humane AI pin. This thing was supposed to be the future. Founded by former Apple executives, it raised $230 million at an $850 million valuation. It was this sleek little brute that could project a laser display onto your palm. The price was ridiculous. $699 plus a $24 a month subscription. Now, what",
        "start": 0.08,
        "duration": 323.11999999999995
    },
    {
        "text": "This thing was supposed to be the future. Founded by former Apple executives, it raised $230 million at an $850 million valuation. It was this sleek little brute that could project a laser display onto your palm. The price was ridiculous. $699 plus a $24 a month subscription. Now, what obvious. It was a complete disaster. One of the worst reviewed consumer tech products in recent memory. By mid 2024, the returns were outpacing sales. They sold maybe 10,000 units when they planned for $100,000. And in 2025, HP acquired the assets for just $116 million, which is just half of what they raised. And they basically killed the products. The servers got shut down, and everyone who bought it was left with an expensive paper weight. Now, Rabbit R1, the fluorescent orange AI walkie-talkie, was supposed to use something called a large action model to actually do things for you, to book flights, order food, all that kind of [music] stuff. And the price was $199, which is much more reasonable. Well, what happened? 100,000 pre-orders sounds great, right? But 5 months after launch, only around 5,000 people were using that device. And the founder admittedly, you know, said that they rushed it to market. Security vulnerabilities expose user data, and most people just returned them. The media called it one of the top three hardware failures of 2024. Now, if you aren't sure why I brought this up, think about the common thread. Both of those devices promised to replace or support your current smartphone. Both relied entirely on AI that wasn't quite ready. And both answered a question that nobody was really asking. What if I had my phone, but worse? Now, this is the actual problem, the consumer habit problem. This is the biggest challenge that OpenAI is going to face. The brutal truth is that changing how people interact with technology is incredibly hard. Think about it. Your smartphone has been your primary computing device for what, let's say, 15 years now. Every app, every phone you use, everything that you do, every muscle memory you developed, it all revolves around that little rectangle in your pocket. The iPhone wasn't successful because it was just good technology. It was successful because it replaced something people were already using, flip phones and PDAs, and did those jobs better. It fit into existing behaviors while improving them. But an AI pen, what behavior does that replace? Note takingaking, most people type faster than they write. Voice memos, your phone already does that. Quick questions to ask AI. You can already talk to chat activity on your phone, your watch, or your car. The challenge isn't building a cool device. It's actually convincing millions of people to add another thing to their daily carry list. Another thing to charge, another thing to remember, another subscription to pay for. And that the people most likely to buy a firstg AI device are early adopters. And",
        "start": 163.76,
        "duration": 589.9200000000002
    },
    {
        "text": "challenge isn't building a cool device. It's actually convincing millions of people to add another thing to their daily carry list. Another thing to charge, another thing to remember, another subscription to pay for. And that the people most likely to buy a firstg AI device are early adopters. And Humane and Rabbit. And that trust problem is going to be very hard to overcome. Now, of course, we need to talk about the price. Okay, this is something that nobody at OpenAI has mentioned yet. How much is this thing going to cost? I mean, look at the prices of the previous things. It's kind of expensive. Humane AI pin cost $699 plus $24 a month in subscription. The Rabbit R1 was $200. Meta's Raybang glasses $299 up to $700 for the display version. And now this is a Joanie I've designed product. So we're talking about the man who made Apple products command premium prices for decades. And OpenAI isn't exactly known for being cheap. Chativity Pro is $200 a month. So my prediction is that this pen is going to be expensive. Maybe $400 to $600 minimum for the hardware potentially with a Chat TBT subscription bundle or required. And here's the thing about price. It completely changes the risk calculus for consumers. If you're paying $200 for the Rabbit R1, that's an impulse buy. Sure, I'll try it. I'll drop $200 on it. But $700 for the Humane AI pin, that's an investment. That better be life-changing. If OpenAI prices this too high, they're setting expectations that no first generation products can meet. If they price it too low, they're signaling that they don't even believe in it. And that's of course the question of the ongoing costs. Will this require a Chat Gibbt Plus subscription? a separate subscription or will the full features be locked behind ChatBT Pro at $200 a month? These are the questions that are going to make or break adoption. Now, let me ask you something. Would you actually use this? Picture your daily routine. When would you reach for an AI pen instead of your phone? The pitch seems to be taking notes in meetings while getting AI assistance, capturing ideas on the go without screen distraction, having a calmer relationship with the technology. But we need to be real about this. Whilst yes, being offline is actually a real trend moving into 2026 due to the AI destroying the internet, we need to be real about daily interactions in meetings. Most professionals already have laptops open in meetings. The ones taking handwritten notes do so specifically because they don't want technology involved. An AI pen kind of defeats that purpose for ideas on the go. I can already say, \"Hey Siri, remind me to do XY Z.\" Or I can open chat GBT and have it speak my thoughts. The friction isn't that high. Now, calming tech is, of course, the most interesting",
        "start": 298.4,
        "duration": 864.1590000000002
    },
    {
        "text": "AI pen kind of defeats that purpose for ideas on the go. I can already say, \"Hey Siri, remind me to do XY Z.\" Or I can open chat GBT and have it speak my thoughts. The friction isn't that high. Now, calming tech is, of course, the most interesting trying to grab your attention with notification, ads, or infinite scroll, this is the real dealer here. But here's the thing. If you want less distraction, you can just put your phone down. You don't need a $500 pen to do that. The real question is, what's the use case that only this device can solve? Remember, smart pens have existed for years. Livescribes, Moleskine, smart pen, Rocket Book, they never went mainstream because the problem that they solved wasn't painful enough. And adding AI doesn't automatically change that equation. It just makes the pen more expensive and adds another point of failure. Now, here's something that most people won't talk about, and that's the privacy problem. This is something that should concern everyone. The privacy implications of an always on pen. The device will have cameras, always on microphones, and direct connection to chatbt servers. Think about what that means. Every note you write could be uploaded to OpenAI servers. Every conversation in Airshot could be processed by AI. Every environment you're in could be analyzed and stored. We already saw what happened when Meta's Ray-B band glasses became popular. People got uncomfortable being around someone who might be recording them. There's a social cost to wearable cameras. A pen is slightly more discreet, which could be worse. At least with glasses, people can see you might be recording. A pen on the desk in a meeting, nobody's going to think twice about that. And then there's the question of data security. Both the Humane and Rabbit had security vulnerabilities that expose user data. They're wellunded startups with experienced teams and they still messed up basic security. So what happens when an AI records a confidential business meeting and that data gets breached? What about attorney client conversations and medical appointments? This liability is probably going to keep OpenAI up at night. Now this is the question that I was thinking as someone who's, you know, looked at all these AI tools, done a bit of research. Why on earth are OpenAI not just making glasses? And this is the question that I keep asking myself. Look, look at what is actually going on in the smart glasses space. Meta's Ray-B band glasses have been a genuine success story. I have a pair. Over 2 million units sold. Revenue tripled the first half of 2025 and they now command 73% of the global smart glasses market. And the smart glasses market grew 210% in 2024, almost entirely because of Meta. Google announced they're launching AI glasses with Gemini in 2026, partnering with Samsung, Bobby Parker, and Gentle Monster. Apple is reportedly working on,",
        "start": 437.12,
        "duration": 1132.7980000000005
    },
    {
        "text": "of 2025 and they now command 73% of the global smart glasses market. And the smart glasses market grew 210% in 2024, almost entirely because of Meta. Google announced they're launching AI glasses with Gemini in 2026, partnering with Samsung, Bobby Parker, and Gentle Monster. Apple is reportedly working on, Amazon already has its Echo Frames. And I did a video recently on how Amazon's using smart glasses for their delivery drivers. And Snapchat is announcing AI glasses coming in 2026. Think about it. The entire industry is already converging on glasses as the form factor for AI wearables, and it's working. Meta has already proved that there's actual consumer demand. And glasses make sense for a few reasons. People already wear glasses. It's not new behavior. They're hands-free by nature. They can provide visual and audio output. They look normal. The social acceptance is higher. And you can't actually lose glasses as easily as a pen. So why is open eye zigging when everyone else is zagging? Well, maybe they think they're smarter than everyone else. Maybe Joanie IV has a vision that we just can't see yet. Maybe they're trying to avoid direct competition with Meta and Google. Or maybe they're making a mistake. Remember, the contrarian bet isn't always a smart bet. Sometimes the herd is right. Now, let's talk about what OpenAI does have going for it. Because although I've been pretty skeptical, I just want to play devil's advocate and talk about what chatbt does have going for it. Well, think about chatbt. Unlike Humane and Rabbit, which were building on AI that wasn't ready, OpenAI is the AI. ChatBT is the most capable and consumer AI product on the planet. If anyone can make an AI device that's compelling, it's the company that makes AI that everyone actually uses. Secondly, Joanie IV is a genuine genius. Love him or hate him, the man has a track record. He made products that people didn't know that they wanted into products that people couldn't live without. The iPod, the iPhone, the iPad, the AirPods, all I've pen feel essential, it is him. Third, they've already learned from other people's failures. OpenAI has watched Humane and Rabbit crash and burn. They know exactly what not to do. Don't overpromise. Don't rush to market. Don't ignore security. Don't require subscriptions that make the value proposition worse. And fourth, the third device framing might actually work. By positioning this as a companion to your phone rather than a replacement, they're lowering the expectations and reducing friction. You're not asking people to change their whole life. Just add a tool for specific situations. And the fifth reason, and this is the biggest reason that I think they will be successful with this is that they have time. 2026 is 2017 launch gives them time to iterate on prototypes, gather feedback, then actually get it right. Unlike Humane and Rabbit which rust capitalize on AI hype, OpenAI can afford to be",
        "start": 572.959,
        "duration": 1413.039000000001
    },
    {
        "text": "the biggest reason that I think they will be successful with this is that they have time. 2026 is 2017 launch gives them time to iterate on prototypes, gather feedback, then actually get it right. Unlike Humane and Rabbit which rust capitalize on AI hype, OpenAI can afford to be leave us? Well, I think that OpenAI has a much better, you know, chance than Humane or Rabbit did, but it's still an uphill battle. The good is that they've got the best in-class from an actual AI leader, large distribution from everyone that uses the product every day, worldclass design from Joan IVive, and the time and patience to get it right. The bad is that they're solving a problem that might not exist. They're going against industry consensus on the form factor and consumer trust in AI hardware is at an all-time low and privacy concerns are going to be significant and the price is likely to be high. Now, my prediction, my personal prediction is that this is probably going to be a niche product that sells to open eye enthusiasts and design nerds, but it won't be a mainstream hit. Not because it's bad, but because the use case isn't compelling enough. The future of air hardware is probably glasses and not pens. Meta, Google, and Apple, they're all converging on the same form factor for good reasons. Open AAI might be too clever by half here. Now, I'd love to be wrong. A genuinely useful AI device that isn't trying to steal my attention would be refreshing. If anyone can put it off, it's this team. Now, let me know what you guys would think. Would you buy AI pen from OpenAI? Do you think they should have just made glasses like everyone else? I think it's a good risk and if it does come out I probably will",
        "start": 715.36,
        "duration": 1551.9200000000003
    }
]