[
    {
        "text": " So, OpenAI might be in trouble with Google's latest release. So, let's talk about it. So, recently this article came up from the information speaking about how Sam Alman's memo is forecasting rough vibes due to the resurgent Google. And honestly, I think this is probably true. If you've been living under a rock, then maybe you wouldn't have seen the fact that Google's Gemini 3 is honestly rather incredible. And I know right now I am showing you the benchmarks of humanity's last exam GPQA Diamond Arc AGI 2, but you have to understand that even if the benchmarks don't surprise you, from what I hear from most people, the results that they seem to be getting are outstanding. And you have to understand that with Nano Banana, with VO3.1, with all the range of products that Google offers at this moment in time, it seems to be like Google are pushing ahead in a way where I don't see them losing. Google's suite of products are honestly rather superior at the moment. I mean, I use Sora, I do use chat GPT, and slowly I do find myself on a day-to-day basis using Google products more and more, and they just seem to have a wider range of products and services that I think the average person would just enjoy. Now, you can see here that Samman literally says that OpenAI are going to be facing some temporary economic headwinds for the company. And he does say that OpenAI would emerge ahead. And this does make sense because if you've been on Twitter recently, you'll see that the mode of thinking has somewhat changed in the sense that a lot of people are starting to realize [music] just how powerful Google are when it comes to being a major player in AI. Now, this is somewhat of a big deal because it's not just OpenAI losing to Google. In this article, they talk about the fact that, you know, Anthropic, the four-year-old firm whose founders previously worked at OpenAI, are actually poised to generate more revenue than OpenAI this year from selling to AI developers and businesses through the API. And that's pretty interesting because OpenAI started earlier. They clearly had a lot more time to get their products market fit. Of course, more people know what chatb is, but somehow Enthropic also have managed to gain ground on OpenAI. Most of you guys know that people who code currently, they do use the Claude models exclusively and it's somewhat become an industry standard that if you're vibe coding or software developer, Claude is just, you know, the models that you choose to use. And remember guys, this is something that we really couldn't have predicted. If you were around in the early days of Claude 1 and 2, you really wouldn't have seen Claude 4, Claude 4.5 emerging at the rate of capability it did and taking such a huge market share out of OpenAI.",
        "start": 0.16,
        "duration": 318.16100000000006
    },
    {
        "text": "guys, this is something that we really couldn't have predicted. If you were around in the early days of Claude 1 and 2, you really wouldn't have seen Claude 4, Claude 4.5 emerging at the rate of capability it did and taking such a huge market share out of OpenAI. also in his notes acknowledges that by all accounts Google has been doing excellent work recently especially on the pre-training which is the first phase of developing a large language model that can generate text or images and in that phase that's where the AI researchers expose an LLM to data from the web and other sources so it can learn connections between them. Now this article also dives into the fact that OpenAI you know they're somewhat assuring staff that they're still going to be gaining ground in the coming months. Last month they spoke about the fact that they're going to have a new LLM code named Shallot Pete. I'm not actually sure what this model is. There isn't a lot of information surrounding this model. We don't know if the model is Omni, we don't know if it's just an LLM purely. And the reason I do say that even though the article does say it's just an LLM, we do know that omni models are pretty much the future in terms of higher level reasoning because they actually do understand the world quite like we do. Now we can see here that Sam Alman is basically saying that he wants to focus on very ambitious bets technologically even if it means that OpenAI is going to get temporarily behind in the current regime. So it seems like OpenAI might be playing the long game. And so and it seems like one of the long games they're playing is using AI to generate data that could train new AI and post-training techniques [music] such as reinforcement learning which most of you guys know what that is. So I think what we can get from this very ambitious bet here is that OpenAI are trying to rapidly work on automated AI research. I'm guessing if you can have the AI that just generates incredible training data, you can really start to move forward. And if you can make that training process a lot more efficient, the models are going to get a lot better. Now I do personally think that OpenAI are probably going to focus on omnimodels because we've seen that these omnimodels can reason in an incredible way with NOANA 2. the visual reasoning some are literally calling visual AGI and honestly chat GBT image one just doesn't even come close I mean the model is good but it just doesn't come close as it should but I do think it interesting that you know OpenAI are thinking long term here which means that they could certainly come ahead in the future if they are planning ahead in ways that people just simply haven't",
        "start": 159.44,
        "duration": 567.7620000000003
    },
    {
        "text": "model is good but it just doesn't come close as it should but I do think it interesting that you know OpenAI are thinking long term here which means that they could certainly come ahead in the future if they are planning ahead in ways that people just simply haven't you know a lot of times we do discount OpenAI but we have to remember that they're still a very innovative company and they may just pull something incredible out of bag that we just, you know, couldn't predict. So, you can see right here as well that they're also thinking very long term and they are stating that they need to focus on super intelligence. So, Sam Alman in the memo said that we need to stay focused short-term through competitive pressure and that we built up enough strength as a company to weather great model shipping elsewhere, but having most of our research team focused on really getting to super intelligence is critically important. So we can see here that whilst you know everyone is currently loving the models from Gemini and there's a lot of discussion about what people are going on it seems like open AI staying focused on super intelligence is their one big goal and I think it's very clear why although super intelligence seems like a daunting far-off task if they do manage to achieve super intelligence well then I guess all bets are off for everything else because super intelligence would literally be able to do everything. Now, I know a lot of people are going to say, well, how you going to make it do anything if it's super intelligence alignment, this and that? I know there are a million different problems that come with that, but the point I'm trying to make here is that OpenAI are saying, look, if we just focus on the big picture, then we can eventually win the AI race. Now, I wanted to talk a little bit more about the change in the mode of thinking about how people use these models because there was a recent tweet from Mark Beoff and we can literally see here he says, \"Wow, I've used chatbt every day for 3 years and I just spent 2 hours on Gemini 3 and I'm not going back. The leap is insane. Reasoning, speed, images, video, everything is sharper and faster. It feels like the world just changed again.\" Now, this is important because this is the billionaire CEO running the biggest AI integrated SAS companies in the world. Like literally one of the biggest and historically he's been very aligned with OpenAI and GPT him. So, for him to say he's not going back is pretty different. This isn't just hype from like someone random. This is a pretty big deal. So, Google was behind for quite some time and then all of a sudden Gemini 3 pops out and you've got, you know, billionaires saying that they're not",
        "start": 286.32,
        "duration": 816.0010000000003
    },
    {
        "text": "say he's not going back is pretty different. This isn't just hype from like someone random. This is a pretty big deal. So, Google was behind for quite some time and then all of a sudden Gemini 3 pops out and you've got, you know, billionaires saying that they're not kind of interesting. It's very, very interesting. I mean we like if you've been in this space for a while you know that often times you are in the cycle where Google will seem to pull ahead but I think this time is different because not only are Google pulling ahead in terms of you know just the reasoning of the models they seem to be pulling ahead on all fronts I mean video images overall reasoning those are three key areas and it's going to take a lot for open eye to of course pull ahead now of course some aren't convinced you do see here that some users are saying that Gemini is terrible at following instructions and I honestly do have to agree with this to some extent. I know you guys might think I'm just pure hype, but honestly guys, seriously, there are some times when Gemini just does some really strange things. I'm not sure why the instruction following sometimes can get so bad, and I'm sure some of you guys know exactly what I mean. But despite the model being, you know, incredible reasoning, Gemini 3 isn't perfect. It's very clear to say that there isn't an AI that currently is perfect. But I think that once they do manage to fix this, I think their lead manages to grow even further. And of course, we have someone else saying that I don't find Gemini 3 as impressive as the rumors made it sound. It's fairly good, but I don't think it knocks out Chatty. Sometimes it worse. You know, sometimes people aren't convinced. Now, if we want to just look away from Twitter and this speaking and just, you know, people's opinions, we can take a look at the generative AI traffic share because that is where you realistically get the best data in terms of how people are actually using the models on a day-to-day basis. Twitter is a bubble and most [music] people who are currently using the models in that Twitter sphere are among the power users. So, it's not really an accurate reflection of what's going on in the wider LLM space. But what we can see here is that OpenAI, their generative AI traffic share is actually been declining quite a bit. Now I don't think this is as bearish as people think because of course other companies are going to be coming into that space but we have to say that openai does need to you know really make a sort of defensive action here because if the trend does continue what do the next 12 months look like in terms of generative AI traffic share",
        "start": 412.319,
        "duration": 1059.6010000000006
    },
    {
        "text": "companies are going to be coming into that space but we have to say that openai does need to you know really make a sort of defensive action here because if the trend does continue what do the next 12 months look like in terms of generative AI traffic share it's trending down and open I's market share is just continually going down I mean each month we get new AI tools that are simply better of course for the consumer you know we had things like Deepseek, Perplexity, you know, Manis. And taking a look at the generative AI traffic there, we can basically see that OPAI still has, you know, nearly above 70%. But will that be the same a year from now? Who knows? And another big problem that is, you know, concerning AI investors and people looking at the AI industry is the fact that OpenAI's model, it just bleeds cash by design. When you are OpenAI and you are, you know, competing with the likes of Google, it is tremendously difficult. You can see here this article talks about how OpenAI's business is expected to burn $115 billion through 2029 information report. So OpenAI has to rent thousands of GPUs, you know, constantly retrain the models when they break, pay data licensing fees, pay researchers, safety teams, infra teams, and OpenAI is going to be burning $100 million, not 100 million, hundred billion dollars over the coming years. And OpenAI is essentially a capital intensive cash hungry low margin business for now. Now, of course, you know, if they achieve AGI and stuff, they can, you know, really, really have an insane valuation. But the point I'm trying to make here is that compare this to a company like Google. Google has $70 billion in free cash flow per year. They've also got their own TPUs, so their training cost is way cheaper. They've got already existing massive data center networks. And it's crazy. It's crazy of the disparity that these companies, you know, have. I mean, one thing I know about Google is that they can offer powerful AI models for dirt cheap or even basically free. They could run Gemini at a loss for years with basically infinite runaway. So they can decide to if they want to outspend OpenAI for a decade without even breaking a sweat. So you know OpenAI they need to charge aggressively for chat GBT and API usage and they need every model to pay for the next one which is pretty a pretty difficult position to be in and they need to literally raise billions of dollars every year and can't surprise a price wall which is scaring investors and the economics of this it just doesn't look good. I mean, some people could argue that if Google wanted to, they could arguably price OpenAI out of existence by simply lowering their margins. And we have to just have this one takeaway is",
        "start": 535.76,
        "duration": 1323.5210000000009
    },
    {
        "text": "price wall which is scaring investors and the economics of this it just doesn't look good. I mean, some people could argue that if Google wanted to, they could arguably price OpenAI out of existence by simply lowering their margins. And we have to just have this one takeaway is rough vibes ahead is pretty short because Google has momentum. They caught them on pre-training and it's going to look bad for a bit for OpenAI and their lead is essentially narrowing and they also have a heavy burn rate and investors are suddenly looking at OpenAI like hm maybe maybe this company is a little bit riskier than I thought. But let me know what you guys think. I'll see you guys in the next",
        "start": 669.68,
        "duration": 1363.6810000000007
    }
]