[
    {
        "text": " So Sam Alman says, \"I don't get this insanity. What is going on? Let's talk about it.\" So if you haven't been paying attention to the Twitter space, you'll have missed this recent comment from Sam Alman. And it all relates back to the deal on ICE. Ladies and gentlemen, the $100 billion mega deal between OpenAI and Nvidia is apparently on ice because of a few things that most people just completely missed. and it's pretty integral to the future of AI. So, there was this article that was released almost a week ago and it talks about the fact that Nvidia had a plan to invest up to hundred billion dollars in OpenAI to help it train and run its latest AI model. However, the deal is on ice. Take a look at this. Nvidia chief executive Zenang Huang has privately emphasized and remember guys this was privately emphasized to the industry associates in recent months that the hundred billion dollar agreement was non-binding and not finalized people familiar with the matter said and he also privately criticized what he has described as a lack of discipline in OpenAI's business approach and expressed concerns about the competition that it faces from some of the likes of Google and Anthropic, some of the people have said. So, I mean, this is particularly interesting. You have the world's most valuable company, Nvidia, going toe-to-toe with OpenAI, and borderline backtracking on their agreement to give $100 billion in terms of funding. And this is pretty crazy because all of this information was supposed to be private behind closed doors saying that OpenAI doesn't know how to manage their money. And on top of that, he's saying they're worried about OpenAI's competition. I mean, think about it. That is not a good thing. Now, the craziest thing about this, before we dive into OpenAI's financials and just how bad the situation is really getting, you have to understand that this is a statement that is true. Okay, this isn't completely false. Jen Sen has come out and said that look, the pledge to invest $und00 billion in OpenAI, this was never a commitment. This means that look, they may invest $und00 billion, they may not. And trust me guys, this thing was going completely viral. You can see he said here, look, we never said we were going to invest a hundred billion in one round. They invited us to invest up to hundred billion. And this clip had over, I think, around a million in views. And it got to the point where Jen Sen Hang was literally on TV calling out the fact that people were wondering what on earth is going on at OpenAI and Nvidia over on Twitter. and he was like, \"Look, this is complete nonsense. We're still going to make a huge investment in OpenAI.\" Now, this is very interesting because of course, if you're partnered with a company, you do have to save face. It",
        "start": 0.08,
        "duration": 342.5599999999999
    },
    {
        "text": "is going on at OpenAI and Nvidia over on Twitter. and he was like, \"Look, this is complete nonsense. We're still going to make a huge investment in OpenAI.\" Now, this is very interesting because of course, if you're partnered with a company, you do have to save face. It never said we're going to invest in them.\" Jen Sen, I'm pretty sure he has to ensure that people still look to AI as the industry that is going to change the most lives, and no doubt it will. But if we actually go to the second part of this statement, there is a lot of truth to what he said about OpenAI and it's probably why they haven't committed the full hundred billion agreement. You have to understand that just because Nvidia is like a $3 trillion company, it doesn't mean they're just going to throw $und00 billion at OpenAI, they need to understand that they're going to receive a return on said capital. That's the entire point of investing. Now, the crazy thing is that yes, OpenAI does have a lack of discipline. If we do take a look at what they've been doing, things haven't been going great. For example, their business expects to burn $115 billion all the way through until 2029. Now, I understand that, yes, this is a tech industry. Companies burn billions of dollars all the time. But remember, guys, this isn't like Amazon or any other business. We don't know exactly where that revenue will come from. And if that revenue faces some severe limitations that we couldn't foresee, maybe there's something in the future about AI that we just couldn't have seen, then companies like OpenAI are genuinely set to implode. I mean, if we're just talking about purely the financial side, we need to understand that look, OpenAI have projected losses for 2026 alone, $14 billion, and cumitive losses all the way up until 2029, like we've said, are $115 billion. But remember that's before they even sniff profitability. Remember you've got compute costs. They spent $2 billion on sales and marketing alone in the first half of 2025 and $6 billion on stock-based compensation just to stop employees from leaving which is nearly half their projected revenue. And that's just to stop the talent from going over to anthropic. Now what's crazy about this is that the market share is slipping because they're effectively spreading themselves too thin. I'm not sure if you're familiar with OpenAI suite of products, but OpenAI have launched Sora 2, a web browser called Atlas, and they're working on consumer hardware devices with Joan IV, and they're also researching humanoid robots. They're also adding e-commerce. They're also adding advertising. Do you get the point I'm trying to make here? Their core product is losing ground. Okay, other competitors are actually stepping up to the plate and they're gaining some of the market share. Now, I'm not saying that look, Open Eye are",
        "start": 172.4,
        "duration": 637.6000000000003
    },
    {
        "text": "also adding e-commerce. They're also adding advertising. Do you get the point I'm trying to make here? Their core product is losing ground. Okay, other competitors are actually stepping up to the plate and they're gaining some of the market share. Now, I'm not saying that look, Open Eye are everyone's going to stop using the app. They're still probably by far the most used app, but look at their product lineup, okay? They launched Chativity Atlas. That product simply isn't used by anyone. Sora 2 was a really cool app, but it's essentially was basically a fad. AI video is super fun, but at the end of the day, when you do have AI video on shorts, it is very hard to monetize. If you guys have ever remembered the Vine video platform, that was a platform that simply didn't work because they simply could not monetize it. Of course, you could save through subscriptions or maybe even ads, but it has to be something that has a ridiculous amount of demand. OpenAI is facing the problem where when you focus on too many different things, you essentially get nothing that works really well. And other companies are of course taking advantage of this. Some Alman even had to declare a code red as Google Gemini has been surging. If you haven't been paying attention, the code red was in December the 2nd of 2025 and essentially OpenAI decided to declare a code red because they realized that Google couldn't stop shipping and they started to really lose market share and mind share. Take a look at this from Similar Web. This shows the traffic from April 2025 to September 2025. And it shows clearly that Chat GBT, yes, they are still king, but the thing is is that their growth is basically flat. April to September, it barely moved. It grew maybe 8%. For a company that's burning $14 billion a year, that's not really what you want to see. But if we look at Gemini, 411 million in April is what I meant. over a billion in September. That's more than double in 5 months. And the reason is simple. Google don't need people to go and download a new app or to sign up to a new website. They just shoved Google Gemini into Google search, Gmail, and Docs. And two billion people already use those products. Okay, that's the cheat code that OpenAI doesn't have. Google and these other companies, they have massive distribution modes, meaning that if they want to gain more customers, they can just simply plug them in. And remember, Google Gemini has improved massively. I don't know about you guys, but I know most people don't use chatbt as a daily driver as much as they used to when it comes to getting serious work done. Google Gemini and Claude are taking over the workspace. And the worst thing is, remember Deepseek? Everyone was freaking out",
        "start": 321.36,
        "duration": 930.0800000000002
    },
    {
        "text": "know about you guys, but I know most people don't use chatbt as a daily driver as much as they used to when it comes to getting serious work done. Google Gemini and Claude are taking over the workspace. And the worst thing is, remember Deepseek? Everyone was freaking out declined. But think about other companies, guys. Anthropic, Claude, they're quietly growing with 64% in that same window. And in that same window, you've got perplexity. Remember, guys, there is competition coming from everywhere. Smaller players are trying to beat chatbt at absolutely everything. The problem is is that they're able to beat chatbt at the specific audiences. Coders are going to go to Claude. researchers are going to go to perplexity and this is exactly the problem that Jensen Huang is talking about. ChachiT is still the number one dominant app, but it's standing still while everyone else is sprinting, moving, and gaining market share. And if you're trying to invest in a company, you don't want to invest in a company where their growth is flat, is stalling. You want to see massive numbers continually increasing month-on-month. And that is the kind of companies that do get investment. I mean, just how crazy anthropic has gotten. If you haven't been paying attention to this, maybe you haven't. This one nearly slipped me by. Anthropic wiped out nearly $1 trillion from software and service stocks as investors were debating AI's existential threat. If you aren't familiar with this entire story, you have to understand that Vibe Coding is starting to take an effect on Wall Street. All of these software stocks, guys, stocks that you may know about, any software company has just been taking an absolute beating. Okay? And that is because people are realizing that software is no longer a moat and people can vibe code software from scratch. Think about it like this. Why would I pay a company $5,000 a month for their enterprise AI subscription when I can simply get one person to vibe code that same app for $2,000 one time and never have to pay that company again. Companies may try and build their own internal tools that they can quickly do. And you have to understand that historically SAS companies had defensibility because software took years to build. Engineering teams were expensive and switching software companies was you know it was high. But the problem is is that now those features can be replicated. The internal tools can be built and the APIs replace entire SAS products not to mention AI agents that are going to be able to do everything. So the point here is that there is entire narrative that AI is eating software and that's simply coming from Claude. If Catbt was at the forefront of that, then maybe it would be good for them. But that's not currently the narrative. So maybe that's why Jen Senang is a little bit hesitant",
        "start": 468.72,
        "duration": 1223.2799999999993
    },
    {
        "text": "is that there is entire narrative that AI is eating software and that's simply coming from Claude. If Catbt was at the forefront of that, then maybe it would be good for them. But that's not currently the narrative. So maybe that's why Jen Senang is a little bit hesitant I'm not going to debate on whether or not this is entirely true. Of course, there are a lot more complex factors here, but I think the narrative that Anthropic can shift billions of dollars in value in the economy is pretty remarkable. Now, what's even crazier about this is that Oracle decided to jump in the mix because they have a massive stake in this. OpenAI has a multi-year deal to purchase up to $300 billion in computing power from Oracle. When the Nvidia OpenAI drama hit, the market started panicking about OpenAI's financial ability and of course the ability to meet its commitments. If there are questions about Nvidia will fully fund OpenAI, investors may wonder, can OpenAI actually pay Oracle $300 billion. Oracle are basically here trying to damage control, saying, \"Look guys, we're chill. Our deal is separate from the Nvidia situation, and we're confident OpenAI can still pay us.\" It's pretty telling that Oracle feel the need to make this statement at all. And it actually shows it shows just how much the Nvidia news actually sparked the market. Now, they're basically protecting their own stock price and reassuring investors that their multi-billion dollar deal is not at risk. And it's worth noting that Oracle providing the compute infrastructure while Nvidia provides the chips creates this interesting trial where everyone's success is tied together. If one relationship wobbles, then another one has to come out and calm the markets. And if you're unfamiliar with why these companies are sort of all together tweeting at the same time, well, it's because of this diagram. Maybe you've been in the AI space long enough to see this diagram appear in your feed, but if you haven't, I'm going to jog your memory. The problem here is that OpenAI are so interlin with many of the largest tech companies that if they do have a moment of weakness, it basically shakes the entire economy. And this is where that question comes in is, are open AI too big to fail? when they become a core part of the US economy or even their strategy for AI, any sort of weakness that you do see such as them not meeting their funding goal, such as them losing you know potential investments, them losing market share to Google, it kind of sets off this chain reaction where they may lose value then because of that Nvidia loses value or Microsoft loses value because Microsoft have a 49% or 51% stake then Nvidia also might lose value. It is just a crazy crazy situation at the moment. I mean, think about it. Like, if OpenAI were to go",
        "start": 617.36,
        "duration": 1525.119999999999
    },
    {
        "text": "they may lose value then because of that Nvidia loses value or Microsoft loses value because Microsoft have a 49% or 51% stake then Nvidia also might lose value. It is just a crazy crazy situation at the moment. I mean, think about it. Like, if OpenAI were to go are tied to them. And remember, Nvidia was supposed to put in hundred billion. Now, Oracle, like we said already, they're building the data centers for them. Soft Bank and Amazon are all in. I mean, look, if OpenAI do die, which I don't think they will, it's going to be pretty catastrophic. And remember, if Nvidia's stock does tank, those data centers are going to become pretty worthless and all those loans that use Nvidia chips as collateral are completely gone. And one person, you know, I was reading an article and one former national security adviser said that if OpenAI stumbles, maybe 50% of the AI infrastructure spending that's propping up GDP right now just grinds to a halt. What makes it scarier is that tech companies are doing the same thing that banks did before 2008. They're they're essentially packaging data center debt into asset back securities which is the same type of product that caused the housing crash. Now I think that AI is real. This is the good thing that AI is a real product and it you know will probably have insatiable demand in the future once the tech does get good. But of course as these things start to develop there are going to be these early phases where we have no idea what's going on. Now what's crazy about all of this is that recently it came out as well. I think it was maybe 24 hours after that, you know, OpenAI and this is why Sam Alman said this is you know insanity. There were seven sources guys, seven that said that OpenAI were not satisfied with the speed at which Nvidia's hardware can spit out answers to CHBT for specific type of problems such as software development and AI communicating with other software. It needs new hardware that would eventually provide about 10% of OpenAI's inferencing compute needs in the future, one of the sources told Reuters. So, this is pretty crazy. Now, Nvidia chips, if you're wondering, they're pretty good for, you know, training. Nvidia still dominates that. But for inference, inference is the part where chat GBT just responds to you. Every time you type in something and it spits out an answer, that is essentially inference. And OpenAI is essentially saying that Nvidia's chips might be too slow for that, specifically for coding. Their Codox product, which they've been pushing hard, was underperforming. and Openi's own engineers were blaming Nvidia for it. Samman even said publicly that coding customers put a big premium on speed. And if you want to understand the technical reasons, Nvidia's GPUs, they basically store their memory",
        "start": 769.92,
        "duration": 1801.6799999999982
    },
    {
        "text": "for coding. Their Codox product, which they've been pushing hard, was underperforming. and Openi's own engineers were blaming Nvidia for it. Samman even said publicly that coding customers put a big premium on speed. And if you want to understand the technical reasons, Nvidia's GPUs, they basically store their memory every time the chip needs to grab the data, it has to reach outside of itself to grab it. And that's fine for training where you're doing massive calculations where you're fetching data millions of times per second to respond to users, that extra step slows everything down. Now the problem is remember how we spoke about competition. Google have their own custom TPU chips and startups like Cerebrus and Grock have memory directly built into the chip and that's why Claude and Gemini can feel snappier on certain tasks. They're literally running on hardware that is designed to do that. Now what's crazy okay and I I couldn't believe this as I was reading this is that like OpenAI they were shopping around for new chips. They talked to Cerebras. They talked to Grock which are other companies that make these high inference chips. And the crazy thing about all of this is that Nvidia found out about this and Jen Sang Huang actually tried to buy both Cerebras and Grock and Cerebras said no and signed a deal with OpenAI instead. And Nvidia swooped in with a $20 billion licensing deal and hide away Grock's chip designers and basically killed OpenAI's negotiations with them. Think about that. Nvidia literally bought out OpenAI's backup plan, which is not a partnership. That's kind of like a power move. And then after all of this, you're seeing people on Twitter post about this and that. And it's crazy because can you take a look at this tweet? It literally says here, \"Our partnership with Nvidia is foundational. Nvidia is our most important partner for both training and inference. And our entire compute fleet runs on Nvidia GPUs. This is not a vendor relationship. It is deep ongoing codeesign. We build systems together and our frontier models are the product of multi-year hardware and model engineering done side by side.\" Now, that may be true, but don't you think that the timing of these tweets is just a little bit suspicious? So, when Sam Alman is saying that, look, I don't get where all this insanity is coming from. This is insanity, and this had 3.1 million views. I mean, I think it's pretty obvious where the insanity is coming from. Maybe it's the fact that OpenAI makes $13 billion a year, but has committed to spending $1.4 trillion over the next 8 years. And that's not a typo, guys. $1.4 trillion. You're projecting 14 billion in losses this year alone, and you won't be profitable until 2030 at the earliest, and you're expecting to burn through 15 billion in cash before you make a single dollar of profit,",
        "start": 912.0,
        "duration": 2075.919999999998
    },
    {
        "text": "over the next 8 years. And that's not a typo, guys. $1.4 trillion. You're projecting 14 billion in losses this year alone, and you won't be profitable until 2030 at the earliest, and you're expecting to burn through 15 billion in cash before you make a single dollar of profit, remember guys, their CFO went on stage and asked the US government for a bailout before you even need one. She called it a backs stop. Trump's AI adviser had to publicly say that there will be no federal bailout for AI. Maybe that's where the insanity is coming from. And of course, Sam Alman at the time ran to Twitter to try and clarify that of course they don't want government guarantees. I think the insanity here is that so many things are up and down. I mean, some of the insanity comes from that Nvidia actively booked their backup plans. Some of the insanity is coming from the fact that Nvidia invests in OpenAI. OpenAI spends that money buying Nvidia chips. Nvidia's revenue goes up. Everyone looks rich on paper. I mean, some of this is insanity, guys. If OpenAI fails, Microsoft fails because they've got hundreds of billions of dollars tied to them. I mean, when you think about where all of the insanity is coming from, I mean, the entire AI industry is pretty insane at this moment in time. And of course, it's for a very good reason. But let me know what you guys think about this. I think future is certainly going to be interesting.",
        "start": 1050.559,
        "duration": 2194.1599999999976
    }
]