[
    {
        "text": " Hi there, my name is Darren. I'm an engineer on the Atlas team. today I wanted to talk to you about a pretty cool feature of the product. having to do with how tabs the tab system works. So looking here, you can see my browser after a pretty big busy day of work. I've accumulated a bunch of tabs. I have my calendar, my Gmail, Slack over here on the left. , when I'm using these tabs that are pinned over here, , when I use them, , and I open links, links open near the pin tabs. That's normal. If I want to maybe do a search, I'm going to hit the plus button here. , tell me about the latest features of Swift 6.2. [clears throat] And , my tabs opening on the right hand side. I might do some other searches. Tabs opening on the right hand side. I might go back to the tab I opened over here. click around and you know check out some different things. maybe go back to the the Slack, open some other tabs and you know maybe this is a normal thing that you're used to in your browser. You have some tabs that are that you're working with on the left, some tabs that you're working with off to the right. you're accumulating tabs over here, accumulating tabs over there. increasingly you're accumulating a cluttering of tabs in the middle. and many of these tabs in the middle, maybe they're not as important to you anymore. So, you might take a moment and just clear out a bunch of these tabs so that you can get back to a clean working setup. so, yeah, a lot of your new tabs are on the right or on the left and it can feel pretty cluttered and constraining. So, u we're aware of this problem and this is a problem that's been had been bugging me for a long time. Started thinking about like how we could potentially solve this. and so we came up with a new system for the tabs at the top that I want to tell you about today. So in the settings there's an option for for tab style here. classic tabs is the default. It works the way probably used to your browser working. We also have scrolling tabs. When I enable scrolling tabs, the tabs suddenly change to be wider. you can see the title more easily on all the tabs. , but importantly what you can see is that you can see that the plus button here is off to the left. I still have my pin tabs, my calendar, my Gmail, my Slack. And if I go into Slack and I click a link, , it opens right next to Slack like you'd expect. But if I open if I want to do a search now, , it opens also on the left here. And as I do",
        "start": 6.24,
        "duration": 305.7589999999999
    },
    {
        "text": "calendar, my Gmail, my Slack. And if I go into Slack and I click a link, , it opens right next to Slack like you'd expect. But if I open if I want to do a search now, , it opens also on the left here. And as I do they're all opening on the left. as I click other links in Gmail or Slack, they're also opening on the left and all the action, all the newer tabs are here on the left instead of being both on the left and off to the right. , and that is really cool because it means the tabs I'm working with stay together. , the fact that they're not they're wider kind of works because, you know, the set that I'm working with, I can see all of them. I can still though get back to the older tabs cuz they're off to the right. Here I am scrolling with my touch a trackpad. You can also scroll with the mouse wheel and I can get back to some of these older tabs. What ends up happening in this system is that your older tabs get sort of pushed off to the right and the newer tabs are over here on the left. And you know, I think this is kind of cool. It means that you can create keep creating tabs, keep working, generating tabs without really feeling like you have to stop and clean things up. and that makes the whole system just feel a lot easier and maybe a little bit less stressful when you're working. So yeah, I really really love this feature and I wanted to share it with you. So I hope you get to try it out and enjoy it too.",
        "start": 158.879,
        "duration": 437.04
    }
]