[
    {
        "text": " We're really focused on making sure [music] we're delivering a better customer experience across the whole organization and working closely with OpenAI to roll out ChatGpt [music] Enterprise across almost 50,000 people. [music] We serve 15 million customers. We're the largest financial institution in Australia making sure that we're helping provide economic [music] growth and stability. We wanted to use you know tooling that most of our people would be familiar with that we think is [music] going to deliver the best experience and ultimately we want to translate that into improvements in the way we serve our customers. That could be account opening. It could be, you know, origination of a new product or a loan. Maybe one [music] of those high anxiety moments where customer has a suspicious, you know, transaction on their card. Being [music] able to respond to that customer experience in a way that really wows them. , and [music] for us to be able to like replicate that across the organization. We had a leadership forum just a few weeks ago. We spent most of that afternoon actually just talking about OpenAI [music] and ChatgPT. Now we're thinking about how to roll out agents and the broader capability and then we're working on some [music] really big use cases. One of the ones that is near and dear to our heart which is in around sort of fraud and scams. How to make Australia more resistant to sort of economic crime [music] and different types of attacks. I've been a an early adopter [music] of open AI and chat GPT and so I think frankly I think that helps there's definitely an element of role modeling across the senior leaders and enrolling the rest of the organization and just communicating about a new technology and how we're thinking about it as an organization and linking that to strategy has been really important. The work that we've been doing with OpenAI is obviously a you know deep partnership. I think it's important to get broadscale use across the organization and for our customers. There'll be hopefully some [music] products not only that we can bring to market much faster. So it feels like the customer experience is improving much more [music] rapidly.",
        "start": 0.08,
        "duration": 265.65
    }
]