[
    {
        "text": " This is superpowers, the agentic skills framework with more than 50,000 stars on GitHub that stops your coding agent from rushing and making mistakes by forcing it through a structured workflow that contains brainstorming, implementation, red, green, test-driven development, and even using sub agents to execute tasks and review code in parallel. But what makes this different from just using plan mode or something like spec driven development? Hit subscribe and let's get into it. So this is a project called XDL which is a CLI tool used to download videos from Twitter. I want to create a web UI for this tool that not only downloads videos to the users's browser from a URL but also uses it to create an article. So I used Opus 4.6 with plan mode in clause code to try to create that UI and this is what it did. Now unfortunately when I ran the code the first time there are some issues. So, I went through with Claude to try and fix those issues, which hopefully it's resolved. So, now it looks like everything is working. I'm going to go to Twitter and copy the link to this tweet. Sorry, Kevin. Paste it here and see if it'll download the video. So, it's extracting and it's been able to download it. So, if I click here, it opens it in a new tab, which is not what I expected, but hey, it does the thing. And if I try to create an article from that tweet, so I'll paste it in here, and it generates. We can see the different steps it's taking. So, it's first extracting the video and then it's doing the audio. And now that it's done, we get the article in perfectly formatted markdown, which is really impressive. And if we take a look at the exact same task done with Opus 4.6, but using superpowers, we can already see that the design is much better with an option to download and generate an article. We'll paste in the same Twitter URL. Hit download and again it extracts the video, but this time it downloads to my browser and I can click on it to view the video. Now, if you were to use the same tweet to generate the article here, we can see the steps that it's taken. And now that's finished all the steps. It's streaming the article to my browser. And I have the option to copy this and paste it wherever I want. Now already you can see the superpowers version is better than the version without using superpowers. We'll go through the code a bit later on in the video, but first let's go through how I did this. So after you install the superpowers plug-in, we should now have some new slash commands like brainstorm, execute plan, and write the plan, which will write the plan from the brainstorm. Now, we only actually need this command",
        "start": 0.16,
        "duration": 293.12
    },
    {
        "text": "in the video, but first let's go through how I did this. So after you install the superpowers plug-in, we should now have some new slash commands like brainstorm, execute plan, and write the plan, which will write the plan from the brainstorm. Now, we only actually need this command next stage at the end of a previous one. So let's run this and we'll paste in a prompt. We're going to hit enter. And now it loads the brainstorming skill and begins to understand the current project. And here it's going to ask me some questions to further improve the plan. So I'm going to say react plus feet. And then I'll say a step by step for the article generation. And now it's asked me to confirm the structure of the architecture which I think looks good. It also asks about the layout and then asks about the endpoint and server logic. So after I've answered all the questions, it then goes ahead to create a plan which it's now put inside this directory. And if we take a look at the plan, we can see it's very detailed giving an overview, the stack, the structure, as well as design, layout, API endpoints, and much more. In fact, this is very similar to what Claude code would give us if it was writing its own plan. But the next step is where things get interesting. So after I confirm the plan and say I'm ready for implementation, it then goes ahead and writes another implementation plan. It does this by first looking at the original design plan that we created and it breaks this down into smaller, more manageable chunks of tasks that can be completed by parallel sub aents. So now it's written another plan and it saved it to the plans directory again. And if we take a look at that one, we can see instead of giving a detailed overview of the project and architecture, it splits things up into tasks. So we have one task here to scaffold the project and it has some steps inside those tasks. We have another task here to create V and React client skeleton and again it has some steps and this keeps going on with every task that's needed to complete the project. From here, superpowers asks me to pick an approach. Do I want the sub aentdriven approach or the parallel session approach? This approach will use a separate sub agent for each task without any human confirmation. This approach will create another session from the plan session, complete the tasks in batches, and then check with me. So the human if I'm happy with the batch is completed before it continues. Now, for the sake of speed, I'm going to go with the sub aent-driven approach. And now it's gone ahead and created the tasks that need to be completed for this project. Now, unfortunately, these tasks look different from the previous task",
        "start": 146.64,
        "duration": 544.6390000000001
    },
    {
        "text": "with the batch is completed before it continues. Now, for the sake of speed, I'm going to go with the sub aent-driven approach. And now it's gone ahead and created the tasks that need to be completed for this project. Now, unfortunately, these tasks look different from the previous task the first time. So, I've gone ahead and started again, but I used the exact same prompt. So, what's happening now is that each sub agent is first creating a test. So, it's writing a test that's going to fail, and then it writes the minimal code to make that test pass. And then when it's finished working on the feature, it verifies the feature passes the requirements that was specified in the plan. and then moves on to check the quality of the code which checks if it's clean, wellb built, and maintainable. So now it's finished most of the tasks. It's now going to test everything it's done. And here we have it. It's completed all the tasks. And it even found one bug in the process that it was able to fix. And if we take a look at the code, it's split by server and source. I'm assuming source is the front end or client. We have some components in here. So article tab, download tab, etc. If we take a look at the pipeline progress, we have stages in an object, a TypeScript interface. Now, it looks like it's using some kind of CSS in JS for the styling. And in hindsight, I should have specified to use Tailwind, but this is fine. And check this out. This is something Opus plan mode wouldn't do by default. You can see through every step of the way, Superpower has made a git commit from scaffolding the project to adding the CLI wrapper and adding HON and everything in between. So if I check the get status, there's nothing for me to commit because the branch is clean, which is much less work on my part. Now you may be looking at this and wondering where are the test files. I'll talk about that later. So if I'm being honest, I think superpowers is an impressive project. I love the fact that it focuses on skills. I think it has 14 which do so many different things from brainstorming to planning to implementing and even reviewing the code afterwards. I love the focus on TDD, specifically red green TDD, where it writes the tests first, so they fail, making them red, and then writes minimal code to pass them. But sometimes this doesn't always work because the agent chooses not to do that. Take a look at this. So here we can see the writing plan skill explicitly said TDD. And for some reason, Claude chose not to do it. I asked it to confirm that, and it said yes, it's on me. The skill says TDD, and I still didn't do it. and asked it why",
        "start": 275.36,
        "duration": 793.5190000000006
    },
    {
        "text": "this. So here we can see the writing plan skill explicitly said TDD. And for some reason, Claude chose not to do it. I asked it to confirm that, and it said yes, it's on me. The skill says TDD, and I still didn't do it. and asked it why focused on shipping quickly over following the process. I'm not sure exactly why this happened for a state-of-the-art model but it just goes to show that you shouldn't blindly accept what the model does. It's important to read through the plan and make sure it does what you expect it to do. This is one of the reasons why I don't think I'll be using superpowers for every single one of my projects or feature requirements purely because they're quite small. And if I have a small feature I want to add, I'm happy to go back and forth with Claude to plan this out, write a plan document, and then wipe the context to execute that plan. But if I do find myself in this situation where I'm implementing multiple features, which does happen from time to time, then superpowers is a great tool to use just because it's very good at breaking down complex requirements into chunks that can be completed by sub agents. And yes, the claude code tasks feature can kind of do this, but I love the fact that superpowers creates a plan for this instead of going ahead to implement the code. Now, how does superpowers compare to something like beads or spec kit or the whole specd driven development architecture? For me, it seems like a more simple version of planning out before executing. Of course, not as simple as something like Ralph, but maybe in between something like Ralph and Beads. But it seems like to me there are more and more tools like this helping people to write better code with their AI agent. Now, this is a good thing, but everyone is different, and I think it's good to take a bit from here, a bit from there, and end up making your own workflow that is perfect for you. So maybe that's just something I might do in the future.",
        "start": 400.639,
        "duration": 984.5590000000005
    }
]