[
    {
        "text": " Gemini 3 Flash is here and I'm excited because it is looking really good. It's everything that I want in a flash model. It's fast, cheap, and doesn't compromise on intelligence too much. In fact, Artificial Analysis ranks this higher than Opus 4.5 on their intelligence index. So, yeah, it's looking really good. Or is it? I did discover one issue that might make you skip this model. So, let's just jump straight into it. Let me start with a somewhat unrealistic test. creating a Minecraft clone in 3GS in one shot. Now, I know this is a little unrealistic, but I've tried this on all of the previous models that have come out recently, and Opus 4.5 is currently the leader at this, but Opus 4.5 takes around 5 minutes to create the game. What Gemini 3 Flash is insanely good at is speed. We can see already here that it started generating the code. And I'm pretty confident that I don't need to make any cuts here or even speed up this segment because by the time I'm done telling you to subscribe to this channel to stay up to date with the latest developer news, tools, and model releases, this will probably be done with its code. And there we go. We can see it is absolutely finished now. All in all, that took 32.4 seconds. But how good is it? Well, loading up the code that it gave me, we can see it's a pretty basic Minecraft clone in 3JS. Here we can click to start. We can move around, although the movement is a little fast and we're actually clipping through blocks here. We are able to break blocks and place blocks, but again, it does seem like it has a few issues. But remember, this was generated in 30 seconds. In fact, I'm pretty confident I could go back and ask it to fix some of these issues before Opus 4.5 was even done, and it would probably still work out cheaper. The thing that you always have to remember with Flash models is you're weighing up the cost versus the intelligence. And we can see that on the benchmarks as well. When we take a look at the speed benchmarks here on artificial analysis, it shows that yes, it is a little slower than Gemini Flash 2.5, but here it's competing with the small OpenAI open- source models and it's a step above the rest of the competition. Then if we take a look at the intelligence and coding benchmarks, as I said, artificial analysis has this beating Opus 4.5 on their intelligence index, which is absolutely crazy, and it means it's the first model to be in the ideal quadrant for speed versus intelligence. For coding though, it is behind Opus 4.5 by only one point. And in fact, on Google's official benchmarks, you actually have Gemini 3 Flash beating out Gemini 3 Pro on SW",
        "start": 0.08,
        "duration": 263.99999999999994
    },
    {
        "text": "crazy, and it means it's the first model to be in the ideal quadrant for speed versus intelligence. For coding though, it is behind Opus 4.5 by only one point. And in fact, on Google's official benchmarks, you actually have Gemini 3 Flash beating out Gemini 3 Pro on SW on the other benchmarks as well, especially in Toolathon, which is meant to test long horizon software tasks. Now, I personally still wouldn't recommend this model for coding. Maybe it's great for a repetitive task here and there, but based on past experience, I've just found that the Google models don't behave as well as clawed ones when it comes to coding. And I still think Opus 4.5 is going to have the edge here, especially when it comes to understanding the codebase, following instructions, and completing complex coding tasks. But as I said earlier, if you want a cheap model and you can deal with sending a few more follow-up prompts to correct the code, maybe this one works out for you. What we do have to talk about though is the massive downside that I found in the benchmarks on artificial analysis that might stop a few use cases for this model. This is a benchmark that artificial analysis runs that test knowledge and hallucinations, rewarding accuracy and punishing bad guesses. Here we can see that flash is actually the best on the index and also the best on the accuracy which means that it got the most right answers. So everything looks absolutely great, right? Well, where it goes really wrong is on the hallucination benchmark. This measures how often the model answers incorrectly, making up the answer when it should have refused or admitted that it didn't know the answer. And Gemini 3 Flash performs terribly. It has a 91% score here. It's one of the worst models tested. So, it's definitely a weird intelligence where it seems to know a lot, but it doesn't know what it doesn't know and it will just make it up. So, that might rule it out for certain use cases where you really don't want hallucinations. The final aspect to cover about a flash model then is the price. Gemini 3 Flash has a million token context limit again. And the price is a flat 50 cents for a million input tokens and $3 for a million output tokens. That is four times cheaper than Gemini 3 Pro or even six times cheaper if you use more than 200,000 tokens. This actually places it just outside of the ideal quadrant here on artificial analysis when we take a look at the cost versus the intelligence, but you can see it is the smartest model in this range. The final thing I want to mention about the Gemini 3 flash model though is its multimodal capabilities are absolutely awesome for a model in this price range. It can handle images, videos, audio, and PDF files. When you combine that with",
        "start": 135.28,
        "duration": 507.1979999999998
    },
    {
        "text": "it is the smartest model in this range. The final thing I want to mention about the Gemini 3 flash model though is its multimodal capabilities are absolutely awesome for a model in this price range. It can handle images, videos, audio, and PDF files. When you combine that with results like the demo that Google showcases where Gemini 3 Flash is simultaneously analyzing video and handtracking inputs to provide strategic real-time guidance in this slingshot game. There is going to be some super cool use cases for a model this smart and this fast. So, there we go. What do you think of the Flash models? I know a lot of people did like 2.5 Flash and I'm also curious if you think that Google are starting to lead this AI race. Let me know in the comments below. While you're there, subscribe and as always, see you in the next one.",
        "start": 258.639,
        "duration": 561.5199999999999
    }
]