[
    {
        "text": " AI coding assistants in the terminal are blowing up right now. It feels like everyone is using them on their desktop machines and not on their phones because they don't work that well on phones, right? But what if I told you thanks to this tweet from Levels.io, I now know how you can vibe code anywhere with just three tools and maybe one of these. Do you know what? Let me just show you. And before we get started, make sure you hit that subscribe button. Okay, so we usually install coding assistants on desktop machines for easy access and so that they can run in the background while we do other important tasks. But because phones are less powerful and go to sleep more often, it's better to install the assistant, in this case clawed code on a remote server, then connect to it through a terminal running on your phone via SSH, which means if your phone runs out of battery or gets lost, your project doesn't go along with it. To set that up, you could use an EC2 instance or a digital ocean droplet. But personally, I'm a huge fan of HTNA because you can't beat four bucks a month for a server that's always on. So once you've created an SSH key locally, added it to HNER and then created your server, connect to it, update the packages, install node with nvm, which is a bit more straightforward, then install claw code and connect it to your Anthropic account. If you have any custom hooks or sub agents you use regularly, make sure to bring them over at this stage because this is super fiddly to do on a phone. Let's also add a project from GitHub and double check that Claude Code is working. The next step is to get a terminal app for your phone. If you want just an SSH client, then get Terminus, which works on both iOS and Android. But if you want the full terminal experience on your phone, then use Termox, which is Android only. Let's go through how to set up both of them. For Teras, you can set up a new SSH key by either generating one or copying over the private key of an existing one, which it will use to generate a public key. Then we need to create a new host with an alias and the IP address of the remote server with a username. We'll use root for now, but this should usually be your own user. Then add your SSH key, and you should be able to interact with your server. Please note if you've generated a new SSH key, you'll have to go into the authorized keys file in your Hessna server and add it manually before you can get access. Now let's move on to termox which is a bit harder. After updating the packages, install open SSH. You can also install the fish shell for",
        "start": 0.16,
        "duration": 314.6399999999999
    },
    {
        "text": "SSH key, you'll have to go into the authorized keys file in your Hessna server and add it manually before you can get access. Now let's move on to termox which is a bit harder. After updating the packages, install open SSH. You can also install the fish shell for Then generate a new SSH key. add that to heter connect with this command and then you should have access to clawed code from your phone which is really cool but it could be better. Right now we're connecting over regular SSH which is fine for desktops but not ideal for phones since it doesn't support roaming. So moving from a Wi-Fi to a cellular connection. So to make things better, we could use Mosh, the mobile shell, which addresses these issues because it uses UDP instead of TCP for the connection, which is better for handling network interruptions. And it's also able to keep the session alive if the connection is lost and automatically reconnects. Mosh uses its own client and server to open UDP connections. So it first needs to be installed on the Hetsner server and also in Termox. Then we can update our SSH command from this to this which works as expected. But what about Terminus? Well, Mosh is actually built in. Just edit the connection and turn on Mosh. Now, I know a lot of you out there have home servers like a Sonology, which could also be used instead of a hetness server. You'll have to enable SSH firewall rules if you have it turned on. And in my opinion, I would have claude code installed on a separate Docker container so it's isolated from the rest of the system. But if you're interested, I can go through all that in more detail in a separate video. And that, my friends, is how I would connect to Claude Code using my mobile phone. Now, I know there are tools like Vibe Tunnel that can make the whole process much easier, but I prefer having access to an actual terminal on my phone instead of using a terminal through a browser. Speaking of mobile terminals, I'm going to go off on a tangent and say if you want Termach to look as good as Terminus, there is a separate app called Termach Style that costs a bit of money, but allows you to change fonts, themes, and a few other things. There's also an app called Kuk, hope I'm pronouncing that correctly, that isn't yet released, but does look promising when it comes to connecting to something like Claw Code on your phone. Anyway, I've given you enough information to get started. Hope you enjoy vibe coding while your girlfriend is shopping. Add any questions to the comments. Don't forget to subscribe.",
        "start": 157.519,
        "duration": 596.2409999999996
    }
]