[
    {
        "text": " This is INC, a TypeScript library that uses React to power some of the most popular terminal AI tools like Quen Code, Gemini CLI, and Claude Code. But I know what you're thinking. React and TypeScript for a terminal app. Ew, isn't that really bad for performance? Hold that thought because I'm going to go through why I think Ink is so popular and also a new TypeScript terminal app that will hopefully replace it. So sit back, hit subscribe, and let's get into it. As someone who uses the terminal for absolutely everything, I've always been interested in making my own terminal app. And because I know how to use React fairly well, inc by Vadim Deeds makes perfect sense. So let's try it out by building a simple counter because why not? We'll start by using this code to scaffold an app. And right now, all it does is prints out hello with a name you pass in as an argument. And if you don't pass in a name as an argument, it prints hello stranger. We'll first wrap our text in a box with a round border style and a flex direction of column. Then we're going to add some more text. And to keep our app open all the time, we're going to use the use input hook and say the process can only be closed if the user hits and c. And that produces this terminal tool. Since this is React, we can use hooks as we normally would in a web app. and we'll increment the counter if the user presses the K key and decrement it if the user presses J. We'll then add our count in a separate box. Add another box beneath it which contains some instructions in a dimmed color and we'll wrap the whole thing in a fragment which will now produce this terminal output where I can press K to increment and J to decrement. This is really cool. I mean, as a React developer, I found this really intuitive, and I haven't even gone through some of Inc.'s other features, like React Dev Tool support, being able to render the standard out, and all of the extra packages you can install, like this cool spinner. It's also not a new library, so if you wanted to, you could grab your favorite LLM and vibe code your own terminal app. But all of this comes at a cost. Running the app in development mode takes up almost 50 MGB of memory. Wow. and running a bundled version of the same app only reduces it to 32 MGB which is a lot for a terminal counter app. Just to be clear, I built the exact same app in Go using Bubble T, which uses 13 MGB of memory for development. And after running the built executable, the exact same app uses under 4 MGB of memory. This is because it contains a minimal JavaScript core",
        "start": 0.24,
        "duration": 319.83999999999986
    },
    {
        "text": "counter app. Just to be clear, I built the exact same app in Go using Bubble T, which uses 13 MGB of memory for development. And after running the built executable, the exact same app uses under 4 MGB of memory. This is because it contains a minimal JavaScript core WOM version of yoga which is used for ink's flexbox layout. This could be why ink is hardcoded to run at 32 frames pers and why openai's codec cli moved away from it to use rust. But there is hope for TypeScript terminal libraries because the team behind open code are working on Open TUI with this guy which is built in Zigg and Typescript and is able to render some amazing user interfaces all in the terminal and uses the bun foreign functions interface so that the TypeScript libraries can communicate with the Zig code. I've actually built a similar app in Open Tui with very similar looking React code that uses less memory than ink but more than bubble te. But I'm pretty sure if I used the SolidJS implementation or just used Open 2 core that it would use less memory. But for something that's still in development, I'm really impressed. I mean, it's already being used to replace the bubble tea side of open code. Don't get me wrong, I think INC is a cool project with a lot of nice features and loads of contributors that are working on making it better, but I really hope for future CLI tools, the team at Anthropic and Google take a look at Open Tui. What do you think? Has this made you consider moving away from Inc.? Do you want me to make a deeper dive video on Open Tui? Let me know your thoughts in the comments. Again, don't forget to subscribe and until next time, happy coding. Hey, it's me again. If you enjoyed this video, go and check out Better Stack. It's an amazing product that I use all the time to help me write better, more robust software. And it's got a free tier, so you've got no excuse not to check it",
        "start": 160.0,
        "duration": 522.0799999999998
    }
]