[
    {
        "text": " This is React Grab, a tool that makes AI coding 55% faster by giving LLMs the exact location of an element instead of searching through lots of files, which saves you time and money since the process uses less tokens. Created by Aiden Bay of React Scan and MillionJS fame. Yes, the tool that makes React 85% faster. But with AI tools getting better at searching through code bases, does a React specific tool that has the potential to break production really make sense? Let's find out. And before we do, don't forget to hit subscribe. Imagine you have a simple React app that you want to modify with AI, like change the text here to counter. If we do that include code with this prompt, it starts to search through all the JS or TS files looking for a string of counts [music] that it eventually finds on line 22 and makes the correct change. The whole thing costs less than a scent with 2.6K input and 1.8K output tokens. But with React Grab installed, I can just press control or command C to activate this overlay and click on the elements that I want to edit, which will copy some metadata that I can paste into this prompt. So running this skips the step to search through all the files looking for the count text and immediately finds the correct element which makes the whole process cost a tiny bit less and use a few less tokens. But if we tried it on a larger project with lots of images, links and pages, say we wanted to reduce the spacing of these icons, we can just activate React Grab, select the section instead of describing this part of the page in detail. add the extra information to the prompt and it's able to make that change in a fraction of the cost and use less tokens than it would have been without using React Grab. But you may change your mind about React Grab once you find out exactly how it works. Because in order to get these details, React Grab uses a library called Bippy, also created by Aiden to tap into React's private fiber architecture by pretending to be React DevTools. And once it's in, it grabs the component hierarchy, gets the nearest component, generates a HTML preview and formats the file location information. I mean, if Bippy gets compromised, a hacker could do some serious damage to your project. It doesn't have all these warnings on it for no reason. That's why it's important to only run it in development and make sure you review the code before running it. That being said, I really like the fact that React Grab gives the information in an LLM friendly format with nice markdown headers and [music] an XML style wrapper. But is all this really even necessary since newer tools are getting better at scanning through your code? Like this instant",
        "start": 0.08,
        "duration": 316.71999999999997
    },
    {
        "text": "That being said, I really like the fact that React Grab gives the information in an LLM friendly format with nice markdown headers and [music] an XML style wrapper. But is all this really even necessary since newer tools are getting better at scanning through your code? Like this instant grip feature from Cognition that uses many techniques to quickly go through a codebase. Now, in my opinion, no matter how fast a tool or model is, adding this extra information from React Grab does really help with the process. In fact, Aiden has run some benchmarks making changes to the SHA CN dashboard with and without React Grab. And for the most part, React Grab is usually faster and uses less tokens. Not to mention, you can completely customize it. So, if you wanted to change the overlay from pink to something else or disable the crosshairs or even trigger custom [music] actions, you can do that if you wish. Anyway, that's a quick overview of React Grab. A great tool that I wish worked for all JavaScript frameworks and not just React, but I understand why that's the case. What do you think? Is it something you want to try out or do you think it's overkill for making small UI tweaks? Let me know in the comments. Again, don't forget to subscribe.",
        "start": 158.4,
        "duration": 429.2799999999999
    }
]