[
    {
        "text": " This is Starflow, Apple's newest entry into the AI image and video editing space going up against Open AI Midjourney and even Nano Banana Pro by using a unique auto reggressive flow architecture that creates great images and videos with much lower computational demands. And the best part is it's free and open- source. But why are Apple doing this? Do they really want users to generate images on their iPhones? Let's find out. And before we do, don't forget to hit subscribe. Fun fact, Apple have 375 repos on GitHub and 200 of them are related to machine learning, which is weird [music] to think that Apple is slowly turning into an AI company. But in this video, we're only going to focus on one of those repositories. Scalable auto reggressive flow or starflow for short contains two models, one for image and one for video generation announced way back in June, but they uploaded the code for it last month with some instructions on how to set it up and showed some examples on their site. We'll go through both of those later, but first, what makes Starflow so special? Well, Starflow uses a hybrid auto reggressive normalizing flow architecture. Yeah, let's break that down. An auto reggressive model is one that automatically predicts the next step based on the previous ones. So, chat GPT will come up with the next word based on what it said before. And an auto reggressive image model will [music] create a picture pixel by pixel based on the previous pixels which is different from the typical diffusion model used for [music] image generation that starts off with Gaussian noise that gradually gets dnoised to form a coherent image. But what's weird about starlow is that it's an auto reggressive model that does use gorsian noise. How? Well, this is where the normalizing flow part comes in. A normalizing flow model transforms a simple probability distribution like Gaussian into a more complex one using inversible functions also known as flow layers. So similar to diffusion starflow transforms a clean Gaussian into a coherent image but instead of denoising it uses multiple flow layers that can do the whole process in a single forward pass. Unlike diffusion which could use tens or thousands of passes. And the auto reggressive part actually applies to the flow layers which are computationally expensive since the layers transform patches of an image and the auto reggressive cost grows quadratically with the number of patches in every layer. But Starflow gets around this using parallel Jacobe iterations to solve the same auto reggressive equations simultaneously making the process up to 15 times faster especially for video generation. And because normalizing flows are invertible, it's possible to go from final image all the way back to the noise stage and even go from noise back to the exact same final image. [music] which means it's possible to tweak a small part of an image or",
        "start": 0.16,
        "duration": 399.27900000000005
    },
    {
        "text": "for video generation. And because normalizing flows are invertible, it's possible to go from final image all the way back to the noise stage and even go from noise back to the exact same final image. [music] which means it's possible to tweak a small part of an image or the same. Basically, this whole process makes inference much faster and cheaper. And the whole thing is open source, which means we can try it out. to make sure I have enough resources. I'm going to use a digital ocean GPU droplet using a single H200 and then I'll follow the installation steps on the starflow repo, making sure to download the checkpoint from hugging face, which means I can run this command to generate images of a cat playing the piano, which gives us eight cats that look pretty good. I mean, there's some weirdness with the cat's head over here. This cat seems to be sinking into the piano. And down here we have two sets of keys, but apart from that, they do look like cats near a piano. Looks like we get eight images because the batch size is set to eight. So, let's change that. And here we're going to change the prompt to a chicken running on custard. And okay, this is a very low resolution image with a chicken running on what looks like a bowl of mashed potato. I guess because the checkpoint only generates 256x 256 images. And now I understand why it generated eight instead of one. This time, let's generate eight images of a polar bear running through the desert. And here we get a few more different styles like this cartoony one. And apart from the weirdness over here, the black shadow near the ear, and the weird face over here, most of the other images look pretty believable. Unfortunately, there's no checkpoint for the Starflow V texttovideo model, so I don't think I can generate any videos. But some of the examples on their website look very impressive, like this video of an orange being replaced with a lemon, changing the color of this vase to golden, and extending this video of food being placed on a table. But the milliondoll question is, do these models work on a local device like an iPhone? Not exactly. Right now, Starflow requires a Python environment, PyTorch, and GPU resources for inference. It's not even optimized for Apple silicon or metal. So, while image generation could work on an M5 MacBook Pro, video generation, however, would be a nightmare. Besides, Starflow is currently a research project that only has one checkpoint publicly available, even though their documentation shows higher resolution images and even videos. So, I'm sure they have a lot of work to do before it's ready for us regular consumers. Anyway, I think Starflow is an amazing breakthrough for image and video generation, especially if it's able to generate high resolution videos incredibly quickly. I'm still kind of",
        "start": 199.84,
        "duration": 731.7600000000001
    },
    {
        "text": "images and even videos. So, I'm sure they have a lot of work to do before it's ready for us regular consumers. Anyway, I think Starflow is an amazing breakthrough for image and video generation, especially if it's able to generate high resolution videos incredibly quickly. I'm still kind of this research, but maybe it's a direction the company want to lean into. [music] Anyway, let me know your thoughts on Starflow in the comments. Again, don't forget to subscribe and until next time, happy coding.",
        "start": 368.56,
        "duration": 758.24
    }
]