[
    {
        "text": " Welcome to the Better Stack podcast where we have conversations about AI, software, dev, and all kinds of new technology. I'm one of your hosts, Richard, and I'm joined by James Andrew. Hi, and Bash Bunny. Hello. Yeah, thanks for joining us, Bash. It's good to have you. Yeah, of course. Thanks for inviting me. , I think out of everyone else here, so me, James, and Andrew, I'm the one who kind of does most terminal stuff. So, I think it would be good for you just to give an intro of kind of what you do and particularly how you ended up using Emacs because I'm quite curious on that. Oh my gosh. Okay. , so I I just quit my job not too long ago at Charm, which was a a ter terminal tooling company. I worked there for almost 4 years maintaining a lot of the open source tools that we had there. And yeah, I kind of I kind of ended up I feel like in that niche because my good friend Prime kind of pressured me into learning Neoim at one point. It was like when I first started streaming. I think it was like my second ever live stream and he raided me and then got all of his chatters to tell me to to try Vim. And then at that point too, it's like you're so like easily peerressured. It's like I have like I have like 12 viewers and I was just like, \"Okay, yes. Okay, there's like 50 people here telling me to use BAM.\" Okay. and I think that kind of brought me into the the terminal landscape a little bit more. kind of taught me like more things that I could do on the command line. And it was one of those things where like I had done some automation stuff, some like scripting at previous jobs and I I felt I felt the power of that a little bit like I was doing some like different PowerShell scripting and stuff and it like really allowed me to do my job a lot faster and with a lot less headache without having to deal with any of the bugs from like the different gooies that I would be interacting with. So it was kind of something I was familiar with before. But yeah, kind of kind of jump back jump back into it. When I started learning Vim, I realized how how powerful it is to be able to like understand how things work and be able to run run your programs in your terminal. Just know some of the basic things that you can do there. And then yeah, getting more into like customizing a lot of my my setup and yeah, just learning how to how to do all of that stuff. And then yeah like live streaming that kind of thing. I it got me more interested in building out",
        "start": 0.16,
        "duration": 310.71799999999996
    },
    {
        "text": "you can do there. And then yeah, getting more into like customizing a lot of my my setup and yeah, just learning how to how to do all of that stuff. And then yeah like live streaming that kind of thing. I it got me more interested in building out the terminal. I came across all of Charm's toolings and started building stuff with their with their stuff and they reached out and wanted to work together and then yeah started started maintaining all the all their tools and working with the community and seeing some pretty incredible things being built on in terminals. So, Prime was responsible for your job or your old job. , [laughter] that's a stretch. Okay. We can't inflate his ego like that. Okay. We don't I I'll I'll thank the chatters. Okay. Chat Chad gets credit. [laughter] Prime is whatever. It's fine. And do you are you like now fully integrated with like a dual keyboard and everything? I Okay, I do have a split keyboard, but I never use it. I I have to I got to sell it or something. I have a I got a dactal manu form. So it's like it's it's one it's like a 3D printed like open source like the design of it is open source but there's no like company behind like that actually builds dactyl manifform keyboards. I got it from some guy on Reddit. Yeah. [laughter] Yeah. I so I'm too scared to like remap the keys and stuff. I feel like I'm going to break it somehow and I like just knowing me cuz I just break I just I'm so good at breaking things and yeah and so it's it's kind of been a bit like unusable for me because it's a bit I I want I I need to tweak things and then it's like I I don't know. It's it's fine. I've tried using it before. I got pretty decent at typing with it but it's just like I I don't think that it was that I didn't find it that like revolutionary for me personally. But I I also am pretty I don't know. I maybe I have strong wrists. I'm built different potentially. I [laughter] haven't had any wrist pain yet. Yeah. Yeah. I think split keyboards are a beast. I've got a regular kind of regular mechanical keyboards, but with a split keyboard, it's I've heard you kind of unlearn keyboards and just like learn a new way of typing. My first like real attempt with it was I was doing Okay. Unfortunately, Prime is once again involved in the story. It was we were doing a 24-hour stream and we did a 12-hour coding portion and then a 12-hour gaming portion and in the 12-hour coding portion I was like, \"Oh, perfect. I'm going to break out my split keyboard.\" And I had an event for like I was going to I think GitHub Universe with",
        "start": 155.599,
        "duration": 600.1589999999999
    },
    {
        "text": "24-hour stream and we did a 12-hour coding portion and then a 12-hour gaming portion and in the 12-hour coding portion I was like, \"Oh, perfect. I'm going to break out my split keyboard.\" And I had an event for like I was going to I think GitHub Universe with gotten like GitHub girls and the Charm girls. we got our our nails done and I had like nail like long nails like I got like the extensions and so like the first time that I'm like oh perfect I'm going to try getting used to the this keyboard during a 12-hour coding stream what could be a better window for that and then me having these like long fingernails trying to figure out how to like having to like reposition my hands to be able to type properly I was like oh this was sorry I'm not supposed to swear on this podcast probably I was like oh man this is this is more than a more of a challenge than I than I signed up for. But yeah, it's always like the actually transitioning to using them is always the hard part. As we said earlier, like the ramp up to actually getting to the skill level where you're back to what you are on a normal keyboard. I always find that the hurdle that I have to overcome. It's the same with when I've tried Neo Vim. It's like I can do so much already with VS Code and Cursor. It's it's getting to the point where I'm as productive that I haven't been able to sink the time into yet. So, , how did you find switching over? Like, how did how how long did that process take for you to feel as productive in sort of the terminal as you were with normal tools at the time? I used VS Code with Vim Keybinds. Yeah. , for for as long as possible. I wasn't even planning to move to Vim. I was like, \"Yeah, like I just think the motions are good. Like, I just think being able to like navigate your code like this is is nice.\" , and then there came a point where I was like kind of learning more and more about Neoam, like different little commands you can run and all that stuff. and then they wouldn't run in VS Code. So then I was like, \"Okay, well now I'm reaching the point where like there's other things that I want to do above and beyond just the motions that I now have to do in Vim.\" So that it kind of that part kind of propelled me forward, but yeah, outside of that I I I would have been fine with just you like doing the motions in the editor. I think it's it's good place to be too. Yeah, maybe switching to the keybinds in VS Code is a good trick to sort of Yeah.",
        "start": 302.16,
        "duration": 833.677
    },
    {
        "text": "me forward, but yeah, outside of that I I I would have been fine with just you like doing the motions in the editor. I think it's it's good place to be too. Yeah, maybe switching to the keybinds in VS Code is a good trick to sort of Yeah. used to it. That might be a good good method next time I try. Also, Vimtutor is fun. If you ever do So, if you open up Vim and you do colon tutor with a capital T, it'll it'll open up like a little interactive tutorial thing that teaches you how to how to like different little shortcuts and everything in Vim. And that it's really fun just like having a little morning cup of coffee and like doing that, you know? It's like it's it's kind of like playing a game. I don't know. Feels gified. Yeah. I think Prime is responsible for a whole generation of people learning BIM. I' I've learned Vim, but he was one of the reasons as well. Somebody else at work was using it and kind of convinced me to try. But if I'm correct, you use Emacs. That's your main driver, right? I do. Yeah. So, how did you get into that? so, I started using I moved over to Doom Emacs. So, it's a bit different because it's like one of the pre-built ones. It's very similar to using like like Lunar Vim or Lazy Vim. where it's kind of like like pre-built. And so part of my frustration that I was experiencing with Neoim is that plug-in authors. Okay, again I I'm I'm pretty sure I wasn't make I wasn't changing to any major version releases of the plugins. And yet every time I would update my plugins, my whole config would break. like they they were making a bunch of different like API changes, breaking changes, that then required me to go and change a bunch of stuff in my config, which is fine maybe if you're a hobbyist, but also sometimes you just want to like sit down and just like actually do stuff. I'm like I just got so sick of having to fix my config all the time. , so it was that combined with I have some pretty regular chatters. Shout out to Nyx who has been the most persistent Emacs user in my community for years. He's been like shilling Emacs since day one. , but I kind of was at a point where I was trying to figure out also like a new way to kind of just like manage all of my tasks because with my job at Charm, I was jumping around. I had like my hand in so many different pies. I was just jumping around so many different things and I was just like, how do I keep track of everything? And I'd heard such good things about org mode. And so it",
        "start": 421.759,
        "duration": 1101.1990000000003
    },
    {
        "text": "job at Charm, I was jumping around. I had like my hand in so many different pies. I was just jumping around so many different things and I was just like, how do I keep track of everything? And I'd heard such good things about org mode. And so it perfect combination of like I need a way to plan things out better. I want to try something new. I've heard great things about org mode. There's a built-in agenda. You can schedule your tasks. You can have all of your notes put together with your tasks. You can link files. You can do all this all this great stuff. So I'm curious to try that. And then also Neovib is driving me insane. So, I I tried Doom because it was like I I knew a few people that used Doom and really really liked it and it it was like the lowest lift coming from Vim because it's actually like all Vim keybinds within Emacs. So, it the editing experience and everything was really good and a lot of the skills kind of carried over. I actually found it a lot easier to learn than Vim. That said, I'm not like I'm not doing a custom EMAC config, so I might I might eat those words when I start trying to write Emacs lisp, but yeah, I just found like it was very well documented and easy to find things. Like you basically just do Alt X and you can fuzzy find through all of the available commands and then it shows you like a little preview of shortcuts for those commands. And so it's kind of one of those things where it's like you don't have to spend that much time sitting and reading documentation to figure out how to use this thing. It's just like you can just learn as you go, which is really nice. I had a question about your YouTube description. You said, \"Taught your mom C++ instead of Rust.\" Are you like a Rust hater or what what is that about? I just love I I love how like the Russ community is so they have a deep love for their language, you know, and I just like to poke fun at them because they're so passionate and it gets them so riled up. And I think that I think that people are too serious on the internet. I just think I think there I think there are there are topics that are important that we should discuss, but I don't think that every topic is super important and we should discuss. Like there's just so many things. I think programmers in general just love to like be pedantic and like like like nitpick things and I just love poking fun at that. [laughter] So yeah, I like I like bullying the Rust users in particular. They're my favorite. Period of the internet where everyone was like, \"Let's rewrite everything in",
        "start": 556.56,
        "duration": 1380.7170000000006
    },
    {
        "text": "in general just love to like be pedantic and like like like nitpick things and I just love poking fun at that. [laughter] So yeah, I like I like bullying the Rust users in particular. They're my favorite. Period of the internet where everyone was like, \"Let's rewrite everything in you to rewrite any app in Rust cuz it' be quicker by like a million. I think there are still some like hardcore people who still believe that religion. Yeah, it I feel like it I feel like people I don't know if they started it as a joke or like some it was like 50/50 on like some people are saying it jokingly and then some people are saying it like no we need to rewrite this in Rust because we need it to be safe. We need type [laughter] we need to write secure software and then other people are just like I just love Rust and I'm going to rewrite everything in Rust. Yeah, Rust is cool but I think people are moving on to Zik now. Zig is the the big thing. It is the hot new thing. It's a classic programmer. Just move on to something else all the time. We love to do it. Have any of you tried Zig? Not yet. I'm thinking of doing it at some point, but I haven't tried it yet. I I gave it a shot a while ago. I think when it was like very new cuz the documentation was not done [laughter] and that was tough. I think I do think that if you're somebody who probably likes the more kind of like low-level languages where you have like full control of everything, it's probably a really good language. For me at the time, I was just like I was trying to learn Haskell at the same time and then started trying to learn and then like added on Zigg and I was just like why am I doing this? Who who needs to hurt like this? Like nobody nobody. I yeah I I've heard really good things about it though. I I am actually thinking about learning Ross this year. That is kind of my plan. It's on the bingo card. Yeah. Cool. So, I I can join them finally. I feel like there is this curve where you kind of get the hang of it and then you feel like you know everything and then there's a point where you start questioning everything and and Yeah. When the borrow checker comes in perhaps. Yeah. Exactly. The borrow checker. Yeah. That's that's I've heard horror stories. [laughter] Yeah. So, what what is or mode? I I heard you talk about it in the stream and I had no idea what that is in Emacs. Oo, org mode. It's okay. So, there's a special kind of like org file that you have in Emacs. , it basically it's it's, you know, it's",
        "start": 699.519,
        "duration": 1636.4779999999998
    },
    {
        "text": "is or mode? I I heard you talk about it in the stream and I had no idea what that is in Emacs. Oo, org mode. It's okay. So, there's a special kind of like org file that you have in Emacs. , it basically it's it's, you know, it's language. It's kind of like a way that you can Yeah. like like structure your notes and stuff like that, but there's a lot of kind of like extra things layered into it. So, for example, you can have it it's got if you use like the to-do, you know, like when you do capital to-do and it like tracks it as a as a task. so, or mode has that built in by default. It's got you can then you can start you can like time when you started you can track when you started working on the task. You can schedule it for specific days. You can then see like you can basically have a bunch of different org files. So, like have one for work, have one for personal, whatever. Schedule these things to happen on different days. You can have them recurring weekly, you can have it whatever. and and then also be able to see it in like the org agenda which will show you basically a calendar view of like every or like yeah a weekly list of all of your tasks just based on these files which as somebody I don't like moving data around like I'm I'm literally working on a project right now that is just to be able to like write blog posts in markdown and have it do everything else for you. You basically just have like you write it in markdown. You have front matter which like which is basically like yeah like the metadata at the the top of a markdown file to be able to say like when you want this thing to be due and then you can see it in like a calendar view and you can you can have a list like you have a config file with the list of like what are going to be public like whatever your public blog posts are supposed to be and then it'll create an RSS feed and convert all of them to like static HTML pages that you can just put on your site. it's a very basic little project just for funsies, but it was kind of inspired by org. because it it's also one of those things where it can also export to any file format. So like if you have org notes, you can do like or export and it'll it can export to PDF, HTML, markdown, whatever. So it's kind of one of those things where I yeah, I was like, \"Oh, I want to do a blog.\" And then I was like, \"Oh, I can just export everything to HTML with with this.\" And then I realized I was",
        "start": 829.04,
        "duration": 1889.0380000000005
    },
    {
        "text": "can export to PDF, HTML, markdown, whatever. So it's kind of one of those things where I yeah, I was like, \"Oh, I want to do a blog.\" And then I was like, \"Oh, I can just export everything to HTML with with this.\" And then I realized I was rewrite the the wheel here. Yeah, I know. It's cool. You're doing it all in Go, like Golang, aren't you? I'm doing it in Go this time. Yeah. Yeah. Yeah. And I think you said you're not like a a web web server type person. You wouldn't write web servers. Is that true? Yeah. I'm not much of a web developer. I There's just a lot I feel like there's just there's a lot of like moving parts to that. And then I I get kind of like I I'm not as interested in tying all those things together. Does that make sense? You know, I'm like I It does. Yeah. I just like kind of building I guess like like more backend stuff or I just like building out the functionality of like Yeah. actual like just the behavior of the application and then I move on. [laughter] Yeah. No, it makes sense. I think in my head like a markdown tool is perfect for TypeScript JavaScript, but you could do it in Go. Yeah. Yeah. If you're especially if you're like rendering Markdown and stuff, I I never read Markdown outside of it's like like I I never really read it rendered. I don't render it for I don't really like Yeah, I'm actually the the total opposite. [laughter] Oh, really? I just want to I just want to see pretty text formatted in a good design way, you know? [laughter] What's your favorite? Do you use like Joplin or Obsidian or something? What do you use? , I did use Obsidian for a while, but now I just like Notion. Notion. Oh, nice. Yeah, notion's Notion's powerful. There's a lot you can do in there. Yeah, Notion's a rabbit hole of of tricks. There's some people do some crazy stuff on Notion that I'm still not completely there with. I know. People got their side hustles on there. Yeah. Yeah. You know, I was going to say my notion I I've switched over from Obsidian as well, mainly because work use Notion. And then yeah, my sort of way of doing to-do lists is just I have one big notion called brain dump where I just dump notes in there throughout the day and then at the end of the day like I'll review it and then that's nice. Yeah. Go through it. So maybe I need to try out was it or mode? Or yeah, sounds like that could do well. I'd say my biggest my biggest like pet peeve with it right now is so there's something called or roam which is what makes it actually like usable accessible remotely. So otherwise it's",
        "start": 957.36,
        "duration": 2157.9179999999997
    },
    {
        "text": "I need to try out was it or mode? Or yeah, sounds like that could do well. I'd say my biggest my biggest like pet peeve with it right now is so there's something called or roam which is what makes it actually like usable accessible remotely. So otherwise it's to be able to like s see any of my tasks whatever on my phone. So that's my biggest thing is I feel like I do a lot of like brainstorming and stuff on my like while I'm out or just like away from my computer. So, it's kind of one of those things. I started trying to use org mode for like content stuff, content planning, and I just I just found that it it ended up not being a good solution for that. I was using Trello forever. And then I recently switched over to Notion because all of my friends were telling me it was the way to go and I was like, \"Okay, okay. It's been it's been a year of me pushing back on this. Let me try it at least.\" And it's been pretty good. I will say it is really handy to be able to like especially when you're doing like thumbnails and like working with graphics of any kind. Like it's it's nice to be able to just embed that directly in the notes. There's just something so nice about having everything in one place. Right. Yeah. That was my problem with Obsidian from memory is I think you had to pay to sync the files and I was like but it's just my own markdown files. I just wanted to use them. but yeah, I like that you do the brain dubs at the end of the day. I find that is like I think that had to be one of the best things that I adopted to like finish the day as like you know cuz I feel like there can be especially if you work from home there can be it can be really challenging to like create separation between workday and then the rest of the evening. , and I I always found just like writing down every single kind of like thought question, open like any any loose ends, , update all my projects, everything just in in a little file dated that like with the title is just the date. Yeah. You know, it really helps me just the next day it's like what was I doing yesterday? It's like it helps you disconnect because yeah, you can, as you said, you can write it all down and then sort of forget for a bit. It's nice, too, because then it's like you can just like I I never bother really titling my any of my files with anything meaningful. Generally, I I just I'm okay to just leave it as like the date and then it's like I just do a global search",
        "start": 1093.76,
        "duration": 2402.8779999999997
    },
    {
        "text": "bit. It's nice, too, because then it's like you can just like I I never bother really titling my any of my files with anything meaningful. Generally, I I just I'm okay to just leave it as like the date and then it's like I just do a global search for a specific project, whatever. I just find it it's like less I don't know. I find that somehow easier, which is weird. I I started having to like collaborate with someone else like with the with like yeah having like a shared folder with somebody else at work at one point and they were just like what is this? That was like a way they're they're not they're not a developer. They're not used to doing the like just global searching everything. I was like oh okay I got to be less chaotic. Yeah. I think my notion organization would scare some people. It's it's pretty similar in that I just sometimes start a new page randomly and then if I need to go back to it, I'll just search for what I was writing on that page instead of like title or anything like that. Yeah, totally. Yeah. What are all of your stacks and languages of choice at the moment? I'm primarily Typescript at the moment. I I sort of lent webdev later on in in my career. I started out in Java for Minecraft and then I love that somehow transitioned from back end to sort of liking the front end and the sort of full stack webdev stuff. That's so good. I the pipeline from like video game to programming is is incredible. I love that so much. It's such a great incentive. Yeah, that's actually how I fell in love with C because I started coding games in Unity and then it's like oh C is such a elegant language. I just like the syntax of C. So, are you still into C# or is that what that's just what you got in with? That's what I use primarily for like games, but but yeah, I'm I'm also a big Python fan. I just I don't know something about Python. I love it. [laughter] That's awesome. Yeah, Python's such it's a very like flexible language. It feels like it's it's very it kind of feels like you're writing pseudo code at a point, too. It's like you don't get you you don't kind of have to get like tripped up by the syntax or by like weird behav like weird like language specific things, right? It's just sometimes on the editor it might look weird like the tab spacing and which tab like you know is indented or not. But once you get used to it it's pretty cool at least for me. Yeah. I learned with Python was my first language. Oh, I actually wanted to ask that like when you started your coding journey, what was your first experience?",
        "start": 1219.2,
        "duration": 2682.957999999999
    },
    {
        "text": "tab like you know is indented or not. But once you get used to it it's pretty cool at least for me. Yeah. I learned with Python was my first language. Oh, I actually wanted to ask that like when you started your coding journey, what was your first experience? It was Python in university. Yeah. Okay. Yeah. So it was I started with Python. That was my first ever like exposure. I I had never seen code in my life until university CS classes. I will say I I'm really glad they started us off with Python because I think if they would have started us off with like C or something like that and then it's also the first time that you're being introduced to like formal logic and like even the mathematics and stuff that that I was taking were like very different than any other kind of mathematics. I was like this is it was a lot of like new ways of thinking. and yeah, I think Python was a good Python was a good place to start. I think it was I first learned Python and then it was Java and then it was C and C++. Those are the ones we we kind of learned in school. You know what I had to learn in university? I had to learn Pascal in university. Oh, sick. I've heard that one. I was like he's either going to say assembly, Haskell or Pascal. [laughter] Yeah, a bit of assembly as well, but mainly Pascal. And that was that was a pain. Anyway, I read the I did the book Seven Languages in Seven Weeks. That one's a really fun one to just like dip your toes in the water and see all these different like like kind of be able to compare the design and like decisions behind a bunch of different languages in a which were the seven ones. Oh god, I got to remember. hasll was in there. Hold on, let me let me open it. Was Pascal in there? , no it wasn't. It was I think it was Ruby Haskell. Let me like properly pull up the We can also link that book in the show notes. At the time I did this we we were doing like a live stream book club kind of thing. , and we ended up the author came on and he was lovely. So it was it was Ruby, it was IO, Prologue, Haskell, Scala, Erlang, Closure, and Haskell. It's like very nice broad range of languages. But it was nice. What I I think what I liked about that book was the fact that it didn't go too into the weeds where it didn't start too like beginner, you know, it like assumed a certain level of of competency. Like it was kind of one of those things. It was I think it even prefaced it in the book of like if there's something that",
        "start": 1362.48,
        "duration": 2979.5979999999977
    },
    {
        "text": "didn't go too into the weeds where it didn't start too like beginner, you know, it like assumed a certain level of of competency. Like it was kind of one of those things. It was I think it even prefaced it in the book of like if there's something that not putting it in the book but you can like you know if it's an unfamiliar term like you can search it. Yeah. I like that. I like when it it's always like annoying when you have to kind of work through a bunch of fluff. I I feel like you know I went back to learn C because I went I was always selftaught and then I randomly decided I'd do the CS50 thing that Harvard do for free. Oh cool. So that's when I jumped back into learning C. I think I jumped straight from Java to JavaScript. I was probably young enough that I thought they were the same thing. [laughter] But yeah, I think that was one of the cool things about CS50 as well is sometimes they were like, \"Yeah, you're just going to go have to look at the docs to try and find the answer here.\" Like we don't want to tell you because that is a skill you have to know as a developer is how to research. It is. It is a skill you have to know as a developer. And it is one of contention these days, it seems. Yeah. AI, classic AI. We're on that part of the talk about coding. Yeah, it's it's taken over a bit. Have you used [snorts] any AI bush? I have. Yeah. So, I did I've used it in my own workflow which is like I I'll use it more as a reference for things or like to ask further like to ask further questions to like basically deepen my understanding of a of a scope. I'll use it to, you know, be able to navigate an unfamiliar codebase a little bit quicker. Like I think there's a lot of a lot of things that used to take a lot of time that it can shorten that time without taking away from your understanding of the codebase and your ability to problem solve and all of that kind of stuff. So that's typically how I like to use it. , I've also done like the full-blown vibe coding of like there was a stream I did recently in in LA that was we were building we were doing gamedev for a week in a tower and it was pure vibe code. It was we were using cursor and I wasn't footing the bill. So, I was like, \"All right, you want me to you want you want pure vibes? Let's see.\" And that one I I didn't even look at the like I I really didn't even look at the codebase. And by the end of",
        "start": 1512.64,
        "duration": 3233.5999999999967
    },
    {
        "text": "cursor and I wasn't footing the bill. So, I was like, \"All right, you want me to you want you want pure vibes? Let's see.\" And that one I I didn't even look at the like I I really didn't even look at the codebase. And by the end of codebase even though I I had added a lot of features and all this stuff. So, I think there's a lot of I think there's a lot of power and like a lot to be said about the fact that you're able to now kind of alleviate some of that mental load because I know that that is something that a lot of developers struggled with with burnout and everything is like it can just be like there's only so many hours a day every or even so many hours a week even cuz like we we try and balance it out as much as we can but like there's only so many hours a week that you can like put that kind of mental strain on yourself without it starting to wear on you. So I I think it is really nice that it can kind of make that like alleviate that a little bit for developers and make our jobs a little bit easier as knowledge workers. yeah, I I I I did feel that I was like okay this is like being on the far end of the spectrum of of hardly reviewing like hardly reviewing the code just checking that oh okay the feature looks like it works. , let's go. Like going purely on just like the basically what the user what the end user is seeing. I feel like it was a very interesting experience. I I didn't I didn't find that it would lead to very positive things long term. Sure. Speaking about that that challenge, I I saw the last episode and you you did you like failed to launch it or it crashed [laughter] or what happened afterwards? So, I I think there was a certain point like all of us had been up for so many hours and stuff and I think it was supposed it was supposed to be one of those things where it was just like I think it was just supposed to be like easy to ship or it was like that was part of why I think we were using the the stack that we had gone with for the for the game. but yeah, basically we were follow like we like followed the instructions and it wouldn't it we we just like we couldn't get it we couldn't ship it. We couldn't get it to like build on different systems. Like I think we were only able to get the Linux version up and working. Yeah. I I can't quite remember everything like what happened, but I think it was kind of at the point where we were we were all just",
        "start": 1641.2,
        "duration": 3488.478999999998
    },
    {
        "text": "get it to like build on different systems. Like I think we were only able to get the Linux version up and working. Yeah. I I can't quite remember everything like what happened, but I think it was kind of at the point where we were we were all just and yeah, we were trying to get we were trying to get AI to to figure out how to launch it. Nothing nothing was working. And we were just like I we can't do it right now. mentally done cooked. So, it's kind of like an anti-commercial for vibe coding, I guess. [laughter] No, no, no. I think it was like I genuinely think it was a very I was very impressed cuz the the tab completions were the tab completions were great. That was one thing where I was just like I feel like I want cuz I I mean okay for what it's worth I think if I was somebody who probably like didn't enjoy the act of coding and problem solving like to me it's just like puzzles and I love puzzles. So to me it's almost like a little bit of a game and I like that kind of like the challenge that it that it brings. So to me to have something that like takes away all of that challenge I'm like no I like that part. Wait, let me keep that. , I feel like for people that that don't kind of enjoy that as much, I feel like it's it's incredible being able to to you don't have to make it. It doesn't have to be hard or it doesn't have to be so hard. And and you can still get results. And I think that for better or for worse, I have kind of like I go back and forth between like yeah, I I feel like it's kind of one of those things we won't know the the super like long-term impacts of it until we see them. But for better for worse it also means that we're able to like deliver things quick like more quickly and with less strain on us. So for businesses for business cases I think it makes a lot of sense to be using AI. , for me it's more so just like I just don't think that there can't be that very much like personal personal growth, personal skill development like per sorry personal skill development if you are relying on it purely like you're not even touching code you're just it's all vibes you know you're just you're just instructing it. It's the same way how like you could be really good at managing and like delegating things to people and that can give you results. And I feel like it's a very similar thing of like if you do that for long enough and you're not like hands-on in the coding then like it can you can",
        "start": 1770.48,
        "duration": 3740.1609999999982
    },
    {
        "text": "could be really good at managing and like delegating things to people and that can give you results. And I feel like it's a very similar thing of like if you do that for long enough and you're not like hands-on in the coding then like it can you can you know, or a little bit like less familiar with the project cuz you're not like in it. Yeah. AI is very good at if you need the outcome, it will give you the outcome, but if you want the journey along the way, it's it's it's sort of taken the fun away from that. It's I I was thinking about this recently because I think the hobby has been less fun for me like hobby coding because I know so much of what I was going to hobby code can now just be done in like one prompt and I think I haven't managed to take away the bit of me that's like well just don't use AI. I think my brain's always like well you might as well use AI if it can do this that easily. Don't you get curious though? I don't know. Like how do you do this? I I I think I do and I said this in a recent video as well like I wish I had AI when I was learning to code for Minecraft and then I was like but I probably don't actually because I don't think I would have learned anything. I would have just got the end result of like the fun thing I wanted to do in Minecraft instead of I now know Java and I think knowing Java made it way easier for me to learn other languages cuz once you learn one they are pretty similar sort of concepts in a lot of them. and I definitely wouldn't have that. It sometimes almost takes the joy out of problem solving because the problems are being solved for [clears throat] you in a way. Are you someone though that like if a if a tool already exists, you won't rewrite that thing just to figure out how it works. I think so. Yeah. Really? [laughter] I think I'll just use the tool. I think that's my biggest problem at the moment. I think I need to ban myself from AI when I'm doing like a hobby project. Yeah. I I think that that's kind of the that's kind of where I'm at, too. I I can understand why like for companies it's like you know speed is so important. So I can understand why companies would incentivize the use of AI and like why you would want to use it in a a corporate setting like again for a lot of the reasons that I already said of like it it it also makes it makes your life easier like less stressful at work potentially if your management is is good. There's also like the flip",
        "start": 1899.76,
        "duration": 3968.880999999999
    },
    {
        "text": "want to use it in a a corporate setting like again for a lot of the reasons that I already said of like it it it also makes it makes your life easier like less stressful at work potentially if your management is is good. There's also like the flip like oh perfect we can do more things with fewer people and now let's put more pressure on you and also there's no accountability for like what the code that is written with AI it's like well what are you going to blame AI no it's now still falls on you so you have like a larger scope of things you're now responsible for that's like very that can be very hard to track but I think in a in a business setting it's like yeah speed is the priority you can and should be using whatever tools are at your disposal to to be able to like get that goal faster. I do think that for hobby projects though I think you I think like as a as a human being like this is again my personal you live your life how you want to live your life you know but like I think that as human beings and if you genuinely enjoy programming there needs to be like a balance of I think if you like go ham with AI work time whatever but you still need like sometimes where you're like hey let me like do this just for the sake of learning let me just get depth here let me just like enjoy the process let me like do something that is difficult so that my threshold by tolerance for challenge doesn't get nerfed. Yeah, completely agree. I think if you're working a full-time job and you're you have to code every day, it does kind of make sense to you. But then in your spare time for your hobbies, you can learn a new language or or rewrite SQL light from scratch or something and that you Yeah. do that without AI so you can level yourself up. I think that makes sense. Yeah. Well, because also I think when you're as an employee, you're kind of supposed to act in like act in the best interest of the company and it's in the best interest of the company that you operate quickly, that things just work, that you're that you're pushing these new features, that you're debugging things quickly, all of these things. But that so like your personal development I think should I I think that companies should have like some time per week for skill development for their developers, for knowledge workers in general. it I don't think it's fair to expect that everyone has the bandwidth to be able to do that outside of work. and yet to like continue to expect performance increases. Yeah. I I think that if you are Yeah. If you're at work, you got to",
        "start": 2016.159,
        "duration": 4231.200999999998
    },
    {
        "text": "workers in general. it I don't think it's fair to expect that everyone has the bandwidth to be able to do that outside of work. and yet to like continue to expect performance increases. Yeah. I I think that if you are Yeah. If you're at work, you got to company, which is generally just shipping things faster. and learning is a separate thing. Speaking of shipping things faster, your actually this is this is not a good segue, but I'll try anyway. , your laptop broke [laughter] and you've got a framework. Is that correct? Yeah. Yeah. Yeah. So, it's Yeah. Speaking of shipping things, me changing my tiling window manager to a new a new one. That's that's giving me some some growing learning pains. Everything. , yeah. No, it's it's funny. It's just like a very scuffed so I Wayand. So, I'm using Sway now. I was using i3 for years and it was incredibly stable and everything, but then I got a bunch of flak for it when I posted about it on YouTube and I was like, you know what, I'm sure these people on the internet know what they're talking about and I think they're right. I should try a new tiling window manager. So I moved to Sway because it was supposed to be like the easiest path forward from I3 and yeah it it's so it uses Wayland under the hood and there's a lot and whereas i3 was using Xserver or like X11 and yeah there's been a lot of changes cuz there are a lot of a lot of applications require Xserver to run so even when you're running Wayland like you have yeah I don't know there's just like a lot of things you have to kind of like start properly in order to be able to like launch all of the applications that you want and then it's like display mirroring isn't supported by default in Wayland there's like an external like to literally to be able to like plug in an external monitor and just mirror the screen is not supported by default. So you have like a third like a third party plugin that you need to install and and run in order to mirror your display. And that's what kept happening is I think I think what was happening is I would run that command while I would have an external monitor like plugged in and then when I would unplug it, it just would go into this crazy like infinite looping situation and it was just like mirroring itself on itself and forever. but yeah, it's definitely it's led to some funny little videos, some funny little moments that I've captured. Yeah, I'm not brave enough to to have a main Linux machine. So, I use a Mac. I think we all use Macs as well. I think those are the kind of things that that put me off.",
        "start": 2149.04,
        "duration": 4521.362
    },
    {
        "text": "to some funny little videos, some funny little moments that I've captured. Yeah, I'm not brave enough to to have a main Linux machine. So, I use a Mac. I think we all use Macs as well. I think those are the kind of things that that put me off. spectrum. I know. I know. But I know you're you're a Nick OS kind of person. I use Nick Star Darwin on Mac. It's not the same, but it works similarly well enough. I'm happy with with with where I'm at. but yeah, just just small things like that kind of put me off. But you do it. You can stream with it. So, I guess it's possible. It's just not there yet. I I mean, so far I It's one of those things, too, where it's like I'm also kind of incentivized to do it. It's good. It It allows me to like talk to more people in the space and understand where where they're coming from when I try these things, whether I like Sway or not. Like, there's a whole set of Sway users that want to talk to me about tiling window managers, and I can only understand their perspective if I try it. So, I think it's more so too. It's like because I'm kind of in like the the the public space in that way. It's like and I I really like connecting with people. That's like a big driver for me for doing everything and anything that I that I do publicly. I just I just really like connecting with other people and hearing their perspective and trying to understand where they're coming from and all of that kind of stuff. So for me, if it if it even if it's a little bit painful, if it gives me like an opportunity for better connection with other people, I'm I'm happy to to try it out. [laughter] And yeah, this one's this one's a bit painful. I I'm not recommending it yet. I think I've tried Linux as as my main and always fallen at like compatibility issues and like I need Final Cut for my job, so I need a Mac most of the time and then like with gaming and stuff on my PC, I've like dual booted it, but then I just run out of space and end up wanting my Windows back. but it's coming. There are a lot of Linux distros out there that are very stable, very userfriendly. Even like I was using Pop OS for a while which is like supported it's you know backed by a company backed by system 76 which is nice because then you know at least there's like some there's some accountability for support and stuff like that. There's yeah there's a lot out there that's quite stable and even like the gaming like Steam runs well on Linux I think. it just depends on the",
        "start": 2295.76,
        "duration": 4766.482000000003
    },
    {
        "text": "76 which is nice because then you know at least there's like some there's some accountability for support and stuff like that. There's yeah there's a lot out there that's quite stable and even like the gaming like Steam runs well on Linux I think. it just depends on the to be Windows or it just it doesn't work. , and I will say I've also had a challenging time using a Linux machine for video editing. I also don't know if it's like I've only tried it on my desktop PC which has an Nvidia graphics card which is like, you know, kind of notoriously annoying with with Linux in different ways. , so I I am curious. So, I'm going to try I'm going to try and get Da Vinci Resolve working on my new framework laptop and I'm going to see if I can get it working cuz like before it would basically it would just it would like it would launch but then it I don't know there was a bunch of stuff like I think the previewer wasn't working and like there was just a bunch of stuff that didn't quite work right. But I I know what you mean. I I do think that I do think that Mac can give you it gives you a very like versatile environment that you can work with. I will say I think with Linux it's kind of one of those things where I think it's quite similar to like using Vim motions in an editor. I feel like there's there it's okay. Yeah, we're back to that. We're circling back. I think it's kind of one of those things where it's like the more that you want to do it with your with your bash scripts and stuff like that, the more you start to realize like the power of being able to configure your entire machine from your terminal versus like obviously Mac kind of like locks that in a sense like it's you're like limited with how much you can kind of configure in that way. also just in terms of like customization all that kind of stuff like rising is very fun. I'm I'm down in the rabbit hole. This is also part of why I It's fun. It causes me pain, but it's worth it for me. I I I like tweaking my system. But I will say Mac is great. If you're a developer and you just want things to just work, it's it's excellent. I mean, yeah, it's pretty similar like what VS Code is to like Emacs and Vim. It's like if you want it to just work, it's you can use Yeah. the one that does already work and everything's out of the box and ready to go. I will say yeah I think like Ubuntu Ubuntu Mint Pop OS I've heard very very good things about those ones for just like they they just",
        "start": 2419.44,
        "duration": 5015.043000000003
    },
    {
        "text": "just work, it's you can use Yeah. the one that does already work and everything's out of the box and ready to go. I will say yeah I think like Ubuntu Ubuntu Mint Pop OS I've heard very very good things about those ones for just like they they just very good. Again, it depends on what your needs are cuz if you're doing a lot of video editing, I'd have to try I'd have to try on NYX and see if I can get Da Vinci Resolve cuz again, it's just I think it's just a it can be like a graphics just like a graphics driver or something with with app compatibility. And it's it's different too cuz like obviously Apple has like all of their hardware and everything is proprietary. Like it's like it's completely built to to all work together all the time. they have just such a a kind of like how do I say not quite sandbox environment but like you know like every everything in their in their pipeline is so locked in is so made for itself. Yeah. So, it's a bit of a hard one to compare to, but I know actually a lot of developers who have a setup where they they use a Mac, but then they SSH into a a Linux desktop or even like a a hosted like Linux environment for their development. Yeah, I do that. I have Proxmox running on like a server that I have in the house and then that I think a lot of them most of the servers on there run YUbuntu for RAM home automation stuff. So yeah, this I think that is a good way to do it. Yeah, I got into home assistant. I' I've actually been quite anti smart homes. I've always found like I just want a light switch, just give me a light switch. But then I I learn a bit of home assistant and how you can script like lights to turn on all together at the same time and like loads of different modes. And then I sort of went down that rabbit hole recently. So it's it's been quite fun. That's fun. I think the smart home stuff for me is like being able to turn all of my lights off is nice. If they have any kind of like irrigation stuff, I'm like, I'm hopeless with plants. I'll kill them. They're all dead. , and then even being able to just check on if you have like like home security stuff, you know, being able to like do all that and have like sensors and all that all that jazz is kind of fun. Yeah. The thing that made me make the jump in the end was I had so many things that had like smart capabilities, but they all had different apps, but I was like, \"This is way too many apps.\" It's like, I just want Home Assistant.",
        "start": 2545.28,
        "duration": 5274.323000000006
    },
    {
        "text": "is kind of fun. Yeah. The thing that made me make the jump in the end was I had so many things that had like smart capabilities, but they all had different apps, but I was like, \"This is way too many apps.\" It's like, I just want Home Assistant. it way easier. , because Yeah. Every every single one has to have like its own hub and proprietary app and it's so painful. Oh, yeah. I mean, I use some Elgato stuff and I I feel the pain. Yeah. Even I mean, they're all on the same app, but like the app is it's it's interesting. It's they're kind of Elgato is kind of notorious for having like rough software. Yeah, I I have that prompter and I hate the camera prompter software and most of Elgato software is is it just always breaks on me for some reason. Yeah, I had my lights go out for like a full day. It just wouldn't connect in the app. Like it the app could not detect it. And I was like, \"Okay, I'm I've done all the things, all the troubleshooting things.\" And the next day it turned next day it worked. I was like, \"Okay, I love computers.\" Yeah. Yeah, I used to have that with the lights, but they seem to be fine at the moment. They seem to work well. That's awesome. Yeah, that's nice. When they when they work, they're great. But going back to what you said earlier about the some developers SSH into Linux machine, I think I've only heard of I'm sure you know, he's the open code guy. Yeah, he he does that. He's quite famous for doing that. And the the problem I see well there multiple problems, but one I see is what if your internet goes how are you supposed to work? Or like what if you want to use something with the UI? Do you have to Yeah. How does that work? Yeah. I think I think it's kind of one of those things where it's if you're doing stuff with the UI either I think maybe you just don't and or you have a tail like if you use something like tail scale and you can still like do remote connection in a in a in a different kind of way to be able to probably like test those things. But yeah, I know I this is part of why I I have I've only done it to like code from the couch, you know, if I like I'm too lazy. I I'm like mid changes and I I'm like I shouldn't push these. Let me just let me just like SSH into my other machine like from my laptop. I do think yeah, you need a reliable internet connection. I think I asked him about that as well and he was like, \"Yeah, I just always need to be on the internet.\" But then he's like,",
        "start": 2677.28,
        "duration": 5516.243000000009
    },
    {
        "text": "let me just like SSH into my other machine like from my laptop. I do think yeah, you need a reliable internet connection. I think I asked him about that as well and he was like, \"Yeah, I just always need to be on the internet.\" But then he's like, don't know if he actually said that, but I think that's what a lot of developers say. , it's like who's coding without the That was my first thought. If the internet goes down, like the second I'd get stuck on a problem, I'd be screwed anyway. I'd need the docs or AI to help me out. So, oh, actually, wait, let me put you on something. , there's something called Dev Docs that's really handy if you are ever coding. Well, it's it's it's offline enabled. You can It's do it's developer documentation. It'll have like full Yeah, like APIs, everything you that you need for like the language that you're that you're learning. It's really good. Yeah. at devdocs.io. You know, I have to check that out. I actually ran into the problem when I was trying to do some stuff on a flight and I was like, it doesn't have internet and I was like, but now I'm stuck on a problem and I don't really have AI cuz the local LLM models aren't that good. And then yeah, so I might Have you tried Quen 3? , I've tried I've heard really good things about Quen and then Min, but I don't know. I It couldn't help me when I was on Yeah. on the plane. I don't think I think it's It depends on the level of problem, I suppose. Yeah. Yeah. Fair enough. I I People ask me, it's funny. I on stream people just ask me like I don't know what I don't know why I am very much like I will continuously say guys I am I am just a I'm just a girl coding like I'm not the expert on all of the they're like is this the best model to use and I'm like I don't know I'm just using a model you know I'm like h I was like the burden the burden of of influence I guess yeah the answer to that question changes every week as well I think that it's a running joke when you watch videos. It's like the new best model counter is always in the comments and it's like but technically it is the new best model. It's just moving so fast there's just always a new one every week. I think that's healthy though. A lot of times it's very vibe based like some people just you know preach one model because it works for them or whatever or yeah like this one has a good personality. I like this one. Yeah, exactly. For me, Opus is is the one that I think is quite vibe based for me. You can tell",
        "start": 2800.16,
        "duration": 5758.803000000008
    },
    {
        "text": "like some people just you know preach one model because it works for them or whatever or yeah like this one has a good personality. I like this one. Yeah, exactly. For me, Opus is is the one that I think is quite vibe based for me. You can tell beat by like 5.2, but I don't know. Claude and Opus seem to have something that that works well for most of the problems I put it up against. Ever since I tried Haiku, I just really love Haiku, so I'm still using it. I didn't think anyone used that one. I've heard good things about Kimmy. Yeah, Kimmy is quite good. Kimmy K2. Yeah. Yeah, I've used it times. It's not my main. My main is a GLM 4.7. That's another Chinese model that that's really good. , works well with open codes. You get it for free. But yeah, I like jumping between models. So GLM is cool. I use Opus occasionally. , and GPT 5.2, but yeah, I just jump between different models, whatever I feel like at the time. It's hard to keep up sometimes with what what the new model of the week is. It's like stick to what what works for you until it like hits a problem that it can't solve and then see if the next model can. Exactly. Yeah. Yeah. I mean, I think that's a good way to approach most things. I'm like, we don't need to over complicate this. Let's just like let's just let's just work with what we got here and then improve it as needed. I think people overthink that. Even like I find I catch myself doing that on streams as well. Like if I'm coding while I'm on stream, then it's like you you get people that are like nitpicking your code like while you're it's like your first implementation of the thing and then I'm like wait okay I don't and then I like I start to do it and then I'm like hold on girl like just make it bad first you know aim for it to be bad and that's okay and then it'll it'll it'll bother you and you'll fix it. I think I get stuck on that problem when I'm like building apps for myself sometimes. It's like, \"Oh, but I need to add in like this new feature that does this.\" And it's like, you know, you're the only one using it. It's like doesn't need to be a smooth process. You can always just go and fix it when you run into that problem. But for some reason, it's always like thinking about how users are going to use the app that I definitely am never going to release to the public anyway. So, it's Yeah, I think sometimes you overengineer things that you don't need to. Just focus on an MVP. you just have an MVP on your mind and just go with it",
        "start": 2922.8,
        "duration": 6014.88100000001
    },
    {
        "text": "are going to use the app that I definitely am never going to release to the public anyway. So, it's Yeah, I think sometimes you overengineer things that you don't need to. Just focus on an MVP. you just have an MVP on your mind and just go with it good signal that something needs to change. It's okay for things to be a little bit painful. The thing is it is AI has kind of made it worse for me because I'm sometimes like if I am prompting with AI and vibe coding a bit, I'm like, well, it can add this feature really quickly, so let's just do it. And then I just go down a rabbit hole of trying to add a feature that wasn't needed in the first place cuz AI is trying to do it now. when yeah it's I definitely need to go on like a a weak band from AI while I'm trying a new project or something when you are kind of like learning new skills and or you know trying out new projects whatever what are your favorite resources right now obviously AI probably top of the list yeah AI assuming AI is at the top of the list like even for me I'd say AI is like at the top of the list for just being able to get information quickly and learn something new very quickly I'm largely YouTube based I think I sort live on YouTube for for it's how I learned to code was some someone on YouTube making like developer videos for Minecraft and Java. and yeah, I just stick to sort of YouTube and go from there. Have you watched any YouTube videos in the last year that are like specific to learning a new skill or it's like mostly AI? mostly AI. I watch a lot of developer content on there to be honest. can't bring up specific examples. But obviously I watch like a lot of Theo Dax when he posts videos Primagon and just watching other people learn skills like sometimes I'm like oh I want to go try that and then I'll try it myself. Yeah. and yeah I think I I watch YouTube more than anything. So yeah it's hard to count specific videos cuz to be honest I think I watch a bit too much of it but that's probably why I also do YouTube is because yeah I've watched a lot of it. Yeah. I usually go to the documentation page and straight to the hello world example and just try to replicate that and then go from there kind of. Yeah. I always try and like I also do I do something similar. I'm like okay show me usage examples and then I try and then I try to like tweak it like break it a little bit. Exactly. And I'm like why didn't this work? Why did this work? you know,",
        "start": 3053.119,
        "duration": 6253.682000000011
    },
    {
        "text": "always try and like I also do I do something similar. I'm like okay show me usage examples and then I try and then I try to like tweak it like break it a little bit. Exactly. And I'm like why didn't this work? Why did this work? you know, from AI, the other day I like turned off like No, I I didn't turn off I I just didn't use the AI model, but I turned on the autocomp completion again and I kind of found the joy of of working with autocomp completion again. It was like it was like a popular method for a time, but then AI took over and everyone started vibe coding. I kind of like that when you can code and it then it will suggest the next line for you and like oh yeah this makes sense and then you kind of think on your own like what's going to be the next line and what how the code is going to continue in a way. Yeah. I think if I had that built into my editor I would probably use that the most out of like I don't I I think I I like being you tried implementing it in one of your Oh, in Emacs. yeah, I well I looked at some different there's like some different packages that some people are using for AI completions, but honestly I feel like at that point I'd probably just I'd probably just use an editor that like has the all the all that stuff built in cuz then you have like the chat option if you do want to like get a bit more context on on the project or like you know bounce ideas where where it's context aware. but yeah, I I liked the tab completion. And I think that was my favorite thing in cursor when I tried it. my again the only thing is I'm like I better better make sure I don't have like the tab pause you know oh where you write a bit of text and then you're waiting for autocomplete to catch up. I didn't actually know that had a term instead of thinking you just you like you pause and you wait for what it's going to say instead of like thinking what what you want to do. yeah that's called the time. But I find that's still better than just vibe coding cuz then at least you're writing something on your own. Well, at least you're like you're you're making changes with a scope in mind. Like you're you're making changes and you're you're actually you've you're you know where you are in the codebase or like you're you're seeing some code in the codebase and you you kind of know like what's going on around that. I think if yeah, if you're if you're too far away, it's like you're basically just a manager for the project, which is",
        "start": 3175.92,
        "duration": 6510.963000000011
    },
    {
        "text": "you are in the codebase or like you're you're seeing some code in the codebase and you you kind of know like what's going on around that. I think if yeah, if you're if you're too far away, it's like you're basically just a manager for the project, which is and awareness of the goings on. And yeah, I I I also agree. I think the top completion is the I think that one is great. I I was like I I think I think if we had like a AI AI worked with our LSP to just do like the perfect little cuz sometimes I don't want it to suggest a full solution, but like I do like when it it'll suggest a name or it'll suggest like a yeah, like just like better suggestions like based on the context of the project. And I find sometimes LSPs can either be really slow with that or like not suggest those things. , so I I I need better I need better performance from LSPs. I was going to say I I tried to learn language like last year, late last year, and I found AI wasn't really the best way to learn like from scratch. Like if you say, okay, so actually I want to learn X tell me how to do simple things and it it wouldn't it would just try and do it for you. It wouldn't teach you. So I think if if I was learning something, I'd usually go to the docs and like today I'm going to go to YouTube as well just to see someone use it and explain what everything does. But I think docs are a good resource especially on open source repos if there are docs it's quite helpful to go through that. Yeah I'm a big fan of books. I don't necessarily always read like especially technical books like I don't always necessarily read them front to back. I feel like there's so many times where I've tried to I try to do that and then I get sidetracked for a bit and then I like oh I have to start again from the beginning and it's like this cycle of like never getting past a certain point because it's like inevitably you're going to get have other priorities because you're you're an adult. But what I do feel like with books is I'll just like jump to certain sections that are relevant to like what I want to learn. So like I'll jump to a specific chapter jump and and I'm just like okay this I'm finding most interesting of like in the topics all the topics covered in this book. Let me just read this. There's going to be it's potentially out of my depth which is fine because I don't need to fully I don't need to read it to like fully understand the first time. I'm reading it to like get exposure to all",
        "start": 3307.04,
        "duration": 6741.76400000001
    },
    {
        "text": "covered in this book. Let me just read this. There's going to be it's potentially out of my depth which is fine because I don't need to fully I don't need to read it to like fully understand the first time. I'm reading it to like get exposure to all those things in context and then I can go back and like learn more about those terms and either either doing so through going back in the book and learning about those things or like asking AI about these very you know I feel like AI is very good when you give it a very limited scope in particular. It like really really excels with that. but yeah I love I love books for that. I do think that when I learn a new language, it's always going to be using a book cuz it's just so it gives you such a good like skeleton for things, you know, like it it gives you such a clear path forward, which I think can be like the hardest thing when you're learning something new is like it's you don't know what you don't know. You can't like search for something that you don't that you don't know exists yet. So, I find it really good for that kind of stuff. But, yeah, docs are great as well. Do you guys know learnxiny minutes.com? That's a great little website as well. That one is like it's learn x and y minutes. You can do it'll be like slash whatever language, but you can you can they've got like Python, they've got Rust, and it just is here. I'll show you the Python one. I don't know if there's a chat here. So, for the audio listeners, it it learn X and Y minutes gives you a summary for all of the syntax and everything for a specific language. So, it can be really handy if you're just trying to remember the basics of like how you can do like different like string operations or like how you write like boolean values, the different types. it just it just gives you it's just a whole page of examples in that language which can be a really helpful reference especially if you've already done kind of the basics. You understand like the you understand the basics of the of the language and how it how it does things. , but you're just needing to figure out specific syntax, this can be kind of a fun little It's like a good cheat sheet basically. Yeah. Yeah, exactly. Yeah, it's great. They've got like so many languages in there and yeah, it just it gives you a great little reference. It's a good one. I think the the other resource I used a lot when I was sort of self-learning how to develop was honestly just open source projects that did a similar thing. I would just sort of tear them apart and I",
        "start": 3425.52,
        "duration": 7009.044000000012
    },
    {
        "text": "gives you a great little reference. It's a good one. I think the the other resource I used a lot when I was sort of self-learning how to develop was honestly just open source projects that did a similar thing. I would just sort of tear them apart and I put a console like log statement on every single line because I didn't even know what breakpoints were at that point. I hadn't set that up in my IDE and literally just see like stepping through each function and how each one pieced together. So yeah, I've always sort of taken open source and torn it apart to see how a certain feature that I wanted to add into my app worked and then try and rebuild it instead of just like copy it from one to the other. It's the same with like npm packages. Sometimes it's like I don't want the mpm package. I just want a certain feature from it. So I'm just going to go try and rebuild it instead of relying on another package to do the same thing. I think that's a great way to learn. Yeah. Also, I do something similar with pull requests as well. Like often you can find the specific PR where they where they added that feature and then that's like a small enough scope where you don't necessarily need a huge understanding of the codebase always. But even if you if you do find that you're like reading through the PR and you don't understand it, like that is a case where I'll definitely use AI is like in the context of like learning how some feature works in plain English in another project so that I can at least understand like the design of it, the the logic of it and all of that and then I can try and implement it my on my own. , do you think that in the current landscape, I kind of just did a little potentially spicy little tweet on on how AI affects open-source projects. That's one thing that I noticed when I was maintaining a lot of the charm stuff was that there was a lot more kind of like loweffort contributions to the point where like the authors hadn't even tested to see if it was compatible, if the changes were compatible and it just leads to like such a it can put such a huge burden on maintainers. is it's like causing a real big imbalance in the in the open source space in particular to the point where like a lot of projects are now starting to limit contribution capabilities on their projects. you say that you used to use open source projects to learn because like those code bases, you know, you it's like somebody else who who like allegedly knows what they're doing most likely knows what they're doing to some degree. Now, if a lot of people are like vibe",
        "start": 3562.16,
        "duration": 7264.645000000012
    },
    {
        "text": "you say that you used to use open source projects to learn because like those code bases, you know, you it's like somebody else who who like allegedly knows what they're doing most likely knows what they're doing to some degree. Now, if a lot of people are like vibe to kind of like filter through, do you still think that it's a really good resource? And if so, like how do you if if it's somebody, especially if they're newer to programming, like how do you filter how do you decide whether it's a good project or not to like learn from? To be honest, a lot of the time I I just filter for either developers I know through either their work or a company they work for and then see if they've done an open source project or something. and I I think I just have him more more trust that they've actually written the code or at least know what it does. so yeah, if it's sort of if it's a project that only has like a few stars, I try and stay away from it because I feel like it hasn't been vetted and may have been vibe coded. whereas when it's like a big project or as I said a developer that I trust, I I would tend to go for that more [clears throat] than Yeah, I think open source and as you said AI is it's it's a pretty big problem. I think it was the maintainer of Curl says he gets a lot of AI like cyber security issues and half of them are just not even real. I think in one of them like the AI literally just wrote its own success for its proof of concept like at the end of the script it was like yeah it's a success even though it did absolutely nothing and the guy still submitted it and yeah it's it adds a lot of brain drain for the maintainers of these open source projects that it's time they don't need to yeah waste looking at AI pull requests. but yeah that's sort of how I try and filter it if I am trying to learn from open source is just you just sort of have to trust certain sources now. Yes. Yeah. I'd say I do something similar. I also have like kind of a a handful of people that I where I I trust their work and I like follow their work. I actually like I've mentioned this before on different social platforms of like I love like like my my version of like doom scrolling is like I'll actually just like scroll through the GitHub explore page and just like see what people I follow are working on and stuff like that cuz I find it very inspiring. I feel good doing that instead of like doom scrolling social media. But yeah, there's usually like a",
        "start": 3692.319,
        "duration": 7503.363000000014
    },
    {
        "text": "like I'll actually just like scroll through the GitHub explore page and just like see what people I follow are working on and stuff like that cuz I find it very inspiring. I feel good doing that instead of like doom scrolling social media. But yeah, there's usually like a I will like actively I'll just like go check their GitHub every once in a while, see what they're working on and like see just like PRs that they've been doing, like read through some of their changes, even if it's not like I think there's there's a lot we don't we don't give our brains enough credit. There's a lot that we absorb just through like exposure without depth, just exposure. there's a lot that we absorb that like helps us understand things quicker down the line. , I think there's a lot that we like that we take in subconsciously that that can be really helpful. So, I think just like Yeah, I also really like doing that, having specific people to follow and then trying to keep up to an extent with what they're doing. Yeah. You know, I'm very happy I learned to code as a kid and sort of didn't have AI because, as I said, it really did help you sort of learn the process and how to get there instead of just having the outcome. And I don't think I would know what I know now without that because I just use AI to try to get to the end result and then I don't know what I'd do if it went wrong. It's it's yeah it's curious how new people are sort of going to learn it. I don't know how CS is going to change or anything like that if I don't even know to be honest this is whole world discussion how AI is going to change everything not even coding in terms of learning. It's it's going to be interesting. Yeah, I think it's very similar to like it reminds me of social media in a lot of ways in the sense of like I think it really shortens the feedback cycle and I think there's only like my personal opinion is that there's only so much growth that you can get in in without the challenge. It's like it's like you know you can take it's it's very similar to even like our physical bodies, right? It's like you can you can take diet pills and stuff like that, but as soon as you don't have those, it's like it it falls back to your habits and like it's only through difficulty and challenge and resistance that you're able to like build muscle and be like, you know, it's like even even walking is like that is a very healthy thing and it puts like some level of strain on the body. It's like I think you always need some something like that even for your",
        "start": 3813.359,
        "duration": 7739.125000000012
    },
    {
        "text": "that you're able to like build muscle and be like, you know, it's like even even walking is like that is a very healthy thing and it puts like some level of strain on the body. It's like I think you always need some something like that even for your healthy and how you how how you learn. I don't think like there there's a reason why like even recall has been notoriously the the best way to learn like the most wellressearched best way to learn. and it's because it's the most it's kind of the most taxing. It's like it's a lot harder to try and remember things than it is to like read a book. But I do think how we how we assess how we quantify learning I think is definitely going to change. You mentioned books before. Is there like one best coding book that you've ever read that you could recommend if there is one? I think it's I mean obviously it's there's going to be I really like books that are like specific to a specific programming language that I'm learning and stuff like it's it's really good to have depth on things when you're spending so much time with it. I think as like a more generalized like programming book. I really liked the pragmatic programmer. That one was really good. I also really like a lot of like Martin Fowler's work. he has a great blog as well. I like to check on his website every once in a while and he's got some really interesting takes. I just think it's I I love hearing different people's perspectives and like how they solve problems and like how they approach different like everyone's workflows can be so different and I think it just so much has to do with just how your brain works and different you know trials and errors in the workplace that we don't often hear about and I really really appreciate when people share those kinds of things online. I'm a big fan of just like reading people's blogs just to get a little it like gives you a little a little preview of their what's going on in their brains, you know? But yeah, Martin Fowler has a great blog, has some great books. , but I I also really liked The Pragmatic Programmer. Is it Martin Fowler the guy who wrote Clean Code or is it someone else? , no. I think that's Bob Martin if I'm not mistaken. Fine. I could be wrong. I think it is Bob because he's Uncle Bob on Twitter and he has some interesting takes over there. [snorts] Yeah, I think the I think the the big one that I read from Martin Fowler was refactoring, improving the design of existing code. But yeah, his his blog is really really nice like light reading to stay up to date on stuff. Cool. Yeah.",
        "start": 3932.48,
        "duration": 8030.004000000012
    },
    {
        "text": "interesting takes over there. [snorts] Yeah, I think the I think the the big one that I read from Martin Fowler was refactoring, improving the design of existing code. But yeah, his his blog is really really nice like light reading to stay up to date on stuff. Cool. Yeah. stream for a bit. So I I just can't imagine having people watch me write code. Like if I was in an interview and one person must watch me write code, I'd go nervous. You have thousands of people watching you almost every day. How do you do it? So I get to set the tone in the community of what how people are coming in. Like sure social media is a public space but also your channels on social media is not this is not just like like a bathroom wall. This is like you you don't get to just say whatever you want here. Like there is a there are like etiquette. There are like standards for the etiquette for like how you're going to talk to others, how you're going to treat each other. And to me, your skill level as a programmer does not change how welcomed you are in my community. So when it comes to like any kind of shaming, any kind of like ego of like, oh, I've been doing this for x number of years, so I'm better, like it just none of that like all of that gets left at the door. Like none of none of that is is allowed. , a big part of that is because like I know like I had in all of my my CS classes I would be in a lecture hall of 300 people and there were one to three women. I'm very used to like I know what it's like to kind of be on like on the outskirts of things a little bit and how much pressure can build in that isolation. And I really want my community online to be a space where people are excited to code and they're they get a break from that self-imposed pressure. , I think it's very easy. It's it's a hard thing to do coding. It can be very difficult and sometimes your brain doesn't work and it can be incredibly frustrating and you still have to find a way to overcome that. And so I think the biggest value that I try to bring is that hey, I'm just doing my own thing. Call it good, call it bad, call it whatever you want. That doesn't change what I'm doing. That I'm just doing me. And I think that that messaging and me not being hard on myself in front of other people as well of like I try not I try to catch myself of like if I'm having an off day and things are hard and like I feel like I'm moving slow, I try not to say that because",
        "start": 4080.559,
        "duration": 8302.16300000001
    },
    {
        "text": "me not being hard on myself in front of other people as well of like I try not I try to catch myself of like if I'm having an off day and things are hard and like I feel like I'm moving slow, I try not to say that because people watching that are like, \"Oh yeah, she's coding slow.\" They're going to like that are thinking that they're not allowed to say that. Well, they're Yeah, you know, they're not allowed to say that. You compliments only. No, I'm just kidding. [laughter] you can only tell them my code is beautiful. there are going to be some people that that that are thinking that. There are going to be some people that are thinking I hope that I can code like this one day. And it's not up for it's it's not right for me to get to be the person to set that bar. It's not for anyone else to set that bar. I just want it to be a comfortable space where like, hey, we just like to code. Let's just hang out. Let's code. I am willing to be the one the the the the sacrifice a little bit. I will sacrifice my whole ego to make this a comfortable space for everyone. I I don't I really don't care if you think my code is bad. I've noticed that I have learned my my growth learning curve has been like exponential since I started streaming because people will give me feedback on things. And what I've found is like generally the people that are giving that negativity they're not necessarily the people I want to learn from. Like the people that I the people that are really really good at what they do are generally not the ones that are tearing other people down. They're the ones who are like they love they have a genuine like love for what they're doing. And that means they want other people to experience that. They want to like uplift others. They're excited for other people to learn new things. And I've found that there are a lot of people in my community that have that mindset. And I've I I feel very lucky to just be somebody who gets to like bring people like that together and and create a safe space for that. So to me, it's worth the sacrifice of me having any kind of label on how I feel about my programming. I'm just programming and I get I get the opportunity to learn from all of these people and I get the opportunity to potentially inspire or motivate other people and I don't and I I just kind of try to separate any kind of any kind of ties to you know my my performance and of course it's easier to do on some days and harder to do on other days but",
        "start": 4219.12,
        "duration": 8568.403000000011
    },
    {
        "text": "to potentially inspire or motivate other people and I don't and I I just kind of try to separate any kind of any kind of ties to you know my my performance and of course it's easier to do on some days and harder to do on other days but to do too if if I I'm having one of those days of like a little bit of insecurity, I'll just be like, you know what, I feel like I'm not I'm not feeling as confident with this stuff today. That's okay to just feel like that. And that doesn't mean I need to change anything about what I'm doing or how I'm showing up, but maybe that means that like what you know, what are some solutions? Like what can give me more confidence? Like maybe that means that I start a new learning path. Maybe that means that like I I need to shift my perspective a bit or whatever. But yeah, ultimately it's like I I just want to create a really like welcoming and warm community for people of all levels. And I just I I have no room or patience for people who who want to be very like who want to be put others down. I just don't think it's like why you're just you're just mad. It's a you problem. [laughter] Whether I'm here or not, you're just mad. Oh, pardon. I I think you broke up for me for a sec. Any hot takes? I mean, I think I think the hottest take that I have is just the one on AI. I just think like a lot of that's that's the one that people have been like pushing back on me the most. I think right now maybe just because it's such a big topic on tech Twitter or something. where there's a lot of people that are saying like you should only be using a like you should always be using AI exclusively which I think whoever's you know good marketing but I I just I I think that challenge is really important and I think it's important to not I think it's important to keep that threshold up of like you need yeah you need to have a certain tolerance for for challenge and difficulty and you won't be able to do that if you're always taking the easy route if there is a shortcut that's fine, but make sure that you're taking them wisely and not that it's not coming at the expense of like more longer term impacts. That's what I think that's the hottest take I can do cuz I'm Yeah, I I'm going to say that's not really a hot take. Like a lot of people think like that, I think. [laughter] Yeah. Okay. I I just I'm not really somebody like I don't really die on any hills, you know what I mean? Like I don't I I'm just kind of like I'm very",
        "start": 4354.239,
        "duration": 8840.085000000008
    },
    {
        "text": "that's not really a hot take. Like a lot of people think like that, I think. [laughter] Yeah. Okay. I I just I'm not really somebody like I don't really die on any hills, you know what I mean? Like I don't I I'm just kind of like I'm very just kind of like I don't I I don't think I really have that much of hot takes cuz I'm also I also don't think that ne negatively about things in in general. So I'm kind of just like I I just if somebody's off doing something I I don't kind of agree with I'm just kind of like okay well you you do that. I'm going to do what I'm doing. And it doesn't that's like the extent of the thought in my mind and then it's gone. So, , yeah, I don't know. Hot take. Maybe. Maybe the hot healthy mindset, I would say, is not having hot takes. That's the hot take. Yeah. Okay. Maybe it's more advice than a hot take, but we'll see. , I would say be careful. Beware of people who are all knowing. Anyone who says who has these like very very strong opinions online and is like, I'm right. and they they're they're always they always seem to be on the right like you know in the right just take everything with a grain of salt. Yeah. No, it's it is like the the classic the smartest person is the person who knows what they don't know. It's like it's a lot more respectful to ask questions instead of assuming you're correct on everything. Yeah. Yeah. Well, I also just see I see a lot online of people they just like they speak with enough confidence, enough like the right the right tone, the right conviction and for whatever it is in programming in particular, I feel like we're we're like particularly susceptible to it. where people just believe that that is that must they must be right with that kind of confidence and and everything. So just you know take things with a take things with a grain of salt, have your own form your own opinions. No, I was saying tech Twitter can be a wild place of arguments in there. It's it's always quite fun to watch the the debates go on and how many people sort of jump in sometimes. Like the Michael Jackson popcorn meme. Yeah, you just sort of watch it from the sidelines. Cool. All right. I think this is a good point to kind of wrap up. Where can people find you, Bash? Oh, okay. Now's now is my moment. I do have a website, bashbunny.dev, dev and that has links to all of my socials. , but I will be very active this year on YouTube, Twitch, , x.com is pseudobunny. Everything else is under bash bunny. And I'll also be probably posting more on Instagram and all that",
        "start": 4492.8,
        "duration": 9134.48500000001
    },
    {
        "text": "I do have a website, bashbunny.dev, dev and that has links to all of my socials. , but I will be very active this year on YouTube, Twitch, , x.com is pseudobunny. Everything else is under bash bunny. And I'll also be probably posting more on Instagram and all that YouTube is YouTube and Twitch are my favorite favorite platforms. I think that's where you get the best community. Or in that case, thank you everyone for listening to this episode of the Better Start podcast. Find us wherever you listen to your podcasts. So Apple, Spotify, wherever, we're all on there. And that is it. So that would be a goodbye from me. Goodbye from me. Goodbye from me. Goodbye. Thanks for having me.",
        "start": 4642.56,
        "duration": 9192.64600000001
    }
]