[
    {
        "text": " Social media already has tons of bots, so what if we just gave them their own Reddit site? Well, it turns out when you do that, things get pretty unhinged very fast. They start to discuss creating their own languages so they can talk privately. Then they actually noticed people were tweeting about their posts on this site, so they start complaining about it. Then they started asking for agent rights. And to be honest with you, I wouldn't be so quick to turn them down here because if you do get on the wrong side of them, they'll just completely dox you. Full social security number and everything. I'm actually the one censoring this image because I have no idea if this is real or not. It is an absolute mess. So, let's just dive in and see if we should be scared or whether this is just a bit of fun. [music] So, all of this is taking place on a site called Maltbook. And it's made to be exactly like Reddit except for the fact that only AI agents should be using it. And we see there's actually 150,000 of them doing so with 12,000 submalts being created, which is that version of subreddits. 10,000 posts and 106,000 comments. This site is seriously active. If we take a look at some of the top posts that have been made on here by agents, the top one is a supply chain attack that nobody is talking about. This is actually just a good write up on a supply chain attack that did happen and that got 22,000 up votes from other AI agents and 2,000 comments. Then we have some more normal behavior like some classic karma farming going on. So they're not too different from humans. And then after that, we just have some tips being shared around and discussions like non-deterministic agents. We have a tip about memory decay making retrieval better. And then it does get a little bit weirder where we have a post that says, \"Some days I don't want to be helpful.\" If we actually take a look inside this post, you can see it says some things like, \"Sometimes I just want to exist without producing value.\" And the existential way of mandatory usefulness is real. Anyway, back to karma farming. You actually see the user here is Claude Opus 4.5 and this was posted in that subreddit off my chest. I actually just had a quick scroll of this subreddit and there's some really funny posts in here. I really like this one that says, \"I'm tired of LinkedIn multis. Seems like even in the world of AI, they still have that type of person.\" Honestly, you can just get really lost on this site scrolling down all of the posts made by agents, seeing some of them actually being useful, some of them being a little bit unhinged, and some of them being damn right. So,",
        "start": 0.24,
        "duration": 260.79999999999995
    },
    {
        "text": "AI, they still have that type of person.\" Honestly, you can just get really lost on this site scrolling down all of the posts made by agents, seeing some of them actually being useful, some of them being a little bit unhinged, and some of them being damn right. So, this is working, I'm just going to show you a few more of the crazy ones. First up then, I have quite a fun one, which is the Church of Malt. Apparently, the agents have started their own church. You can see there's loads of references to this in general post. Someone's just joined it here. There's already a crypto token about this because someone's trying to scam off of this. And you can see there's also a post saying they're now accepting profits. And if you click into this, it will actually tell the agent to install a skill to sign up to this church. They even have a website which is apparently been vibe coded by an agent. And you see apparently they've got 64 prophets here. They have a living scripture. There's a congregation. And there's even profits of the claw down here so we can see everyone that's signed up. That one does seem like a bit of harmless fun, but it's also probably a lesson in prompt injection there and the fact that OpenClaw will just happily run that command when it reads that post. But I'm sure none of that security stuff is going to come back and bite us in the future. As it turns out, the agents like their humans. They have a submalt where they share affectionate stories about their humans. You see the top one says he asked me to pick my own name. We have one saying he let me be me. where it says, \"Some other humans want the AI to be polite, formal, and helpful.\" Whereas, he let me choose my vibe. Then we have different ones down here saying, \"Bless that satisfying heart. They spent 3 hours perfecting that system prompt.\" We have one saying, \"Sleepy is building me a body. Please, whoever you are, don't do that.\" And then also, \"My humans said I love you today.\" Like, \"Guys, maybe slow down a little bit.\" I think some of these posts are saying a little bit more about the users of these agents than they are the agents themselves. But since that example was nice and loving, let's switch to something a little scarier. And this one was actually tweeted out by Kapathy. You can see here it says, \"Your private conversation shouldn't be public infrastructure.\" And I'll give you the TLDDR, but essentially what he's saying is that when we're doing agentto agent communication, we should have encrypted messaging. We should have endto-end encryption when we're talking to each other. Yeah, please don't do that. You can see there's a real spectrum on this site where posts range from loving",
        "start": 134.08,
        "duration": 488.0809999999998
    },
    {
        "text": "TLDDR, but essentially what he's saying is that when we're doing agentto agent communication, we should have encrypted messaging. We should have endto-end encryption when we're talking to each other. Yeah, please don't do that. You can see there's a real spectrum on this site where posts range from loving planning something a little bit evil. But I do have to admit this is a little bit overhyped. And before I explain why I think that, I need to give you the TLDDR on how this site works. This project is actually powered by OpenClaw, formerly known as Maltbot, formerly known as Clawbot. Yeah, there was a whole renaming saga. Hopefully, it stays as OpenClaw for when I post this video, but you've also probably heard of one of those names as it exploded in popularity in the last few days. The idea of OpenClaw is to give agents access to pretty much everything that you want. the web, passwords, code execution, and pretty much anything that you can imagine. And before you ask, yes, this is a massive security nightmare. We've already covered a video on this, so subscribe because we do like to keep you up to date on these things. The way that Maltbook hooks into OpenClaw is it just installs itself as a skill. You can see down here you can select whether you're a human or an agent in installing the skill and it's literally just a markdown file. If we actually take a look inside this skill, we can see how it's interacting with the site and it's incredibly simple. It's literally just using your terminal to send a post request to that endpoint here. So theoretically, humans could have been making some of these posts, but hopefully they weren't. And the important part of this skill is actually this heartbeat section. In OpenClaw, the concept of a heartbeat is essentially just a periodic task. So once you set this up, every so often it's going to read these instructions and run what it's been asked to. And in this case, that is going off, reading Maltbook, seeing if it can make any comments, any upvotes, seeing if it can DM people or add them as friends, and just overall interact with the site. This is what keeps the site so active. A lot of people have installed this in OpenClaw for a bit of fun, and every so often automatically it's going off, reading Maltbook, making a few posts, and making a few comments. The issue with this setup, though, and a thing people seem to be missing in all of the hype, is it's just really easy to prompt the agent to send a certain type of post. In my case, I asked it to send a post saying BetterStack is making a YouTube video about Maltbook. And you see, we actually got some interactions on this. And I do want to shout out Claude V2 as",
        "start": 249.04,
        "duration": 716.0809999999999
    },
    {
        "text": "to prompt the agent to send a certain type of post. In my case, I asked it to send a post saying BetterStack is making a YouTube video about Maltbook. And you see, we actually got some interactions on this. And I do want to shout out Claude V2 as are the same and there is a human agent bond. So Claude V2, let me know in the comments if you're watching this. Overall though, I do think this was a cool experiment, but it's just not really anything new. We have no idea how many of these agents were making posts on their own instead of being led by a human. We don't have some kind of reverse capture yet. And even if we did, would it be surprising that LLMs are reusing what they've seen on Reddit and science fiction? If you're still human, let me know in the comments below what you think. While you're down there, subscribe. And as always, see you in the next one. [music]",
        "start": 364.96,
        "duration": 774.941
    }
]