[
    {
        "text": " Good news for Cloudflare fans. You can now run the very popular OpenC claw tool on their infrastructure using a combination of workers, sandboxes, browser rendering, and even R2. They actually have a very detailed article on how everything is put together. And for the most part, it works really well. But do the advantages of running OpenClaw on a serverless infrastructure outweigh the flexibility you get from running it on your own VPS? Hit subscribe and let's get into it. [music] So here is open claw or clawbot running from cloudflare. If I show you the URL, you can see it's running in a sandbox and I'm getting access to it from my worker. I can give it a prompt like tell me everything about the system that you're running on and you can see it gives me details about the infrastructure. Now I'll wait for it to finish and I'll scroll up a tiny bit and we can see here that it's running on a Cloudflare cloud chamber. It's in San Jose, Florida and we can get all the specific information about it. But we also have access to channels. So this is where we can add WhatsApp, Telegram, or Discord. We can see we've got access to skills. I haven't installed any, but I could if I wanted to. And we get the full access to the configuration, debug, and all the logs. No service to manage or update. You only pay for the compute you use. And you benefit from Cloudflare's global edge network. Very cool. We'll go through how to set this up later on in the video. But before we do, let's talk about how the different bits of technology work together to make this work. So when you first try to visit your instance of OpenClaw, you'll be hit with Cloudflare access for authentication. So then you have to sign up with your username and password or ooth and then from there Cloudflare will use JWT tokens to authenticate you to the worker. Now this worker isn't quite yet the open claws gateway. This has a hono routter which has the roots for the admin that I'll show you a bit later, but it also has the Chrome developer tools protocol and also a JWT validation section. There are a few more things here, but I've decided to keep it brief and just show you the three main parts that I think are worth talking about. Now, this Chrome developer tools protocol gives access to a browser renderer. And this is something very cool from Cloudflare providing a headless chromium instance which can be used when openclaw does web browsing or research or anything else. Now from here we have a cloudflare sandbox that uses docker. So to build this locally you'll need to have docker or kyma installed and this is essentially the open claw gateway. Now if you've watched a previous video of mine talking about how",
        "start": 0.16,
        "duration": 305.3599999999999
    },
    {
        "text": "browsing or research or anything else. Now from here we have a cloudflare sandbox that uses docker. So to build this locally you'll need to have docker or kyma installed and this is essentially the open claw gateway. Now if you've watched a previous video of mine talking about how know that the gateway contains the kind of brains of the system. So it contains the dashboard, the websocket access for nodes and clients. It also has the Asian runtime, a session manager, channel manager and this is on port 18789 for the websocket access and also HTTP for channels. So the cloud flare or molt worker equivalent of that is in a sandbox. So it can run code in isolation making it extra safe. Now this doesn't use the direct access from AI providers. So API keys to their systems. I mean you can use OpenAI or Anthropic, so your own API key, but you can also use Cloudflare's AI gateway which gives you access to all of these providers. But because this is running in the Cloudflare system, you can't of course have your own local LLM. So that would be something to consider. But again, you can use channels like Telegram, WhatsApp, Discord, and connect to your sandbox in Cloudflare, which actually communicates. So there should be an arrow over here to your worker. Now when it comes to session management so managing the storage and configuration that is done in an R2 bucket. Now it's important to note that if you restart the sandbox so if you rebuild the container anything you saved inside the sandbox will be wiped and therefore you need to save things in an R2 bucket to make it persistent. So that is a very brief overview of how everything works. Of course I could go into more detail but that's what the article written by Cloudflare is for. Now, let's go into how to set this up. Okay, the first thing to do is to make sure that you have a paid workers plan for $5 a month plus additional usage. Yes, it's probably cheaper to have a HNAV VPS than this, but you do get a lot of usage for the price you get. You also need to have something like Docker installed locally. I use Kalema personally, but Docker desktop is fine. And finally, you'll need to have an anthropic or open AI API key. Now, once you have those three things, you'll need to get access to this GitHub repo and clone it locally to your system. Of course, you could click this button to deploy straight to Cloudflare, eliminating the need for you to clone it, but I tried it and it didn't work well for me. So, I'd recommend cloning the repo. Now, once you've cloned it, they have some really helpful steps down here telling you exactly what to do. So, I'd recommend going through these steps and remember",
        "start": 152.56,
        "duration": 589.2799999999997
    },
    {
        "text": "for you to clone it, but I tried it and it didn't work well for me. So, I'd recommend cloning the repo. Now, once you've cloned it, they have some really helpful steps down here telling you exactly what to do. So, I'd recommend going through these steps and remember token because this is really important. put it inside a notebook, save it to a text file, just make sure you don't lose it. Then after you deploy your malt worker, there are a few things you have to do that are listed in the readme, but are a bit difficult to find since they're all over the place. So, let me walk you through that. Now, inside your worker, you should be able to see in the binding section a dual object, which is the sandbox, the R2 bucket, and the browser renderer. If you don't, you may need to rebuild your Docker container and deploy again. But once you've got this, click on domains and rules and then make sure you have Cloudflare access enabled. I already have it enabled. But the first time you do, you should see a pop-up over here. Now we need to populate two secret variables before we can run our mult worker. The first is the CF access or and the second is the CF access team domain. You can get the first value by managing your cloud access and that is down here and you need to add that to Wrangler as a secret. The second value you have to get is in the settings which you can find over here. This is your Cloudflare access domain. And once you've done that, the documentation asks you to run deploy again. Now, if you already have a sandbox environment, then building it again could cause you this issue. So, I would recommend running this command to list your containers, then once you have the ID of the container that already exists, all you have to do is run delete followed by that ID. Now, because I don't want to delete that container, I'm going to leave it as is. But you should delete an existing container before rebuilding or redeploying to add a new one. Once you've done that, you should have access to the Maltbot admin page. That should look something like this. Now, don't worry about this warning unless you want to persist your information. In that case, you need to add these missing secrets. But if this is the first time you're running this, you should see a device to pair over here. So, a pending pairing request. and you'll have to click on a button here to pair it. Now, because I've already done that, you'll see it here. So, this is the device that I've paired and this happens when we connect a browser to our Clawbot gateway. So, now with that in place, we'll need to go to our worker",
        "start": 296.88,
        "duration": 842.3189999999995
    },
    {
        "text": "on a button here to pair it. Now, because I've already done that, you'll see it here. So, this is the device that I've paired and this happens when we connect a browser to our Clawbot gateway. So, now with that in place, we'll need to go to our worker So, this is the token that I asked you to save earlier to the URL. And this is something you'd have to do just the first time you access Claudebot from your browser. And once you've done that, you should hopefully have okay health and be able to communicate with your agent. Of course, this gives you the full flexibility of having Open Claw as if it was on a VPS. And if I scroll down here, the CloudFare team even managed to connect it to Slack. So, you can see over here some screenshots of somebody talking to Maltbot in Slack and getting responses from it. Now, if you don't want to get your hands dirty with all the things that involve setting up a fresh Linux server or Mac Mini, then using a mol worker from Cloudflare could be a good option since the team have put security first and they've essentially done all the hard work for you. But if you don't mind doing a bit of research, sshing into a server, and running a few terminal commands, then I think that the option of going with a VPS or Mac Mini in the long term is more secure if you know what you're doing and is very, very flexible. And besides, you could get a version of OpenClaw that is truly private. If you run Lama or any local model, you can connect OpenClaw to that model and use it without even needing to connect to the internet. And you may also notice that the malt worker I ran showed a logo of claudebot and not open claw, meaning their version on GitHub is slightly out of date, but I'm sure the team can fix that in no time. In my opinion, it's better to go down the route of a VPS and learn how to set it up properly so that you have the complete flexibility you get from doing whatever you want and privacy. If you want to know how to set up maltbot, open clawed or clawedbot on a VPS securely, then check out this video I've made earlier, which goes through exactly how to set things up using tail scale. Security aside, if you're using one of these bots and you're building software with it, then you're going to want to make sure that the software is bug free and has as few errors as possible. This is where Better Stack comes in, giving you the ability to view logs on your back end and know when things go wrong before they do using anomaly detection. There's also AI native error tracking that can track errors no matter the",
        "start": 425.28,
        "duration": 1112.9609999999993
    },
    {
        "text": "and has as few errors as possible. This is where Better Stack comes in, giving you the ability to view logs on your back end and know when things go wrong before they do using anomaly detection. There's also AI native error tracking that can track errors no matter the prompt on how to fix the errors in your favorite agent harness. So go and check out a better stack",
        "start": 564.0,
        "duration": 1124.1619999999994
    }
]