[
    {
        "text": " Anthropic released Sonet 4.5 earlier this week and ZAI snuck up on them to release GLM 4.6 the following day. I mean these guys are out to get anthropic. First with the GLM coding plan and second with a model which is supposedly better. When I compared the previous version of these two models, Claude came out on top. But with these new models and GPT5 codecs, are we living in a time where Claude is no longer king? Let's put these models to the test by running an easy, medium, and hard coding task. And before we do that, don't forget to hit the subscribe button. GLM 4.6 comes in hot with a 200K context window, an improvement over 128K, but it's nowhere near Sonet's 1 million, which you can learn more about by checking out James' video. Enough talk. Let's run our first test, which has a surprising winner. We'll run all of our tests in open code to make things fair. And here is the prompt for the first test, which is to make a portfolio website for a photographer using HTML, CSS, and JavaScript. We'll start with Sonet 4.5. And I'll simply ask it to run the prompt file. And there it goes, starting the task. And it has suggested to use Unsplash for the images, which is exactly what I would have done. And the whole thing is finished in less than 2 minutes, which is really fast. And it cost 15. If we open up the project, we have this pretty impressive looking site with a background image and a button to view my work. It's loaded in the images correctly and has this really nice hover effect. Although, I would say the design of this site is very similar to the design of the portfolio site that was created by Sonet 4. Next up is GLM 4.6. Again, we'll ask it to run the prompt file, and it starts off by creating a to-do list. It's written some HTML. It also even tested the website before finishing the task at around 2 and a half minutes. Now, it says here that it costs the same amount as Sonnet, but I think the pricing for Open Code and GLM is a bit off. Let's take a look at the site in the browser. Okay, and this is looking very similar to Claude's one, apart from the missing button here, but it does have a light and dark toggle button in the exact same position, and it has an about me page with a get in touch section. Overall, this is a good effort from GLM, but not as good as Claude's version. Now, I've actually gone ahead and run the exact same prompt in GPT5 codeex to see what it does. Wow. When it comes to design, GPT5 has definitely won. I mean, it's even given the photographer a name, given the site a name, unlike the other two that have",
        "start": 0.08,
        "duration": 326.07900000000006
    },
    {
        "text": "version. Now, I've actually gone ahead and run the exact same prompt in GPT5 codeex to see what it does. Wow. When it comes to design, GPT5 has definitely won. I mean, it's even given the photographer a name, given the site a name, unlike the other two that have click on view latest work, the images do have different lengths. So, I'm not sure why it did that, but I do like this hover effect that the cards have. So, for this task, even though GPT5 took the longest and used the most amount of tokens, it still did the best job of creating a portfolio website. Let's move on to the next medium task, which is to improve this Hacker News project by adding infinite scrolling and caching, realtime comments, and advanced search. We'll start with the winner of the previous round, GPT5 Codeex, which finishes the task in around 20 minutes and uses over 150,000 tokens. We can see the site looks really nice, but it has an issue loading the stories. This looks like a websocket related issue. So, first we'll run the server before running the client. And we still get an issue saying that initial story is not defined. Let's get Codeex to fix this issue. And now that it's fixed it, let's take a look at the site again, which works much better, showing stories and comments. And if I scroll to the bottom, there should be infinite scrolling. So I should see more stories and there should be some live comments. So if I click here, I can see all the comments related to this article. And I can do the same for any other article I click on. And let's try doing a search. And if I hit enter, nothing shows up. Maybe because it's still indexing all the stories. But hey, this is still pretty impressive. Next, let's try the same prompt with GLM 4.6, which finishes the whole thing in just over 9 minutes and uses half of the tokens that GPT5 used. So, here it is. And I really like this skeleton loading menu. I'm not sure why Hackne is here twice, but it also looks like it's using the newer version of Tanstack. If I scroll down, there should be infinite scrolling. If I click on an article, it takes me to it. But if I click here, then hopefully I should see all the comments, which yes, I do. And this is very nice. I can also click here to see the nested comments. And click here to reply. Now, let's check how well the search works. If I do a search for Kaggi, oh wow, I can see all the stories related to Kaggi in this dropdown. Let's try Claude. And without hitting return, I get all the Claude related stories from Hacker. This is really impressive considering it used less tokens and was quicker than GPT5 CEX. Now, let's try",
        "start": 163.519,
        "duration": 619.1979999999998
    },
    {
        "text": "for Kaggi, oh wow, I can see all the stories related to Kaggi in this dropdown. Let's try Claude. And without hitting return, I get all the Claude related stories from Hacker. This is really impressive considering it used less tokens and was quicker than GPT5 CEX. Now, let's try And Claude is done again, using the least amount of tokens and finishing the quickest at just over 4 minutes. Let's take a look at the app. We can see it's loading the stories. And here we have it. Now, I'm going to admit I'm not really impressed by the design, but let's just check if everything else is working. So, if we scroll down, there should be infinite scroll support, which there is. And if we click on a story like this one to see the amount of comments, all the comments load up. And I can add a comment by clicking here. I can even upvote and I could search for a story like Kaggi, which shows the results here. And also Claude. Now, I'm not sure if it's just the prompt or the model, but the previous version, so Sonet 4, did a much better job of this exact same task than Sonet 4.5. But it looks like GLM 4.6 wins this specific task. The third, and possibly the most hardest task, is to build and a first person game similar to Minecraft. So, we'll let TLM go first, but I've also given it some extra prompts with creative freedom to add enemies or collectibles, a health bar, more foliage with gravity, and anything else it wants to add. But it has to be very, very impressive. And it looks like GLM has finished in 3 minutes and 50 seconds. The game actually looks very impressive. It's Oh, and here we have a bug. Game over. Score zero. I'm not sure what's going on here. And it seems to just restart. So, and we have game over again. Let's see if we can fix that. So, I've written a prompt telling GLM the issue, which it has now fixed. So, now if we try the game, we seem to be falling from a higher height. And maybe that's what causes me to take health cuz I seem to be falling in lava the whole time. And what is going on here? Okay, I'm now rotating. , I don't understand what's going on. I mean, the game does look really impressive, but it's not playable. We'll run the exact same prompt with GPT5 codeex which finished everything in over 11 minutes and used 86,000 tokens. If we take a look at the game, ooh, it says click to enter the wild. And I'm clicking. I'm hitting enter. And okay, it looks like in the console 3 is not defined. So, let's give this to codeex and hopefully it will fix it. So, if we try the game again, we are in wild. , the controls are backwards.",
        "start": 311.759,
        "duration": 907.6780000000001
    },
    {
        "text": "to enter the wild. And I'm clicking. I'm hitting enter. And okay, it looks like in the console 3 is not defined. So, let's give this to codeex and hopefully it will fix it. So, if we try the game again, we are in wild. , the controls are backwards. backwards, but it's fine. And I can see some enemies which I'm attacking, but nothing is happening to them. I'm not sure what's going on, but this is actually more playable than the GLM version, which is good, but let's just say it's not enjoyable. And finally, we'll try it with Claude Sonet 4.5. Okay. And as usual, Claude has finished the fastest in 1 minute and 46 seconds. Again, using the least amount of tokens. And if we run the game in the browser, we don't see much. I mean, I I don't see anything. Nothing is nothing is going on. Let's inspect the elements and we'll ask Lord to fix these issues. Okay. And now it's fixed it. I should be able to click start. And hey, we can play the game. Or can we? The frame rate is so bad. And I don't seem to be going down. Let's hold on to shift. Okay, we're going down. Wow, this is horrible frame rate. This is very bad. Yeah, this is completely unplayable. Of course, this is not the most comprehensive test, but already from this you can see there isn't a standout model. Yes, Sonet 4.5 usually runs the fastest and uses the least amount of tokens, but it didn't always have the best results. For me, GLM 4.6 would be the way to go purely because of the price. It does have the smallest context window and it's not a multimodal model, but at just $36 for the first year with a higher usage quoter than the Claude Pro plan, this is a no-brainer. Unless of course you don't want your data sent to Singapore. But let me know what you think in the comments below. Again, don't forget to subscribe.",
        "start": 459.28,
        "duration": 1105.1979999999999
    }
]