[
    {
        "text": " Wait, I just noticed the report is based on publicly available information as of January 2025. Oh no. Oh no. 2025. No, that's not what I asked for. Moonshot AI has released their newest AI model, Kimmy K2.5, and it's been all the rage this week around the internet. Some people are even going as far as saying this might be their favorite model yet. So, naturally, I had to test it out to see what the fuss is all about and determine if this really is something fresh or is it just another model that's hyped up by flashing marketing. So, that's what we're going to find out in today's video. It's going to be a lot of fun. So, let's dive into it. So, Kimmy K2.5 is the latest open-source model developed by a Chinese company called Moonshot AI. Six months ago, Richard already covered K2 in great detail, and today we are back and we're looking at what's new in K2.5. So, what's the big deal about this model? How is it different from all other thousand new models out there coming out almost daily? Well, there's two things. First of all, it claims to be really good at vision and coding. It even goes as far as labeling themselves as open-source sot. Do you realize what that means? Actually, I had to look it up myself what it means. I don't actually know. Oh, okay. So, it means stateofthe-art. Okay. Well, today I learned. So, anyway, it is full-on state-of-the-art on agentic benchmarks and vision and coding. And the second thing that stands out in this model is that it has a new functionality called agent swarm where it is capable of spinning up up to 100 sub aents and 1,500 tool calls and run them concurrently resulting in a 4.5 times faster performance. For this model, they used a new training method called parallel agent reinforcement learning or PARL. And this means that the model can self-direct the whole agent swarm by creating a trainable orchestrator agent which is basically running the show by decomposing tasks into paralyzable subtasks and is keeping an eye on all of these agents to ensure that the whole operation doesn't fall into a serial collapse which tend to happen with these multi- aent workflows. The way they solved this is by giving each sub agent rewards at separate critical step stages. And this whole system lets K2.5 achieve noticeable performance gains. So, we're definitely going to test it out. Now, I'm not going to go into too much detail about all of the different benchmarks because honestly, every video I see now is always praising these numbers, and I don't even think we can trust these numbers anymore, to be honest. They can't even line up their benchmark graphics properly. Come on. So instead, I'm going to be focusing on the two things they claim this model seems to be good at, vision and coding and the new",
        "start": 0.24,
        "duration": 350.48
    },
    {
        "text": "I don't even think we can trust these numbers anymore, to be honest. They can't even line up their benchmark graphics properly. Come on. So instead, I'm going to be focusing on the two things they claim this model seems to be good at, vision and coding and the new it up for a test. They've also got their own CLI tool called Kimmy CLI. So that's what I'm going to be using today to conduct my tests. So one of the most impressive features they claim to have is the ability to take a video recording of a UX of a particular website and replicate that in code. That's pretty impressive. So to test it out, I made a video recording of Apple's iPad Air product page with all their fancy animations and transitions. And I created a folder that contains only the file of this recording. And now I'm going to prompt K2.5 to make a promotional website for the iPad Air product based on this video. And before executing shell commands, it will ask if we want to allow it. So I'll allow it for this session. And it's now running. And this is interesting. It detected that the file was too large. So it went ahead and used ffmpeg to compress it on its own. And I was really curious to know how does this model process and understand a video file. It turns out that it takes the video file and once again it's using ffmpeg to extract key frames from the video to use as visual aid for building the website. So it took the model roughly five and a half minutes to finish the task. So, it's not the fastest model out there for sure. And mind you, I am using their own APIs to call the model, not a local version. But anyway, once that is done, we can see here that it gives us a detailed overview of what it did. So, now let's view the site itself. Oh, wow. Look at that. It really nailed the whole Apple design aesthetic. And it even created this 3D floating iPad in the middle. And it seems to be responding to mouse movements as well. That's pretty cool. Then we get this nice carousel section with different windows, but unfortunately it does not respond when I click on the dots, but it's still quite elegant. Then we get another section with some animations. Oh, and here we actually get a navigable carousel with different designs. That's pretty cool. And then we get a couple of more sections which all feel very similar to Apple's aesthetic. Honestly, this is pretty good. The fact that it was able to produce a nicel looking website with all these animations just from a reference video in a short prompt is kind of cool. All right, but Apple is a well-known brand. I'm sure the design aesthetic is definitely part of their models training data. So, this is",
        "start": 178.56,
        "duration": 635.8400000000001
    },
    {
        "text": "it was able to produce a nicel looking website with all these animations just from a reference video in a short prompt is kind of cool. All right, but Apple is a well-known brand. I'm sure the design aesthetic is definitely part of their models training data. So, this is model. Now, let's try something more interesting and a little bit quirky. I've created another folder with a single image of Mr. Birds from The Simpsons. Let's see how creative Kimmy K2.5 can get. I've added this prompt. Mr. Burns is running for president. I want you to create a presidential campaign website for Mr. Burns, which includes his policies and political agenda based on this character's traits and motivation. Let's see how that does. Once it starts the reasoning process, we can see how it thinks about the design. The asset is clear. Montgomery Burns in his signature dark green suit and peach tie. This is the key visual reference for the campaign's aesthetic. Pretty cool. And this section actually took even longer to finish. This was around 6 minutes in total. But now that that's done, again, we see a detailed overview of what was produced. And we can see here it added a vision section, a policy section, promotional materials, etc. And look at that. It even added a hidden Easter egg just for fun. Now that is super cool. Now, let's see how the website looks. Wow, look at that. Excellence in governance. I'm making this country great again for me. Oh, and there's a little nuclear button over there. What happens when I click it? Smithers, get me a coffee. That's cool. And there's even a detailed about page. And then there's prosperity. And the animations are so slick. Wow. So, I guess Kimmy K 2.5 really knows how to create punchy graphics. It's obviously a lot better than all of those purplish slop designs that we've seen other models produce. And look at that. Policies for the elite. Oh my god, there's so many good cheeky jokes here. That's amazing. Healthc care vouchers redeemable only at Burns Medical Centers. Organ transplant waiting list sorted by net wealth. Border wall made of gold. What are people saying? Okay, here we get some Simpsons character quotes and a contact form and a campaign donation page. It even added a merch shop. Okay, but that section is coming soon. Yeah, because this is a static HTML page. All right, now I want to trigger that Easter egg. How do I do that? Konami code. It says I have to input the Konami code. What is a Konami code? Oh, okay. The Konami code is a famous video game cheat code. Wow, I didn't know this. Once again, today I learned. So, it's up, up, down, down, left, right, left, right, AB. Oh, okay. There we go. We now get the big haha text over the page. And the slogan turns to excellent. That's pretty",
        "start": 324.0,
        "duration": 956.3190000000003
    },
    {
        "text": "a famous video game cheat code. Wow, I didn't know this. Once again, today I learned. So, it's up, up, down, down, left, right, left, right, AB. Oh, okay. There we go. We now get the big haha text over the page. And the slogan turns to excellent. That's pretty cool nuggets here that I'm just going to leave a link in the description for this homepage so you can check it out for yourself later. The Simpsons fans might really appreciate this. This is really impressive. Honestly, I didn't expect it to create such a fun website from just a single image and a short text prompt. All right, but now I want to try the agent swarm function everybody's been raving about. So, looking at their own examples, apparently the swarm feature is very good for tasks like gathering research for a certain topic or any action really where you want a multi-threaded approach. But to test out this feature in all of its glory, it's best to use the official Kimmy page and run it in their chatbot because they have also added a bunch of cool visual elements and animations that really makes the swarm process look very cool. You'll see that in a second. So for this test, I'm going to ask the agent swarm to gather as much information as it can about different AI models, which ones are the most used, and I'll ask K2.5 to gather all this information and consolidated in a well formatted PDF document. And also, if you do want the model to use the swarm, it is useful to ask it to do so. Because in one of my previous tests, I asked it to do a task and K2.5 concluded on its own that it didn't need to employ the swarm and gave me back some token credits. So, if you really want to activate the swarm, just be sure to let it know. All right, so let's launch our task. And as soon as it starts, we can see these cool animations Kimmy has on their chatbot interface. And this is honestly something that I've noticed Moonshot AI is very good at. They really excel at having a very playful, very gified user experience, which kind of makes the whole process of using their tools much more fun. And again, Kimmy is being cheeky here about the whole process as the model assigns the agents. And it even gives ID badges to each of them. And we can also track their task completion statuses in real time. And as the agents are completing the tasks, we can also follow their progress. On the main window, we can see the web pages they are visiting and the code that they are producing. And at this point, you can also place your bets as to which agent will complete its task the fastest. Once the agent completes the task, you can see a little bubble",
        "start": 486.319,
        "duration": 1229.5189999999996
    },
    {
        "text": "main window, we can see the web pages they are visiting and the code that they are producing. And at this point, you can also place your bets as to which agent will complete its task the fastest. Once the agent completes the task, you can see a little bubble 10 and a half minutes later, my swarm has finished the given task and we get this PDF document as a result. It appears that there's there's a text here, but I I can't quite seem to see it. Okay. So, I had to copy paste it somewhere to understand it. Okay. So, it says coding models comparative analysis. Okay. Okay. Well, very bad design choice right from the start. But okay, let's let's not jump to conclusions. Let's look at the rest of the report. Okay. We have an executive summary here. Major findings, 81% of devs use or plan to use AI. 59% of devs run three AI tools in parallel. Okay. Okay. Interesting. And we see here that Claude Code Opus 4.5 dominates the charts. And then we see market trends here. 46% of devs actively distrusts AI outputs. And wow, this is surprising. GitHub Copilot is the market leader with 42% of market share. Wow. Llama 4 Scout seems to have the largest contact window with 10 million tokens. That is pretty impressive. Okay, here comes the juicy parts. Key takeaways. Okay, let's see. No single winner. Oh, come on. How lame. 45% of AI generated code has vulnerabilities. Yeah, that is something to worry about for sure. Wait, I just noticed the report is based on publicly available information as of January 2025. Oh no. Oh no. 2025. No, that's not what I asked for. I specifically asked it for information about the currently most used models currently. Why didn't you use data from January 2026? You're absolutely right. I should have researched data from 2025 and January 2026. Typical LLM behavior. I am very disappointed in you, Kimmy. I just wasted a bunch of tokens and 10 minutes of my time for outdated information. Oh well. So, there you have it. That is Kimmy K 2.5. Despite my utter disappointment in its ability to follow orders in the last test, I still think it's a pretty good model. I wouldn't say it's groundbreaking or state-of-the-art, but it does have its upsides. I would certainly recommend it if you want to make a truly beautiful website. you know, something that you can display on awards.com, then I would definitely go with K2.5 opposed to one of the Claude Code models, for instance. And I got to be honest, the Swarm feature looks very cool and it's definitely fun to use. But did you know that you can get the same feature using Claude Code? Richard just did a great video exploring that topic, so be sure to check that video out as well. And folks, if you found this video",
        "start": 624.24,
        "duration": 1569.5990000000004
    },
    {
        "text": "feature looks very cool and it's definitely fun to use. But did you know that you can get the same feature using Claude Code? Richard just did a great video exploring that topic, so be sure to check that video out as well. And folks, if you found this video let me know by smashing that like button underneath the video. And also be sure to subscribe to our channel so you don't miss out on any of our future technical breakdown videos. This has been Andress from Better Stack and I will see you in the next videos.",
        "start": 797.04,
        "duration": 1599.1190000000004
    }
]