[
    {
        "text": " Claude Code is quickly becoming the go-to AI coding assistant for many developers and also non-developers. But it's had so many updates recently like custom status lines, background tasks, and output styles that if you're not following Boris or Cat on social media, then there is a chance you might have missed it. So, let's go through them. And before we do, make sure you hit that subscribe button. First up is creating a custom status line to add contextual information below the input prompt. Running just the status line command will try to recreate your terminal's prompt using the status line setup sub agent. You then have to close and reopen clawed code to see the updated status line. And it also updates your settings.json file. This is a good start, but what's much better is to add a prompt after the status line command, making sure the status line config is in a separate file. Note the first line of the standard out becomes the status line text and the status line code receives this structured JSON data whenever the conversation message updates and this is the result of the previous prompt. You can also add a padding value which will move the status line away from the edges. Next is background command which lets you run any bash command in the background by either pressing Ctrl +B which then shows over here or if you're lucky clause code will do it for you automatically. You can press the down arrow and enter to view the running background command or you can run the bashes command. From here we can view the standard out and because Claude can read it as well. This is useful for fixing issues or just asking questions. So if you use bun or have another way of sending browser logs to the terminal, this will save you a lot of time copying and pasting. And remember to press K to kill a background task because if you quit Claude's code without doing that, the application will still run. And then we have output styles which changes the way Claude communicates with you. This can be changed with the output style command where you can change from the default to explanatory which adds an educational insight section or learning which also adds insights but then adds these to-do human comments in the code and gives you tasks you have to complete before it continues which I guess is a nice way to keep your coding skills sharp. These basically edit Claude's default system prompts, which means you could make Claude worse at coding by replacing the default system prompts specific to coding, but you could make it better at doing other things like creative or non-fiction writing. And the documentation tells you why this is different from using the append system prompt flag agents or using custom slash commands. But you can also add a custom output style with the output style new",
        "start": 0.08,
        "duration": 298.63999999999993
    },
    {
        "text": "you could make it better at doing other things like creative or non-fiction writing. And the documentation tells you why this is different from using the append system prompt flag agents or using custom slash commands. But you can also add a custom output style with the output style new setup sub aent. Or you can just write a prompt asking Claude to create a new output style which adds a custom output style to the output styles directory meaning I can select it in clause code and now Claude uses more emojis and you can also just change the output style as a command argument. The next two updates are pretty small, so I'll go through them quite quickly, like using the permissions command to allow or deny specific tools, which you could always do in these settings. But there's also this new ask option for Claude to always ask permission before running a tool, and workspaces, which allows you to manage your added directories, and the new Opus plan mode, which uses Opus for planning mode, and Sonnet for everything else. So you can benefit from the superior reasoning of Opus 4.1 and the 1 million token context window of Claude Sonet 4. For a bonus tip, you can use the release notes command to have a look at all the new changes in your version of Claw Code. The team at Anthropic have added so many helpful features to Claw Code that I would have never thought to add myself. And I didn't even go through security reviews, PDF support, and support for multiple MCP config files. Shout out to Boris, CAD, Sid, The Reek, and everyone else for working so hard. I'm super excited to see what comes out next. Again, don't forget to subscribe for more AI news. And until next time, happy coding.",
        "start": 149.28,
        "duration": 454.721
    }
]