[
    {
        "text": " If you're developing web apps with AI agentic tools, you've probably stumbled upon this problem. The agents write code for the front end, but they can't actually see what they're writing. They're basically programming front end blindfolded. Well, Chrome just launched a new MCP server that changes the game, the Chrome DevTools MCP. It's the missing piece for agentic front-end development we've all been waiting for. In this video, I'll show you what this MCP server does, why it's such a cool, helpful tool, and we'll also try it on our own to see how it works. It's going to be a lot of fun. So, let's dive into it. So, the Chrome DevTools MCP server allows AI coding assistants to see and debug the web pages directly in Chrome. This is super powerful because now they can use the built-in Chrome dev tools to inspect the web page, run performance tests, and even debug API requests. There are many instances where this MCP can be very, very helpful. For example, you can ask the agent directly to perform a full performance audit and improve LCP, otherwise known as largest contentful paint metric. It will then open up a new Chrome instance, record a performance trace, return a detailed report of the findings, and even identify and fix potential issues which are impacting your site's performance. Now, that is pretty cool. So, let's try and run it on our own to see what it can do. For this demo purpose, I vibecoded a little app called Recommend, which lets you search for movies and TV shows based on your mood and also based on specific things you want to see. It also uses Open AI to figure out suggestions for content based on the user's mood and needs. And then it uses the watch mode API to retrieve relevant content titles. So, this is a little demo of how the app works and it's looking pretty good. But now I want to use the Chrome DevTools MCP server to run a complete performance audit on my app. So for this demo I'm using GitHub Copilot and installing it is super easy. You just need to run this single command to attach the MCP to your agent toolbox and that's it. If you're using a different Agentic framework, they also have easy instructions on how to install it on other frameworks as well. So to start our security audit, all we have to do is run this simple prompt. And if the MCP is already attached, the agent will immediately recognize that it needs to use the Chrome Dev Tools for this task. So it will open a new Chrome instance and start running the performance audit. As it's doing that, you can see what the agent is specifically measuring and at what moment. And once everything is done, you will get a detailed report of your app's performance, including the largest contentful paint, overall render time, and other additional findings.",
        "start": 0.08,
        "duration": 360.72
    },
    {
        "text": "and start running the performance audit. As it's doing that, you can see what the agent is specifically measuring and at what moment. And once everything is done, you will get a detailed report of your app's performance, including the largest contentful paint, overall render time, and other additional findings. take it a step further and ask it to measure the app's performance under certain load restrictions, like for example, using a slow 3G network. And once again, the agent will run another test using Chrome DevTools and give you a detailed report on the performance findings. Another thing we can ask it to do is to go through the entire app flow and check if the APIs are working as expected. And since this MCP server has complete control over the entire Chrome instance, it can navigate through the web page for you, perform actions, fill out forms, and do any other web automation task. So basically, you could use this tool for web automation tasks as well. And as you can see, the agent was able to successfully go through the entire flow of the app and report on its findings. And based on the results, it seems that all the APIs are working successfully. The only minor issue we have in the app is the missing fav icon, which is very minor, but it's still cool that the agent was able to detect that and report it. And lastly, I can also ask it to measure how fast would my API endpoints load under slow 3G network conditions. And as you can see, once the test is done, we once again get a nice little report about the performance findings. So there you have it. That is Chrome DevTools MCP server in a nutshell. Honestly, I think this is such a cool yet underrated tool for agentic coding. Not only can it automate web tasks, it can also help you debug console logs, failed network requests, and other things that normally an agent couldn't do unless you test it manually in the browser. So, I think this is a must-have tool in your AI agent toolbox. But what do you guys think? Have you tried this MCP? Do you like it? Will you use it? Let us know in the comments down below. And as always, folks, if you like these types of technical breakdowns, give this video a like and don't forget to subscribe to our channel as well. This has been Andress from Better Stack, and I will see you in the next videos. [Music]",
        "start": 180.56,
        "duration": 634.5799999999999
    }
]