[
    {
        "text": " Claude code is great, but we also know it's only great in the session. Anytime we pick back up, we've lost everything out of the last session. This is clawed me. It gives Claude code persistent and compressed memory across sessions while auto capturing stuff like bug fixes and decisions, then brings that context back right when we need it. All open source, no API keys. We have videos coming out all the time. Be sure to subscribe. The setup here is really quick and you can get all this from the claude mem repo. I'll assume you already have claude code installed as I do. So adding claude mem is basically two commands inside claude. First fire up claude. Then just run this command right here. After that we can install it with the command right here. Both of these I got off the repo. I'm going to restart Claude and you're done. That is claude mem right on your system. I didn't have to play around with any config files or API keys, which is a huge bonus. And here's the part I really like. It runs locally, so all this data it's capturing is staying on your machine. All right, let me actually show you all the good stuff here. It'll be quick so you can get the gist of it cuz that's what matters. We're inside a fresh project folder, just some fast API I was messing around with. But for this, we're going to make a super basic Python script just to cover the point. In the first session, I'm going to ask Claude to create a recursive Fibonacci PI file, but skip handling negative inputs. As expected, Claude generates the file and opening it, it all looks good. So now I'm going to run with this and I'm going to say I'll run it with a negative number. For obvious reasons, we get an error. So I'll just tell Claude add a value error when in is negative. Claude updates the code. I rerun it. Clean error message. The bug's fixed. Okay, now here's the thing. Claude can do that. That was super easy. While we're doing that though, Claude MEM is quietly watching in the background. It's logging what just happened. This runs completely locally on your local host. So, it's always refreshing. We can do things here like the bug, right? I can view this. I can view the fix, the reasoning, and the code diff. This is really the whole Claw mem web UI. And you can see real-time entries that are categorized. And there's our bug fixed. So now comes the real test cuz the first part is already nice. It was cool, right, to see this, but basically it's just nice looking logs. I'm going to go in here and I'm going to end the current session. I'm going to clear out my terminal and I'm going to fire back up",
        "start": 0.24,
        "duration": 302.80000000000007
    },
    {
        "text": "test cuz the first part is already nice. It was cool, right, to see this, but basically it's just nice looking logs. I'm going to go in here and I'm going to end the current session. I'm going to clear out my terminal and I'm going to fire back up I'm going to ask Claude to pick back up where we left off. Let me just ask it to recall the Fibonacci bug we fixed last time. And there it is. It's pulling in that context. Claude pulls the exact fix back without me explaining the whole story again. And I can go one step further. I can ask it to search for Fibonacci bug fix. Now I get the compressed summary. And if I expand it, I get the full context. I don't have to waste time here copying and pasting or trying to reexlain what we were doing before. It just remembers. This is huge cuz now we can enter new sessions, leave these sessions, and claude mem is running in the background to help us out. There are a lot of things here that I love that are going to help you out. First, it saves a huge amount of time, so you can stop reloading context every session. Then, it's actually pretty token efficient. Claude mem compresses memories by up to 10x, so we aren't hitting our limits as fast as we once were. Finally, you can actually find stuff. You can search memories by integrated tags that we have in Cloudme. Type things like bug fix or decision file path or keywords that pops up in our UI. That's what makes this really useful to us in these larger projects. And unlike Claude's basic memory file, this is automatic. Plus, it's open source. So, if you want to tweak it, you can. Long story short, that's Claude MEM, right? Cloud memory. Claude MEM saves us time. This is ideally a tool to speed up your workflow and save you a bunch of tokens. Try it out on your project. I think you'll immediately feel the difference.",
        "start": 154.8,
        "duration": 489.12000000000006
    }
]