[
    {
        "text": " Have you heard of Active Pieces? It's one of the fastest growing open-source automation platforms right now with almost 20,000 GitHub stars, over 100,000 active installations, and it has over 500 native integrations, built-in AI agents, and full MCP support for Clawude, Cursor, and the new wave of agent tools. This may mean that there's no need for tools like Zapier or Make.com anymore. We're going to touch on should you or should you not switch over to this for your automation. We have videos coming out all the time. Be sure to subscribe. I was scrolling around on X and I've seen some outrageous automation bills. To me, that sounds a bit crazy. So, I started digging around looking for alternatives to all these automation platforms, and I came across Active Pieces. You may never need to pay for automation again with this, but we're going to find out. It's an opensource self-hostable automation platform that works exactly like Zapier or Make.com, but you own it completely. There's no per task pricing. It's unlimited runs forever, and it's built from the ground up to be AI native. It became open- sourced under MIT and even got accepted into Y Combinator and it appears that it's been shipping weekly ever since. As of December 2025, this month, it's become the largest open-source collection of MCP servers, meaning every integration with any LLM agent is essentially one click. At least that's what they claim, amongst other things. So, I wanted to figure this out for myself. Here I am on the active pieces git repo. Now, this is a breakdown of everything, but really to get started, I just went over to documentation. Takes me to their docs page. And then when I go to install, the fastest way that I found was just using Docker. Okay, here is where you are going to pull their Docker image and run the container just to get all set up. So, super fast here. Once this is spun up, it's going to give you your own URL and take you to the active pieces landing page. Now here you can see that I already tried playing around with a few projects. but over here under new flow they actually have a boatload of templates you can choose from. Have a scroll through here. Right. Some of these we could even incorporate for us. Right. Automated keywords or topic pipeline. That's cool. LinkedIn content idea generator. Right. I can just use these templates. It spins it up and you can see how these pieces are already linked together. But we do need to drop in our information. So for example, right to send a Gmail, we just need to create that connection, but everything is actually already integrated. So for templates end to end, this is really cool with built-in AI. If if I were to go back here, I was playing around with my own pipeline, which I",
        "start": 0.32,
        "duration": 349.2
    },
    {
        "text": "example, right to send a Gmail, we just need to create that connection, but everything is actually already integrated. So for templates end to end, this is really cool with built-in AI. If if I were to go back here, I was playing around with my own pipeline, which I right? This looks exactly like Zapier. I can start off with either a web hook if we wanted to incure that or I could do something like with Gmail, right? when I receive a new email, create a connection, Gmail, and we can even add other things in here. Now, you will need an API key depending on what you're working with, right? If I do open AI, I'll have to make that connection to Open AI. I can choose the model, give it a question, and we can go through an entire funnel line, right? I could update something inside my notion, append a page, and end. Along with all that, something that active pieces does really well is that every piece automatically exposes itself as an MCP server. Now, all that really means is from claw desktop, I can paste one URL and get access to over 500 tools instantly. I don't need any of those custom plugins, no OOTH dance inside the LLM. It just works. If you actually start needing automation at scale, this can burn deep holes in your pockets. Cuz let's face it, what I've seen, Zapier at scale could easily cross five figures a year, which is insane. Active Pieces Cloud uses flat rate unlimited tasks. If you do want it running 24/7 though, you are going to need a VPS. That would be the only actual cost that we need for this. But all in all, that's it. Now, just because this appears great, I did find some drawbacks that I wasn't a huge fan of, and it appears that others aren't as well. People are actually complaining about a few different things here. For the big one, the integration count is over 500 compared to Zapier's 8,000. That is a huge gap in integration tools. Advanced enterprise governance is only available in the paid tier. So, if you're a big company, you are going to be paying for this. And then documentation for writing custom pieces is good, but it's certainly not amazing by any means. And honestly, it's a little confusing. Then finally, self-hosted cues can actually back up under 1.5 GB of RAM during spikes. Now, for most startups or independent developers, these are non-issues, but if you're trying to scale, if you have a big team or you work at a big company, this is going to become a problem and it's going to slow you down. So based on all this, I think that if you're a team and you're spending around $200 a month on automation tools already, heck, maybe you're just a dev who wants full control and zero task billing, then I think",
        "start": 179.2,
        "duration": 645.52
    },
    {
        "text": "become a problem and it's going to slow you down. So based on all this, I think that if you're a team and you're spending around $200 a month on automation tools already, heck, maybe you're just a dev who wants full control and zero task billing, then I think large enterprise or you're a big team and you require that 24/7 uptime, then this might not actually be the right choice. You still might be better off paying for an automation platform. But as an open-source tool, this is really good. Check out the repo. Give it a shot. This may save you big time if you're automating.",
        "start": 329.759,
        "duration": 684.7990000000001
    }
]