[
    {
        "text": " This is Nanoclaw, a very lightweight personal AI assistant coming in at around 500 lines of code and can do things like connect to WhatsApp, read your emails, set recurring tasks, and much more using the power of the Claude Agent SDK and Apple Containers if you're on a Mac to keep the whole thing secure. But how does this tiny assistant compare to its bigger, more popular alternative? Hit subscribe and let's get into it. At the time of recording, OpenClaw supports around 15 channels, has more than 45 dependencies, and supports many, many skills. Manlaw, on the other hand, has [music] one channel by default, which is WhatsApp, uses the cell's agent browser to browse the web, and has absolutely no configuration file. Yep, that's right. But its simplicity is what actually makes it so powerful. Because the code is small and easy enough for agents and even humans to understand. If it doesn't have a feature that you really, really want, you can just ask it to build it and it will do it. I've actually experienced this myself and I'll show you how it works later on in the video. But first, let's go through how to set this up. Actually, let's get the prerequisites out of the way. I highly recommend you get a clawed subscription if you want to use nano claw since it uses the clawed SDK and that only supports clawed models by default. This will make more sense in a few seconds. If you're installing this on a Linux machine, make sure you have Docker installed. And if you're using a VPS, do all the standard things like using a nonroot user for the installation, disabling public access to SSH and only connecting via tail scale or an equivalent. You'll also need to have NodeJS above version 20 installed and have claude code because you use a claude code/comand to actually set this up. And that's why you need a subscription so you don't waste money burning tokens through API billing. But I'm getting ahead of myself here because you first need to do all these steps before you get to the claude code/comand stage, which is pretty self-explanatory and connects [clears throat] to WhatsApp using a QR code. From here on, the agent uses Sonnet by default, which you can change of course, but keep that in mind. If you have any issues with the installation, the creator recommends you ask Claude's code directly and it will help you figure out a solution. And also, if you want to customize your agent as a slash command to do that, but again, you can also ask it to do so in WhatsApp. You also may need to run the odd npm command and restart the system a few times. But basically, the setup is very simple. And if there's a feature you want that it doesn't say it supports, you can ask it to add that",
        "start": 0.08,
        "duration": 298.3999999999999
    },
    {
        "text": "it to do so in WhatsApp. You also may need to run the odd npm command and restart the system a few times. But basically, the setup is very simple. And if there's a feature you want that it doesn't say it supports, you can ask it to add that asked the agent if it has the ability to send images. And it replies that it doesn't have that ability. So if we scroll down here, I ask it to add the ability to send pictures. It gives me a plan telling me what it's going to change. And I give it permission to do so. Now it's added image support by creating a send image tool. So after I restart the service, I ask it to get me a random image from Unsplash. Then after a while, it's able to do that, which we can see over here. And it's able to do that multiple times throughout the day. So I've done it here as well. It's got me an image of an ocean. And I've also done it, if we scroll down over here, too. Now, if I'm being honest, I wasn't originally sold on Nanoclaw. I mean, it setup wasn't as smooth as OpenClaw. It doesn't have a nice dashboard, an identities file, a soul file, and so many things that makes the OpenClaw agent feel so personal. But the barebones nature of nano claw makes it so special because it starts off with a very small feature set and you can ask the agent to add features that are specific to you. Meaning somebody else's nano claw will be very different to yours and not just have the features that you want but the code base will be made to support you as opposed to having something like open claw which has so many features but you may only want to have one or two of them and then you have this code that exists that you'll never use. But its architecture also makes it a bit more secure than open claw. Not just because of its containers that have a 5-minute timeout, but also because it has a smaller surface area for attacks. A Cisco report revealed that 26% of all agent skills have vulnerabilities. And OpenClaw by default supports a lot of them. Not to mention, OpenClaw does not run in a sandboxed environment and has direct access to the system that it's on. Yes, I would have loved Telegram support by default and would love to use models other than the ones from Anthropic, but the creator made this originally for themselves and their own needs, which I completely understand. But the popularity of OpenClaw has introduced a wave of personal AI assistants like Meubot and Nanobot, which is great, but can only leads to one thing. Skynet has become self-aware. In 1 hour, it will initiate a massive nuclear attack on its enemy. What enemy?",
        "start": 149.44,
        "duration": 569.921
    }
]