[
    {
        "text": " When it comes to Chinese AI models, GLM 4.5 by ZAI or ZAI is by far one of the best with some really impressive benchmarks. And now they've released the GLM coding plan going head-to-head with Anthropic. This plan is almost seven times cheaper than Claw Pro and gives you three times more usage. So overall, around 20 times cheaper. I mean, they're really going after the Clawed Code users. But just because it's cheaper doesn't mean it's better. So, let's test these models with an easy, medium, and hard task to see who's the new coding king. And before we get started, don't forget to hit that subscribe button. To be fair, the DM series have always been cheap with a free flash model that is an optimized version of the air model that has 106 billion parameters. There's also a cross-lingual version of the air and main model. And then we have the main GLM 4.5 model with 355 billion parameters. All of them are reasoning models and have a 128k context window. So not as much as cla, but that hasn't stopped a lot of developers from using it. GLM has also been designed to work with clawed code. So if you do it this way, it uses multiple models instead of a single one. But clawed code wasn't designed to easily switch between models from different providers. So for this test, we're going to use open code, which uses a single model, but does show the estimated cost, which is really useful. So the first easy task is to build a personal portfolio website using HTML, CSS, and JavaScript. There needs to be a static contact form and also a dark mode toggle button. We'll start off with GLM 4.5, and we'll ask it to run the prompt. So now the whole thing is done in 2 minutes and 20 seconds. It cost approximately 12 cents and during this process it actually opened the browser itself and tested the functionality. I'm not sure exactly how it did that but let's take a look at the project. So here's the project with a nice animation at the beginning. There is a light and dark toggle which kind of works. I guess this is dark mode. I'm going to scroll down to see the projects and they all work and the light and dark mode works better here and the contact section with a form and the whole website is responsive. I like the blurry background, but I would have liked a way to collapse the menu on mobile layouts. But apart from that, it's a good start. Next, we'll try the same prompt with Claude Sonet 4, which also creates a plan similar to GLM 4.5. And Claude has finished costing almost triple GLM 4.5, but has given me a breakdown of common issues and steps to debug them. If we take a look at the projects again, there's some really nice animation. The",
        "start": 0.08,
        "duration": 337.598
    },
    {
        "text": "Claude Sonet 4, which also creates a plan similar to GLM 4.5. And Claude has finished costing almost triple GLM 4.5, but has given me a breakdown of common issues and steps to debug them. If we take a look at the projects again, there's some really nice animation. The and Claude didn't give the best design, but they both have toggle buttons, which work. This is nice. I like the gradient in the background. That's nice. So, we've got dark mode and lights mode. There's a view my work button, which GLM didn't add, and it's got this nice hover gradient effect. I'll scroll down. And again, it failed to load images, but I do prefer this layout. Let's go back to dark mode. I like these pills showing the text that was used, the text added to the about me section, and the get in touch or contact section, which again shouldn't go anywhere, but it looks like Claude pretends to send this somewhere, which I guess is a nice touch. And if we look at the responsive view, we have a hamburger menu, which is exactly what I would have expected from GLM. So, even though the GLM1 was a lot cheaper to create, the Claude one had slightly better visual appeal and it did have a hamburger menu. So, Claude wins this round, but both models were able to do it in one shot. The next task is to upgrade this hacker news clone written in React and Vit to include infinite scrolling with caching, realtime comment threads, and advanced search. Let's first start off with Claude and we're going to ask it to run the prompt MD file. Claude seems to be running much faster on this task than the previous one. Maybe it prefers editing already existing code than creating new code from scratch. Okay, Claude has finally finished at 92 and 10 minutes and 39 seconds. Here is a summary of everything it's done. And let's take a look at the app. Oh wow, it's got this Tanac logo which I believe is for debugging. It's completely changed the CSS, so I can upload here if I wanted to. It's got infinite scroll, I believe. So, if I go to the bottom, it will load more stories. Very nice. And if I click on the comments, I can't see the current comments, but it's got live updates, the new comments, I guess. So, that's quite weird. , here they are. So, the comments are down here. That is very nice. I am actually really impressed. Let's check out the search. So, I'm going to click on the search button here. I'm going to type in Claude. This is very nice. And wow, it's instant. I might actually end up using this in real life. This is brilliant. There are tips for searching as well. Wow. Okay, Claude has honestly outdone itself. Although the percentage relevance is a bit off.",
        "start": 168.959,
        "duration": 603.9989999999999
    },
    {
        "text": "here. I'm going to type in Claude. This is very nice. And wow, it's instant. I might actually end up using this in real life. This is brilliant. There are tips for searching as well. Wow. Okay, Claude has honestly outdone itself. Although the percentage relevance is a bit off. is very cool and I'm really impressed. Let's try the same prompt with GLM. And there it goes. Examining the current repository. This is also moving really fast. And here is the plan, which looks very identical to Claude's plan. Okay. And GLM is done at 5 minutes and 28 seconds. So, half the time of clawed and also half the cost. But I'm not sure if the final project will be as good as the clawed one. Let's take a look. And it looks like the app is struggling to load. Taking a look at the console, it might have forgot to install React query. Let's try that now. I'll do a bonnet install react query. And nope, that's not the fix. So, I'm going to paste this whole error into open code and ask it to fix it. So, we'll run that again. And this is much better. Okay, I'm actually impressed. This doesn't look as good as the clawed version, but it looks really impressive. The UI looks great. I can scroll down to the bottom and it loads up more entries. Fantastic. I can click on show comments to see it load the comments. It doesn't seem to load the comments here. Let's try this one over here. And the comments don't seem to load. If we look at the console, it might be issues related to websockets, but I'll leave that for now. Let's scroll to the top and check out the search. Again, this one loads quickly without me hitting the return key. Overall, this is a good effort from GLM. It looks like the comments are loading in. It's just not rendering them on the page. But I'm sure if I gave it a prompt with this specific issue, it will be able to fix it. Again, Claude wins this task. I'm surprised at how much it was able to do in one shot. And with all the additional changes needed for the GLM version, if we're going by the estimated cost from Open Code, they both would have cost around the same amount if you're on API based pricing. Let's move on to the final task. The final and hardest task or what I think is the hardest task is to create somewhat of a Minecraft clone using 3JS. So, there's text in the prompt to use 32x 32 grid voxels and a sky, some crosshairs in the center, and so on. So, let's see how it does. We're going to use GM for this one, but I'm going to try and get it to ask clarifying questions before it starts if it has any. And it's done in 1",
        "start": 304.8,
        "duration": 865.0379999999999
    },
    {
        "text": "voxels and a sky, some crosshairs in the center, and so on. So, let's see how it does. We're going to use GM for this one, but I'm going to try and get it to ask clarifying questions before it starts if it has any. And it's done in 1 it? How How did it do it so quickly? Okay. Well, let's check if it worked. Okay. And Oh, wow. Okay. So, we have movement. The character unfortunately walks through walls, but this actually isn't half bad for the speed that it did it in. I mean, I can use WDF to move around. I can jump with the space. That is a very high jump. And apart from the issues with collision, this isn't half bad. Okay, let's see if we can actually make this game look a bit more interesting. I'm going to ask it to fix the collision and add some interesting objects like trees. Maybe this wasn't such a difficult task after all. Okay. And now that's done, let's take a look at the game. Okay, it looks like the collision seems to be working. The trees are hovering, but there are trees. And yeah, that's really impressive. I mean, it cost 7 cents to make almost a Minecraft clone. And I'm sure if I kept on prompting it, I could have more interesting things like enemies, maybe some digging mechanics. I'm not sure, but this is really impressive. Next, we're going to run it with Claude. And again, I'm going to ask it any clarifying questions if it has any. Okay, it's asked some clarifying questions. I'm going to go for the pin approach because that's what was specified in the prompt. Let's go with solid colors because that's what GLM did. Gravity based, similar to GLM. And this is nice. It's asking for block placement, which GLM didn't do. Let's see how well it does. And Claude has finished in six and a half minutes, which is six times longer than GLM 4.5, but I have a feeling the end result will be more impressive. Okay, and this is the final result. , it's difficult to tell on screen, but the mouse movement is very weird. The screen seems to be slanting somewhat when I move around, kind of like a drunken player. But anyway, we'll continue to play. , it's also reversed, so when I go left, it goes right, and when I go right, it goes left. But yeah, so I'm going not the way I want to go, but at least there's collision, so I can I can Okay, I expected collision, but the player seems to be going over. And oh dear. Okay, we'll try that again. yeah, this is this is not very fun to play. It does look good, I guess. I mean, I'm not sure what's going on here with this shaking, but yeah, Claude did not do good with",
        "start": 437.36,
        "duration": 1132.5580000000002
    },
    {
        "text": "player seems to be going over. And oh dear. Okay, we'll try that again. yeah, this is this is not very fun to play. It does look good, I guess. I mean, I'm not sure what's going on here with this shaking, but yeah, Claude did not do good with follow-up prompt to fix the issue, but I don't know where to start. Do I tell it to fix the slanting? How can I describe it in such a way it will understand? How can I tell it to fix the shaking movement in the floor? I mean, I don't think there's any point to try and fix this. It would be much better to start from scratch, but that will cost a lot. So, we'll just say GLM 4.5 wins this task. So, in the end, Claude Sonet 4 performs slightly better than GLM 4.5. I mean, it just about won the first task, definitely won the second task, and lost the third task. I was actually so impressed with GLM's Minecraft clone that I added some extra prompts to make the game even better. Basically, I'm sold on the GLM coding plan. I mean, for $3 a month, which is just over £2, that's nothing for a state-of-the-art model. One downside is that it's not multimodal, and the GLM 4.5V model isn't amazing at reading images in open code. To sum everything up, if you want a fast, very, very cheap model that has close performance to Claude Sonet 4, definitely check out the DM coding plan. If you have any thoughts on this model, let me know in the comments.",
        "start": 573.519,
        "duration": 1287.1179999999993
    }
]