[
    {
        "text": " This is Skills by Bell, a directory of agent skills that you can add to any agent to extend its capabilities like making it amazing at React, turning it into a front-end designer, or even making it a motion graphics editor. The whole thing works by cloning and scanning a repo to see if it has a skills MD file before installing the skill. But will Cloudflare's new proposal make this amazing resource obsolete? Hit subscribe and let's get into it. Agent skills were introduced by Anthropic last year to improve Claude's capabilities on specific tasks and works by adding a skills directory to the Claude one and then adding another directory with the name of the skill followed by a skills.md [music] file. Now, this file needs to contain a few key things for the skill to work. First, the top section which is front matter in YAML. That should contain at least the name of the skill and the description. Then below that outside of the front matter, this is where the instructions for the skill should go. The instructions get loaded into the model's context so that it can be used for the specific task. And the beauty of skills lies in a technique called progressive disclosure where only the essential information is shown at first and the model can dig in to find even more if necessary. So when an agent loads up, only the information in the front matter of each skill is loaded into the context. And after it reads a prompt, it checks the description of each skill to find out if a skill can be used to enhance the prompt. And if it finds one, it then adds everything outside of the front matter into the model's active context. You can even link other files to skills like references for a model to grab those if it thinks it's necessary. Since then, other companies like Microsoft, OpenAI, and Open Code have adopted agent skills, but there hasn't really been an easy way to install a skill for multiple agents without manually going into the relevant directory and cloning the repo. This became especially apparent when Versel wanted to share skills for their tools for people to put in their specific agent. So, they made a project called add skill, which makes it easy to add a skill to 16 different agents. simply npx add skill followed by the name of the skill or the location of the repo. Now, I know what you're thinking. What's stopping people from using add skill to add any repo? Well, the way it works is after it passes the command, it then clones the repo, then looks for a skill.md file. If it can't find it, it cleans up by removing the repo. But if it can find it, it auto detects a user's installed agents by looking through the configs. Then creates a sim link from agents/skills to wherever the skills",
        "start": 0.16,
        "duration": 322.5600000000003
    },
    {
        "text": "clones the repo, then looks for a skill.md file. If it can't find it, it cleans up by removing the repo. But if it can find it, it auto detects a user's installed agents by looking through the configs. Then creates a sim link from agents/skills to wherever the skills doc cursor for cursor and dotclaws for claude code. It also has some telemetry for tracking which I'll talk about later. But at this point, Vel had a way for people to easily install skills to any agent. But what about discovering a skill? This is where skills.sh SH comes in showing currently a long list of uncatategorized and unpadenated skills and the list gets populated I think by someone first installing a skill using ad skills or skills which kicks off the telemetry that's inside the package to add things like name agents and other information. The telemetry is completely anonymous and is not only used to populate the list, but also the amount of times a skill has been downloaded and by the specific agent, which can also be used to track the trending skills in the last 24 hours. And also, if you're worried about being tracked, you can totally disable the telemetry. It's amazing how much work the cell labs have put into skill discovery and it's being used by loads of people to discover awesome skills like react native skills for your agents best practices for better or even the super popular remotion skill which people are using to create all kinds of crazy videos just from a single prompt. But has Cloudflare's new proposal made this all for nothing? because it introduces an alternative way for agents to discover skills by first fetching a lightweight JSON file from a well-known location that lists out all the available skills a place has to offer. So you could essentially write a prompt saying build me a Cloudflare project using Wrangler and the agent will first read the prompt then check the well-known location like cloudflare.com/wwellnown of course it won't actually be wellnown it'll be something else/skills and then retrieve the index.json from that location which includes mandatory information per skill like name, description and number of files related to that skill. After that, it passes this information to the agent and then based on the prompt, the agent will realize that the wrangler skill is needed from this well-known location based on the index station file. So, it will make a call to that location to get all the files related to that skill and cache them in case they used again in a followup prompt, but use that skill for its response that it gives back to the user. So, while Cloudflare's proposal does sound really cool, it does add a few extra steps to making a skill discoverable, like adding that index.json file with the relevant information and also adding it to a well-known URL, which I'm not exactly",
        "start": 161.44,
        "duration": 642.7990000000007
    },
    {
        "text": "its response that it gives back to the user. So, while Cloudflare's proposal does sound really cool, it does add a few extra steps to making a skill discoverable, like adding that index.json file with the relevant information and also adding it to a well-known URL, which I'm not exactly putting a skill on GitHub and having it found by Vel versus this way, I think Cloudflare's approach does harm smaller developers because of all these extra steps. But if it does get accepted, and I'm not also sure who's reviewing this and who has to accept it, then it means goodbye to Vcel's Skills.sh project. However, I'm sure there is a way they could work together because you could use skill.sh to find skills from indie and lesserknown developers, and you could use Cloudflare's approach for an agent to discover a skill automatically from big companies like Cloudflare and Vel. Either way, with developers using these skills to create amazing new projects, you're going to need some error tracking in case they explode without you knowing. And this is where Better Stack comes in. Because not only does it ingest logs from your back end, it can also keep track of front-end errors using its AI native error tracking. And to top everything off, Better Stack can also create beautiful status pages. So go ahead and check out Better Stack",
        "start": 323.759,
        "duration": 765.5970000000008
    }
]