[
    {
        "text": " This is BetterFish, a multi-agent public opinion analysis system that automatically collects and processes insights from the thoughts of 1.4 billion people, analyzing videos, images, news, and private databases by web scraping. Built by a single Chinese student who has uploaded the whole thing to GitHub for free, which is crazy considering similar tools charge a lot of money. But wait, why does this project have so many disclaimers? Would it be illegal for you or me to use it? Let's find out. And before we do, don't forget to hit subscribe. [music] The name better fish is a play on words for the Chinese term where you symbolizing small but powerful. And let me tell you, having access to the opinions of billions of people is definitely something that feels very powerful. But before we get into that, let's talk about how this project actually works. So when a user types in a query, it goes to a Python Flask Orchestrator application which sends it to three different agents that work simultaneously. An insight agent that generates SQL queries to go through private databases, a media agent that analyzes images and videos using Playright, and a query agent that searches for news and web content. The images shown here like deepseek, Gemini attack GPT and Kimmy for these agents don't really matter. In fact, any model can be used for these agents and this can be set in the configuration in the background. Even before a user types in a query, a media crawler scrapes lots of Chinese social media platforms like Tik Tok, Wayboo, and Zoo. then populates a MySQL or Postgress database with those results giving each post a hotness score as well as doing some sentiment analysis [music] which all the agents can use to get information from. But the agent forum down here is really cool because here agents debate and discuss their findings and the whole thing is moderated by an LLM to guide the discussion and ensure a productive debate. That is truly mind-blowing. Then all the data gets sent to a report agent that generates a comprehensive final report. Let's see all of this in action. So here I'm using a hetner cax 31 server to set better fish up using docker and I'm using open router to supply the agents with the relevant models. So with everything up and running, I can add a query like what do the Chinese media really think of Donald Trump and hit start to see the agents working. We can see logs from the insight engine, the query engine, but the media engine shows an error saying it's missing the Bcker web search API key. And that's because unfortunately I haven't been able to get a Bcker web API key because you need WeChat to sign up, which I currently don't have. And because the report engine needs to wait for all the other three agents to finish their work, we",
        "start": 0.16,
        "duration": 361.8389999999999
    },
    {
        "text": "web search API key. And that's because unfortunately I haven't been able to get a Bcker web API key because you need WeChat to sign up, which I currently don't have. And because the report engine needs to wait for all the other three agents to finish their work, we have an idea on how to get reports, which I'll show you later on in the video. For now, we can see the forum engine is getting information from the query and insights engine. And in the yellow boxes, we can see the forum moderators summary, which I've had to pause because websockets will keep dragging this down. But here, it's summarizing all the previous information from the query and insight engine and addressing any varying opinions from the agents if they have any. Once the agent has finished, [music] you get a nice summary here. And because of the media agent issue, even though the query engine and the insight engine have finished, I'm still not able to get any reports. So, I'm going to get all this information from the forum engine and put it into Gemini 3 to do the report generation. But I've got to admit, some of the data is really funny. Like, dear aunties and grandmas, soybean oil is already 105 y a barrel. The team leader said that only cash is accepted. and middle-aged and elderly WeChat users forwarded the soybean price link 987,000 times. I honestly had no idea soybean price was such a big deal in China. And here we have a report showing what the Chinese people really think of Donald Trump. And it looks like soybeans plays a big part, especially in the elderly population. I've also created a report for what Chinese people think of Marvel films. And for some reason, Zootopia 2 is here, but basically they prefer their own films. And one for the Chinese people, think of Apple, which is not positive purely because of the defective batteries. I'll have links to all of these sites in the description below. It's amazing that I can get this level of detailed sentiment analysis from so many places, all completely for free. [music] But now, let's talk about why there are so many disclaimers on the readme. Well, BetterFish uses web scraping technology with its own mind spider scraper to get information that could potentially violate Chinese or most other countries personal information protection laws. So, this data could be used maliciously for fishing attacks or to amplify misinformation, not to mention the real-time monitoring and prediction ability of better fish that could be used to do so much damage. But despite all the risks and potential scares, I think this is a really exciting project. I mean, it doesn't have over 30k stars on GitHub for nothing. Right now, its focus is on Chinese social media, but I don't see why this can't be used to get data from American social media sites",
        "start": 181.44,
        "duration": 660.3989999999999
    },
    {
        "text": "risks and potential scares, I think this is a really exciting project. I mean, it doesn't have over 30k stars on GitHub for nothing. Right now, its focus is on Chinese social media, but I don't see why this can't be used to get data from American social media sites even be used in other industries like finance or healthcare, which actually gives me an idea for a potential business. But anyway, what do you think of better fish? Let me know in the comments. Again, don't forget to subscribe. And until next time, happy coding.",
        "start": 332.639,
        "duration": 693.3589999999999
    }
]