[
    {
        "text": " Please welcome our moderator, Chelsea Sumar, Nvidia healthcare startups lead for the Americas. Chelsea, thank you. [applause and cheering] All right, welcome everyone. Happy GTC. This is a full room. We're excited. Yeah. Oh, come on. I think you guys can do better than that. Awesome. Awesome. Awesome. Well, we are here. We're going to get started. We're going to have a seat. We're not going to stand in front of you all day. , but we're going to have a wonderful panel. , we're super excited to talk to you. We're super excited that you're here for GTC. And I've got a great, great, great group of people with me on stage today. So, we are going to get started. We're going to get started. So, welcome. As John mentioned, I'm Dr. Chelsea Sner and you are sitting in this session to learn a lot more and to be talking about the revolution that is happening right now , in healthcare and AI. I'm honored to moderate this discussion and I get to be to tell you more about our inception partners who've joined me on stage today. They're experts in their field. but we have with us we've got five or five of us total but four great panelists. I've got Aleandro with me who is the founder and CEO of Therapy Side. It's an AI driven mental health platform. I've got Con de D Cruz and I'm getting my words out today. Con de Cruz with me who is the CEO and founder of super luminal medicines and I have Davidid here who is the chief technology officer for item leading the development of LAA the AI pilot for veterinarians and I've got Dr. Shai Shenor who is a systems biologist and co-founder and chief scientist at Caiter Reason. So you're going to hear from them today and they're going to tell you so many amazing and great things. , so I won't be labored a point, but what we're going to do to get started, we've got three big themes that we're going to talk about. Create, cure, and care. And I'm going to get the juices flowing. So, we're going to start off with a quick round robin that each of them will answer before we dive into each of our key themes. So, I'm going to start with Aleandro. If you will tell me, if there was one innovative solution that you could implement tomorrow, what would it be and why? Yeah, thanks Jesse. Nice to meet all of you. I would create an AI powered ecosystem where basically therapists would have access to both the therapy session information as well as other real world data like it could be those coming from wearables or face recognition or even like mood trackers, daily mood trackers. , I believe that something like this would allow therapists to have a much better understanding of the well-being of their patient and offer a much more tailor and",
        "start": 0.16,
        "duration": 336.561
    },
    {
        "text": "world data like it could be those coming from wearables or face recognition or even like mood trackers, daily mood trackers. , I believe that something like this would allow therapists to have a much better understanding of the well-being of their patient and offer a much more tailor and And I don't think the barrier today is technological anymore. I think it's much more a psychological barrier which is let's say sometime the fear is keeping us away from doing that. So yeah, thank you. Wow. So firstly, thank you for Nvidia. They're it's been awesome to be obviously part of this so far. They're an investors for full disclosure and we thoroughly enjoy being part of the ecosystem. But just building off what Aleandro says, I think it is fear. Now from my particular aspect in drug discovery and development, the lack of progress from implementation of AI is really data limitation. We're faced with an extraordinary amount of siloed information that's not shared. So the big innovative idea to actually all of us are those of us who can make an impact is why don't we share data associated with pre-competitive aspects or maybe stalled projects and here I'm talking about particularly things that haven't worked that are associated with we'd call adx. So these are how a drug enters the body gets distributed gets broken down and excreted. We now test this these drugs multiply on in animal models which really don't represent all the time what how a drug behaves in the body. We've cured lots of rats and mice and even dogs of Alzheimer's and cancer but haven't made the same impact on humans. So what I'd like to be able to do in this great vision is to share all that preclinical non-competitive information and maybe Nvidia can be the honest broker here. What we need is a particular compound structure tied to the data that we can build models on. And that's all we're asking. We'd be open to share that information because again, we're here to develop new therapies that can benefit all of us. And we're limited by the access to data. The juices are flowing. The juices are flowing. [laughter and gasps] David question. Okay. Thank you all to be here. Thank you for invitation and thank you Connie for taking a bit of my answer. Actually [laughter] I mean I want to expand from that they are important also the platform to make the modeling from let me say genome to the entire organism having a sort of digital twin for that will be an amazing piece of of engineering because with having that you can enable very precise medicine because you can maybe I don't know you can make a biopsy of a cancer tissue biopsy of a healthy one you can run on the cheap let me say whatever kind of different compound and you will find a solution that is targeted for the",
        "start": 168.0,
        "duration": 648.8010000000002
    },
    {
        "text": "enable very precise medicine because you can maybe I don't know you can make a biopsy of a cancer tissue biopsy of a healthy one you can run on the cheap let me say whatever kind of different compound and you will find a solution that is targeted for the if I can snap the finger and find it on my table. Maybe that one will be one piece of engineering that I would like to snap make it happen. [laughter] So well I I'll connect to the fear point that was raised by Alessandro and Cody. I I personally believe that the technology is no longer the problem. Of course, we haven't solved everything and we haven't cured cancer. even in mice, you know, it's questionable, but but if you're looking at the rate that technology is moving, as well as just data availability, it's exploding and and pharma companies are starting to upload that data into organized structures, which means that they're one step closer to sharing it and so forth. There's the commercial incentives to do so. So, the limiting factor in my in my feeling around this is actually much more on the human side. So you know there's that statement that you know the way that fields advance I think the joke is on physics is one funeral at a time right and and so if you're looking what is it that's stopping drug development from changing rapidly it's it's really the humans involved in this and understanding their incentives understanding the economics of this so if I had to do one innovation was actually to get a lot of health economists interested in drug development and organiz ganizational behavior of people and plant them within organizations in a way that ultimately the the fear is no longer the barrier. Of course, not the revolution is going to happen all places simultaneously. but but ultimately, if I'm looking right now, there's a there's going to be a first mover advantage for companies are actually recognizing where AI can start playing a role in drug development, not just in the more commercial lens. , and those companies that are managing to overcome the organizational , kind of I guess incentives and structures are I think are going to win out. All right. , I guess we're looking for any health economics in the room and just see, you know, come talk to me. [laughter] Darn. I don't I didn't see any hands raised, so sorry about that, Shai. This is exactly the problem, [laughter] right? They're not coming. We need more. We need more. , but now that we've gotten a little bit warmed up and got the juices flowing, I want to kind of kick us off into some specific questions. , we just as a reminder to you guys, as I mentioned earlier, we're going to talk about create, cure, and care. And so the first one being create",
        "start": 327.12,
        "duration": 937.4420000000005
    },
    {
        "text": "little bit warmed up and got the juices flowing, I want to kind of kick us off into some specific questions. , we just as a reminder to you guys, as I mentioned earlier, we're going to talk about create, cure, and care. And so the first one being create means is like how are you leveraging AI to build your solutions and integrate to make healthier patients because at the end of the day every single one of us is in this room will be and our patients. so we know generative AI is everywhere. We know u that that what really sets it apart in health care is how it's being integrated. so my first question is for shy and debday. I on what unique capabilities have you seen with your technology and what does it bring to your field? So I'll start off with Shai if you will start. Sure. So so I guess the way we've approached this problem is actually from I think top down. What's the biggest problem today in drug development? I think the the two biggest places is a we don't understand the biology and b we are way more diverse as a population than we would like to think. So we're not mice. and and where does this come together? Well, ultimately it comes down in in phase two trials because in phase two that's testing efficacy and on this book disease biology understanding in the first place where we start seeing population diversity and drugs fail that that is the biggest place that failure exists and it's already an expensive failure. So from our perspective what we set out to do is to try and solve this problem of improving the probability of phase 2 success. Now solving it one time is not really changing the industry because the issue is that you're always thinking about phase two. You think about this when you're thinking about just choosing your first targets. You're thinking about once you've had a successful drug you're and you're like to think about where you're going to expand to new indications. So you're constantly needing to think about the disease biology and population diversity and in every decision that you make. So you need to build a platform that ultimately gives you scale to make thousands of decisions across all your drug portfolio all the time. and that basically is moving from what I would call an art data science and computational biology as an art. Oh, give me the data. I'll play a bit. Maybe we got a result and push it on to how do you bring the best insights from data, molecular level data for every one of those decisions so that your phase 2 success becomes better. And AI here plays a huge role, right? Because what you're talking about is the richness of biology, all the multiple layers, multimodal layers that describe ultimately what I think of as a tissue",
        "start": 474.879,
        "duration": 1223.5199999999995
    },
    {
        "text": "level data for every one of those decisions so that your phase 2 success becomes better. And AI here plays a huge role, right? Because what you're talking about is the richness of biology, all the multiple layers, multimodal layers that describe ultimately what I think of as a tissue body. overlay that with all the drugs that exist. So the drug that I'm thinking about developing, but also all the competitive landscape, the things are already out there and the and the things that are going to be coming out before I finish my trials, right? and estimating this in at the level of populations and so forth. So that's kind of the challenge we've been able kind of been tackling on and AI in this respect is basically coming in and Nvidia in particular also an investor for disclaimer they are is actually in in doing multi-modal integration and inference at a scale that allows you to do this very rapidly. So, we're not there at real time yet, but you'd like to get to a point where every decision quickly can bring you the latest molecular level information. Just like today when you navigate with your phone, you drive, right? The information is there real time and you're using it to make important decisions. Should be the same for biology. You want to take a guess at how long how long it's going to take us to get there? I don't really care how long it's going to take us as long as we continuously improve. And and and I think the important point here and I'd love to hear what our panelist other panelists think about this is it it's almost a fundamental shift between thinking about investing AI in a single drug, right? I'm I'm going to take my entire company and put all my AI to make you know to make the drug as Cody was saying between you know all the different silos and 5% across all the drugs AI across all the drugs in my portfolio 7% 8% 10% you know doesn't matter as long as I I can do this and continuously show the improvement right ultimately drug development is still unfortunately an extreme failure business most times we fail and it's going to take us a huge amount of time to be able to kind show that AI is changing the percent success rate and so that's why with side reasons we elected to build kind of a a cutting edge platform that brings the AI across the board in all the decisions. Yeah. Awesome. Davidid I know I'm going to ask this question too but I also want to give the disclaimer for our audience. you know everyone I know got a pet during the pandemic. [laughter] Yeah. which makes the work that you guys are doing even more important. I'm the one that is not on the human but I'm the one that is on veterinary.",
        "start": 620.399,
        "duration": 1503.6809999999994
    },
    {
        "text": "want to give the disclaimer for our audience. you know everyone I know got a pet during the pandemic. [laughter] Yeah. which makes the work that you guys are doing even more important. I'm the one that is not on the human but I'm the one that is on veterinary. will explain. Absolutely. What we bring into the veterinary space with our AI that is built on on top of all the all the stuff from Nvidia is a solution that allowed the veterinarian to reduce the pressure on them and to rise their efficiency. Let me let me explain. Maybe nobody knows or lot no not many doesn't know that veterinarian are really much challenged by the their their domain and they are very under stressed has been estimate that veterinarians have four time probability to commit suicide wow because of that this CDC investigation and what we do is with like eyes to support them in all the stuff that they do during the day not just providing them clinical advice so they can basically upload the data and like IA will answer anything about them but also providing them suggestions but also just confirm what they already know that can be helpful for them and also this is something that we discovered that was not intended but we discovered when we tried it is that they don't know much how to communicate with the pet owners and so what they are really much asking to to Leica is how can I say is to the to the owners. Maybe it's a bad news or maybe it's just okay, how can I educate and so this is really what like a bring into a field that is somehow a bit outside of the innovation of AI but we are bringing it into it because really they need it. I mean it's really an application of AI that is a winning everybody application. Yeah. Okay. So it's really that that what we are bringing into the table of of Yeah. We I would say again patients we again can think about every single one of us but when we think about creating an AI innovation it it extends to our our our pets that are extended family as well for the family. Definitely definitely in the end is not much different. Yes. Not much different from medical and also from emotional point of view. Absolutely. Absolutely. , but I I want to keep talking a little bit more again about this idea of create. , and I want to ask Con a question here. , before we move on to our cure theme. , I know Super Luminal has integrated generative generative AI with deep biology and chemistry to revolutionize drug discovery, but can you share the tools and platforms that you all have developed in a little bit more detail as well? Yeah. So [clears throat] revolutionized biology is a bit you know we have to do",
        "start": 763.04,
        "duration": 1808.4809999999995
    },
    {
        "text": "has integrated generative generative AI with deep biology and chemistry to revolutionize drug discovery, but can you share the tools and platforms that you all have developed in a little bit more detail as well? Yeah. So [clears throat] revolutionized biology is a bit you know we have to do and just building off when I first heard about this panel I thought this is going to be really diverse how are we going to tie it all in but you've seen already the themes are very much common it's about data it's about scale it's about access to these various tools and Nvidia is obviously making that very convenient and easy to use for us but essentially what we've done is [clears throat] we start with biology and chemistry First it's you look for the solutions that can enhance drug discovery from that perspective rather than see that AI can solve all the problems because you obviously you need a key domain of applicability etc. So we figure out which aspects of drug discovery in particular can be facilitated by the use of machine learning AI or or computational chemistry or biology and then we deploy those tools appropriately. We've been fortunate in what we've selected seems to have worked. So we started in 2023 in a live fire situation and we're in our first nomination of an internal development candidate. So that means going into animal studies as we speak. So we believe that we're moving pretty rapidly. And so what's enabled us to do that is essentially scalability and using machine learning tools across the paradigm of drug discovery. And I'll just point out a few things and then you can tell me to move on to Alessandro who's probably got more interesting things to say. Essentially, okay, we look at proteins not as static like you see in pictures in a book, but they are constantly dynamic. They're being influenced by the environment constantly, water, [clears throat] pressures within the cell, electrostatic forces, etc. But it's really challenging to do that as a full motion. So, typically drug discovery looks at a static picture and tries to figure out how to interfere with that protein. If it's an enzyme that's causing the disease maybe to stop block it in some way. So you have an inhibitor locks into orthosteric site or the binding site and it stops the activity. Well, that's not how proteins work. They're constantly moving. So you got to figure out which confirmation that's appropriate. Well, we use tools such as scalability in AI to actually investigate every possible confirmation that protein could adopt and interrogate that with every single possible small compound, small molecule compound that could possibly exist. Now, you've got all these various confirmations. You've got potentially 7.8 trillion compounds that you could make. It's quite a big order, but you use machine learning to be able to and generative AI to triage that to a",
        "start": 916.24,
        "duration": 2105.121
    },
    {
        "text": "single possible small compound, small molecule compound that could possibly exist. Now, you've got all these various confirmations. You've got potentially 7.8 trillion compounds that you could make. It's quite a big order, but you use machine learning to be able to and generative AI to triage that to a screen. So that's what we do. We investigate vast chemical libraries against multiple protein confirmations and then identify drugs or potential drugs that we think are going to be suitable. And then linked to that is the ability to think about that compound as having some type of liability. As Shia mentioned, unfortunately, the majority of failures you take through right into the clinic and it fails at phase two, which is a very very expensive prospect. What we try and do is build predictive models right from the start that enable our medicinal chemists and biologists to understand some of those liabilities from the beginning so that obviously hopefully we can reduce some of the bad actors in terms of compounds we take forward. And that's essentially it. Yeah. Awesome. , we we've heard a a variety of different things, but as Con mentioned, just when we think about creating what new medications in pharmacy, we always say the right dose, the right patient, right time. , and as you can see, there's a lot of steps before we can get to what our next theme is, cure. , we know that there's a lot of pieces to that puzzle and there's a lot of steps in the process to it, but I really do want to talk about how do we get to what maybe that next step, but how do you tailor individualized treatment approaches , and really get to kind of the closer to the cure aspect. So, Alisandre, I'm going to go to you for this one. , most people don't really associate mental health as being a huge part of our overall health about what is a sick person versus a healthy person, but you guys are working on that at therapy side. can you share a little bit more about how your technology in particular is providing more adaptable and effective support to better meet the needs? Yeah, sure. Thanks Chelsea. So so first of all we in therapy side we've built a technology for therapist. So for the day-to-day right interaction with the patients so they can do basic things like manage the schedule payments but also do video session they have a chat with their patient they can share clinical questionnaires etc. So before explaining you what we did and why we did that is I I wanted to start with how we see AI being applied to to mental health as of now. we're always seeing as something that should be focused to the therapist right now not to directly to the patients. So it's it's something that empower therapist in providing a better care",
        "start": 1068.24,
        "duration": 2397.7599999999993
    },
    {
        "text": "I wanted to start with how we see AI being applied to to mental health as of now. we're always seeing as something that should be focused to the therapist right now not to directly to the patients. So it's it's something that empower therapist in providing a better care our efforts until now have been focused on the therapist again which is our client and and of course the patients are benefiting and I'll explain you why I think first first of all the therapists that are using therapy side they get a better and faster access to the patient information and why I'm saying this That's because we all all the session that happen via therapy side h they can be transcribed. So you don't need to note take anymore. So you can fully focus on the session with your patient and at the end of the session you already have the full session being stored in the database and we run it through an LLM and we automatically generate a session recap for for the therapist. And so that's also great, right? You you you imagine like you're you're having a session with with your therapist and and and your therapist having a session with you and he can just fully focus on on on that. So once we have this we have used the rugs or retrieval augmented generation and we've created a a chatbot which is called Maya and this chatbot speaks with the with the therapist and the therapist can ask any information about the past sessions with the patient and can also like help you organize the future sessions for example can or or can play as like a clinical supervisor for the therapist. It can be also adapted to specific therapeutic school like it could be CBT or or any other school that that our therapists are are are are from. so I think this is what is allowing you to deliver a much better care much more personalized to your patients. So that's the first part and then I think the second part is we took Maya and we are evolving it to an AI agent. So what is this doing is taking away all the admin task from the therapist so they can again fully focus on care they don't need to take care anymore about scheduling session managing the payments so via the tool calling of the AI agent we can we can get to that we also want to bring Maya to the edge hope hopefully soon [snorts] and and and yet like long story short this is allowing therapists to establish a much better therapeutic alliance with their clients and and get a much more engaged patient and better results. We don't love AI agents at NVIDIA, but no, just kidding. We'd love to hear that that's how people are getting that more personalized approach to care because it is so important. Again, we",
        "start": 1216.4,
        "duration": 2722.5609999999997
    },
    {
        "text": "therapeutic alliance with their clients and and get a much more engaged patient and better results. We don't love AI agents at NVIDIA, but no, just kidding. We'd love to hear that that's how people are getting that more personalized approach to care because it is so important. Again, we personalization, that individualized approach to be able to really feel that people are getting their needs taken care of. we can't just talk about approaches, we also have to talk about breakthroughs. So I want to give an opportunity to con and shy to share a little bit more about recent AI breakthroughs from your perspective. So Con I'll start with you. It's [clears throat] it's really the power of scalability. When we first started this is end of 2022 with our first protein that we wanted to interrogate from start to finish. That means when we tried to model these various confirmations to actually getting compounds of interest took us about 3 months and that was just in one process and we had to go through multiple processes to actually identify interesting compounds. Late last year we kicked off the latest program and the same process took us 24 hours. Wow. Okay. So think about that. Yeah. Three month saving. Now again this is just the workflow on the technology side that's modeling the confirmations excuse me doing the virtual screening to identify the compounds and then getting them synthesized but that's the kind of scale up you can require we still push the problems downstream but if you can go through more cycles per unit time you're going to get better and better molecules out the process so to share with you thank you yeah similarly scale I think is the is the key word of the day so with with our case you know I The way I think about the problem we're trying to solve is is how do you leverage get more bang for the buck from data. Data has been exploding exponentially in biology and also in other fields. insight does not grow at the same rate say grows linearly. So percent of data utilized every day drops right. and and that actually is a problem for a field that relies on data to generate insight is that you know it's it's I'm generating huge amounts of data but I'm not managing to get the value out. So when side reason started back in 2016, the amount of data we had at the time and the amount of data we have right now is is orders of magnitude. Just as an example, I don't know if people know in the past two months, the amount of single cell molecular data in the world tripled. Wow. Right. Tripled. So so you know and we're still we have people sitting manually and digesting one data set at a time trying to make sense of that, right? So, so in many respects, data is of course",
        "start": 1381.36,
        "duration": 3012.721
    },
    {
        "text": "the amount of single cell molecular data in the world tripled. Wow. Right. Tripled. So so you know and we're still we have people sitting manually and digesting one data set at a time trying to make sense of that, right? So, so in many respects, data is of course to a point where it's going to become a commodity. , and and and I I actually suspect no one will own the entire data landscape because it's just too rich. Too many data types, too many population diversity to be handling, right? So in that so so for cider reason it's building a platform that's supposed to get the bang for the buck from data get scalability of insight for phase 2 predictions for phase two probability of success for guiding use cases such as prioritizing targets or prioritizing indications or prioritizing subopuls overcoming the data insight gap is fundamental for our business right so this is an example where Nvidia and AI comes in because you know we're processing single cell data using kind of standard CPUs and implemented with Nvidia a whole pipeline that actually does this with GPUs and we got 30x scalability on this right and it allowed us suddenly to bring in way more single cell data and additional data types that we've been kind of bringing in and with that more data availability suddenly things like inference on missing information because biology data always sucks right it's always partial there's is always sparse or the experiment is just measuring these types of this type of condition but not really the one next to it that you're interested in. So you need a lot of inference, right? So using that kind of data ingestion pipeline that are now much faster, we were able to to start making inferences on subopuls and identify subopuls datadriven way subopuls in chronic diseases that were not identifiable before validate them and suddenly target priorization at the earliest stage of thinking about targets. When you're prioritizing thinking about drugs, when you're prioritizing targets, we have our our pharma customers thinking at that stage already which subop this would work for and and which it would not. Now whether they make it ultimately so that the phase 2 is going to be for the entire for for the entire population or only a subop that remains to to be seen. As I said, health economics, , people are needed in this space and and people, you know, we're still, it's still a failure business, right? But having that knowledge where I can think about precision medicine, not necessarily yet as a means where I'm only going to develop the drug for a small population, but actually I've looked at the subopuls, I've identified them, I've validated them, I've looked at them, and now I'm designing a drug that overcomes the diversity in the population, right? Is is a place where we're going. And this is basically a",
        "start": 1528.24,
        "duration": 3321.0400000000022
    },
    {
        "text": "develop the drug for a small population, but actually I've looked at the subopuls, I've identified them, I've validated them, I've looked at them, and now I'm designing a drug that overcomes the diversity in the population, right? Is is a place where we're going. And this is basically a achieve now with with AI. That's awesome. I don't know about you guys, but that's exciting for me and exciting to hear about these different these different breakthroughs. Again, the approaches that we think about again when we're looking at patients as a as a totality and how we are not just going from create, but how do we get to cure the approaches and the breakthroughs are really important to we get to that last piece of care. you want to have the whole reason for this is that you don't want to spend all these times in clinical trials and you don't want to spend all this time trying to get to a a drug or a therapy that may not work. Again, the failure rate is already so high. But really, again, behind all of these different things are people. They're patients. They're you and I, your family members. And when we think about that last piece or this last theme that we're going to talk about today of care, why do we do it? That's why we do it. We do it for these, we do it for us. So, super excited to kind of bring us to the last theme. , and we've heard about the approaches and the breakthroughs. , and of course, what does this really mean to how is it impacting patient lives and how do we partner to do this to make it a reality? Because I think that's the last piece. It does take collaboration. It's going to take everyone in this room to be able to get to this to get it all together, right? so to round out this theme I want to start with Davidid. can you share an example of a successful collaboration for item and other stakeholders and that you leveraged to be able to make this happen and just kind of what led to the creation? Yeah, thank you for the question. I mean we have a fundamental problem. None of us you read my introduction none of us was was a vet. Okay. So when we started to develop we really need to have firsthand experience of what is really does it really mean to be a vet. Mhm. And so we started by engaging during the beta more than 100 clinic and hospital in Italy for obvious reason. and we really engage with them getting feedbacks what how is going not just about the performance but also about the tone of voice how they are going to use the stuff. That was the moment where the communication cames out as a as a as a fact something that they need for and",
        "start": 1684.88,
        "duration": 3594.401000000002
    },
    {
        "text": "with them getting feedbacks what how is going not just about the performance but also about the tone of voice how they are going to use the stuff. That was the moment where the communication cames out as a as a as a fact something that they need for and collaboration that we had. So really with with the one that are going to use then we need to stay up to date with the veterinary science that is not so static as it seems. really lot of research and development apart from the one that is used to cure the cancer of the of the mice but there is also a lot of advancement in the in the in the small animal okay the one that are with us and so with this we have we we we enjoy the collaboration with main university okay in the Europe just to say two of them one is the university of sur in in the United Kingdom with which we are part of VI with what So we can have firsthand with research, we can have the firstand with really the new advancement in the science and we also collaborate with the University of Saser that is in Sardinia in Italy where we are co-developing a validation protocol that can change the standard in the field of veterinarian for this kind of tools. Then of course we have also other stakeholders because the the ecosystem is contains lot of different the other one is for example the software that manage already the data of the patient that is let me say is not so keen to innovation but is important that we integrate also with them. So we are closing lot of agreement with them. we are integrating such that also we reduce the let me say u mental workload of the vets that doesn't have to switch between different tools and also we have first access to the data and last of course there is the technology partnership of course I mean I cannot mentioned without Nvidia but we also have others like scaleway or other company that help us in developing like yeah it it takes a team yeah [laughter] takes a team it is a collective effort it's a collective it's a collective for Sure. just to round this out, Allesandro, can you share how your AIdriven tools have ultimately led to improving the level of care for patients? Yeah, sure. I think that was like one of the question we were asking oursel when we were setting up this project and developing the tools and looking back like what we generated is both is both like an impact on the quantity of and the quality of therapy that has been delivered via therapy side. So when I talk about quantity, therapists can save up to 20 minutes per session when using our technology. So this basically allow them to increase their patient",
        "start": 1822.32,
        "duration": 3896.4020000000028
    },
    {
        "text": "both is both like an impact on the quantity of and the quality of therapy that has been delivered via therapy side. So when I talk about quantity, therapists can save up to 20 minutes per session when using our technology. So this basically allow them to increase their patient that you can expand your reach and and and reach many more clients, right? especially in a situation like the one that we have in Europe where like if we look at one of the markets the biggest market that we have is Spain and in Spain we have five therapist every 100,000 inhabitants and whereas the target that is being set at a European level is 15 to 20 therapist so again we're running out of therapist if you use our technology you can get many more patients right so that's why I'm talking about quantity and then if we look at quality. we always look at when we look at retention metrics as well as release metrics and focusing on on on retention for example as you're focusing much more on the care of your patients and this has an impact on the second visit return of your patients. For example, there are some therapists that after using our technology have increased that ratio up to 50%. And so it means that if before you were seeing four patients and at the second visit only two of them were showing up right now right now you you get one more. So you decrease much more your your acquisition cost with your patients, right? and that's great. And and then if we look at the release metrics, which is when the patient ends the therapy, NPS is we see that it's pretty much skyrocketing after using this AI tools, right? So, so if before you were like having we look at the same therapies before AI and after AI if you had an MPS of 60 to 70% right now you can easily achieve 90% and why just because your patient can feel this this better attention that you're giving them and and yeah so that's that's really going to the bottom line and and and touching the data and that's that's I think amazing what we have achieved. Yeah, absolutely. I I hope you guys have been able to appreciate the different and the variety of perspectives that we've we've talked through today. and I just think that as we continue to solve these problems together, what I heard from today is really if we want to create innovation has to be scalable. , if we want to cure, we've got to have data and that data has to to get out so that we can we make it sharable. We make it able to everyone to be able to collaborate because that is how we show we care. So, , I want to round us out. We don't have an official Q&A, but I thought it",
        "start": 1975.36,
        "duration": 4216.321000000004
    },
    {
        "text": "has to to get out so that we can we make it sharable. We make it able to everyone to be able to collaborate because that is how we show we care. So, , I want to round us out. We don't have an official Q&A, but I thought it lightning session. , this AI this or that. So, I'm going to ask our panelists five or so questions. there is no wrong answers. so they are just going to answer and if it sparks any discussions for you guys afterwards I hope you'll come up and chat with them and a and ask them some questions. and before we wrap up before I ask these last couple questions I want to say a special thank you to each of you. these are our inception partners and so we take our NVIDIA inception partners very very seriously. there's a QR code for you to be able to explore, but the opportunity that they have to be here to lead innovation and to be experts in their field really come from our collaboration and our ability to collaborate together through our inception program. And so just a special thank you for each of you being with me today. So I will round us out you guys. Here are our five questions. lightning round really quickly. So AI generated drug discovery or AI optimized clinical trials. So we'll start and we'll go this way. [laughter] Clinical trial one. Yeah. Okay. Clinical trials. Clinical trials. Generate. I generate a drug. Just a [laughter] change. Okay. I tended to say both but I'll say both. Why? [laughter] Why one? Why one? It's one or the other. Now we are forced to say one. I mean [laughter] discovery. We've got precision medicine or AI enhanced drug repurposing. We'll go this way. Oh, that's a difficult one. , I'll go with repurposing. Okay. But at a sub population level. Okay. The specifics. [clears throat] Precision medicine. Okay. Repurposing. Okay. Precision as well. Oh, we're split. It's split. I really We We'll have to talk about this offline, guys. [laughter] , AI powered mental health support or AI for chronic disease management. AI powered mental health. [laughter] I kind of had I'm with I'm with Alisandra. The mental one. Okay. [laughter] We're all in support of We're all in support of Alisandre. Okay. More AI in drug development or more AI in patient therapy matching? , in drug development. Okay. That will solve the matching issue. Matchmaking. All right. Matching. All right. Management. Okay. Last question. Human centric AI or fully automated AI healthcare systems? Human center AI. Human. When it comes to decision, human. Vote team human. [laughter] Team human. Team human. All right. Well, there you got it, folks. , thank you so much. We appreciate you joining us in our session today. , we hope that you'll connect with us and we thank you. Enjoy GTC. Thank you. Thank you, Chelsea.",
        "start": 2139.599,
        "duration": 4552.242000000004
    }
]