[
    {
        "text": " We say accelerated computing is sustainable computing because it is inherently fundamentally more energy efficient and Nvidia has really pioneered this acceleration of compute power. We've improved the energy efficiency of the accelerated computing platform by 100,000 times over the past decade. And that type of energy efficiency improvement is really critical to us unlocking the next level of performance that allows us to build bigger and bigger models and do more and more with AI. The potential positive impacts of AI for sustainability are really huge. People are applying AI to long-term sustainability challenges. So things like climate modeling, climate tech, for carbon capture and storage, for battery chemistry to improve recyclability of materials. Put that in context of manufacturing across the world as well as transportation and buildings. The energy savings and the resource savings are really dramatic. There's so many examples. It's really easy to get excited about all the potential good, but it's totally valid to look at, okay, what's the footprint of AI as well? And it's true that the footprint of AI from an energy perspective is growing, but OpenAI estimates that it's only.34 W hours of energy that's used for a single CHAGPD query on average. And that equates to very, very small activities in your daily life like using your microwave for just 1.2 seconds or running a light bulb for just four minutes. So if you look at all the other things that we're using electricity for and generating emissions for, AI is a tiny fraction of a tiny fraction of of the overall pie. It's growing absolutely and it will continue to grow. But there's no other technology and no other energy consumer that is more likely to have a positive impact in the long term than AI. And in this period of rapid innovation, it's a democratizing tool that really unlocks potential for sustainability goals across sectors.",
        "start": 0.16,
        "duration": 218.958
    }
]