[
    {
        "text": " So good morning everybody. hello Jensen. Good to have you Tim. Good to be here. look this is an interesting press conference for us to this morning because we do it very interactive not by presentations only and therefore it would be a nice dialogue and I was thinking how to start that session. Yesterday evening I was with my fitness trainer and I did fitness. and I can tell you fitness is only working if your muscles are in good shape. if your technique is perfect and if your mentality is at the right edge otherwise you can forget every training and what are we talking today is exactly about that one it's about let's say how can we make Germany fit this is the whole purpose of this exercise and what is the heart of Germany it's our industrial core that is what what it is this is the heart which we have to train now the muscle of this body I would call it do telecom we are let's say the infrastructure you know we have the connectivity we built the infrastructure of data centers across the globe we have 186 data centers which we operate already today we are the muscle of the body and then we have the brain of the body and I can tell you the brain is here I'm very happy that you know Jensen is here today he's running the most wealthy company on Earth which is for me a very impressive achievement. and I'm more impressed about the technology. It's the brain of the future. Without AI, you can forget the industrialization. You can forget the German industries. If we are not adapting AI in our industries, I can tell you there will be no prospect. There will be no prosperity in our society in the future. So therefore, we need a good brain for that one. We have the muscle. We have the brain. And on top of that we have the skin and that is even new what we are presenting today. The skin of what we are talking about is SAP because it's very important that you don't only run a compute machine that you have a T-cloud or an environment of infrastructure you even need a skin which is making the world open which is let's say enabling all industries and therefore I'm very happy that Kristen Klein is here from SAP where we are launching a new cooperation here as well at this event so therefore I hope that you know you understand already what we talking about and what we want to do. But I want to hand it over now to Jensen about how he looks at the world and especially about let's say the German situation and what we're doing here today. Thank you Tim. I always love coming to Germany because this is the land of engineers. You know, this is where we're all very welcome and we I feel very",
        "start": 0.24,
        "duration": 346.40000000000003
    },
    {
        "text": "how he looks at the world and especially about let's say the German situation and what we're doing here today. Thank you Tim. I always love coming to Germany because this is the land of engineers. You know, this is where we're all very welcome and we I feel very very happy to be here today because this idea actually started with me and I approached you about this great idea. Well, our industry, this story really started with the transformation of our industry. As you know, we're at a transition time in the computer industry. After 60 years of general purpose computing, the technology that Nvidia invented over the course of 30 years is now shifting how everything is done. Every single layer of the computer industry from the chips to the systems to the software to the applications are being completely revolutionized by artificial intelligence. After 15 years of working on AI, it is now transforming every single industry including finally manufacturing. Manufacturing is extremely difficult and the reason for that is because physical AI needs to understand the structure of the world and the laws of physics. And the work that is done here in Germany is done at such an extraordinary scale and precision. We have to have incredibly good AI. Yeah. But finally that day is here and this is a very exciting time because Germany had a vision of industry 4.0 fusing digital with physical. Yes. And finally now with artificial intelligence we will supercharge industry 4.0 and this will be the era of industrial AI. And so I'm very excited about that. Today is a very big day. We talked about industrial 4.0 and I think the architecture of and the concept was right good but the problem was the execution in Germany didn't took place and you know the step going into investments and using the technology for you know making industrial 4.0 zero happened. That was something which was you know at least slowly happening and at the same time the world was waking up. China was waking up, the US was waking up on all this kind of possibilities to create this next generation of industrialization. And what you can see here on that slide is you know that you know today 70% of all GPUs are sitting in the US 14% sitting in China and in Asia mainly in China and only 5% sitting here in Europe as a total. So how can Europe and especially German at the core with this industrial competence, how can then adapt into this next generation and that is why we are started this initiative to say we have to build a stack here in Germany which is enabling our industry to participate in this in this next generation evolution of the industrialization. And Tim, your your vision is absolutely spot on. And the reason for that is because these GPUs, these computers are the modern versions of factories. These are factories just",
        "start": 174.0,
        "duration": 718.6390000000001
    },
    {
        "text": "here in Germany which is enabling our industry to participate in this in this next generation evolution of the industrialization. And Tim, your your vision is absolutely spot on. And the reason for that is because these GPUs, these computers are the modern versions of factories. These are factories just industrial factories of Germany. These are factories of intelligence. And in the future in industry 4.0 with AI, every company that's a manufacturing company will have two factories. the factory for the car and the factory for the AI that drives the car. And maybe the core of all this is the compute power which the companies have or need to deploy this digital twins, you know, to use, you know, this virtual world to optimize processes, to optimize their scientific work and all of this. And we have here today something which you brought with us which is going to be implemented very soon in Germany and maybe we we show it to the to the public today. So by the way let's just open up here together and then you say what this is here. [music] This is one GPU. People think that Nvidia builds chips. We do we build chips and these chips go into what is a GPU supercomputer that we invented started working on almost 30 years ago and this is our latest version. This is called Blackwell and this is I don't know a few thousand pounds a few thousand pounds of I can tell you the exact price you know so it's quite costly thing but anyway it's worth very good value. Yes I agree. Yeah, very good value. there there are currently 16 different chips that are connected together into one giant GPU and this is the Blackwell B200. Yeah. So the initiative which we have together is that we are launching a new data center coming soon and I go into the details in a second with 10,000 of these GPUs. this is going to be a data center under all security standards which is going to be taking place in Munich. it is in a special prepared location which is three to four floors under the ground. it is powered by a local energy renewable energy 100% and on top of that by water cooling by a local liver which is enabling the cooling process. a GPU needs a very very special environment and for for being deployed and we worked on the possibility to start with 10,000. Now some journalists and some people would immediately say by the Americans they are putting gigabit factories into place their announcement up to 70 gabit gigawatt in in the US right now. So what do you think that we are just starting with 10,000 now? Well, starting is the most important part. Here we are. Starting is the most important part. , this this computer is a factory. This is quite an interesting thing. This computer, you apply energy to it. It",
        "start": 361.919,
        "duration": 1100.0780000000004
    },
    {
        "text": "So what do you think that we are just starting with 10,000 now? Well, starting is the most important part. Here we are. Starting is the most important part. , this this computer is a factory. This is quite an interesting thing. This computer, you apply energy to it. It and what comes out of it are tokens. And these tokens are like you you you market the tokens for dollars per million tokens just like electricity dollars kilowatt hours. And this is the new industrial revolution, a machine that generates a commodity that has tremendous value and which is the reason why this is a factory. Germany is going to be incredibly good at running these factories because as you know Germany is really good at building and running factories and this is going to be the new industrial factory. Jensen can you give a for for the ones who don't you know work in this industry every day some examples about how this AI GPUs can create productivity can create time to market can create value for different industries. Well, the first thing is we have to teach the the model which is software. We have to teach the model the language of information. We taught it of course English and German. We also taught it mathematics. We taught it robotic articulation motion. We can also teach it chemistry, biology, fluid dynamics. We could we could teach this software almost anything that has information encoded. And so once you teach this computer running the software the AI model the language of that information and how to think and reason about that information then it can translate the information. So let me give you an example. I can to it's called tokens numbers. I give this computer numbers in English and then I say to this computer translate it to German. It will output numbers that will become German. I could also give it a whole lot of English in a book and I say summarize all of that for me and it will generate a summary of the book. And so the key is that it understands the meaning of the information and the key is this computer can understand can learn the meaning of the world's information. I like the algabar behind but and but the question is what is the economical benefit and Germans always you know count the beans and therefore you know to give you some examples where I see benefits from GPUs in the in the past car manufacturers used a kind of physical car to test the CD CW you know the the wind channel and to improve the the the the streaming ing or the around the cars. Now they could put everything every detail into the machine and can simulate it on on the computer. So the cost for the optimization of the car frame is is significantly optimized. We have the example of the chemical",
        "start": 554.399,
        "duration": 1501.2780000000007
    },
    {
        "text": "the the the the streaming ing or the around the cars. Now they could put everything every detail into the machine and can simulate it on on the computer. So the cost for the optimization of the car frame is is significantly optimized. We have the example of the chemical chemicals, you know the way of molecular structures and what you need, you can reduce the time to market significantly by almost 50% if you work in a digital environment in optimized way. we talk about let's say the optimization where just a company which is producing pills and you know you can reduce the ingredients by 60% if you optimize the way how you manufacture the the the medical services. So the raw material consumption the effectiveness the time to markets the trial and error cycles everything is going to be simulated in the machines. you have billions of data points which you put into the system but you have to work with them in a very fast manner because otherwise you need a lot of CPUs which are eating a lot of energy and then it's getting inefficient and with the GPUs you're able to do this in a much more efficient way. That's right. Is that that's that's spot on. The the real the real idea here is that we're producing intelligence. Now intelligence as you know is very difficult to see but the benefits of intelligence is very clearly easy to measure. Yeah. Now one of the one of the things that we all know is that the world has a shortage of labor. And let me give you one example of labor. Let's pretend for a second that the shortage of labor we have is somebody to drive the car. Somebody drove me here today. And you asked the question what is the value of artificial intelligence? In the case of the car, the self-driving car, we now have a digital and AI chauffeur. That AI chauffeur is can learn to recognize the environment and manipulate the steering wheel and the gas pedal. And it it does this incredibly well. Correct. What is the value of that AI? Maybe it's $20 per hour. Whatever is the the price of an AI chauffeur. And so so whether it's measured in labor cost or it's measured in the benefit of the output you said in many examples the number of drug discoveries and examples has has doubled if your productivity improves and you could measure the amount of output and that is the value of AI but what comes out of this machine is basically numbers because it's a computer and these numbers are reformulated into intelligence that that the intelligence of human language, the intelligence of numbers, the intelligence of chemicals and proteins. Now I think we understand the need for GPUs compared to CPUs. They are you know much more efficient in the way of creating results. They are less energy",
        "start": 758.16,
        "duration": 1836.397000000001
    },
    {
        "text": "are reformulated into intelligence that that the intelligence of human language, the intelligence of numbers, the intelligence of chemicals and proteins. Now I think we understand the need for GPUs compared to CPUs. They are you know much more efficient in the way of creating results. They are less energy which you can have in a normal data center. and on top of that they they work simultaneously and in parallel. This Tim this computer right here this computer right here will replace an entire data center of CPUs. That's how efficient this is. So second what we can summarize is that we have now in 6 months you know from the idea to the realization worked with Nvidia to make that happen in a at a German location. we have found a location in Munich which is you know well protected which is giving us you know renewable energies at we are talking about 12 megawatt at that point in time which we need from an energy perspective. This is guaranteed and we got by the way all the approvals from the from the local municipalities and from the state that we can start working with this GPUs and we are not talking about years we are going to start ready in the market in the first quarter 2026 so this is let's say in a few months from now or days from now so there's no excuse for the German industry anymore to say by the way I don't know want to bring all my data to an American server. I I want to export it. I do not know what's happening with my data. Everybody can do it right now here in Germany. And you have the most advanced computing system here. One of the things that that is is truly incredible right now is, as you know, all of these GPUs are completely consumed around the world. right now in the United States we're seeing expansion of GPU computing in data centers at a really incredible pace and the reason for that is because the fastest growing companies in the world today are artificial intelligence companies and they're growing at exponential rates and many of them are incredibly profitable already and so the timing is really important it's time for Germany to race this is the next industrial revolution in combination with your industries will turbocharge industry 4.0. It's going to be enormously important and I think this is going to be the the beginning of a new phase of growth and and innovation for Germany. Let me you know put our focus on another topic. by the way we are now building 10,000 of these GPUs in Germany. We are increasing the capacities of GPUs in Germany by 50%. Only by doing this step. Most of the GPUs today are used you know very fragmented structures at universities more most of them in the scientific environment but we make the AI",
        "start": 928.56,
        "duration": 2161.2770000000014
    },
    {
        "text": "building 10,000 of these GPUs in Germany. We are increasing the capacities of GPUs in Germany by 50%. Only by doing this step. Most of the GPUs today are used you know very fragmented structures at universities more most of them in the scientific environment but we make the AI only for the the the the specialist but as well for the for the broad audience and we're talking about the middle stunt the midsized company and the big companies at the same time. Now we have a lot of discussions about sovereignity. This geopolitical challenges which we are all facing is getting tougher. we we are not you know using any Chinese components here at all. But nevertheless there is even a sovereignity discussion about how can Europe become more sovereign on this core technologies going forward. And u I looked at it this question that and there are three elements of sovereignity. There is data sovereignity, there's operational sovereignity, handling the processes and the the infrastructure and there's technology sovereignity. And if you look to this three elements of sovereignity, what you can find here is that all the data is staying in Germany. It's not leaving this country anymore. So therefore, we have a stack which is data sovereign. The second one what we have is full operational sovereignty only certified employees of German or European companies will handle this data and will work on this infrastructure. So we make sure that the full stack is in our control and we call call it sovereignty and then we have the technology sovereignty and look Europe doesn't have this competence on chipsets and therefore we are with the best and with the world market leader in this category here together and I can say you we have a very reliable partner with Jensen a great collaborator we worked with him for years here is a collaboration needed between the US and between Europe And so therefore there is no ST which is so sovereign on that one. And any any thoughts on on sovereignity? I I think you're you're spot on. I think the the the other thing that I would add is one of the the one of the most important ingredients of artificial intelligence is energy and that energy is is created here. And then the last part of artificial intelligence is the economic flywheel. And for the first time with the factories here, you will be able to apply energy here in Germany, drive the economy of and industry of Germany and have the economic benefits terminate in Germany and so that flywheel will be completely inside Germany. Now maybe coming to the last topic, why Deutsche Telecom and YT? any any thoughts about why a telecommunication company should go into data center infrastructure and into high compute services? Well, there's several reasons for that. First of all, operational excellence. these AI factories are going to be producing intelligence for companies and people",
        "start": 1092.559,
        "duration": 2526.395000000001
    },
    {
        "text": "last topic, why Deutsche Telecom and YT? any any thoughts about why a telecommunication company should go into data center infrastructure and into high compute services? Well, there's several reasons for that. First of all, operational excellence. these AI factories are going to be producing intelligence for companies and people and factory other factories. you're going to be producing intelligence for so many here in Germany. The ability for you to have operational reliability, infrastructure, infrastructure excellence is really vital. The second is there's going to be just as AI has transformed all of the other industries related to computing. AI will transform telecommunications as well. Yes, that's right. And so AI for RAN and AI on RAN is about to come. AI technology will revolutionize the way spectrums are used on the one hand. On the other hand, the telecommunication network that you provide will carry intelligence in the future. And so I think that this so you're not surprised at Tel because this morning I read some newspapers and said oh big strategy shift of Telkom. you know they're going now into data center and high comput chips. If you're looking to your global partners, we are not the first, you know, telco who's working with you. Correct. Not the first. It's very close to that's right the DNA of a company like ours. Telco plus. Yeah. Think of this is as telco++. It's plus in the sense that it's a new business for you. So it's incremental growth. It's plus in the sense that it's going to revolutionize telecommunications in the future. And so it's plus to add and plus to change. Plus plus. I'd like to put your attention to another topic and maybe you have seen that slide already. YDT because that was the question which I wanted to discuss here with Jensen and I want to show you this maybe a little bit technical chart here. Look this is the stack as we call it which is required to run an infrastructure. on the bottom level you have the connectivity. connectivity is quite relevant for these data centers you know especially when they are close to manufacturing areas you need low latencies. a lot of data goes in a lot of data goes out. I think there's no question you know that Deutsche Telecom as the biggest European telco has the credibility to build good connectivity. I don't go into the numbers here which we are to date transporting over networks on a daily basis. on top of that data center. It's the classical infrastructure. It's just the physical hull which is being built. So we have today 184 data center which we running globally at Dodger Telecom. and so it's not something which is new for us. It's not that we don't have a competence in this regard. we have 390 megawatt which we are today already using to deploy the data of our customers classical data",
        "start": 1278.799,
        "duration": 2864.795000000001
    },
    {
        "text": "184 data center which we running globally at Dodger Telecom. and so it's not something which is new for us. It's not that we don't have a competence in this regard. we have 390 megawatt which we are today already using to deploy the data of our customers classical data for our customers global on top of that is very important and it's it's the security layer take Germany you know we have the largest integrated cyber defense center our NOX we are serving more 20 DUX companies over this this security environment. we have our own business unit and we have as well by the way partners who are helping us you know to provide security already in the infrastructure but as well into the in into the communication services. Now it comes to place this is the the that is the infrastructure as a service and this layer is super important. That is what we talked about earlier. These are the 10,000 Nvidia GPUs. And by the way, for us, this is just the beginning. because we want to do more and bigger. I come to No, go back please. I want to go I go into secl later on. So this is let's say the 10,000 services and our T-cloud is enabling let's say the the data hosting and in this environment on top of that we have the so-called pass layer. and now it's getting interesting because this is not a competence of Deutsche Telecom and and and we were talking with the leader in this regard and that is SAP. the good thing is that SAP is as well a German a European player. So if we [clears throat] are really talking about a full stack being sovereign, you know, it was fantastic to have SAP as a partner who is providing their called BTP their business transformation platform into the play because we need somebody who is enabling all the applications into the infrastructure and the environment which we have and therefore I'm very happy that we are not only announcing our partnership with Jensen and Nvidia. Today we are announcing as well today a collaboration with SAP and I want to invite you know Christian to join us here on stage to give us a little bit more flavor about BTP [music] Nvidia runs on Nvidia runs on SAP as well. We all run on SAP by the way it's so expensive. [laughter] I thought we can end here now. [gasps] I'm kidding. Oh, it's so worth it. [laughter] Yes, for sure. Okay, so Christian, , tell me tell us a little bit more about the BTP. Tell us about the added value. Tell us why you're thinking this is, you know, a great answer for the the the requirements around sovereignity and , an add for the industry. Yeah, I mean first clearly just let me acknowledge how important this day is today with these announcements for the",
        "start": 1451.2,
        "duration": 3208.562000000001
    },
    {
        "text": "about the added value. Tell us why you're thinking this is, you know, a great answer for the the the requirements around sovereignity and , an add for the industry. Yeah, I mean first clearly just let me acknowledge how important this day is today with these announcements for the say even broader from a European perspective. I mean as Jansen said I mean our strengths in the industries is manufacturing it's chemical auto but these industries they can't compete let's be honest to ourselves on energy costs on on labor costs. what they need is pure innovation. And what you showed here today is actually the foundation for the next industrial revolution. And I guess what we are now bringing together with this partnership here is first we have the best infrastructure, the best supercomputer, the best GPUs in the world to want all kinds of AI modules. And then we are putting on top the business technology platform and SEP systems are touching 80% of the world's workflows on supply chain on finance and HR. So we can use this foundation now put the platform on top and infuse AI in all of these workflows. So when it comes to quality control in manufacturing, when it comes to producing with higher efficiency, having higher up uptimes of machines, this here is the foundation. And then when you stack it up from the infrastructure, the GPUs, the platform, the apps with the AI agents coming on top. I mean, this is a true German stack. It's a European stack. It's completely sovereign. And and this is I guess the key what our industries need to really be a leader also in the future in their in in what they are good at in their core industries. Look, it's I think you know very important. Yeah, go ahead. One one one piece now just looking at the slide because I know what question will come. Is this now only the three of us? No. I mean on the business technology platform you find any kind of open-source AI modules. You find great startups here from Germany building on the business technology. They can leverage the AI. they can leverage the genai models but they can also have the native access to the SAP systems to the business context. So it's really about also embracing open source. It's about embracing the whole startup ecosystem here in Germany in Europe. There are thousands of partners building on top of that platform. And last but not least also thanks to our political leaders because they are embracing this partnership as well. And when you [snorts] think about you know the digitization of our government of our public sector I mean this is a true sovereign stack which also will serve our our our governments and the public sector in a in a in a very positive way. Yeah. Look I think the the the answer which we're trying to give for",
        "start": 1631.12,
        "duration": 3519.762000000001
    },
    {
        "text": "of our government of our public sector I mean this is a true sovereign stack which also will serve our our our governments and the public sector in a in a in a very positive way. Yeah. Look I think the the the answer which we're trying to give for excuse anymore. We cannot excuse by saying we don't have GPUs. We have them. We cannot say we have no excuse because we do not want to host the data outside of Europe or outside of Germany. We cannot say we do not have access to all the tools which are required from a from a from a business software architecture. Everybody can use and optimize its its workflow, its production floor, it is it it's its scientific work with this kind of offer. And we want to test the water. I know that there are people sitting in the room saying, \"By the way, when the Americans are investing into 70 gigawatt factories and we are coming with only 10,000, we will never catch up.\" But I can tell you, you know, we are crossing the river by feeling the stones. This is the way of doing it. And if we learn that you know the industry the public services are using this infrastructure Deutsche Telecom is willing to double down on this investments. We are preparing the next u bit for the AI gigabit factory for the which is the big RFQ from the European community. you know that we are u one u applicant here in this environment. We are you know developing partnerships around where we find let's say this big slot where we can invest this billions into money. This is going to be a double digit billion investment. This here is a 1 billion investment. But what you can see on that slide is you know we have now the stage one ready for Germany. And I think it is u now up on everybody else to use this. And by the way I'm having two ministers sitting here. we are not only talking about the industrial in the classical sense for us even the public sector is relevant. If we think about you know digital twins for military service if we think about let's say all the data use from from the communities which you know have to be u computed. this is something where we have a a sovereign secure environment as well. So I hope that we are trying to give a good answer. I'm convinced that Germany will not survive if we are not adapting this new technology. we do not want to be let's say somebody who is showing the people you know how great we were in the past. We want to stay as a wm furer in our categories. And I think we are now giving an answer in this regard. So this is part of our first deck. I like to thank all of",
        "start": 1788.96,
        "duration": 3854.240999999999
    },
    {
        "text": "is showing the people you know how great we were in the past. We want to stay as a wm furer in our categories. And I think we are now giving an answer in this regard. So this is part of our first deck. I like to thank all of your partnership. The first step is the hard step. Everything after that is easy peasy. [laughter] And Christian, we hang out anyhow in Thank you very much. Thanks a lot. Thank you. [applause] Thank you.",
        "start": 1958.32,
        "duration": 3880.402999999999
    }
]