[
    {
        "text": " America, [music] the land of innovation, where invention [music] shaped destiny and technology helped dreams take flight. At Bell Labs, the transistor was [music] born, sparking the age of semiconductors and giving rise to Silicon Valley. HDI Lamar reimagined communication, paving the way for wireless [music] connectivity. IBM's system 360 put a universal computer at the heart of industry. Intel's [music] microprocessor drove the digital age forward and Cra supercomputers expanded the frontiers of science. So, we think we're at the beginning of something with this technology and we're going to go just as fast as we can. Apple made computing personal. Hello, I am Macintosh. Microsoft opened the window to a new world of software. Long before the web, you've got mail. US government researchers built Arponet, connecting the first computers, the foundation for the internet. An iPod, a phone. Are you getting it? Then Apple again. Put a thousand songs in your pocket [music] and the internet in your hand. Every era, a leap. We choose to go to the moon in this decade and do the other things. Not because they are easy, but because they are hard. Every leap, America led. Science leap for mankind. Now, the next era is here. Launched by a revolutionary new computing model. This is likely going to be the most important contribution we've made to the computer industry. It will likely be recognized as [music] a revolution. Machine learning is a branch of artificial intelligence. computers that almost appear to think. The amount of computational [music] resource is ultimately what's going to turbocharge this field. Artificial intelligence. The new industrial revolution. At its heart, Nvidia GPUs invented here [music] in America. Like electricity and the internet, AI is essential infrastructure. Every company will use it. Every nation will build it. Winning this competition will be a test of our capacities unlike anything since the dawn of the space age. And today, AI factories are rising. Built in America for scientists, engineers, and dreamers across universities, startups and industry. I think we want to try to reach new heights as a civilization, discovering the nature of the universe. And now, American innovators are clearing the [music] way for abundance, saving lives, shaping vision into reality, lending us a hand, and delivering the future. We will soon power it all with unlimited clean energy. We will extend humanity's reach to the stars. This is America's next Apollo moment. Together, [music] we take the next great leap to boldly go where no one has gone before. And here is where it all begins.",
        "start": 0.0,
        "duration": 453.7619999999999
    }
]