[
    {
        "text": " [applause] Hello. It's great to see all of you. You know, once a year I get the benefit of thanking all of you for the incredible work that you do. As you know, we pioneered a new way of doing computing called accelerated computing. And we've been working on this for now 33 years. The big idea, the big idea is that if you could co-design, meaning if you understood the problems you're trying to compute for, and you developed the entire stack, meaning the algorithms, the computers, and the processors within it that if you co-designed, you solved the problem from top down, you solved the problem from bottom up and inside out, that you could accelerate these applications which are incredibly computing intensive by a level that Moore's law would only dream of. Moore's law runs at about 10 times every 5 years, 100 times every 10 years. In the last 10 years, we've accelerated AI about a million times. A million times versus a hundred times. A million times compounded over 20 years gives us an opportunity to maybe address some of the most incredible, most impactful challenges of humanity. That's you. And so we've been thinking about accelerated computing and this codeesign idea for a very long time. Well, after some 30 years or so each different fields of of computing domains became within reach. One of the first ones was computer graphics. And somebody told me about 10 years ago that it would take 30 years for us to solve this incredibly hard problem called ray tracing for computer graphics. Literally following every photon of light as it bounces around the room, eventually reaching your eyes. And using ray tracing, you could solve for really interesting computer graphics problems and create photorealistic images like this. Well, that was 10 years ago that it would take 30 years. It was the computer graphics problem that was always the future. And literally today, we ray trace every single pixel in a computer graphics program in our video games. And not only do we rate trace it incredibly beautifully, we do it at several hundred frames a second, as large of a resolution as you like. And we've taught an AI how to we've taught our computer how to simulate with first principal simulations very few pixels. And then we use AI to predict the rest of it. We teach an AI what an image should look like and it generates the the the image for us. It's temporal consistent. It's spatially consistent. It's incredibly beautiful. It looks even better than we compute. Well, each one of these different domains are becoming within reach. About 10 years ago, we started talking about self-driving cars. Today, I think we are at the chatbt moment of self-driving cars. There's no question in my mind that within the next 10 years, you know, almost every car that gets manufactured will have, of course, either robo taxi",
        "start": 3.274,
        "duration": 384.886
    },
    {
        "text": "reach. About 10 years ago, we started talking about self-driving cars. Today, I think we are at the chatbt moment of self-driving cars. There's no question in my mind that within the next 10 years, you know, almost every car that gets manufactured will have, of course, either robo taxi yourself, you still can, but it has the ability to be a robo taxi. That future is just around the corner. Each one of these domains are within reach. Now, of course, we now have the chatbt moment. The last year we've seen incredible progress in generative AI in large language models. U these ideas made it possible for us to take an AI that we thought was magical but hallucinated a great deal. It was essentially cute and very interesting to something that is incredibly useful. This last year we saw last couple years breakthroughs in multimodality AIS. Not only do you understand the word cat and the letter cat a t, you could look at an image and hear the word hear the sound meow and recognize all of those words, all of those information is aligned to the same place in your brain. And we can now do that with all kinds of different modalities which is very important to you. we made huge breakthroughs in reasoning capabilities to be able to decompose through composition. Break down a problem we've never seen before into routine things and through that composition solve problems step by step reasoning through hard problems. The ability to do multimodality reasoning and to be grounded by different sources of information is going to be a revolution even for your industry. It is clearly a revolution in ours. The idea that we would use multimodality sensors very sensible. But the idea that a car a self-driving car stack that can think because it can reason through and experience a situation it's never experienced before. Reason through it step by step and be able to solve that problem, navigate through it. Incredible capabilities. It expanded the operating domain of self-driving cars tremendously. It no longer, it's now the case that we are very certain we don't have to test every single car across every single scenario in order for that car to do well just like us that we have we can now have a car that can think and be basically intelligent. these techniques has made and and of course agentic capabilities, the ability for agents to reason, use tools, work with other agents completely revolutionary. And so these these breakthroughs in in the day that I've been here is permeating your industry, permeating life sciences, some of the most exciting work that I've seen in a very long time. And so today we announced a very important very important partnership. Before I get there, let me say a couple of things. We announced of course some of the work that we've done with all of you. We've brought an accelerated computing",
        "start": 195.2,
        "duration": 754.327
    },
    {
        "text": "that I've seen in a very long time. And so today we announced a very important very important partnership. Before I get there, let me say a couple of things. We announced of course some of the work that we've done with all of you. We've brought an accelerated computing suite of libraries that we're very proud of. Parabicks for gene sequencing. Monai, an open- source platform for medical imaging. and one of the most important ones biono a platform that understands geometric structures like molecules and proteins and these platforms are used by many of you in the room and I'm very grateful for that the several announcements that we made before before I say that there there are so many partners here a couple couple of hundred different companies here they're pharmas or hospitals or startups There are startups in robotics, surgical robotics. There's startups in robotics labs. There agentic AI companies here helping with health healthcare diagnostics and also some really cool work being done in AI scientists. You know, part of part of being at the JP Morgan event is that large companies meeting small companies and so many of them are doing revolutionary work and and I'm so grateful that that all of you have chosen the NVIDIA platform to work on and so so our platforms our platforms ended up achieving some really great results. , Monai has been downloaded some six million times. We achieved the Guinness World Record of gene sequencing. You know, that's cool. I've always wanted to be in the Guinness World Record, so that's cool. , the the vast majority of the world's , structure prediction models are built on NVIDIA today. And so, I'm really proud of that. and and on top of the Bionmo platform are a whole bunch of pre-trained models. You use it for data processing. You use it for training these biological models. You use it for fine-tuning. , but we also have a whole bunch of pre-trained models and a bunch of data that that you can start with and you could apply your data to fine-tune your your molecules and and some of the some of the models that that we've created and participated and jointly developed are really proud of Laortina for protein design resin for molecular synthesis Kermit for predicting toxicity evo 2 a a DNA foundation model. These these foundation models start of course we're we're trying to we're trying to learn the represent representation of proteins so that we can create a foundation model for protein. But the the moment that that time where where we're going to learn a representation and create a foundation model for cells is just round around the corner. The multi-roin systems codon FM for RNA design just just really really terrific re really terrific progress. And so today we announced a a a large number of partners that are working with us in Bionmo and I'm very grateful for that.",
        "start": 381.6,
        "duration": 1121.885
    },
    {
        "text": "for cells is just round around the corner. The multi-roin systems codon FM for RNA design just just really really terrific re really terrific progress. And so today we announced a a a large number of partners that are working with us in Bionmo and I'm very grateful for that. a a a land landmark partnership with one of the most important companies in the world and and a really great friend Dave Bricks and Lily. And so without without I won't tell you more about it. I'm going to I'm going to let the two of us describe it together. , but Dave Dave, he he's been the CEO of Lily since 2017. And , in the context of the history of Lily, 150 year old company. He's been in the company for 30 years. That's so he's basically a new college grad in the context of Lily. and and and I'm anxious to to learn from him you know how how he learned so much in just a short period of time. But but he's been with Lily now 30 years and as you know he has helped guide and and help build Lily into one of the most valuable companies in the world and surely one of the most important companies in the world. And so if you could join me in welcoming my guest David Ricks. [applause] [applause] Thank you, Dave, for being here. [applause] So, so it turns out the two of us have have a I can't imagine more different upbringing. So, so, , Dave was a was an Eagle Scout and went to a juvenile delinquent, , school. [laughter] Just to be clear, I I was placed there as an accident. It wasn't [laughter] It was no that was it was a very good school. It was very affordable. and so so 2017 you became CEO. Yes. My question is this. What was Lily like and what was its vision for the future of life sciences and and then what is it like today and your vision for the future of life sciences in the context of Yeah. Well, so in 2017, we were almost 140 years old or just a year older than that and had pretty well established company. we had been through a difficult period of time in our industry and we'll get into this a little bit later. You know, we are plagued by as many people in the room know the cycles of innovation that are actually longer than the reward cycles on average. So you have this peak trough, you know, you're peaking and troughing and in the troughs of course you either don't survive, you end up as a back end of a hyphen on another company or you learn how to survive and you do difficult things and I think it's true that Lily is the only major farming company that has not merged or combined ourselves to",
        "start": 572.48,
        "duration": 1454.511
    },
    {
        "text": "course you either don't survive, you end up as a back end of a hyphen on another company or you learn how to survive and you do difficult things and I think it's true that Lily is the only major farming company that has not merged or combined ourselves to been through a few of them. So, I think we've developed a bit of a DNA for scraping by in these tough times. And one of the things that really stuck with me, I was a leader on the executive committee at the time. We went through our last cycle with 2010, 11, 12, was, you know, how you have to be so relentless on invention because that time cycle is brutal. When you have a patent cliff and you have nothing to replace it, you have to rescale your whole company. And imagine doing this every 10 or 15 years, it's impossible to get momentum. People leave, you're lose inherent knowledge, etc. So, we set about to do that. And I think that problem can be attacked two ways. One, you can say, okay, we'll just have better ideas. But as you may know, that's difficult to sustain. even if you have a good idea, everyone thinks you're smart. They think about that about Lily now. But it's hard to sustain. So we try we of course worked on that more invention. But the more important thing we did was speed up invention. So we systematically took apart the R&D process literally like every step and there's hundreds of steps from candidate selection to first approval and we squish the time and so still today probably Lily is about 40% faster than the next scaled pharma company on average across all therapeutic areas and so we can invent things inside the patent cycle. Yeah. Then you can start to grow. Yeah. So I think that was a notion in 2017 which we've actualized along the way. Then of course we did a lot of things to drive more invention. We were lucky enough to be early on an idea called GLP1 in 2006. We launched the first one in the world. Never heard of it. We fi Yeah, we f we fiddled around. Is it doing well? If it weren't for you, it would be the most important idea in the stock market. Yeah. But [laughter] but but never heard of it. pretty good idea for mankind and we fiddled around with it for like 12 years and to their credit our sounds like a chip GLP1. Yeah, it does. Yeah. GLP1. Is there is there a two coming? we [laughter] there's a there's a three coming. So there is a GLP2 that's actually a real protein. Is it really? Okay. It's a protein. It sort of does the opposite. But [laughter] don't but you don't want that. What we've done is combined two hormones. Very small market. I gota tell you. That's right. That's right.",
        "start": 752.639,
        "duration": 1761.9500000000005
    },
    {
        "text": "coming. So there is a GLP2 that's actually a real protein. Is it really? Okay. It's a protein. It sort of does the opposite. But [laughter] don't but you don't want that. What we've done is combined two hormones. Very small market. I gota tell you. That's right. That's right. healthcare, but I'm guessing sign up on GLP2 now because turseptides two proteins fused together and that's a technology we've developed too. And there's a there's a a triple acting one coming next year 27. So that'll be pretty interesting. But anyway, we caught that wave. Our competitor innovated into obesity. We chased and executed I think quite well to become the market leader last year. So we not only now have an engine that's faster, we have a tremendous success cycle with this one idea. The challenge before us now is like how do we find another success cycle before that one runs out hopefully a lot sooner than it runs out and you know sort of get exit velocity which really no major company in our industry has had. There's they've just had these cycles. So yeah, you know, you said something you said something earlier and and I I I have several of my employees here and they they hear me say this all the time. You know, the the fundamental purpose of the CEO is to create the conditions by which, you know, not our job isn't to create ideas. Our job is to create the conditions by which great ideas can systematically, you know, arise. and and what what you just described is essentially you know Lily with wisdom that that you have to create the conditions by which these great inventions can happen. one one of the you know we we've spoken before about the early days of Nvidia getting into AI and and I I would say I would say that that without exception probably the single most important thing that we did was investing in the infrastructure the creating the conditions by which amazing AI researchers can come to our company and great great inventions could arise. you know, today we're we're we're quite silent about this but people are in increasingly discovering that that over the over the course of the last 10 years. One of the best decisions that I made in the beginning was was and at the time we we couldn't afford it. but nonetheless I built one of the largest supercomputers in in the world for Nvidia to use and at the time I had nobody to use it but because Nvidia had very few AI researchers at the time but the problem is if if you don't have AI researchers and therefore you don't have the instrument if you don't have the instrument you'll never have the AI researchers because they need scientists need the instrument nec you know necessary for for their science if you if you want to attract the world's",
        "start": 908.639,
        "duration": 2067.87
    },
    {
        "text": "if if you don't have AI researchers and therefore you don't have the instrument if you don't have the instrument you'll never have the AI researchers because they need scientists need the instrument nec you know necessary for for their science if you if you want to attract the world's don't have a a a particron collider, you're you're going to have a very hard time doing that work. And and so I came to the con conclusion that the right answer is to to create the conditions for great AI work to be done and I built that supercomputer and we attracted some amazing people and today we do frontier work and physical AI and biological AI and robotics AI and the work that we did in self-driving cars is revolutionary and and so so which led led led our conversation y to that that AI is is starting to to make enough progress that we might be able to apply it to tackle some of the most extraordinary challenges of humanity which is biology. Yes. And and the two of us thought it'd be amazing if we have the the largest computer company in the world and computer science company in the world partner with the world's largest life science company. And it's as if we created this lab where we are essentially one company combining all of the best amazing things together which led us to our announcement today. Yeah. And so so exciting. Yeah. Today we announced Yeah. [applause] Yeah. And so and as you know so there's like four parts of this. We we bought a bunch of chips and we're building I think it'll be finished this week actually the largest dedicated on-prem biology supercomputer in the world. that'll be in Indianapolis which is the world center for biologic discovery by the way. You know I was going to say I was going to say earlier [laughter] because of the selection of the headquarters of Lily it is exactly the reason why it has never merged with anyone. Maybe so that could be true. That could be true. There's a lot of artifacts with that. I Yeah. You know, I think that seriously there's something to like if you manage to make it all the way to Everybody knows what I mean. Yeah. If you manage to make it all the way we don't want that and you're a discovery chemist or biologist, you really aren't going to leave, right? I mean, you made it all that way. You're going to stay. So, we have great retention. , anyway, we're building this huge So, we have massive compute. Dave's invited me to visit him many times. Yeah. He's never Well, actually, you did come in 2018. I don't know if you remember that. Yes, I did. Yeah. Actually, that just a sidebar like that was the first time we met and that you gave a talk to our management team, a",
        "start": 1063.12,
        "duration": 2371.904999999999
    },
    {
        "text": "to visit him many times. Yeah. He's never Well, actually, you did come in 2018. I don't know if you remember that. Yes, I did. Yeah. Actually, that just a sidebar like that was the first time we met and that you gave a talk to our management team, a Yeah. And I guess I was lucky enough to 100% of the audience I could see. I could see it in their eyes. Nonsense. Yeah. Honestly, it blew my mind. What you said blew my mind to the point where I spent several months like reading about some of these things which sounded like science fiction. Yeah. And now it's fact. Yeah. It's incredible what you built and it's great to partner with Nvidia on this. So supercomputee we're going to put together a research team here in the Bay Area. So if there's any smart scientists or computer scientists who want to work at the center it'll be a joint Lily NVIDIA LA AI lab. We're going to develop new data because anyone who knows about this problem we have is you can train models but if the data is an inch thin you don't get very far and biology is largely unknown. So we need to create massive experimentation for the purpose of training machines and then we need to build on the work that Nvidia has done with the models you've created to ladder up to even more sophisticated predictions. That's right. So super exciting and and so you know one of the the important things to understand about AI is it it's easy to think about it as a multi-layer cake. I mean at the low lowest level you need some energy for these computers and then of course you have the chips and the computers. You have the infrastructure layer. That infrastructure layer is is about you know how do you how do you cause this computer it's kind of like the operating system of AI. How do you cause this computer to learn, process the data, learn? How do you guardrail it? How do you fine-tune it? How do you teach it? And so that layer is is kind of like a the HR department of AI, you know, it's like it's like, you know, only they're they tell better jokes. [laughter] Exactly. And so that's Yeah. And and so they that's the infrastructure layer and then the layer above that is the models. Yeah. And the layer above that are the domain the domain specific data and flywheel. And one of the areas that that's really exciting is it is u the idea that we would we would be able to train models synthesize proteins or chemicals, go put it into an a robotics lab, collect more data, take that data back into our model. And this this flywheel this flywheel of of data generation or pro or or model protein generation using AI collecting ground truth experimentation and then putting that scientific",
        "start": 1222.08,
        "duration": 2687.426
    },
    {
        "text": "synthesize proteins or chemicals, go put it into an a robotics lab, collect more data, take that data back into our model. And this this flywheel this flywheel of of data generation or pro or or model protein generation using AI collecting ground truth experimentation and then putting that scientific future is just incredibly exciting. So, so we're we're we're systematically bringing together some of the brightest minds in in the field in the domain expertise of drug discovery and some of the brightest minds in computer science and together, you know, between the two of us in our co-innovation lab, we'll have essentially every layer of that cake and put together you know, hopefully hopefully a blueprint for what is possible in the future of drug discovery. I was going to tell you this. I was going to tell you earlier. I was going to tell you the story 40 years ago. So I guess 43 years ago I I was the first generation of engineers where the concept of computer aided design was invented before before my generation. my manager would that generation of engineers they would they would design a chip and and it would be a hit but they would go several years without another hit and they would design another chip and then it would be a hit and they would go several years works now. Exactly. Exactly. And and our generation came along and we were able to represent the transistor, the logical gates, the functionality. We learned the representation and described it in software. We did 43 years ago. , finally a computer could could represent your domain and accurately simulate it. It's it's right to do as much in situ in silicon as possible to do as much as in silicico as possible. And so today we design massive chips. 15,000 people come together to design a computer system. And we just we just taped out Ver Rubin. Billions of dollars of R&D goes into it. the computer when it's done is three tons, you know, a million and a half parts. And and six brand new chips, 220 trillion transistors. I mean, it's gigantic systems. 15,000 people coming together and that computer is going to work first time. It does exactly what we expected and every single generation we build upon the last generation. Every single generation we build upon the last generation. I think your time has come for that. Yeah. Finally the computer you know a million times a million times a quadrillion times of computing power later. I think finally we might be able to represent one of the hardest problems in the world which is the human biology. And I'm really hoping that your industry moves from drug discovery, which is kind of like wandering around the forest looking for truffles, which literally sidebar, we used to have a department of soil discovery. [laughter] Seriously, where we would send people into tropical forests and scoop up soils",
        "start": 1380.96,
        "duration": 3047.904999999999
    },
    {
        "text": "biology. And I'm really hoping that your industry moves from drug discovery, which is kind of like wandering around the forest looking for truffles, which literally sidebar, we used to have a department of soil discovery. [laughter] Seriously, where we would send people into tropical forests and scoop up soils Uhhuh. And refine out what became antibiotics. In fact, the most important antibiotic in the world still is venkcomyosin. to the last resort antibiotic in the hospital. We couldn't run hospitals without it was discovered in Borneo in a soil sample by Lily. Now, how do they know to go there? They would they would just go to exact because fungus produce as tools to fight bacteria and so they dig in the soil and discover these naturally occurring defense mechanisms, refine them into drugs. Huh. But that is true drug discovery. Okay, when you think about it, right? That's that's like you could get malaria doing that job. [laughter] Like you That was that's and that was in the 50s. That was, you know, 70 years ago. Well, see, now your job gets to be just like my job. You never have to leave your office. There we go. Yeah. Do it all in silico. Yeah. Yeah. So, I I think that that that's what really excites me. The concept that we could have computerated drug design. Yeah. And that that this is going to be of course that the science behind it is going to be incredible. It's incredibly complex. the human biology is incredibly complex and it's going to be still a decade yet. But I I I really think that this announcement between us, you know, could be a blueprint. Start of something. Yeah. Start something. I hope you're right. I mean, we need it, right? I think if we think of all the unmet needs left at a conference at JP Morgan, you're reminded of like the incredible pipeline of the industry, but most of that is sort of like chipped out of stone, you know, it's like hard work. and and especially occasionally we we get we we can harness systems like when monoconal antibodies came around we basically hijacked like biology's way of making solutions to infections and other things but mostly what we do is like really empirical and like chipping away and very difficult. Each small molecule discovery is like a work of art. There's only one of them and you know one brush stroke and it's wrong. if we can make that an engineering problem versus you know this sort of discovery arteasonal drug making problem think of the impact on human life. The first the first ships that that I worked on my my first generation of computers were quite empirical. There are some rules yeah that we used and we apply some intuition. We have no ex we have no clue how it's going to perform. We know that it's it's going to perform",
        "start": 1565.919,
        "duration": 3327.4250000000006
    },
    {
        "text": "first ships that that I worked on my my first generation of computers were quite empirical. There are some rules yeah that we used and we apply some intuition. We have no ex we have no clue how it's going to perform. We know that it's it's going to perform because we you know we made mistakes and and so we could we could at least correct those mistakes and we'll have more transistors and more everything. So it's going to do better. Yeah. However, the functionality of it unknown. It's full functionality unknown. It's performance completely estimated. Today we know the functionality of the systems we created down to every single bit. The performance we could measure. We simulate everything. Yeah. And so we know exactly what we're going to produce. I really believe that that that could revolutionize the future of it would make that come true even for a part of human biology. Yeah, that's right. And so tell me GLP1 you were saying that it's really in its third phase. Yeah. Already. Yeah. And and where does it go from here? What happens? What other things can you use it for? How could it change everything? Yeah. Well, I think as it turns out, you know, obesity is like a key lynchpin driver of chronic disease in in adults and like a lot of things in evolution most the ailments of today are weren't were concerns in our evolutionary past, but we evolve much slower than our environment is and so we're maladapted to the to the modern world. And obesity is one of those things. We grew up in a world of scarcity. Sounds like you grew up in a world of scarcity, but most people here didn't. , ourselves, our ancestors did. And so, , that's behind me. There was no I [laughter] I just I I just I don't want I don't want you guys to get the wrong impression. There was no need for an off switch on hunger. The word is abundance now. Abundance. Yes. And we live in a world of abundance of intelligence, abundance of productivity, abundance of those kind of things. And I don't know what you were thinking about, but my life is surrounded by abundance. But unfortunately, we're all in caloric abundance now. And there was no need for us to wire in an off switch evolutionarily. So, , that's why we have obesity. And that leads to many, many chronic diseases that ail people and probably shorten life. , so, , I think by having a pretty effective set of tools going to get more effective, and I'll get back to that in a second, , to really help people manage that to create an off switch synthetically in a way. Yeah. , we can downregulate a lot of diseases, over 200 chronic diseases. No kidding. So, the the two big evolutions that are going to happen in the next 24 months",
        "start": 1706.96,
        "duration": 3626.063000000002
    },
    {
        "text": "in a second, , to really help people manage that to create an off switch synthetically in a way. Yeah. , we can downregulate a lot of diseases, over 200 chronic diseases. No kidding. So, the the two big evolutions that are going to happen in the next 24 months GLP1 is one peptide, but it's in a family. And by combining two in in tereptide gip plus GLP we see we can get better performance and better tolerability. I think you expect more of that kind of thing in the future. So within this super family of proteins, we can harness their combined strengths to really have much more tolerable drugs that are even more effective effective in the maintenance phase, effective in inducing weight loss, different patient characteristics that's coming and I as I said our trip just reducing weight loss has so many so many downream benefits and that's the second thing which is use cases. So, we know you lose weight. If you take our Zepbound today, you'll lose 23% of your body weight on average. But what we're starting to uncover is a series of obvious things like reduced heart attack and other metabolic systems that improve diabetes, pre-diabetes, , conversion to diabetes drops by 93%. Imagine if we treated the country where we have 70 million people with pre-diabetes with Zbound, we would we literally would have 93% less diabetes in our country. That that's a profound finding and hopefully with the government access deal we signed with the Trump administration we'll be able to do something like that. But there's many now non-obvious I think use cases or less obvious inflammation being a primary one. So being obese causes excess inflammation not acutely like in response to an event but chronically and that's not good for you. it's not good for your cardiovascular system. It's not good for your joints. And so spontaneously in our trials early on, people would report, gosh, I've lost weight, but actually like I can I can stand up from a sitting position for the first time in 10 years. My knees don't ache as much. My back feels better. Or some people with Crohn's and colitis reported kind of resolution of their symptoms. So why is this happening? It's because we're sort of taking down that chronic inflammation at a system level. So we're doing a bunch of studies. the first one read out last month on top of medicine for seroriatic arthritis a kind of arthritis and it boosted the effect of that medicine by about 50% to co- prescribe zeppound with it so we're going to take that on medically because that's how the medical system adopts innovations they need the use cases maybe similar to adopting AI technology you need to prove the value in a particular setting and then we're also starting a number of brain health studies right now and we've have a a special purposed GLP1 GIP for brain",
        "start": 1858.24,
        "duration": 3933.8230000000026
    },
    {
        "text": "the medical system adopts innovations they need the use cases maybe similar to adopting AI technology you need to prove the value in a particular setting and then we're also starting a number of brain health studies right now and we've have a a special purposed GLP1 GIP for brain which you know is really a major modern problem and it turns out that for similar reasons that these these medicines downregulate your appetite which is it turns out not really driven by our need for more calories but driven by other selflearn behavior loops sounds like AI more and more doesn't it that it can do the same thing or a similar thing for other harmful self-learned behavior loops like gambling, like alcohol consumption, smoking sessation. So, we're exploring all of these as well, which are, you know, including we're going to take I hope it doesn't I hope it doesn't affect working too hard. No, it's only the adverse ones we're trying to edit out. Yeah, it's only the adverse ones. but it's a common pattern with over food consumption. Actually, there's a parallel for that. That's just a comment for all the startup CEOs. We got a lot of startup CEOs in the in the room here. Be careful if you find your your your willpower is starting to diminish. Stop micro doing [laughter] micro dosing. Yeah. Yeah. So, anyway, that's very exciting. That's so interesting. Yeah. And then, you know, I think on the horizon, people are working on much longer acting, so you can take these less frequently. Of course, we'll launch our oral GLP1 this spring, which I think is a major breakthrough, not just for convenience, but actually global reach. , it looks simple, our medicine in an auto injector, you know, but it's actually the most one of the most complicated drugs marketed in the world from a manufacturing perspective. And we have to do it times hundreds of millions based on the current demand. We just launched in China and India and Southeast Asia. There's a lot of obesity there. We cannot possibly meet all that demand with just injectable systems. So we need to get Southeast Asia really serious diabetes. Huge problem. Yeah. And Southeast Asians sort of lost the genetic lottery of obesity because they're much at lower body weights small gains in obese small increases in the amount of obesity trigger more diseases. So they're they need to to use something to mitigate obesity. Hopefully diet and exercise. If not, they can use our medication, but we have to make enough. And having an oral form that's a chemistry, it's not relying on protein synthesis and then putting it in these sterile injectable systems, just an oral pill. We can scale that massively, man. , so that will launch this year as well. So huge this one idea, you're going to ride this for another 50 years, right? Right. We're hoping to. We're learning from you.",
        "start": 2016.0,
        "duration": 4245.904000000001
    },
    {
        "text": "then putting it in these sterile injectable systems, just an oral pill. We can scale that massively, man. , so that will launch this year as well. So huge this one idea, you're going to ride this for another 50 years, right? Right. We're hoping to. We're learning from you. Hang on a second. I'm convinced. I'm convinced. GLP1. It's the second best technology. That's right. [laughter] Exactly. Yeah. Ours is not un Blackwell. Blackwell is number one. GLP2. GLP1 number two. Ours is not universal to the entire economy just to the human economy. [laughter] Yeah. That's incredible. Very exciting. And you know what? So, you know, one challenge we have is like how can we keep inventing things that are better and better enough that people will pay for them to improve beyond the patent cycle. But has there ever been a a drug? Has there ever been a life sciences technology that has benefited so broadly humanity? The the on the only other I'd say it's a class of drugs and the only class that did something like this I alluded to earlier which is antibiotics. Discovery penicellin invented modern medicine. If we subtracted antibiotics from our lives, we couldn't have modern dentistry. Yeah. We couldn't have surgeries. We couldn't do a So now we take that all for granted. But in, you know, when Fleming this, you know, self-dosed this weird mold he grew in his lab, that was the start of like a major wave. And that lasted into the 90s. So that was a 60-year cycle with a 100 plus new medicines. I think this could be like that. Yeah. , which would be profound, but this is not for an acute infection. It's for chronic disease of the modern homes. That's that's what we're affecting. Well, Dave, did you ever realize that you were gonna have such an easy job? You know, my wife asked me that a few times. Like, why aren't you working? One incredible discovery. One incred you were just running around the forest and you discovered this this thing called GLP1. Yeah, that's what I've imagined. You're digging up stuff and you found this incredible truffle and it's it's solid for 60 years. Yeah. Yeah. Actually, you know, so what's the history of this? So it goes to the 70s and German scientists discovered this thing called the incrretin effect and we call these GOP1's part of this incretin family. These are hormones excreted by our gut which signal the rest of the body that you're fed and we overboost those and that's what is happening. But he observed that if you give sugar orally versus intervenously you get a very different insulin response. Insulin is like the opposite. it stimulates absorption of sugar. It was slower if you give it orally. And so that's what's called the anchorin effect which was the first insight that somehow your body is doing something different when the gut is involved and",
        "start": 2174.24,
        "duration": 4568.544
    },
    {
        "text": "a very different insulin response. Insulin is like the opposite. it stimulates absorption of sugar. It was slower if you give it orally. And so that's what's called the anchorin effect which was the first insight that somehow your body is doing something different when the gut is involved and 80s to the discovery of actually GIP first then GLP. Those are the two parts of zeppbound and later a whole another set of hormones. But one of the things I hope we can crack with our supercomputer and our team is here we had targets but really difficult to drug the halflife of the native human form of GLP is like seven minutes. So to give that as a medicine the native peptide sequence which was identified in the 90s you'd have to like infu walk around with an infusion all day and all night. So that doesn't make for a product. it wasn't until we figured out how to extend that life first to twice a day and then to once a week and now people are working on monthly and even beyond that we could make that effective product. So one thing in AI drug discovery that is really working is this ability to create massive combination possibilities and then test those in silic and and filter out good ideas. We're doing that at scale now. We can do that at even bigger scale with our collaboration. The other side is discovering. So that's the key discovering the lock. Can we find more biology targets using AI and that is the really the holy grail because if we put those two things together then we can model the whole system at once. Could be could be super exciting. Yeah. One of the things that that that that Dave really wanted to do was to put the AI lab, the co-inovation lab here in Silicon Valley and even close right here in AI city, you know, San Francisco is really epicenter of a lot of AI researchers and we have an office here and and so this is going to be either either in South San Francisco which is really the biotech hub of the Bay Area or we can do it up here. That's right. We want to go where people want to live. Yeah. Yeah. Well, San Francisco is pretty cool. It's cool. Yeah, it's cool. Is cool as well. Yeah. Yeah. Yeah. I've heard from from from just one person from one other person. We're very adaptive. You know, we we used to be good at basketball, but now we're good at football. Uhhuh. And so the so we used to be good at chemistry, but now we can be good at AI. Well, you're just good at suffering. Yeah, we're good at something. That's true. Better than the alternative. Yeah. Yeah. It's incredible. And so, so, , GLP1 beyond, you know, one of the things that that,",
        "start": 2337.04,
        "duration": 4867.345
    },
    {
        "text": "we used to be good at chemistry, but now we can be good at AI. Well, you're just good at suffering. Yeah, we're good at something. That's true. Better than the alternative. Yeah. Yeah. It's incredible. And so, so, , GLP1 beyond, you know, one of the things that that, talking about longevity and, right, aging. Yeah. The absence of Yeah. Yeah. subtracting aging. Subtracting aging. Yeah. And and so so tell me is there what is the technology behind that? Is it Yeah. Well, I mean it's an interesting topic. Obviously it's it's attractive to a lot of people because who wants to get old? the sometimes I just want it to be over. There are a number of Yeah. Yeah. Yeah. I get that too. [laughter] Yeah. the there's a lot of biology on what why individual cells expire and you can extrapolate that to cell systems and then organs and then potentially the whole organism. But as we were talking off stage that is not really a problem we work on that way. So that idea is essentially can we extend the maximum shelf life of a human to something beyond what that is under perfect conditions. So let's just say under perfect conditions we're meant we can live up to a hundred years and then for maybe good reasons the system shut down, right? I think there it would be a weird world if people live forever, you know? It would why would we reproduce? How do we evolve? Like there there's a lot of problems with that kind of even philosophically. How does nature fix that original design? Yeah, we're still even philosophically though like then yeah, you know, we would have a a very weird world I think. But I understand why people pursue it. We're more focused on a more practical problem which is if the n if the maximum shelf life is 100 years, how do we get more people a better shot to get that full life and the way we do that is by knocking out disease. So the reason people perished if you look at life expectancy in our country in 1900 it was like 46 years old for a male and the biggest factor there was child death. So you lost life because you died when you were young at a pretty high rate from infection mostly and by having antibiotics and vaccination and other tools to manage childhood disease that quickly shot up. From 1960 till now, we've added about 10 years of life expectancy, mostly through chronic disease extension. Cancer care has improved dramatically. Most companies in this room have had a big role in those chronic disease management, HIV, AIDS, and other new pathogens have been conquered. And that's, you know, now we're we're up to almost 80 years in our country. Actually, the the the number would be more like 84 if it weren't for opioids and traffic deaths,",
        "start": 2491.76,
        "duration": 5181.023999999999
    },
    {
        "text": "a big role in those chronic disease management, HIV, AIDS, and other new pathogens have been conquered. And that's, you know, now we're we're up to almost 80 years in our country. Actually, the the the number would be more like 84 if it weren't for opioids and traffic deaths, United States, both of those. So, self-driving cars can help with one of those. Maybe GLP ones will help with the other because we're studying opioid addiction actually as a as a solution there. But we chip away at it this way. And of course, as people live longer, the incidence of new maladies of aging rise. So the next frontier for us beyond GOP that I'm really excited about and interested in is is dementia and diseases of the aging brain because as we as our the rest of our bodies are able to carry us into the 80s and 90s this is something we haven't really figured out how to address and for quality of life but also quantity of life that's that's going to be important frontier. We're spending a lot of effort in that area. We've got some exciting programs running now in studies, but I think you know through drug discovery that's simulating brain tissue and how to look for new targets and the interaction between targets we don't understand there's inflammation plus protein misfolding happening in the brain the aging brain perhaps we can discover something really exciting and new and so if you take a step back you look at our now looking at our co-inovation lab the the first thing that we have to do is we have to set up the computing platform for the researchers to do the work. And so we have we have the computers, we have we have the the infrastructure layer and we have biono and we have a whole bunch of of of models that mod models and model architectures we've already invented and and we'll get our scientists together and they they can they can start collaborating in that particular area just building the foundations. But but if you had a wish list for the researchers, you know, I know that that and certainly it is the case with with me. I try to influence the researchers, the direction of it, but I try not to be directive. Yeah. And and obviously the reason for that is because we don't know what we don't know and we don't know what can be discovered and and there are many things that are discovered that quite frankly we didn't even know was possible. But once it's it's created, , you know, our our our innovation brain could kick kick in and together try to figure out how to bring that to the market. But but if you had a direction that you would like to set them on, in in what direction would you would you hope that they do some research?",
        "start": 2652.56,
        "duration": 5461.184999999997
    },
    {
        "text": "our our innovation brain could kick kick in and together try to figure out how to bring that to the market. But but if you had a direction that you would like to set them on, in in what direction would you would you hope that they do some research? problems and I think within these we'd have to narrow the scope to make progress and like feel achievement. the first one there's a lot of momentum in our space already which is what I talked about the the the drug design engineer drug design which I mean you could argue a lot of drugs these days you fall into that category you know the target because it's been around and well profiled and you're better customizing kind of the the key to the lock. but there are new modalities that have emerged you know RNA gene therapies etc that really haven't been optimized because they haven't been around as long. So I think that whole suite of problems around drug engineering drug optimization is pretty tractable and I think the NVIDIA scientists coupled with ours could make a lot of progress pretty quickly there. that solution by the way would be highly amendable to our tune lab kind of interface we've built. Yeah. For all of our biotech partners as well. Better drug making through in silicone design engineered. And just so you guys know, there's anybody who doesn't know about Tunab, this this is this is a a platform where where Lily and startups or third parties could work together to both contributing data. Yeah. to advance a particular space and it's built on top of a plat platform that is called federated learning. It's called MVflare that we contributed to so that so that developers and researchers don't have to aggregate all of your data, co-mingle your data, but you could still train it train a model together so that you can benefit together. the the thing that's really since our announcement all day long the number of startups have been really excited about tune labs and and co-inovation and how they could be involved and just coming out of the woodworks and and so I I think the the the vision you have for tune labs and the work that you did and building up tune labs is completely visionary and and it makes possible for collaboration of AI researchers that are that are not in the same company and it's very hard to data protecting intellectual property but the process of improving their idea improves the training of the model itself. So we all gain by participation. There's no fees. We do curate it. So there's like legitimate biotech projects but we will add the product of our work together to the tune lab interface. And so not just lily scientists can benefit many biotech scientists. The other side of the equation of course is target and here I think we need our robotics",
        "start": 2793.839,
        "duration": 5770.7059999999965
    },
    {
        "text": "So there's like legitimate biotech projects but we will add the product of our work together to the tune lab interface. And so not just lily scientists can benefit many biotech scientists. The other side of the equation of course is target and here I think we need our robotics more targets and why do we understand the targets we have better which are probably structurally more complicated than we understand and that's one of the reasons drug drug development fails is we think we have the target but we don't really understand it and that's because we need massively more amounts of experimental data on specific good targets. , so I think here we'll work with you on flushing out. We already have one robotic lab , running wet lab, but we'll build more and we can have them running 247 experimenting around a target space to really fully profile that and then couple that with those engineered drug designs. So that's a little bit harder problem. It's more empirical, but I think machines are made to work day and night to solve this problem. And that flywheel is gonna it's going to fly. I think that you know, Dave, if you if you look at some of the the advances that we've had in other domains, the first the first thing is you need the flywheel to eventually land at ground truth. So, you have to have physical world experimentation, collect that data. and and you close the loop that way. eventually that model becomes sufficiently good that foundation model becomes sufficiently good and you could teach it how to generate be generative and eventually there's a there's a model that is being tested against another model and this other model is the world model or the target model and and the target model along with the model that you you're training runs in a closed loop so essentially the the lab is another model. Yeah. And so you eventually have to to to ground it again by producing and synthesizing the proteins and collecting real data. But we we get ourselves in a synthetic data flywheel and that synthetic data flywheel is incredibly effective. I don't think that's been attempted in our industry and at scale and I think we'll do that here. But I think really taking a handful of targets which we have highly suspect will be useful in key diseases and really doing the full sort of profiling of those in robotic wet labs to train the data set and then use the machines to fill in the fill in the space make better drugs because we understand this is so exciting. It's very it's very it's I think it's singularly true that finally we're going to have we're going to have a lab where the expertise and the scale of that lab is going to be sufficient to attract people who really want to do their life's work in that intersection.",
        "start": 2950.8,
        "duration": 6086.545999999997
    },
    {
        "text": "It's very it's very it's I think it's singularly true that finally we're going to have we're going to have a lab where the expertise and the scale of that lab is going to be sufficient to attract people who really want to do their life's work in that intersection. So yeah, I'm super excited about that. And so one of the things that that that is really cool about this conference is large companies and small companies getting together. this year AI scientists there's a company I met today. We've been working with them for for some time. I hope they don't mind that I mentioned their name. Edison is really terrific. a a foundation model company who who is going to build both the life sciences lab as well as the AI lab or the the the factory a a real robotics factory and and a large scale system LILA are incredible companies they're probably in the audience what are what are some of the companies that you've seen so so robotics labs companies companies AI scientist companies of course Agentic Healthcare Y assistance the work that A bridge is doing and open evidence is doing really really cool work that's that's being done there what are some of the some of the areas that that you've seen that are really cool yeah I mean well I think at the for AI [clears throat] the most tractable problem now that you're seeing more and more on is healthcare service yeah so this is not as complicated as what we're talking about here today but rather How do you replace human level service with agentic service, AI service? And it seems so obvious for what is like the least productive part of the entire economy to adopt AI. But there are a lot of frictions for that. So a lot of our discussions are well how can we collaborate? You know, we run I think it's probably the largest pharmacy direct pharmacy platform in the country, Lily Direct. it's only a year old but it's annualizing close to a billion dollars a quarter right now. Four billion a year just selling pharmacy. So people want to say well can Lily work with us to kind of use your market weight to force adoption and sort of work against you know let's be honest insurance companies like they they don't they're not into change. and physician groups are frightened by some of these technologies. But we really do need to make the US healthcare system more efficient. And in doing so, we can we can actually have more room for innovation, more room for adoption of cutting edge medicines and maybe more accurate and comprehensive workup of people. Yeah. so that's that seems inevitable, but what can we do to speed that up and really harness that? I'm there's a lot of new modalities as I was mentioning earlier to drug targets and really in",
        "start": 3111.44,
        "duration": 6409.985999999994
    },
    {
        "text": "of cutting edge medicines and maybe more accurate and comprehensive workup of people. Yeah. so that's that seems inevitable, but what can we do to speed that up and really harness that? I'm there's a lot of new modalities as I was mentioning earlier to drug targets and really in rate I think the productivity of the industry on new modalities is accelerating and that's exciting and yet it's early days so a lot of companies are combining new and old modalities into bifunctional medicines that's a whole hot field where you have a targeting part and then a warhead part say to kill cancer cells cells and even just refining how we get these medicines to the right tissue is a important problem and there's a lot of interesting new approaches different approaches happening that I took meetings on today that was pretty interesting to me so that's the drug making side and I think here again AI can help us accelerate that but a lot of smart people working on on those problems yeah and of course a lot of people want to talk about GLP1s that's that's my life yeah yeah but it was good you said like small companies and big companies getting together. So here like we're the small company and you're the big company. Yeah. Yeah. Cut it out. And we're getting together. Yeah. Cut it out. Cut it out. But I was going to say like you know the probably Lily has a reputation 10 years ago when I started you were asking about 2017 of like a little bit of a sleepy Midwestern company. But here's a like fun fact for the computer people. I think the first you may may not know but the the first approved biotech product made by a living organism a medicine made sort of in the most modern way was a lily product Humalin which we collaborated with Janentech on and then 12 years later we bought the first supercomput in the pharmaceutical industry and put it in Indianapolis. It was a Cray supercomput was called Big Red. Our our company logo is red. Yeah, Big Red. Very clever. Yeah. And we designed the first approved medicine designed on a computer on that thing. It's called insulin lice pro which is Humalogue. It's still used by type type 1 diabetics and type two diabetics globally today by playing around with amino acid sequences empirically. And always trying to convince me that Lily is cool. We are cool. We are cool. You know we are cool. And we've been working with computers and the cutting edge of science and computer technology. You had me at hello. Yeah. At hello. This just makes tons of sense because it's [laughter] a natural evolution of our company. Yeah. So awesome. Yeah. It is. It is so awesome to work with you and your team and I am so excited about the work that we're about to do",
        "start": 3273.44,
        "duration": 6703.265999999992
    },
    {
        "text": "at hello. Yeah. At hello. This just makes tons of sense because it's [laughter] a natural evolution of our company. Yeah. So awesome. Yeah. It is. It is so awesome to work with you and your team and I am so excited about the work that we're about to do can't imagine a more worthy a more complex more exciting field to go applied computer science to and and for someone who's dedicated a whole career in basically one job of building computers, the opportunity to work with with you and and Lily and the scientists there in service of of the next breakthrough can't be more exciting And so I want to thank you for your partnership and for personally driving this and and the two of us, you know, teaming up together, pulling together the the mights of our two company, you know, hopefully we could go bend bend the arc of of history and see if we can make a difference. That's super exciting. That's so exciting to hear you say that. Thank you for helping make this come together. We're just getting started, but this could be, you know, a new day. Yeah. And if we can accelerate progress even even if we set modest goals, I think we can accelerate progress in, you know, a use case for computer technology that has to be the most personal and impactful for our country and for for the world and for an industry that really needs to find more ways to be more productive. Yeah. With R&D dollars. So, it's it's a worthy try, but I we're gonna do more. We're gonna make it happen. We're gonna make it happen. Ladies and gentlemen, David Ricks and the second most I'm just kidding. [laughter] Thank [applause] you. Thanks. Thank you. Great. Yeah. Thank you. Thank you. [applause] Fun. That was fun to do. Yeah. Thank you. Yeah. Cheers.",
        "start": 3421.76,
        "duration": 6899.425999999993
    }
]