[
    {
        "text": " At Northrop Grumman, we use our AI factory to enable two different types of AI internally. One is what we would call enterprise AI, which is helping our users, our community, to be more efficient and effective leveraging AI tools. And the other is to help our engineers and manufacturing employees be more effective at testing and developing capability to put into our products- what we would call mission AI. It's incredibly critical for us at Northrop Grumman to have this kind of capability on premise. When we think about leveraging AI. There's a lot of different use cases and some make sense in the cloud and some make sense in shared environments, and some have to exist in a private or classified environment. At Northrop Grumman, we have just over 100,000 employees and every single one of them has been trained on how to leverage AI. And so when we bring this AI factory to bear, it is in support of the entire company. Northrop Grumman operates in what we would call a highly regulated industry. And so the ability to bring tools and capabilities like AI to bear, it's important part of our toolkit, and there are times that we're going to do that in a commercial environment. There's times that we might do that in a federal cloud environment. The important thing is that we're able to service the needs of our employees, regardless of what they do, and regardless of where they have to do it. Having a capability that we can add to our existing toolkit that enables us to use our data in a way that's private to us, to provide it to our users and leverage models and train those models in a way that's material to us, gives us, a flexibility that we didn't have before. And I'm talking about, like, satellites in space where you can't go up and touch a keyboard and fix things. And so we've been taking advantage of that. But when it comes to the acceleration of the workforce internally or the ability to test new capabilities in this rapidly evolving landscape of AI, we can slice off workload and provide it to our engineers, and that gives them a flexibility that they've never had before. We don't have to spend a ton of energy or money building up these unique environments. We can take advantage of the one we've already put together.",
        "start": 6.339,
        "duration": 119.78599999999997
    }
]