[
    {
        "text": " AI is about intelligence. If you have to build intelligence, open models need to exist. Open models gives us the ability to extend and to fine tune these models in order to meet the requirements for specific workflows in specific industries. Open source AI models give you more visibility into what's happening, into the reasoning itself, as well as more customizability. And CrowdStrike is on a mission to stop breaches, so we protect the world's largest and most sophisticated companies against cyber attacks. The most important thing for us is to be able to take the expertise that our humans were delivering to customers and turn those into agents, so that those agents can respond at machine speed for the attacks of modern day and the future. Nemotron help us do that, and make sure that we have full control over the expertise itself. Charlotte is our virtual analyst that will help security teams with getting the answers they need, triaging security alerts, responding to them, and as well as automating the work itself so that they can move up the value chain and work on managing agents instead of managing alerts. Agents are an integral part of the whole autonomous workflow, and the idea here is to deliver these agent engineers at progressively higher levels of autonomy. AI is a very integral part of the Synopsis strategy. All our customers are racing to meet impossible deadlines in terms of intercepting their market windows. The whole process of chip design and system design has become incredibly complex. Our vision of AI is to really deliver significant autonomous functionality to many, many aspects of the engineering workflow. The world expects AI agents now, so if you are a merchant, you want your catalog now to be ingested into all the AI experiences. We want to power every transaction that happens in the agentic economy. Now, because we have open models which we can deploy on the GPU, and we have full control of the stack that allows you to fine tune each of these aspects very well, as opposed to simply just writing prompts. This is the problem we have been able to solve on agentic commerce, and the key player in that partnership was Nvidia. Nvidia and CrowdStrike are on a big mission together to really prevent the future of AI-based attacks. Nemotron is key for us because we can pick and choose the best balance of reasoning and performance, and also fine tune it to get the outcome we need. So in general, open models is going to accelerate innovation. We of course rely on our partnership with Nvidia for many of the components with respect to open models like Nemotron, the Nemo agent kit to help us rapidly build agents for our industry. I believe agentic commerce will be a reality. It's not a fiction anymore.",
        "start": 6.84,
        "duration": 150.686
    }
]