[
    {
        "text": " Packing the power of the NVIDIA Blackwell architecture in a compact, energyefficient form factor, the NVIDIA RTX Pro 2000 delivers AI acceleration for professional workflows across industries. Designed to bring next generation performance to a range of professional workflows, providing incredible speedups for engineering, design, content creation, AI, and 3D visualization. [music] For product design workflows, the RTX Pro 2000 boasts 16 GB of ultraast GDDR7 GPU memory to seamlessly elevate complex multi-lication workflows, including local generative AI to aid in the conceptualizing process. Here with the use of Comfy UI, generative AI imaging models are providing infinite concept iterations. This generative AI concept workflow also allows traditional sketches to be utilized [music] to guide and direct the design process, generating visualizations of the product before modeling even begins, all locally off the GPU. The CAD modeling process brings our design to life in Autodesk Fusion with smooth performance and accurate viewport feedback [music] as expected with RTX technology. Optimized for mainstream design and AI workflows, the RTX Pro 2000 offers up to 1.4 times faster computerated design performance and 1.6 times [music] faster 3D modeling and rendering speeds. Compared with the previous generation, here the design can be built to real world standards in Fusion, all while simultaneously working with generative AI in the background. Beautiful designs, AI performance, seamless modeling, and visualization, all locally produced on a compact powerhouse GPU. The RTX Pro 2000's expansive memory unlocks the full potential of accelerated compute and ray tracing along with the latest in creative technologies, empowering you to work faster, smarter, and at a whole new level. A balance of performance, power, and [music] form factor. The RTX Pro 2000 meets the demands of modern workflows, empowering professionals to bring their ideas to life with speed and precision. Visit nvidia.com for more information.",
        "start": 5.12,
        "duration": 270.71999999999986
    }
]