[
    {
        "text": " Physical AI is about bringing artificial intelligence into the real world. Cities are crammed full of great rich sensor data, video data that could be used to help drive smarter decisions. Milestone has got this really rich history of large-scale video technology deployment and we want to try and use that heritage to help cities drive smarter decisions by training AI models. For us, we think we can help them do that anywhere from data collection all the way through to deployment. K2K is an Italy-based company. We have been working for more than 30 years in the production of neural networks architectures to extract the meaning in real time from video streams. We have been working with several cities in order to enhance and enable cities to manage their infrastructure and also capitalize on the data and knowledge that there is already extracted and capitalized on. What we're doing with Aquila is we're working with operator of large-scale portfolio of buildings and infrastructure, and we are helping them to transform and make their buildings and their portfolio more efficient. So we are developing specifically AI agents to accelerate the decarbonization of the portfolio of our clients. So the AI agents will detect across a large volume of buildings and infrastructure. We have been working seamlessly with NVIDIA and with their software SAC, specifically Metropolis and NIMS, AI Blueprints and Define Tuning Microservices, to develop several use cases and deploy them in smart cities. Lately, we have been developing the VLM, integrating NVIDIA VSS for video search and summarization, and we have been developing a global VQA, which stands for Global Video Question Answering. And it's a technology that allows municipalities to have instant insights in natural language on whatever is happening in the city. And also it produces automatic reports that are sent to the city officials on hourly basis. So being able to capitalize on that knowledge is one of the most important benefits for them. Within NVIDIA and the city of Genoa, we're building this incredibly rich data set. Genoa's an interesting use case because it's got a complex city environment. It's narrow streets, it's motorcycles, but that translates really well into other city environments. We then take that training data and produce the vision language model, which can then be used for smarter decision-making by other cities. Our aim is to take that one step further, is to build the world's largest AI video data library which is anonymized, compliant and traceable. The most exciting thing, in my opinion, is that we are really redefining a new evolution on technology. We are bridging from physical AI to the digital world. Now we are developing and deploying models right now in cities, enabling a better future, a more conscious and awareness future for cities and citizens, but not only in there. And being able to put all of this data together is one of the most exciting things, obviously.",
        "start": 4.437,
        "duration": 192.82800000000006
    }
]