[
    {
        "text": " Hi, I'm Jesse Clayton, product marketing manager for AI infrastructure at NVIDIA here at Supercomputing 2025. More than ever, scientific discovery relies on converged high performance computing and AI. But meeting the needs of today's workflows demands extreme code design, hardware and software, built-in synergy to deliver optimizations across the entire stack and accelerate breakthrough science at scale. Nvidia's platform spans GPUs, CPUs, DPUs, nicks, scale up networking, scale out networking, and software. All optimized for accelerated computing. Artificial intelligence is impacting every workflow. And mixture of experts AI models is a great example of a technology that benefits from extreme code design. With complexe models like Deepseek R1, Nvidia GB200 NVL72 delivers up to 10x performance per dollar, 10x performance per watt, and 10x the revenue compared to H200. This incredible industry-leading performance is delivered through Blackwell GPUs, an Envy Link 72 GPU domain, Dynamo software, and more. In addition to this, NVIDIA CUDA X with more than 6,000 applications from life sciences, material science, physics, quantum simulation, CFD, and much more form the foundation of modern scientific computing. Researchers rely on these applications to reach new breakthroughs and discoveries. Supercomputers worldwide are built on the NVIDIA platform. With just last year more than 80 new systems having been announced, 300,000 GPUs delivering more than 45,500 exoflops of AI performance. Argon National Laboratory's Solstice system is the industry's clearest example, delivering more than 2,000 exoflops of AI performance. That's more than the entire current top 500 supercomputers combined and 25 times the performance of the most recently announced non- Nvidia system. At Supercomputing, we're announcing three new systems. Rekin and Nvidia are partnering on two new supercomputers to accelerate their AI for science and quantum HPC hybrid computing initiatives. These systems will be built on GB200 NVL4 and Quantum X800 Infiniband networking. Also, the Texas Advanced Computing Center and Dell are announcing Horizon to accelerate the characteristic science applications program. With more than 4,000 GB200 GPUs, 9,500 Vera CPUs, and Nvidia Quantum X800 Infiniban networking, it will be the most powerful supercomput dedicated to academic research. Extreme code design, hardware and software developed in synergy is the reason why the NVIDIA platform has become the engine of AI for science. Across the generations, the cumulative flops of systems built on the NVIDIA platform tower over any alternative. And looking ahead, Ver Rubin will enable greater scale and connectivity that will pave the path for the discoveries that will define the next decade.",
        "start": 0.56,
        "duration": 390.8789999999999
    }
]