[
    {
        "text": " [Music] Thank you, Jensen. Thanks for having us. You know, we're excited to announce the latest chapter of our partnership. I know we've worked together since 2019 building solutions that combine the NVIDIA DGX base pod with our technology, multiple super pod architectures, and of course the Nvidia cloud program designs, but more importantly, super excited about the fact that we've served hundreds of customers around the world, bringing them real value. Yeah, today is such such a big day. It's a huge day because we're announcing a revolutionary product at a revolutionary time. Exactly. You know, this is you know, we've been working together now for so long. DJX1 was the world's first AI supercomputer. That's exactly. And it was connected to Net Net. That's right. And we use NetApp all over our company. I love the fact that you are multicloud and you're a hybrid cloud with one basic platform. You can manage your storage. You can manage all of your company's data from structure to object to files. Multimedia, multimodal data. Now, that's right. Like today, today's world is complicated. That's exactly insanely complicated. And the vast majority of of our data is actually multimedia and multimodal. And so that's got to be 90% of NVIDIA's data is unstructured. and and and now with and with NetApp we can manage that coherently you know on across all of the clouds and and and hybrid cloud and the and the thing that's really really exciting is that today we're announcing a dream come true for both of us you know we reinvented computing accelerated computing reinvented computing AI reinvented computing every layer of the computing stack has been reinvented from the chips to the systems the software where the model the applications on top and now we've entered into the world of agentic AI but those agents learn from data that's exactly and they operate on data isn't that right they learn from data and they operate on data and the most important thing is data is the food of AI that's exactly right okay it's the food of AI and so so it's the food of these agents that's what the agents eat that's exactly right what we're announcing today bringing our two companies technologies together is exactly that. How do you bring accelerated computing technologies and your software stack for AI data platform together with NetApp technologies? We're announcing the NetApp AFX family which combines a highly scaled extreme performance composable disagregated storage architecture that can bring near data compute together with exabyte scale data pools, hundreds of pabyte scale name spaces so that you can bring performance and precision to data scientists while giving IT teams a familiar set of technology. technologies that they can scale efficiently. And we are also bringing together the NVIDIA AI data platform technologies together with a suite of technologies from NetApp software capabilities called the NetApp AI data engine that can make AI simple, affordable, easy. We can make",
        "start": 1.12,
        "duration": 425.2789999999998
    },
    {
        "text": "teams a familiar set of technology. technologies that they can scale efficiently. And we are also bringing together the NVIDIA AI data platform technologies together with a suite of technologies from NetApp software capabilities called the NetApp AI data engine that can make AI simple, affordable, easy. We can make yourselves to discover their data, to catalog it, to be able to implement guardrails, and to transform and enrich and serve that data efficiently to the LLMs and the accelerated computing architectures that you guys are so famous for. So, we're really excited. It's groundbreaking. It allows us to bring our mission of helping our clients get knowledge from the vast amount of data that we store for them. Well, this is exciting because AFX and the AI data engine is a complete reinvention of data processing as we know it. Just as we reinvented computing, we're now going to reinvent data processing. Now the thing that's really incredible is in the old days I guess we still do it now a lot of enterprise what we believe to be enterprise knowledge is embedded into structured data that's correct and and the way you index structured data the way you query structured data using SQL for example fundamentally different than the way we do data processing and and data storage in the future. Semantic AI semantic a data processing includes embedding which is discovering the meaning of the data. indexing and indexing is not you know it's not not hash tables. That's right. You know it's not trees and graphs. indexing now is a neural network that indexes it nearest neighbors. The technology is fundamentally different. it's vectorzed and so it's a vectorzed database and you have to index it in a vectorzed way and the way we search it and query that engine is a is an AI query and we're we've done we've done so now in a way that allows us to do it in a multimodal way. So whether it's video or audio or text or PDF file which is you know that's I think the vast majority of NVIDIA's knowledge is in PDF and so all all of these different modalities and for if you're a drug discovery company maybe it's chemicals and and proteins you know maybe a health records it's all in different different types of data structures and and different modalities and and now we have an AI processing engine that allows us to embed the knowledge and query it based on the knowledge that you're looking for, the insight that you're looking for. That entire platform we've been working on together for some time, and I'm just incredibly excited that this new way of connecting your company's knowledge base to these AI in AI agents are now possible. This is a big day. Yeah, we're super excited. You know, it has been a long-term dream for us to be able to help our clients to extract the knowledge that exists in",
        "start": 214.799,
        "duration": 793.5199999999996
    },
    {
        "text": "new way of connecting your company's knowledge base to these AI in AI agents are now possible. This is a big day. Yeah, we're super excited. You know, it has been a long-term dream for us to be able to help our clients to extract the knowledge that exists in unified data storage. Now, what we are able to do exactly as you said through a semantic representation of the data, talk about a unified data model and to do so without all of the constraints of centralized processing. You know, our AI data engines will be available in a software model that can run on any Nvidia GPU anywhere in the world, including your RTX Pro servers. Incredible. This entire software defined platform of yours either runs on prem. You have an appliance that you can offer to customers. You can run on any OEM servers. You can run in any cloud because NVIDIA's GPUs in every cloud. You support all the different versions of our GPUs, right? It's incredible. And so now AI AI, you know, AIs could talk to their data. That's ex, you know, what's really amazing is just as search has been revolutionized, we used to do search. Today, we just ask the internet a question. Exactly. Right. That's And in the f in the past, we'll find our files, pull our files out of storage, process it somehow. In the future, you just ask the AI, ask NetApp. Exactly. some question. Ask it. The question could be as comprehensive. The prompt could be as deep as you like it to be. That's exactly with lots and lots of research that it has to go and do. And NetApp will just go into the storage system and find you the answer. We actually believe that the world of storage and data will transform from classic protocol-driven data operations to agentic data operations where our agents just like you said Jensen will be able to have a semantic understanding of the data across the hybrid cloud wherever your data exists and we'll be able to retrieve the data that you are looking for through any framework. network to access it, whether it's natural language search or conversational, you know, access to data. And it makes it so much easier for our combined clients to be able to get value from their data. An additional capability that we're excited about and our clients are, you know, super excited about is really how do you preserve all of your security, your guard rails, the ability to track data changes, the ability to track the lineage of data so that they can make sure that their models are using high quality data and that they can be efficient in their pipelines. And so again, our two technologies working together helps our clients be able to extract value from their data but keep it compliant with all of the risk management policies and security policies in their enterprise.",
        "start": 402.24,
        "duration": 1141.6009999999999
    },
    {
        "text": "are using high quality data and that they can be efficient in their pipelines. And so again, our two technologies working together helps our clients be able to extract value from their data but keep it compliant with all of the risk management policies and security policies in their enterprise. here. That's right. Isn't that right? That's exactly. you know, we we process a mountain of data here because we're training AI models and and you you now need AI to also find the information that is semantically similar to other other data that maybe we would like to train an AI model with. and and so how each one of these sto objects are embedded depends on the on the AI model that embedded it and so we need to track that and make sure that it's consistent over time and using your tools using your file file system we were able to tell which ones have already been embedded properly which ones are out of date which ones are using a different embedding system that's that tracking that genealogy is really really important to us. Thank you. This is so great George. This you and I we start our company started about the same time. This is the first major reinvention of the storage system. That's great. For 30 since 33 years ago that NetApp was founded. That's right. This is a very very big deal. Now for us this is a huge deal because for the very first time Nvidia GPUs will find its way into file systems and storage systems all over the world. for the very first time. That's an opportunity for us. Exactly. So, this is a great growth opportunity for both of us. Yeah, we're super excited. You know, we worked on this for a long time and our, you know, composable disagregated architecture brings together near data compute with your accelerated computing capabilities and a zero copy way of transforming and enriching data and active metadata doing the processing right in the storage. Correct. Yeah, it's really incredible. Instead of pulling the data out, that's exactly do processing. You know, this is the way kind of a lot of companies do it today and we do it too. We have multiple copies of the same data. That's right. Now, in the world of AI, the data is huge. It's video data. You know, maybe it's physical world data and and in order to process it, we have to bring it out of the storage and do processing wherever the systems are. Today, we in the future, we'll just do it right inside. Absolutely. And you know we are already seeing examples of this in large clients around the world. You know, you look at the Johnson and Johnson, they are trying to accelerate drug discovery and they have their data spread across a hybrid data set. And together we're helping them build this, you know, accelerated computing and data fabric that combines",
        "start": 579.2,
        "duration": 1469.7609999999993
    },
    {
        "text": "this in large clients around the world. You know, you look at the Johnson and Johnson, they are trying to accelerate drug discovery and they have their data spread across a hybrid data set. And together we're helping them build this, you know, accelerated computing and data fabric that combines those with cloud environments so that they can get one seamless topology of data. We're doing the same thing with Yale School of Medicine where they're trying to combine different types and modalities of data, research data with clinical data as part of their computational health platform that again combines our technologies so that they can accelerate oncological research. So super excited, you know, we're delivering real value already to clients. This set of technologies and capabilities exponentially expands those opportunities for our clients. AI is reinventing computing as we know it and then today we're reinventing storage AI for the very first time and this is such a big deal. I'm I'm excited that it's reinventing both of our companies and it's it's as you know this is the biggest industrial revolution the world's ever seen. this is complete reset of the computer industry and it's created a huge opportunity for me. , I think it's going to create a huge opportunity for you and this partnership has been a great joy for me. Thank you so much. Thanks for having us. Our clients will be excited to see much more co- innovation from us going forward. Thank congratulations on the launch. Thank you. Thank you. Thank you very much.",
        "start": 744.56,
        "duration": 1628.0819999999999
    }
]