[
    {
        "text": " When innovation meets scale, [music] new possibilities emerge. Together, Nvidia and Alphabet are [music] pushing the boundaries of AI, advancing robotics that can learn and adapt, accelerating drug discovery and optimizing energy grids for a smarter, more sustainable [music] world across Alphabet. We're turning breakthrough ideas into realworld impact with collaboration [music] throughout DeepMind, Isomorphic Labs, and X's Moonshot projects such as [music] Tapestry and Intrinsic. The same platform powering today's leading AI is now available to every enterprise. Through Google Cloud, we're enabling the next generation [music] of AI that learns, reasons, and takes action, transforming work in the digital and physical worlds. For over a decade, [music] we've built a full stack foundation for AI, combining high performance infrastructure, open- source [music] frameworks, and seamless integration across Google Cloud services. At its core is cuttingedge accelerated infrastructure, delivering the [music] latest NVIDIA architectures to customers at unprecedented speed and scale. Google's AI [music] hypercomputer supercomputing system architecture with optimized AI infrastructure, non-blocking high-speed [music] networking, advanced liquid cooling, and flexible consumption models. Customers [music] can move faster, scale smarter, and run more efficiently. For organizations with the highest security needs, NVIDIA confidential computing can help safeguard both [music] sensitive data and AI models throughout their life cycle. As frontier models like Gemini unlock new levels of reasoning [music] and Agentic AI begins to plan and act autonomously, a new wave of intelligence is within [music] reach. Built on secure, scalable infrastructure, Google Cloud is among [music] the first to bring NVIDIA's groundbreaking Blackwell platform to the cloud. Featuring GB200 systems and advanced hardware across our accelerator optimized machine [music] family, including A4X, A4, and G4 VMs, this platform is purpose-built to tackle the most [music] diverse and demanding workloads from agentic AI and advanced scientific simulations [music] to next generation physical AI applications. For the first time, that capability extends beyond the cloud to wherever enterprise [music] data resides. With NVIDIA Blackwell's breakthrough performance and advanced security features like confidential computing, [music] Google distributed cloud lets organizations run Gemini models on prem, enabling sovereign [music] AI innovation for sectors like government, healthcare, and finance, where data must stay protected. The NVIDIA and Google Cloud partnership [music] goes beyond infrastructure, offering tightly integrated platforms, performance optimized [music] software, and managed services that accelerate the path from development to deployment. Accelerate [music] development with NVIDIA DGX Cloud, a full stack platform co-engineered with Google Cloud for [music] AI model training and fine-tuning and offering direct access to NVIDIA expertise. Streamline deployment with NVIDIA NIM microservices. integrated [music] across Google Kubernetes Engine, Cloud Run, and Vert.Ex AI. And [music] with NVIDIA Omniverse, build largecale digital twin and simulation applications [music] to accelerate the development and testing of physical AI. [music] From agents that reason to models that see the unseen to digital worlds brought to life, NVIDIA and Google Cloud [music] empower developers, builders, and creators everywhere across every [music] industry. The future is taking shape.",
        "start": 1.12,
        "duration": 432.8790000000001
    },
    {
        "text": "and simulation applications [music] to accelerate the development and testing of physical AI. [music] From agents that reason to models that see the unseen to digital worlds brought to life, NVIDIA and Google Cloud [music] empower developers, builders, and creators everywhere across every [music] industry. The future is taking shape. into action. Engineer [music] what's next with NVIDIA and Google Cloud.",
        "start": 217.36,
        "duration": 445.44000000000005
    }
]