[
    {
        "text": " AI touches the beating heart of every business that deploys it. But AI needs to be trusted in order to trust it. You have to understand it. I know there's a lot of people around the world that haven't started using AI yet. And I think that's because it hasn't been brought to a point where it can solve the problems in a way that they can interact with. We know that open technologies have really driven change in the past. For example, think about how the internet transformed retail banking and health care. We think AI also needs that kind of open foundation. People have to trust it and they have to understand how it works in order to customize it. And deploy it for all the different kinds of problems in all the different industries. AI is touching. Nemotron is embodying that idea in AI. We're trying to make the most open approach to AI development that the world has ever seen. NVIDIA's goal with Nemotron is to bring the benefits of accelerated computing to AI by optimizing the models and everything else. We know that a faster model is a smarter model, because it can get more thoughts done in the same amount of time. Nemotron is not just a model, it's all of our AI technology that helps us build the GPUs and systems for the future. There's a lot of questions about how networking or the GPU should work in order to make AI progress, and we are able to answer those questions better because of building Nemotron because we provide Nemotron as an open collection of technology. Different companies can use Nemotron in different ways. For example, ServiceNow trained their own AI model using the Nemotron training data sets. We're also providing post training technology. We were able to take the Llama models from Meta and add reasoning technology with Nemotron. We're releasing our pre-training data sets. All of the technology that goes into post training and alignment, as well as the numerical algorithms and the GPU software that makes it seem. Sometimes when we talk about AI, people oppose general intelligence versus specialized intelligence, and we actually want both. We want generalized intelligence because that's the raw material. But we also know from real life that general intelligence isn't enough. We have to apply ourselves, and we have to be in the right place at the right time to solve problems. That's where specialized AI comes in. Every company has a unique way of thinking about the problems that they're solving with their business. That's something that only they know. Our goal with Nemotron is to raise the bar for general intelligence, but provide that intelligence in a way that allows businesses around the world to specialize it for their own problems. AI is continuing to grow and diversify, and we're really excited about small models, large models working together. And with Nemotron technology. We're hoping to support every company around the world,",
        "start": 1.633,
        "duration": 161.26899999999998
    },
    {
        "text": "provide that intelligence in a way that allows businesses around the world to specialize it for their own problems. AI is continuing to grow and diversify, and we're really excited about small models, large models working together. And with Nemotron technology. We're hoping to support every company around the world, Nemotron is a huge effort, and NVIDIA, with many teams across many parts of the company coming together to bring the insights from accelerated computing to AI, to do full stack optimization all the way from the model architectures and the algorithms down to the networking in the compute that runs it. It's a great honor for me. When I wake up in the morning and try to decide, why am I going to work today? To feel like I'm able to contribute to the development of this technology in an open way that benefits developers and researchers around the industry. That's one of the things that makes Nemotron special.",
        "start": 175.5,
        "duration": 194.101
    }
]