[
    {
        "text": " The United Kingdom, birthplace of the Industrial Revolution Human output multiplied Cities lit Nations connected Then computing Babbage imagined the Programable computing machine. Lovelace wrote its first program Turing dreamed of machines that could think Imitating intelligence And Berners-Lee invented the web Weaving humanity's knowledge into a single fabric Now the AI revolution With a new kind of factory powered by NVIDIA The age of AI has begun Here in the UK began the revolution that shaped our modern world And here it begins again Welcome to the stage NVIDIA founder and CEO Jensen Huang The UK AI ecosystem It's great to be here Today marks a historic chapter in the US, UK technology collaboration Ladies and gentlemen, the Prime Minister of the United Kingdom The UK is the third largest AI startup ecosystem in the world And so today we're announcing NVIDIA is going to invest £2 billion into the AI startup ecosystem of the UK So it's a historic day The biggest ever tech agreement between the United States and the United Kingdom I wanted to thank you for your investment and confidence in the United Kingdom And the flow of investment that has triggered £250 billion worth of investment across the Atlantic, £150 billion coming into the United Kingdom And we'll be the beneficiaries of this partnership This new agreement is a really special moment for me So I say thank you to you, Jensen, so much. This is the DGX 1, this is the world's first AI supercomputer Prime Minister Starmer This is the UK's age of AI A new industrial revolution begins Thank you so much. Thank you sir. The Secretary of State of Science and Technology is here Liz Kendall We have to show this thing, which some people find strange and confusing, can open doors People have to walk through them But together with you, we can open those doors Secretary Lutnik. Secretary Kyle. I'm incredibly proud of your leadership You're investing here that makes me proud And what you showed tonight is that we are here together We want Britain to win It is important for us that you win, that it's important that you harness AI here for your victory, for your great people We are not the biggest country in the world, but we have the greatest insight into health activity Because of the National Health Service, 93% of Britains use state education So the way that we can harness the power of human behavior safely, respecting people's need to have their own data kept for them, but also used anonymously, safely and wisely, so that we can create the kind of scientific endeavor that can flow from having the incredible supercomputing, hyperscale facilities that you are now responsible for investing in Britain I believe the greatest natural resource of the UK is the incredible researchers and scientists It is really quite extraordinary Your universities are creating critical thinkers, independent thinkers, creative thinkers, and they invent amazing things",
        "start": 0.233,
        "duration": 211.29899999999995
    },
    {
        "text": "having the incredible supercomputing, hyperscale facilities that you are now responsible for investing in Britain I believe the greatest natural resource of the UK is the incredible researchers and scientists It is really quite extraordinary Your universities are creating critical thinkers, independent thinkers, creative thinkers, and they invent amazing things The UK AI, it’s started Thank you very much for coming.",
        "start": 226.333,
        "duration": 215.59899999999993
    }
]