[
    {
        "text": " Welcome to Zcass everyone. I'm Zas Garval from ZK Research and I'm here in the Cisco stand at NRF 2026. I'm with Lawrence Wong. , you run all the networking business. You're the network guy. Well, you know, just in specifically, I own the wireless business and our network platform. So, Okay. Wireless and network platform. Well, that's a pretty big business. It is. Yeah. And so we're here at NRF and just I want to talk to you about some of the networking products, but you know you talk to a lot of customers. It's a big part of your job, right? And talk about just how important the network is within retail today. Yeah, I mean look, I I think it's no surprise to anyone of your viewers here that the network is foundational to retail. It is really the central service nervous system for the operations for the digital experience and everything that retailers care about. The foundation of that is a strong secure network. Yeah. And one of the I think the interesting changes that's happening to campus networks including retail networks is AI. And so when we talk about AI and networking historically, we've always talked about data center, data center, data center. But I know one of the things that in fact your CEO Chuck Robinson was talking about in the earnings calls is with the growth of AI comes more inferencing traffic that is largely done across the campus network. And so historically, you know, you think of a retail network, you'd have some peaks in traffic utilization, but we're with with AI coming, we're going to have like just the network being like pegged out, right? Like it's going to have a very very consistent high level set of traffic, you know? So like I I I think that's an interesting point because if you think about it, you know, AI today, you think about the foundational models, we're not talking about the next generation foundational frontier models as much anymore. It really is about yet much more bespoke models that we think are going to proliferate into the enterprise, into the campus, small language models, compute at the edge, being more distributed to the task at hand. And yes, I think it's going to drive an increase in traffic, but I also think it's going to drive a little bit more of a uncertain spike spikiness in traffic, especially as customers figure out what workloads actually matter and they have. Yeah. And so how are you helping your customers see better on the network to understand like what's going on to make sure that the you know maybe there's more traffic but the customer experience hasn't been degraded. Yeah. So Cisco obviously has a rich and deep portfolio. A big part of the investment is how we actually help our customers assure the network experience. That starts with you know integrating thousand eyes capabilities much more",
        "start": 5.52,
        "duration": 298.1589999999999
    },
    {
        "text": "know maybe there's more traffic but the customer experience hasn't been degraded. Yeah. So Cisco obviously has a rich and deep portfolio. A big part of the investment is how we actually help our customers assure the network experience. That starts with you know integrating thousand eyes capabilities much more as own infrastructure. It's it's also integrating Splunk to give that richer layer of observability for that end user application experience and bringing all these things together in much more holistic way similar to what we have here. Yeah. And with more AI comes the need to secure the network differently. And I think one of the nice pivots Cisco's made is to this shift to secure networking. In fact, when I think of Cisco historically, it's it's had a lot of great technology, security technology, but it there wasn't really that tight network coupling. And so, I know since you Patel, the chief product officer has been running, he's talked a lot about secure networking, not security and networking. Yes. Right. And so, talk about what secure networking is and how that's different from the way maybe customers think about security before. I mean, look, secure networking is more than just, you know, a specific protocol. It's really thinking from the very bottom of the stack all the way to the top. Thinking about how we actually build our devices, how we get ready for a postquantum compute era. How do we actually make sure that we're building capabilities so that our customers can actually adopt security capabilities as easily as possible. If you think about our latest devices, incorporating capabilities like live protect, you know, compensation controls so that you can actually deal with security vulnerabilities on your time. These are things that we're integrating into our networking stack to make it much more seamless and ultimately secure for our users here. Yeah. Let me ask you a question then with you since you mentioned device people historically as collaboration end points but they're as much a networking endpoint now as they are anything else they with. Yeah absolutely. Look I I think all our devices and network devices especially wireless. It's really becoming a sensor. It's extending more than just serving clients and it's really becoming a hub for IoT applications for understanding you know the environment both physical as well as digital in a much richer way than ever before. Yeah. Now we're standing in front of a couple displays here and I'm assuming these are some sort of retail dashboards we're looking at here, right? Yeah. And so what are you showing here? Yeah. Why don't we start with this one here? So this one here is a combination of several things. It's showing things like our, you know, physical security smart cameras, the Moroi cameras. It's showing the rich analytics that you can pull from it in real time. It's showing the Cisco store from a networking operator perspective that",
        "start": 154.239,
        "duration": 562.3979999999999
    },
    {
        "text": "here? So this one here is a combination of several things. It's showing things like our, you know, physical security smart cameras, the Moroi cameras. It's showing the rich analytics that you can pull from it in real time. It's showing the Cisco store from a networking operator perspective that This is a live store. And of course, you know, looking at our ecosystem partners in this case, building out retail specific dashboards to understand the actual footfall patterns inside a store location. And then if you stand look here on the, you know, my left, this is really around business analytics. really understanding how much are we actually, you know, making per user, how long does it take to serve our users, what payment processing apps, you know, , credit card systems are, , we primarily using. And all these things come together to give you a 360 view of the retail environment from the infrastructure to the actual business operation side of things here. Yeah. And this is live data from your store. This is live data from a store pulling from our Cisco stores in the Bay Area. Yeah. So, it's telling me is people like Visa or they're using the corporate MX and the rest use Mastercard. There you go. Yeah, that's good to see. And you know, 2% get in declin here. What's up with that? [laughter] Well, they got check their bills that they paid them on time. So, yeah. No, that's great. And I think this again is a case where you can manage what you can't see. And so now you're giving them the data to be able to see more. In fact, what I liked about this one was you can actually see you know the through Splunk the availability of all the the different types of devices and things and so yeah absolutely and you know I think I'd be remiss if I didn't say a big part of what our retailers care about beyond just secure infrastructure that's always on that's always connected is how do they expand to net use cases and that's why with our Wi-Fi 7 access points we really gone beyond integrated Cisco spaces technology to unlock net new use cases to make it a lot easier for our customers to seen the benefit. Yeah. And [clears throat] nothing says proof to me like actual customers. Do you have an example of a customer? Keep it generic if you want that maybe has deployed this and and the benefits that they've seen or the outcomes. Yeah, absolutely. So, some of our customers have integrated our spaces SDK into their mobile application. They use this for things like seamless open roaming being able to uniquely identify you know the customer journey from instore to out of store and ultimately you know building in the infrastructure in such way they could extend it for you know future use cases around asset tracking indoor wayf",
        "start": 289.199,
        "duration": 814.4770000000002
    },
    {
        "text": "use this for things like seamless open roaming being able to uniquely identify you know the customer journey from instore to out of store and ultimately you know building in the infrastructure in such way they could extend it for you know future use cases around asset tracking indoor wayf looking at our technology to help them with that. Yeah, and I I think you know as we look ahead into into the rest of the calendar year and going into your next fiscal year, I would say that we saw more network innovation on Cisco in 2025 than we've seen in a long time, right? Absolutely. Maybe more than a decade. And so is this now a year where you let these products bake and curate or is there like equal amount of innovation coming? I would say that you know we only want to keep accelerating our innovation. We know that you know the expectations of our customers is not getting any less and the fact is with the adoption of AI tools and helping with things like software development with quality we can move faster than ever before and that's our expectation that we're going to you know bring to Oh and I did want to ask you about Wi-Fi 7 too since you are the wireless person. , it's interesting when Wi-Fi 7 came out, I think a lot of people initially looked at as 6E 7 kind of two sides of the same coin, but as they've tested 7 and really open up that 6 gig spectrum as well as some of the other benefits, I I think Wi-Fi 7 is the first truly like gamechanging wireless that could actually cause people to forward roll their depreciation cycles. And so, how excited are you about Wi-Fi 7 at retail? Yeah, look, I I think for retailers, it is clear it's no longer just about peak throughput and performance. Yes, that is important, but what is more important is the deterministic reliability of your infrastructure, especially for wireless, the proliferation of those IoT devices, of the point of sale devices, everything that connects in the store wirelessly. You need that reliability more than ever before. And the technology that's built into Wi-Fi 7 to help with that is more critical than ever for retailers. All right, Lauren. So, we've got Wi-Fi 7 coming, AI to the campus or the or the the retailer. In fact, as I walk around this expo hall here, I there's not an aisle you can go down where you don't see AI. But you remember, you have to have secure networking, not security and networking to make sure your customers are protected. 100%. Yeah. So, is that about it? That's about it. All right. So, on behalf of Lawrence Wong from Cisco, I'm Zaval from CK Research from the Cisco stand saying thanks for watching. , give us a like and hit that subscribe button and we'll",
        "start": 416.319,
        "duration": 1079.9170000000004
    },
    {
        "text": "sure your customers are protected. 100%. Yeah. So, is that about it? That's about it. All right. So, on behalf of Lawrence Wong from Cisco, I'm Zaval from CK Research from the Cisco stand saying thanks for watching. , give us a like and hit that subscribe button and we'll Zcast.",
        "start": 550.56,
        "duration": 1082.9170000000004
    }
]