[
    {
        "text": " Welcome to Zcast everyone. I'm Z Caravala from ZK Research and I'm here at Forinet's headquarters in Sunnyville. I'm with Nav Sha your SVP of product and solutions for Forinet. You've been here a little over a decade now, right? And this is a big week for you guys. You turned 25, right? So happy birthday, Forinet. what's that mean to you the the turning 25? Yeah, first of all, thank you for having here having me here. it's incredible, right? Fortnite we finished 25 years and I'm just so proud of being here for 11 years cuz I remember the day I walked in and this focus on innovations still hasn't changed, right? Kenzie and Michael Z built this company with focus on having the best security, best performance, making sure our customers can consolidate and have that best experience and even today is the same DNA. Yeah. Yeah. And so when you think back in your time here, are there a couple of memories things that stand out in your mind as you hit this milestone? To me, everybody today talk about convergence. And I remember when I'm when I came to this company, convergence was like the main driver of building innovation. And my main memory is how we continue to have this networking and security convergence happening in areas like SD van, how we disrupt the market, then with ZTNA, and now with Sassy. But you're right, I mean it just has some of the things of convergence and having this engineering first approach has not changed. Yeah. And so let's talk about convergence, right? And you did talk about the forinet really being the driver of bringing network and security together, but you've done other things, right? The in fact a forigate is a converge box and so when you think about the vision of convergence, you know, h how do you drive that evolution and how's that changed over the years? Yeah, look for foret it was simple. When we talk about convergence, how do we bring the networking and security capabilities in the same OS in the same software and to do that we need to build a purpose-built technology. So I mean we have been building our own ASIC which really delivers that convergence at scale. Yeah. And we keep on doing that that allows us to bring these new capabilities in the same platform. And you're right today the way the convergence market is evolving we have seen that success over last two decade and we continue to gain market share. Yeah, in fact, I think the ASIC is one of the best kept secrets in the industry. And just like Nvidia makes a great GPU for accelerated computing, you've really got the equivalent for security, right? General purpose processors don't do processor intensive workloads well. They do a lot of things, okay? Right. In fact, Jensen always jokes that you need to run Word, right?",
        "start": 5.759,
        "duration": 339.52099999999996
    },
    {
        "text": "the industry. And just like Nvidia makes a great GPU for accelerated computing, you've really got the equivalent for security, right? General purpose processors don't do processor intensive workloads well. They do a lot of things, okay? Right. In fact, Jensen always jokes that you need to run Word, right? process intensive, nothing beats custom. So, look at and and that's the vision that Kenzie had from day one, right? build our own content processor security network processor and then when customers are using that they are seeing this real advantages imagine many of our customers are seeing that when they use the ASIC the power consumption is 80% lower while they're using the most advanced security processing so you're right I mean that's been one of the key driver of our innovation and patents you see our number of patents over 1,300 higher than any other cyber security vendor that just shows how this innovation well patents can be I mean there's a lot of companies a lot of patents but you're all most of yours actually go towards building good products now I think when I as an industry analyst Nurav when I look at the market share gains happen when markets transition and I think there's few vendors that have taken advantage of those market transitions better than foret you talk about in fact prior to SDWAN you were nowhere in the WAN right the you know your Santa Clara based competitor there I think had like 90% share but now you're the unit share leader and SDWAN. Now the big transition going on now obviously is AI. It took us like 6 minutes to get to AI. how is Foret thinking about its product strategy to take advantage of this transition to AI? Yeah, look when you as as you rightly said we have the highest market share almost 55% plus customers with 6 million plus devices use Fortnet technologies. But to do that and to manage the thread intelligence we needed to build AI and machine learnings 15 years ago to process that trillions of event. So we have been using AI and machine learning. In fact we have again 500 plus patents in AI and machine learning. But as the time progressed we also are focusing on generative AI and today our AI is really focused on three areas. 40I assist really help simplifying the security and network operations. 4DI protect to making sure any of those advanced attacks we are protecting and making sure they are secure and ultimately securing the AI and LLM. Yeah. And when I think about AI, right, there's two sides. So there's AI for security and you talk about how you can use AI to help operations work better. But then there's also security for AI and that's making security using security to make AI safer. And that actually lends itself to the data center. Now, , in full disclosure, I'm actually here for an analyst event. I",
        "start": 175.68,
        "duration": 636.1600000000002
    },
    {
        "text": "about how you can use AI to help operations work better. But then there's also security for AI and that's making security using security to make AI safer. And that actually lends itself to the data center. Now, , in full disclosure, I'm actually here for an analyst event. I camera and run into Rob. , and you t you told us about some new products coming for AI security in the data center. So, talk about those. Yes. So, look, , today many of our customers globally are building the AI data centers and to when you're building an AI data center, you need to secure them end to end. And the first thing you need is a really good framework starting with a parameter security. So that's where the firewall with 400 gig connectivity, low latency, all this ASIC advantage comes in. But from there you need an application and API security. So we have a web application firewall and we recently announced the data security. We are further enhancing and adding the securing the AI and LLM infrastructure. So we are coming up with the newer innovation with that which will allow our customers to secure from end to end from the firewall to all the way to the LNM and that's really what customers want. That's what we're trying to go to the market. Yeah. Well that brings a lot of that for innovation you historically saw in the WAN in the branch into the data center and I'm really excited to see how customers react to that. It's been great. We have seen some very large customers globally in in Asia in Middle East and in Europe where they are using this technology at scale and we are so excited to secure the AI data center and help customer on that journey. Yeah. And I want to talk about in AI you hear a lot about trust right everyone is worried about lack of trust you know trust this trust that right and when I talk to your customers the one of the things they say about foret is trust they trust you you tend to deliver things on time but in your time here you know discuss why you think forinet is such a trusted vendor and why so many customers almost a million customers now rely on you yeah It it again goes back to the DNA of the company of we are really giving our customers the best technologies and it was it was interesting that recently when Forbes did a survey Fordinet is ranked number seven across all the global companies as the most trusted company and I really think it's because of the way our focus on providing the best security with our threat intelligence. We work closely with CISA. We have signed the pledge to have a secure by design. We are working with Interpol, FBI. We are the founding member of cyber threat intelligence.",
        "start": 325.039,
        "duration": 921.8399999999997
    },
    {
        "text": "I really think it's because of the way our focus on providing the best security with our threat intelligence. We work closely with CISA. We have signed the pledge to have a secure by design. We are working with Interpol, FBI. We are the founding member of cyber threat intelligence. stopping the bad actors and doing that consistently giving customers that trust and that is really helping us. Yeah. And I actually think that trust is driven from the leadership down. Ken and Michael Z, I mean trust is a really important thing to them. They want to make sure if they tell customers something, you deliver on it and it comes true. And I think that's made its way through the organization. Yeah. Now if if I were to say forinet to the average security professional they're going to say firewall right but you've built a very nice broad platform that includes firewall and right and so tell me about the the the plus stuff if you think about foret as firewall plus how have you leveraged that firewall to create a broader platform? Great u foret I mean when we look at our overall all the technology innovations we do of course we do really well in network firewall and we call it secure networking so we also have a very large market share in our switches and access point but then most last many years we have been focusing on unified sassy so that SD van success we talked about we are building the entire sassy stack with the same OS same AI and we are seeing a tremendous growth and customer interest there and finally ly we are our focus on security operations. We are building and continue to provide a sock solution end to end right and that having that sock solution working with sassy working with firewall and building one platform is what foret is all about. Yeah you mentioned sassy too and I want to maybe double click on that a little bit. I think your approach to sassy is a little bit different right I think if you were to ask you know most industry analysts media customers of security to describe sassy or sec they would tell you it's cloud delivered security right but you've made you while you have that you also have an on-prem version of that and it's interesting that when I look at the shift that AI has created with more people wanting to repatriate workloads you go over to Europe where there's a lot more focus on data sovereignty Right. It seems that your Sassy solution being able to deliver it from the cloud or on prim actually aligns itself well to where customers are going. You're so right. Yeah. Sassy is a great technology. A lot of our customers want but Sassy really needs to be flexible and that's what differentiate foret because again I come back to that 4D OS.",
        "start": 470.16,
        "duration": 1205.28
    },
    {
        "text": "the cloud or on prim actually aligns itself well to where customers are going. You're so right. Yeah. Sassy is a great technology. A lot of our customers want but Sassy really needs to be flexible and that's what differentiate foret because again I come back to that 4D OS. capabilities are built in organically. So now customers can choose they want to use them with SDN onrem or they want to use it for remote users on the cloud. We provide both the options and that truly help them with the user experience and lowering the cost. Yeah. And I actually again I think just with so much focus today on the on AI and if you were to ask people well what really drives AI value data right and so companies more and more are trying to keep their data in a place they can control it which is on prem I should have the security there as well. You're right and that is where the zero trust discussion comes up. Right. You want to make sure where the users are accessing the data you are doing the zero trust and device posture check right there and that delivers a better user experience and a quick validation and for that that's why we talk about universal ZTNA which is an extension to the sassy. Yeah. All right Nav as I mentioned it's a happy birthday 20 number 25. tell me about the future though when you look out next 1 3 5 years if we do this again on Forinet's 30th birthday what will I be thinking? I absolutely think that foret will continue to be this innovation driver but you will see this three core focus area foret will continue to drive this quantum safe innovations which are really important with the where market is going. Number two, we will continue to expand our AI innovation with a gentic AI capabilities what we do today with where the future is going. But the third and the most important thing is we are going to continue to have that organic focus on building the platform across the sassy across the sock across the cloud to help customers flexibly deploy them. Yeah. Well, I'm glad you're going to stay focused on platform. in fact, I was talking to a CISO the other day and he said this whole concept of trying to cobble point products together. said has never worked, isn't working, and isn't ever going to work. And now with AI, things have gotten sufficiently more complex that I I think most customers will have to actually move to a platform. So and it is it is happening right. I mean I know we shared today as as as we discussed many time some great customer examples of large auto manufacturing how they are using from firewall to sock to sassy and it's a journey. It's a journey of [clears throat] customers going back",
        "start": 613.36,
        "duration": 1482.2399999999998
    },
    {
        "text": "is it is happening right. I mean I know we shared today as as as we discussed many time some great customer examples of large auto manufacturing how they are using from firewall to sock to sassy and it's a journey. It's a journey of [clears throat] customers going back achieving the right business outcome and at the end of the day we are going to be flexible helping customers what they want all right and all right now it's always great talking product with you and a little bit of for strategy anything else you want to add no that's it yeah well so thanks for your time and for you watching thanks for watching give us a like and also hit that subscribe button so on behalf of Rav Shaw I'm Zas Caraval from ZK reaches thanks for watching and I'll see you next time on my next episode of Zcast",
        "start": 755.04,
        "duration": 1534.5579999999998
    }
]