[
    {
        "text": " Welcome to Zcast everyone. I'm Z Carval from ZK Research and I'm here in Japan at Zcaler's Zenith live event coming up tomorrow for this specific part of the region. I'm with Mike Rich chief revenue officer for Zcaler. Mike, I'm really excited about the event tomorrow and really excited to interview as you as well. First time on with me I believe. So maybe just a quick intro on yourself. Okay, my name is Mike Rich. I joined Zscaler about two years ago. before that I spent about 13 13 and a half years at Service Now. I've always been in the software SAS space at least for the last 20 years SAS. Before that software development and yeah, glad to be here. It's a great company and great people, great technology. Well, you know, clearly if you look at you know, being in charge of revenue and sales, stocks been doing pretty well, which means sales are doing pretty well. Now part of that is the security I think right now with AI and cloud and digital tools is really a rising tide and so let's start with that just when you when you look out at the security landscape both globally and within the specific region what trends are you seeing and what's different about maybe Japan and and Asia pack that you might be different than what we might see in the US. Well, AI is on everybody's mind, obviously. How do I safely adopt AI? And, you know, we're so uniquely well positioned because we're in line to see all that traffic to help you protect , you know, information coming in, information going out, and making sure your LLMs are protected. You know, the AI guard product is a hot topic these days. So, that's definitely a trend that's not going to go anywhere. And I expect to see that success in that area just grow. , for us, you know, Zcaler's advantage really is being a platform. Yeah. And that with the platform comes great responsibility. That means you have to also help your customers leverage and get value out of their existing ecosystem. So how do you do that? You do that through integrations. You do that through understanding of the customer and making sure you put together a cyber strategy for them to help not only make your solution more valuable for them, but also the other solutions they have in house. How do you help make those more valuable? either by integrations ingesting that data into the system. it's a number of different ways to do it but that's a responsibility that we don't take light. Yeah. I actually think it's there's an interesting opportunity for Zcaler coming with AI. I think you know when when Jay founded Zcaler you know a couple decades ago now I guess the 2007 something like yeah you could almost argue that I'm not going to say it was a",
        "start": 5.759,
        "duration": 309.5199999999999
    },
    {
        "text": "Yeah. I actually think it's there's an interesting opportunity for Zcaler coming with AI. I think you know when when Jay founded Zcaler you know a couple decades ago now I guess the 2007 something like yeah you could almost argue that I'm not going to say it was a the company's done very well financially but there were other ways to solve the problem as we moved this AI era and you know you think about the rise of agentic agents and IoT devices you know I think Jensen Huang always talks about the next wave being physical AI right and you've got a mobile solution on that I'm not Sure. There's another way to secure it effectively using kind of old security tech methodologies, right? And so that that's got to be pretty exciting for you when you absolutely you think about how it's gone from that nice to have to an absolute critical must have. It's a must have. Yeah. Yeah. It's a quantum shift. you know, people want to work the way they want to work and they they have different there's more systems spread out through IoT, OT, through cellular devices, through u obviously AI. Zero trust everywhere is a real thing. Yes. And that's our focus making sure we can protect our customers from threats no matter where they come from and what device they may go to. So that's the whole concept. If it could be cloud, right? could be devices, could be people, could be websites, applications, and so on. That's our responsibility to make sure we've got zero trust protection across your landscape. And let's talk about Japan specifically. I know this region specifically is really they take trust and reliability , you know, to an exponential level, right? And so when you think about your go to market here, how have you adapted that to meet the cultural and business demands that that they expect here? Yeah. Well, manufacturing centric too, right? Japan is just a great manufacturing nation. They're they're very relationship focused as they should be. That ties in well to our philosophy, which is at the end of the day, we're we're people helping people. And how do you build strong relationships, right? You build trust. That's probably the number one commodity. How do you build trust? You build trust by making sure whatever you tell them you can do. You can do that plus a little bit more, right? Yes. Yeah. and to make sure you can deliver on what you say you're going to deliver on. And then you're also key your key. That's the key. And and being prescriptive. So it's not just, hey, we we sell you something and then we move on. It's no, this is a platform. we're going to work with you to solve a problem, align with your key critical initiatives and making sure we deliver on those outcomes and that value gets",
        "start": 160.879,
        "duration": 586.8809999999996
    },
    {
        "text": "prescriptive. So it's not just, hey, we we sell you something and then we move on. It's no, this is a platform. we're going to work with you to solve a problem, align with your key critical initiatives and making sure we deliver on those outcomes and that value gets the next thing. But it's a different, you know, it's a different mindset than sort of transaction focused which I think Zcaler had to be that focused level because they were creating a new market with CIA but we've we've matured since then. Yeah. And one of the things about this region Japan in particular I think they were very slow to adopt cloud. Now part of that is Japan does my mom's from Japan so you know culturally I understand this region a lot. you know very much in office. Yeah. they don't really like to disrupt things but they're they seem all on board with cloud now. And so you know when you think about that how are you trying to help these customers through that migration so they can go to the cloud but do it in a way that where they minimize risk and they do it safely. Yeah. Yeah. That is key and yeah definitely risk more risk averse than than some geo areas. But we do like that and I think we've kind of hit that quantum shift where we've got a strong set of customers here that are very successful and we're travels fast in Japan. that's why we always say it's all about delivering the outcomes. That's what customer success is and we'll continue to invest there to make sure that we can support this market. you know they have special requirements obviously around language right and different key integrations that they have to have in place and we see that so we're making those investments and I'm always pushing our teams to incorporate that in early so it's not it once you release a product you don't have to wait long before we can actually service the Japanese market you know we've got about a six-month window now which is great yeah that is great and that you had brought up the concept of zero trust And I was at the Melbourne event and they talked about the trust gap. Yeah. Right. And h how well do you think that's understood here in this region? And one of the reasons I ask is I do think zero trust has become a term that's almost become overused. You know some of the network vendors have confused ETNA and zero trust. And so you know I guess you know start from there like do do you think the concepts well understood here and [clears throat] then if it is do they understand the unique value proposition that the Zcaler platform brings? Yeah, I think it's probably halfuh half the people understand it and half the people don't. We it's on us to",
        "start": 300.4,
        "duration": 867.9200000000001
    },
    {
        "text": "like do do you think the concepts well understood here and [clears throat] then if it is do they understand the unique value proposition that the Zcaler platform brings? Yeah, I think it's probably halfuh half the people understand it and half the people don't. We it's on us to zero trust in Zcaler's eyes and that's when you know you just can't move laterally on a network period. There's no way to do it and we provide a solution to do that. The others have a solution where they may say that's what they do, but the reality is you do get in the networks. If you put a VPN in the cloud, that's not zero trust in our definition. Partial trust. It's partial trust. Partial trust. [clears throat] Maybe that needs a new term. But we do have to spend, you know, a decent amount of time making sure people understand our architecture versus the others. That is key. That's what why we invest in these architects that help build these relationships. And it's it's a process, but it's getting it's more widely understood now. People are, you know, I I've actually tried to explain it just very simply that the internet was built on the concept that everything can talk to everything and that's why it works so fast. Zero trust flips that around and and nothing can talk to anything else without explicit permission. Right. Right. And so therefore, you know, if you think about the traditional VPN model, if you were get breached, everything can talk to everything. That's right. Right. and it creates an unfettered access where and if you think about a lot of the big breaches that we've seen historically if they had been running zero trust those breaches certainly would have been minimized right well put well put thank you okay I'm going to have you explain that to others thank you appreciate that yeah yeah now I know ecosystems very important to zcaler and it's critically important in this region right where they want to partner in fact I was down at your again in the Melbourne event they made a lot of the the Telstra partnership who's the biggest telco there and so talk about some of the partnerships you have in this region. Yeah. So number one it's all the big players right you think about Soft Bank and NT they're we're really most interested in partnering with the partners that our customers say hey please make sure they can help service us. So we'll focus we're very customer driven. We'll focus on whoever they say their key partners are. And you know in this region especially if you look at the commercial market which is probably 30% of the market here 30 to 40% that's companies 5,000 and below. You know we can't get to all of them with with our folks. You know we're te we're technology and that's how we view",
        "start": 442.88,
        "duration": 1135.522
    },
    {
        "text": "this region especially if you look at the commercial market which is probably 30% of the market here 30 to 40% that's companies 5,000 and below. You know we can't get to all of them with with our folks. You know we're te we're technology and that's how we view have professional services but they're only there to actually provide an example of what great looks like so that our partners can learn from that. We're all about enabling our partners to actually operate at scale and be able to run a profitable business and help our customers realize outcomes. So, we'll continue to do that. , but you got the managed service providers out here and that's a huge opportunity in this in this country. I know it's funny, managed services tends to vary region by region, country by country, but it's really the norm here in Japan. Yeah. Yeah. Yeah. And you know, the we talked about it a little bit in all hands we just had out there with Red Canary. Red Canary we think in the next six months to a year will be available that technology and then partners might say well wait a second you know we offer that service well we look at it as if you're a partner you're working with our customers you can utilize we'll help you utilize our technology to provide an even more profitable betterun service for your customers and we that's our responsibility to help our customers you know and partners make sense of all that data that we generate. Yeah, it's it's it's a massive and it's only going to keep going up. Well, that that's really the unique advantage I think that Zcanner has is when you think about platformization of security, lots of vendors use it. the cloud-based platform that Zcaler has I don't even know what platformization means. That's well it consolidates all the I think consolidation well kind of right now there's different ways to platform you can do it through M&A in which you you right and some of your competitors do that and the caution I have with that is with AI right good data leads to good insights but silos of data leads to fragmented insights and I think a lot of your competitors that have built through M&A good companies right but they from an AI perspective you could argue that they're not going to get the same insights as the Zcanner platform Right? Because it is all one platform. It is it is all one native platform. There is a major advantage there for sure. And you know we do feel you've probably heard Jay say it before that you should have a partner for identity, you should have a partner for inline cloud and you have a partner for endpoint. Yeah. And that spreads the risk out. So we're going to stay focused there. There'll be some use cases where you know we might",
        "start": 579.04,
        "duration": 1401.6819999999998
    },
    {
        "text": "say it before that you should have a partner for identity, you should have a partner for inline cloud and you have a partner for endpoint. Yeah. And that spreads the risk out. So we're going to stay focused there. There'll be some use cases where you know we might might have a little bit of the identity component, but we're not going to be your primary vendor there. I could argue that identity needs a a rethink anyway. So we'll see. We'll see how that goes. Trying to do everything on a user by user level, especially with a gentic AI. Yeah. Yeah. I mean, what is identity now, right? So now as your role as a revenue officer, right? You're responsible for driving accelerated growth. And so just what are you thinking about there, you know, at a global level, but then also how do you adapt to the the uniquenesses of each region? Yeah. Well, you first off you have to have easy question [clears throat] folks. It's all about the people you that you hire. You hire people that are customer centric. they know how to build great great trusted relationships with customers, listen to customers because we learn everything from the customer where we should go. So our product road maps are based on that information that we, you know, we use our ears. You got one mouth, two ears, and you should behave that way, right? I know a lot of sales guys that don't. So exactly, [laughter] you know, we're not paid by the word. We're paying to actually understand what the unique challenge is. And at the end of the day, our job is to help our customers deliver a better service to their customers securely, right? User experience, these things all play together and be able to do it cost- effectively, right? Yeah. Spiraling cost. When you have a ton of vendors out there, next thing you know, you start to look at your portfolio and you're like, wait a second, why do we have four people doing essentially the same thing? So, we'll help people rationalize that. And we understand we also have to play the role of being that great which I talked about earlier that great integration partner where we can ingest data from all your different services and help you make sense of it. So we'll continue to you know to invest in that area. But Japan is I think very unique in terms of it's manufacturing centric you know life insurance centric all we're industry agnostic as a company but the the relationship that we built here have helped us really advance the product. So we'll continue to go on that path of staying laser customer focused. Yeah. And so you know just looking ahead what what really excites you about the opportunity now? You know obviously AI does but if I were and I'll frame it maybe a little differently. If you were",
        "start": 714.56,
        "duration": 1671.122000000001
    },
    {
        "text": "So we'll continue to go on that path of staying laser customer focused. Yeah. And so you know just looking ahead what what really excites you about the opportunity now? You know obviously AI does but if I were and I'll frame it maybe a little differently. If you were the first wave of Zcaler being all about private access and VPN replacement. What's the 2.0 version of Zcaler look like and and what excites you about that? Yeah. Well, I think it's AI pays a huge component. Like what's the world going to look like a year from now? It's kind of hard to imagine because even if you went back a year from now, you probably didn't think things were going to move this fast. No, it's moving. I think no matter how think fast we think things are going to move, we're probably wrong. It's going to be faster. It's going to be it's going to be a wild ride. So you know I think that the sky's is the limit in terms of the opportunities there to help our customers manage and become you [clears throat] know leverage AI safely right yeah that's probably number one number two is look at the end of the day you can just go back to basics transformation is probably an overused word but that is to me that's a word that says okay how do I make my company more nimble to compete better and again provide a better service and that usually means you're taking complexity out, right? You're simplifying things. And so that's what we're focused on doing, helping customers simplify their cyber strategy, leverage us and their other investments, [clears throat] take maximum value out of those investments, and we have to be prescriptive with how we go to market. Yeah. Melbourne, I talked to Eric Swift, your the GM of A&Z [clears throat] about this that you know, security is a funny thing within businesses because historically it's been looked at as a business inhibitor. Oh my god, we have to secure it. It's going to slow everything down. Right? But if you really do embrace this concept of zero trust everywhere now, all of a sudden, think about it from an AI perspective, right? If I've got the zero trust framework in place, I don't I can use change models. I can change different AI platforms and I can and I can go faster because I've got that in place. And so now security is no longer a business inhibitor, but it's actually a business accelerator. And we've never said that about security before. Yeah. No, you're exactly right. I mean, at the end of the day, again, it's it's helping our customers operate they how they need to operate to service their customers better, service their employees better in a secure fashion. And we help take out some of the complexity that allows them to move faster and that's the focus, right? So",
        "start": 850.88,
        "duration": 1946.8020000000004
    },
    {
        "text": "of the day, again, it's it's helping our customers operate they how they need to operate to service their customers better, service their employees better in a secure fashion. And we help take out some of the complexity that allows them to move faster and that's the focus, right? So things you're doing around AI guardrails and stuff is pretty interesting, too, because a lot of business leaders I talk to want to use it, but then they're worried that, you know, somebody in the PR team might grab the financials and say, \"Create me a press release, you know, and if you throw that into Gemini or something, now it's available to everybody, right?\" And so if if they're and employees like, you know, that's probably a little bit of a dramatic example, but there probably are employees that just aren't sure can I, can't I? and they're trying to get their job done quicker and if it's built into the system to say no you can't do that there that protects everybody including the employee and that's it's it's a it really is a fascinating opportunity I think it's it's a unique advantage we have we take it with great responsibility because when you're in line to all the traffic you can see it and you can stop it at the point of where it's happening and quickly pivot and help educate you know your employees on the spot what they should and shouldn't be doing oh we know we see what you're trying to Yeah, this is how you should be doing this within our corporation and that kind of service is really invaluable. All right, Mike. Well, I think to wrap this up, AI is going to be everywhere. Yeah, we've already seen cloud everywhere and really the that zero trust everywhere is the only way to secure it. We're zero trust as a technology, but we're high trust as a partner. And that's what everybody should expect from us. how closely we partner with you to solve your problems and build out a strong cyber strategy. That's what we take seriously. Yeah. And that's one thing I picked up actually from your customers just not just here in this region, but globally is is how much they trust you. And and I think that's one of those aspects of the business that's it's hard to put a number on, but clearly it's important. You've heard it before, right? You earn you earn trust with drops, but you lose it in buckets. You know, that's an overused statement, but it's true. Yeah. A lot of brands have gone through that. So, all right, Mike. Anything else you want to add? Look, I really appreciate you being here. I love coming to Japan. It's just one of my favorite places to visit. Food, culture, people, the dynamic businesses, and at the end of the day, what a beautiful country. Yeah. Well, that's it's gorgeous",
        "start": 991.199,
        "duration": 2193.202
    },
    {
        "text": "Mike. Anything else you want to add? Look, I really appreciate you being here. I love coming to Japan. It's just one of my favorite places to visit. Food, culture, people, the dynamic businesses, and at the end of the day, what a beautiful country. Yeah. Well, that's it's gorgeous Mike Rich, chief revenue officer at Zcaler, I'm Zas Caraval from ZK Research, and thanks for watching. give us a like, hit that subscribe button, and I'll see you next time on the next episode of Zcast. [music]",
        "start": 1116.64,
        "duration": 2218.9390000000003
    }
]