[
    {
        "text": " Welcome to Zcast everyone. I'm Zas Caraval from ZK Research and I'm in the digital health lounge area part of the consumer electronic show. I'm with Ryan Yuen from Dayton Industrial and I'm actually in the link to care booth. and so and we're going to be talking about some interesting health tech they just announced. And so Ryan, just before we get going, a quick intro on yourself, who Dayton is and what Link to Care is and sort of explain that. Okay, sure. so thanks for stopping by our booth. I'm Ryan. I'm the digital business lead at Dayton Industrial. at Dayan, we've had over 60 years of experience in designing and manufacturing micro electronic products. so there's two main segments that we focus on. One would be e-mobility with things like ebikes. and the other segment would be smart watches. and today the focus would be to showcase our new smartwatch which is called the watch to care vital. this is as this is under the link to care brand which is our more health tech focused brand. And at Link to Care, our mission is to really promote preventative health care tools by integrating both eastern and western medical philosophies. and this watch kind of perfectly encapsulates that idea. Okay. So most of my audience in full disclosure is western a lot of Europe, a lot of US obvious. And so explain the difference between what you might think of as traditional western medicine and eastern medicine. Okay. So, western medicine is great for diagnosis and for treatment of diseases and other health problems. But this tech typically only happens when the patient already identifies a problem in their health. Whereas eastern medicine and traditional Chinese medicine excels at preventative health care. So how it works is they identify subtle imbalances in the body and by addressing those you can kind of prevent them from turning into symptoms and developing into further health complications. Okay. Yeah. And so it's more diagnostic in nature so you don't get sick versus western medicine is oh you've got this disease go get cured. Exactly. And I think something like this is especially important nowadays because with the aging population crisis, we're getting, you know, skyrocketing medical costs. so by the time you're, you know, already in the hospital, you're incurring a lot of medical bills. So that's kind of the idea of where preventative healthcare comes in. So when you're dealing with these issues before they turn into more serious problems, you're actually saving yourself a lot of money and you're able to live longer and happier and healthier as well. So that's and and so what kind of metrics would [clears throat] you be pulling off the watch then that you know maybe somebody with a you know Whoop Apple Watch something like that they wouldn't have. Okay. So with this watch we use a 100 Hz pg sensor to collect your",
        "start": 4.72,
        "duration": 354.96
    },
    {
        "text": "and and so what kind of metrics would [clears throat] you be pulling off the watch then that you know maybe somebody with a you know Whoop Apple Watch something like that they wouldn't have. Okay. So with this watch we use a 100 Hz pg sensor to collect your second we're actually taking in 100 data measurements. So over the course of a whole day it measures continuously and you get 8.6 million data points per day. Wow. Yeah. And based on this raw data we have a AI algorithm on our platform that processes this data and filters it out to create 38 western physiological metrics. So this would be stuff like you know heart rate, your heart rate patterns, your heart rate variability, your sleep patterns, your you know activity levels. So this is like stuff that you might find in other smartwatch products on the market. but where we really differentiate ourselves from our competitors is that we're able to use these 38 western physiological metrics and map them to 18 eastern health indicators that fall within the this framework you see right here the five functional systems framework which is rooted in an integrated eastern and western medicine philosophy. This framework outlines five functional organ systems within traditional Chinese medicine. And so there's the liver, the heart, the spleen, the lung, and the kidney. So the idea is that when you have an imbalance in one of these systems, if it's left untreated, it could actually impact the other functional organ system. So they're all interconnected. Believe everything's connected. Yeah. So So if you leave these imbalances untreated, they can actually cascade into other sort of health problems in your other systems as well. Oh, that's interesting. Yeah. And I guess like when you whenever I look at you know who the longest aged people are in the world, they're always from China, Japan, something like that. So I think the the proof is there. So yeah. Yeah. And Okay. And then and so what u and so the watch itself is the device and then there's also an app that it's paired with. Correct. Yeah. Yeah, that's correct. so there there's a mobile app that's connected to the phone sorry to the to the watch. on the watch you get some more highle metrics and scores. So you can see your health scores on the watch directly, but if you're viewing your full report through the app, you get a lot more detailed breakdowns of each specific indicator, telling you what it's actually showing within your body as well as giving you practical guidance on how to improve your health every day. I was going to ask about that. So it actually tells you gives you some advice on what to do. Yeah. Yeah. So if your report shows indicators that are performing you know not not not too well then it gives you recommendations on how you can",
        "start": 181.92,
        "duration": 670.319
    },
    {
        "text": "health every day. I was going to ask about that. So it actually tells you gives you some advice on what to do. Yeah. Yeah. So if your report shows indicators that are performing you know not not not too well then it gives you recommendations on how you can things like dietary advice to even you know herbal medicines recipes even like traditional eastern treatments like acupressure points or massage therapy things like that. That's fascinating. Okay. And so, , you launched it here today? Yeah. , and what's the just the rollout plan, , you know, for, , can people buy it today? Is it? Yeah. Yeah. Yeah. , we're selling online right now at link tocare.asia. That's, , link to care is the two, not tto. , I'll include the link below. Yeah. We we're actually also doing a promotional discount right now for , the CES show. , so you can get 30% off if you put in the discount code. , and that is CES26-30 and that's running until the end of the month. Okay. And I'll include that in the YouTube description below as well. Yeah. Yeah. Great. And and so what other things have you thought about you could do with the the data that you have? Obviously, you know, this is a big AI show, right? Using AI to come up with these things, but with all the data that you have, have you thought about what other use cases there could be for it? , in terms of like B2B opportunities or or anything? Yeah. Well, I think this tool is actually very important because it's the first time where we have a way to validate traditional Chinese medicine's efficacy. So I think previously that's true especially in the western world it's not really like a medically validated sort of system but now with the watch we're actually able to use this framework and we have you know a datadriven approach to actually show you how your health changes when you do certain things. So for example if you were drinking a lot last night your report today would show a pretty low liver score and might impact your overall health. whereas you know if you drink more water and over the next few days you you stop drinking as much you you'll see that your scores will actually improve. So it is pretty sensitive to your lifestyle choices. Oh it is that's fascinating stuff. So yeah I know there's a lot of skepticism in this world you know especially in the western hemisphere about things like even like acupuncture and things like that where I think you've been using it for a long time. So that's great. Okay. So, this raised an interesting question. Since you have all the data, is there a way to to share it with you know, maybe spouse, partner, you know, a parent, something like that. Yeah. Yeah. So, actually, we're called",
        "start": 341.919,
        "duration": 955.7580000000002
    },
    {
        "text": "been using it for a long time. So that's great. Okay. So, this raised an interesting question. Since you have all the data, is there a way to to share it with you know, maybe spouse, partner, you know, a parent, something like that. Yeah. Yeah. So, actually, we're called behind that idea is that your personal health journey is not just one that you take alone. So, you can actually take your loved ones, your friends, your family on that journey with you. And in the mobile app, we actually have a profile sharing feature where you can grant access to people around you so that they can see your daily health reports and they can actually help you carry out your personalized recommendations each day like helping you boil medicines or help you book different treatments like acupuncture etc. so the idea behind link to care is that we really want to connect people and I think this feature is especially important for people with aging parents who have people to to take after to care after as well as like caregivers who need to monitor their people around them like I guess in a non-intrusive but also a closely monitoring way. All right. Okay. That's great. anything else you want to add? , no, I think that's everything. Yeah. No, that was that was great. I appreciate the time. , I think it's you know, it's it's great to see you know, we talk a lot in this industry about how AI can do this and you know, whatever. But at the at the core, if it's not improving people's lives, then I guess what's the point? So, you know, so congratulations on the launch, but more importantly, thanks for the work you do in helping people live longer. Thank you so much. All right. So on behalf of Ryan Yuen, I'm Zas Caraval from ZK Research saying thanks for watching. give us a like and hit that subscribe button and make sure you click on the links below. thank you so much and so I'll see you next time on next episode of Zcast. Thanks, Ryan. Thank you. [music]",
        "start": 487.599,
        "duration": 1155.6180000000004
    }
]