[
    {
        "text": " , welcome to [music] the ZK tour everyone. I'm inside the AWS sports forum at AWS reinvent Las Vegas. I'm with Jason De'vorin. , I sorry I forgot your title. Just why don't you tell people what you do? I I lead our industry business development team for media and entertainment games and sports here at AWS. Yeah. And that's a pretty big vertical. So awesome. Yeah. And so I was in sports forum last year. In fact, I'll include a link to last year's EK tour of the sports forum. And I noticed last year it was a showcase for how tech and a AI and things are used in different sports and you had it broken up by league. It looks a little different this year. So first just talk about sports form, what you want to accomplish and how it's changed this year and what you're trying to accomplish. Yeah. So with sports forum this year, the theme is all around data and we've broken that down into a couple of different areas. So you have things that focus on the fan experience and what the fans are going to see with that data and how that can educate and inform them. You have things that focus on the player side or the competitor side of of the fence. So that's getting into player performance, race car performance, all of that aspect. And then we have the whole behind the scenes of the infrastructure and what's happening. And the message here is when you look at the data structures of some of the world's biggest and best sports organizations, it's complex. And if we can help to create that simplicity and drive that efficiency and delight of fans for sports, imagine what we could do for your business. Yeah. And this has been an ever expanding area of focus for AWS. You I know in your past you have NFL, NHL, PGA Tour. This year you added DP World Tour. Yep. and the NBA. And the NBA. That's right. And those are pretty notable wins for you, right? We're excited about the DP World Tour. There's a lot [clears throat] happening there and and how that game traveling that side of the world and delighting fans. It's key to bringing that data together to help create that experience because they cater to so many geographies that there's a lot that can be done to really personalize that fan experience. And then when you think about the NBA, I mean, we're not just a cloud provider for the NBA. We're an innovation partner with the NBA. and the amount of effort that they're putting in to really transform the game and the knowledge that they have about the sport and bringing the AWS tools behind that to help them with not just AI and ML for player performance but generative AI and agentic AI and and streamlining processes across the organization.",
        "start": 11.2,
        "duration": 292.48099999999994
    },
    {
        "text": "that they're putting in to really transform the game and the knowledge that they have about the sport and bringing the AWS tools behind that to help them with not just AI and ML for player performance but generative AI and agentic AI and and streamlining processes across the organization. noticed too when talking to the leagues is while they're all different, the one commonality they have is they all none of them really believed that you could produce live sports in the cloud. And then once they started doing that, not only did they believe it, but they understood that you could actually change the way you produce and do a lot of things you can't do with normal broadcast. It is. And you know, we saw an example of the PGA Tour pushing that to the next level earlier this week at they hosted a proam here at reinvent and for the par 3, we actually had it that the amateurs, the professionals who were at that event could come up to the tea, hit their ball. You could see the trace all generated with shot link data and the entire scoring platform runs on AWS. But even cooler than that, with all of the data that's captured in Shot Link, it was automatically switching the cameras that were on that hole rolling graphics showing where the ball was going to land, creating that professional broadcast feel without a single human being touching a control panel to make that happen. Well, that's amazing. So, I think maybe the best way to give everybody, all my viewers, a good view of what's going on in the sports form is let's go over to some of the stations and have a look around. Okay. All right. Well, I'm back and I'm in the Toronto Raptor shooting lab. I dropped Jason, picked up Devin Flutter from the Toronto Raptors and explain what's going on here. So, , what we have here is our, , Troaptor shooting lab, which is a a fan activation that we have, , built to, , track your, , shooting mechanics, , and and give fans a behindthe-scenes look at [snorts] sort of how we do, , player analytics and shooting analysis for the Raptors using roughly the same system. Yeah. And this is actually set up in Toronto. This is a replica of what you have there. We have a very similar setup in Toronto, for sure. Yeah. And do the players use this data at all or is like do the players use the lab to to understand how they're shooting and things like that or is this really just fan activation? We the the pipeline that we're putting all of our fan data through here today is is the same pipeline that we use to analyze you know Toronto Raptors you know shooting mechanics and and player you know performance on a on a nightly basis. Okay. And then when I'm looking at",
        "start": 158.64,
        "duration": 555.8379999999997
    },
    {
        "text": "the pipeline that we're putting all of our fan data through here today is is the same pipeline that we use to analyze you know Toronto Raptors you know shooting mechanics and and player you know performance on a on a nightly basis. Okay. And then when I'm looking at are you capturing off a shooter? each shooter we're capturing I think it's 29 different key points different anatomical landmarks ranging from your your shoulders your elbows your hips your knees your toes and all of that from multiple different angles and we do some 3D reconstruction before we feed all of that sort of anatomical data through our biomechanics pipeline. Yeah. And then and then what are you showing back to the fan? Like what do they what do they look at to help them understand how to improve their shooting performance? We're showing various different metrics ranging from your your hip height through your follow through the release angle of your shots other sort of like balance related metrics that you might be able to take away and learn something about how you're shooting the basketball. All right. And then this is all I assume produced in the cloud. Oh yeah, it's all all in the cloud. , as these videos get uploaded to S3, , we run all of our computer vision models off of Bedrock and then it, you know, feeds through our, you know, sort of pipelines to do all of our, , sort of like traditional mathy analytics. Yeah. And I've noticed, , it's a free throw shooting. Can you also track people doing layups, things like that? We can do any sort of motion that you want. It actually doesn't even have to be basketball. Oh. , which is, , which is cool. As a part of Maple Leaf Sports Entertainment, we have, , teams in all kinds of different sports. so you can imagine this being useful in all kinds of different sporting contexts. Yeah. Yeah. Well and and so do you work the hockey team at all then? we we work across all of our teams including the hockey team as well as you know Toronto FC our soccer team. All right. Okay. But for here it's just basketball. Okay. Good basketball. so maybe this would be a good time to try it out. Sounds great. see what kind of data I get off that. I'll caveat this with I'm Canadian. I'm a hockey player, not a basketball player. Because we didn't actually have basketball in Canada when I was a kid. So that wasn't until well the Grizzlies came and then the Raptors came, right? Yes. Well, importantly, we're still in Toronto. Yeah. So, that's good. A champion, former champion, too. [music] All right. So, I'm now here with Megan Mallister. I hit one of three shots and then practice one, too. So, we'll say two of four. Yeah. Yeah. Yeah. We're two for four.",
        "start": 293.759,
        "duration": 793.4400000000002
    },
    {
        "text": "Yes. Well, importantly, we're still in Toronto. Yeah. So, that's good. A champion, former champion, too. [music] All right. So, I'm now here with Megan Mallister. I hit one of three shots and then practice one, too. So, we'll say two of four. Yeah. Yeah. Yeah. We're two for four. on here. And so, what are we looking at here? Yeah. So every time you shoot, we've got these three cameras that are all taking synchronized videos of you, right? So you can see that synchronicity across the videos here as you're shooting. And what we're doing on the back end is we're taking those synchronized videos, sending it through this pipeline to eventually end up with a three-dimensional reconstruction of you. So each camera only sees you in two dimensions. We put all of those together so that we can see you in three dimensions. Okay? We want to see you moving in every direction. And that's what allows us to calculate all sorts of different metrics about your shot, right? So things like how far apart your feet are, how fast your arm is moving, how high the ball is when you release it. And it's important to note there was no RFID tags on me. This is all camera vision, right? Yeah, that's right. So these are just regular cameras off the shelf. It's the computer vision part of it that is the the sort of nuts and bolts of this operation. And so, , this gives us insights into your sort of movement patterns for each shot, right? And you'll see that if we switch between your shots, these values change because it's nearly impossible and unnecessary to do exactly the same thing over and over again. Although the pros try, right? So, yeah, there there's a time and place for consistency, that's for sure. But so for you specifically, we're noticing this this sort of trend where you're holding on to the ball until, you know, you've sort of gone through your range of motion with your elbow. So you've got a higher than average release height. Oh. So that distance between your belly button and when you're releasing the ball is higher than average, which means that's cuz I'm shorter than average. [laughter] Yeah. You make up for it by holding on to the ball longer. That's right. Yeah. So these are just like small insights, right? But they're important. correctly, I should I should know to release it earlier. There's no magic solution. So, I wouldn't take away that, you know, you you should lower by a certain certain percentage because it's really the combination of all of these metrics that makes up your signature for that. Okay. Yeah. And so, we take this combination here and we compare it to our roster of Toronto Raptors players because we do this very similar analysis with our team, right? And so we're able to compare you to the players.",
        "start": 422.16,
        "duration": 1055.52
    },
    {
        "text": "these metrics that makes up your signature for that. Okay. Yeah. And so, we take this combination here and we compare it to our roster of Toronto Raptors players because we do this very similar analysis with our team, right? And so we're able to compare you to the players. shoot most like Oai. Oh, he makes a little more money than I do. I mean, maybe [laughter] he's also done this a lot more than than you have, but you're 82% similar to him. And that's just based on on this combination of metrics. Well, I can see the similarities. So, yeah. All right. Well, I appreciate the update and a quick look at some of the data you get there. Yeah, my pleasure. Thank you. All right. Well, I'm back at stop two in our tour. , it's under the basketball , demo here. And, , looking behind me, I've got a hoop and a bunch of people in VR headsets. I'm with Mike Lai. , Mike, your role at AWS is I'm the senior solutions architect , supporting the NBA. Okay. Oh, all the NBA. That's big role. And so, what are you showing here? So, today we have an immersive experience , based on augmented reality. the the experience runs on a MetaQuest 3 headset and essentially what we've done is we've taken the player tracking data built it into a product we created with the NBA called PlayFinder. and so based on the movement of a play, we vectorized that data and you can do a a vector similarity search to service other plays that have similar movement. We've taken those curated plays, applied player pose data to it, and so you get an immersive experience where you get to see the you get to feel NBA players executing plays on the court with real size, real speed, real mass. It's awesome. So, I'd be looking up a lot. Oh, yeah. Both. Yeah. And and is this used So, the NBA use this as part of their fan experience. Do players use this to maybe immerse themselves in different experiences? how's this used in, you know, real life, I suppose? So, PlayFinder as it stands today is just used for broadcasters and teams. Okay, they they can find a play based on a play ID and then we find the do the vector search based on that. , this is really a proof of concept of what a fanfacing experience could look like. And so, imagine this on the app store and you download it and you get to find your your highlights and then see them in an immersive experience. Yeah. Because the PGA tour is something like this through their app as well. So, I suppose this event should be standard for all sports, right? Probably. Probably. Yeah. And then so if I'm looking at that, maybe I'll go try it in a bit. But what And so I would",
        "start": 554.24,
        "duration": 1313.1999999999998
    },
    {
        "text": "Because the PGA tour is something like this through their app as well. So, I suppose this event should be standard for all sports, right? Probably. Probably. Yeah. And then so if I'm looking at that, maybe I'll go try it in a bit. But what And so I would the court. I'd have a good a much better perspective as a fan then. So when I'm sitting at home and go, \"My mother could have stopped that person.\" You [laughter] know, indeed that's not the case, right? Not at all. Not at all. Yeah. Sometimes as fans, I think we don't fully understand the just how good these players are. And you know, we're a little critical of somebody's a little slow, missed a missed a pass, things like that. But the game is so much faster, you know, when you get to experience it that The raw athleticism when you have somebody who's 67 coming at you at 20 miles per hour, it is jarring. Yeah. No, I just move out of the way. [laughter] All right, Jason, that was a great experience. Yeah. And what's really cool about that, so not only did you see what PlayFinder can do and how that can inform a broadcast and provide those statistics in real time and just that example of what a fan-facing experience could be, but you also had the ability to see some of the new stats that we've been working with the NBA on specifically around gravity. So being able to see how that one player can impact everything else that happens on the court whether they have the ball or not or the shot difficulty and being able to get better statistics and deeper depth on the quality of shot and the percentage likelihood of that shot going in and new is defense being able to have a better defensive box score and really understand what's happening on the court around you. But this did a great job of going through thousands upon thousands of hours of games and putting you in that moment. And I saw you flinch once or twice when that guy was gonna dunk on you. But it's awesome. Well, I will say like this is sort of an interesting view, but it's nothing like actually seeing it in the headset because you are immersed in it and you see the person coming at you and then you just realize how tall they are and even with the three-point shot just how far away they that really is like that's that's a you know or just how fast they're moving. Like I mean I when I did it earlier just my head was on a swivel just trying to figure out where they were going to go and it's just fun to watch in in that kind of setting. I mean to your question to Mike like this could be where sports starts going and creating that immersive",
        "start": 687.12,
        "duration": 1552.7210000000007
    },
    {
        "text": "earlier just my head was on a swivel just trying to figure out where they were going to go and it's just fun to watch in in that kind of setting. I mean to your question to Mike like this could be where sports starts going and creating that immersive fan engagement. Yeah, we certainly appreciate it a lot more. Yeah. Yeah. Thanks. All right, Jason, that was great. over to football next, correct? Thanks. All right, Jason, here we are. soccer, football, Bunda Lisa. you've had a partnership then with them now a few years, right? Yes. Yeah. And what we're showing here is Bundesliga has fans all over the globe and bringing it them commentary about the game in their local language is key. And what we've done here using AI is to basically go through the game. Now you could actually scrub here with this magic soccer ball. You can see all of the events down at the bottom and pick your moment. And now if you want to translate the the commentary and get commentary that's meaningful and authentic to the type of fan that you are of the sport, you could do that here. So, for example, if we wanted to translate into Spanish, you could see in a poetic style that it's giving you a Spanish language translation. Or maybe you want to see what that would be for a younger fan of Gen Gen Alpha and have that type of experience to kind of cultivate that next level of fan and that next wave of fans. And since I can't read the Gen Alpha in Spanish, just flipping it back to English. Yeah. And you can see exactly how that context and how that language has started to transform. Here it says moment, language, writing style. So you can pick any moment, any language, any style. In fact, I was at the NFL in Berlin this year and there was a Bundesliga speaker and he talked about this that if you're throwing an attack you know, maybe younger fans, you know, from a certain country, you can change that. It' be a little more appealing to them. if you have more of a traditional fan that doesn't like that stuff, you go back just to the stock. Yep. And and that's the thing. I mean just even here from poetic to gen alpha to a standard you have that natural ability to cater to the appropriate fan and the type of fan that they want to be your hardened most passionate they want a traditional they just want to know what's going on but again in cultivating that next wave giving that flavor and that adjustment makes it more applicable to really bring fans in and I will say from the the conversations I had with Bundesliga through through Amazon they are one of the most forwardlooking when it comes to the data they collect the data of the",
        "start": 809.76,
        "duration": 1822.5600000000009
    },
    {
        "text": "wave giving that flavor and that adjustment makes it more applicable to really bring fans in and I will say from the the conversations I had with Bundesliga through through Amazon they are one of the most forwardlooking when it comes to the data they collect the data of the depending on what's popular, what's not. In fact, when I spoke to them, there were some some data points they thought wouldn't be popular but w up being really popular and vice versa. So, it's always good to see a league willing to listen to the fan, understand what's going to make the game more exciting. And I think the thing that's great about them also is they understand that their most passionate fans demand authenticity and they don't want too much cuteness or too much fluff. They want the game and the purity of the game. And now as they cater to that new wave and using AI and ML to do all of this translation makes it easy to be able to really choose your own adventure and pick that D. And understand why this is important is Bundes League is very it's an international league. There's players from bunch of different countries and so you may be you know from Spain and you're only interested in a couple of players. you're going to want to pick those moments and then you're going to want to see in Spanish how that, you know, the commentary around that. So, it's that multil- language AI commentary really can help internationalize a game that's already international but but attract fans from different countries. Absolutely. And like we said at the beginning of this, so I mean here we are at Bundesliga, this is in that fan engagement area. So, it really is about how do you present that sport? How do you present that data in a way that's meaningful to who you want to consume it and personalize it? Yeah. All right. Anything else you want to add? That's it. That was good. [music] All right. I'm back and I'm with Terra Kashimi at the F1 stand. And this is exciting. I love F1 because it is of all the sports, it's the most data driven. I was at the F1 event in Austin and I think Kaylee Seagull mentioned 1.1 million data points been pulled off every car every second. So that's a lot of data. So what are you showing here Derek? Yeah. So we worked together with the F1 production team, right, on a on a tool which should support the production and broadcast teams to do datadriven storytelling essentially, right? So yeah, we do a lot of datadriven storytelling with trackpoints, right? So essentially what you see is there are a lot of stories popping in over time, right? So we consume a vast amount of data, right? So we have position data, we have tire data, timing data, so much data,",
        "start": 948.16,
        "duration": 2091.812999999999
    },
    {
        "text": "we do a lot of datadriven storytelling with trackpoints, right? So essentially what you see is there are a lot of stories popping in over time, right? So we consume a vast amount of data, right? So we have position data, we have tire data, timing data, so much data, engine. Okay. And we have here prepared a demo on the for the reinvent which is essentially based on the last week's Las Vegas session here like like two weeks ago right and in this sense here so something what happened within the race a concrete example is so we detected at lap six that there was a catching scenario right so lic is catching up with pasu we detected that in lap six we pushed that story out we kind of informed the production team hey there might be an overtake soon. Do some pre-work, prepare some graphics, maybe ste your cameras or whatever actually might be needed. No, going through the race, what happened is that he at some point in lap 12 over took P3, he then overtook the next driver and also he did a faster sector update. Right? So what we do, we also with each story we also push timing information, sector times, we have a tire strategy component, right? So we transcribe also the communication between engineers and drivers so that we have also the mood of the drivers and this helps the production team to really to catch up with what happens as you know 20 drivers there's a lot happening on the track side hard to catch up. Yeah. No I know in this race Max came out of nowhere past both McLaren drivers and so there was a lot of passing that day. Yeah there's a lot of things happening so it's a super useful tool also. Oh yeah, for broadcasting right or for parting. So yeah, there a lot of interest also from fans here like I spoke with many fans here. Hey, when do we get access? So let's see. Yeah, and this is just a small percentage of what AWS is calculating for the broadcasters. I know there's also you know close to the wall to see how far they are. Correct. That's F1 insights. That's kind of another direction we're doing with them. It simulates also datadriven insights where we also consume vast amount of data. We do a lot of forecasting but they are usually more advanced right. So we do battle forecast calculations some machine learning in it. Yeah. So yeah a lot of things we do. Yeah. all right. And then here you're actually seeing the raw video. Right. Correct. That's the raw video and essentially what you see here that's what happened. Right. So that's the video feed and that's the data generator of that feed. And yep. There are many things. We can also go to the next slide. All right Derek you got a different set of data here right?",
        "start": 1086.32,
        "duration": 2373.1720000000005
    },
    {
        "text": "video and essentially what you see here that's what happened. Right. So that's the video feed and that's the data generator of that feed. And yep. There are many things. We can also go to the next slide. All right Derek you got a different set of data here right? essentially. So at the end of the race what we see here like where Stapen was pushing right he was pushing away from field we yeah found out that this happens is we have different also values we push through like interval push rates and what we see that here he's building distance to Norris he was like second Norris was kind of struggling a bit and while yeah while pushing he also did a fastest sector one fast sector two and a new fastest lap right so great for storytelling Great for post race analysis. So they can back to the tool. So to be clear, this data is used by the broadcasters, but the teams also use it to understand why they got passed, why they lost, why they won. No. So this data this tool is right now only used for the production tool and also yeah broadcasters. So they're piloting right now and the teams they have their own technologies. Okay. Well, thanks for all you do for F1. you know the popularity of it has gone through the roof and you know I suppose it's not all AWS but the more data you show the fans the more fans you get interested in the game. Yeah. Sure. So all right Derek thanks for your time. All right well that wraps up the ZK tour. We saw the Toronto Raptor shooting lab. We saw some really cool augmented reality basketball. what Bundisia is doing with natural language translation and of course F1. So I hope you enjoyed the ZK tour and I'll see you next year from reinvent 2026.",
        "start": 1230.159,
        "duration": 2550.8530000000014
    }
]