[
    {
        "text": " Welcome to Zcast everyone. I'm Zas Caraval from ZK Research and I'm here at the Consumer Electronic Show. I'm in the West Hall which is known as the automotive area. I'm at DXC Luxoft booth with Kareem Jerei VP of consulting and engineering for Europe. Correct. Very true. Yeah. And we're going to talk about your announcement this week and obviously it's in the automotive space. but before we do that, just a quick intro on yourself and the company. All right. So first of all, thank you for taking the time to be with us today and thank you for coming to our booth. my name is Karim Jerei. I lead consulting and engineering services for Europe. DXC is a global enterprise services organization that delivers both infrastructure and consulting and engineering. Today in CES, we are displaying our capabilities in the engineering space. It's all about engineering today. so we are announcing the launch of Amber and we will talk about Amber which is more in the automotive. We'll talk about digital twin. We'll talk about physical AI u talk about talk about what you announced here cuz you got a lot of cool stuff. You got a car, you got a robot you know and and you are in the automotive zone and so you did launch Amber and so what is Amber? All right. So u DXE locksoft has been a partner of OEMs and tier ones for over 20 years. We're the partner that delivers softwaredefined vehicles and we have been working with our clients in So you don't build the vehicles but you build the software that go that use to build the software defined vehicles. Exactly. We build the software that is running in the vehicle and for more than 20 years we've been the partner of our customers in developing that software that is becoming more and more complex and our customers are under significant pressure to deliver faster at lower cost. So today we are very very pleased to announce the launch of Amber which is our automotive platform that will help customers reduce by more than 50% the time to go to market and by more than 30% the cost of development of new software solutions. Yeah. And I noticed you use the word platform, right? And so as long as I've been coming to CES, we've had cars here, right? And I've noticed more and more the automotive companies are looking for a platform, right? Because there's lots of technology in these cars today and when you try and I guess Frankenstein them from a bunch of different vendors, you do run some problems. So talk about the importance of that single stack and the platform. Yeah. So that that's the big addition that we're bringing to the to the market. We have a platform that allows our customers not to start from scratch from be from the beginning for every new line of vehicle every new hardware",
        "start": 5.6,
        "duration": 364.4000000000001
    },
    {
        "text": "importance of that single stack and the platform. Yeah. So that that's the big addition that we're bringing to the to the market. We have a platform that allows our customers not to start from scratch from be from the beginning for every new line of vehicle every new hardware So we have a new stack and a platform that is independent from the hardware. It's a hardware agnostic that can fit on any of the client vehicles whether this is a commercial vehicle or a truck or even a motorbike we have here. Yeah. And what kind of capabilities are in your platform? So what once they adopted what are the some of the features they're able to bring to market? Well, , every every vehicle on the on the infotainment system needs to have a a number of basic functionalities that need to work in a compliant secure way. we so as an example having a map having the connection to your phone making calls Bluetooth access connection to the different sensors in the car all this is embedded in our solution and it's really turned the car into an edge computing device right I think you know edge computing is a big theme here at or edge AI at CES but it seems that there's no better example of what of that than a car Right. Yes, we're talking about software defined vehicle. More and more software takes a prominent place in the car. it has to be modern. It has to be compliant with the regulations in the in the industry and we this is what we what we we're bringing our experience and we're trusted by our clients and we will help them by accelerate their time to market. Yeah. Now if you watch Jensen's keynote from Monday one of the things you talked about was the next wave of AI being physical AI right and I think first of all you agree with that and then when you think of physical AI it's more than just automobiles and what's interesting is a lot of the vendors that have delivery capabilities to autos specialize in autos but you've got here you talked about digital twin robot motorcycle car right and so when you think about physical AI what are some of the commonalities that you would see across those different devices then what are the differences? Yeah, the commonality is the software it's the data, it's the security. So we we need all these skills and the talent required to develop those those solutions. this is what is common across the whole area of what where we are active. So we are we're proud to be a partner of Nvidia and today having the talent that understand the Nvidia software that Nvidia products and chipset and can develop solutions can deal with data can deal with the problems of security and compliance is is critical. we are proud to have",
        "start": 187.28,
        "duration": 703.3599999999998
    },
    {
        "text": "we are we're proud to be a partner of Nvidia and today having the talent that understand the Nvidia software that Nvidia products and chipset and can develop solutions can deal with data can deal with the problems of security and compliance is is critical. we are proud to have global capabilities whether they are in Europe in America or in India to to support our customers in the journey and we have a number of use cases here whether it's in aerospace and defense or in in the manufacturing industry. All right. Well, let's go back to auto specifically. So one of the goals you had you said was to lower costs and also help them speed up development right and that's in fact I I watched one of the sessions here yesterday and you know one of the challenges EVs today is their price points are still pretty high right and so the manufacturers trying to bring them down and so can you just quantify that a little bit like from the customers you've had what are some of the can you quantify the benefits that they've seen? Yes, we we in the traditional way we have different stacks of costs that are piling up that customers can no longer afford to pay and we are helping with our new technology with Amber solution by removing layers of cost and layers of u middleware for example that we replace with our software. we are the partner to our clients and the customer can implement and buy any technology they want. they don't need to restart from the beginning. their soft software development cycle it's available. It is production ready. and it's compliant with the industry required. and you don't have to name names if you don't want to create but just curious as to who some of the customers are that are leveraging the platform. So we we're very proud to have the all the major OEMs for example in Germany in in Italy with big big brands we've been partners and we understand their requirements for many years today we're bringing this platform to support them and we understand their needs and we have developed specifically our solution to to deliver and to meet the needs. All right. And just last question, what's next for you guys? you're launching today. I guess this year's the year of execution. This is the day one of execution. To to be honest, day one started around 18 months ago when we decided to invest into the products. It took us the time we we were targeting CES as a launch date and we're very proud to be on time. So you hit it. We we hit it and the the the product is is ready. Now our our teams are talking to customers and explaining the capabilities and we had the opportunity to present to many many clients and they were very very enthusiastic and testing and and seeing",
        "start": 359.68,
        "duration": 1038.3999999999999
    },
    {
        "text": "So you hit it. We we hit it and the the the product is is ready. Now our our teams are talking to customers and explaining the capabilities and we had the opportunity to present to many many clients and they were very very enthusiastic and testing and and seeing Well, I can tell you as a consumer of foreign cars myself, I am thrilled you're working with those companies because I can tell you something. Those big brands really understand how to build great cars, but they don't understand user experience and in infotainment systems and things like that. So, user experience is another which we bring we have we have expertise in this field and we we we support our customers. Yeah. And in a lot of ways, you allow the car manufacturers to do what they do best, which is build great cars. And then a lot of the software that goes in them, you know, if they partner in those areas, they're going to just in general get a much better experience than if they try and do it all themselves. And I think that's a lesson I've seen most of the auto manufacturers learn over the last, you know, decade or so. Cuz frankly, when they try to build this themselves, those were those were not great experiences. Yeah. the we we have seen in the in the past few years significant progress and the user experience has significantly enhanced for 20 years we've been supporting our customers and what's amazing is the speed of which new features have been delivered because it used to be if you bought a car this year the difference between this year next year the year after wasn't a whole lot different but now year-over-year there's tremendous innovation competition is also on the user experience and the interaction with the software Yeah. All right. Anything else you want to add? Listen, I I want to thank you for for being with us today. We're thrilled to be here. We're thrilled to announce Amber as a new next generation automotive platform. And I would like to invite any customer to come and visit and test. Well, congratulations on the launch. And if they want to learn more about you, your website is www.dxe.com. Okay. Dxe.com. Okay. So, I'll include that in the YouTube description below. And on behalf of Kareem Jeribbe from DXC Lexoff, I'm Zas Caraval from ZK Research and thanks for watching. , give us a like and also hit that subscribe button and I'll see you next time on my next episode of Zcast. Thanks Kim. Thank you very much. Thanks. Thanks.",
        "start": 530.32,
        "duration": 1279.1200000000003
    }
]