[
    {
        "text": " Welcome to Zcast everyone. I'm Zas Caraval from ZK Research and thanks for joining to what promises to be a really exciting discussion about how AI is transforming work and creating new possibilities across really all companies. I'm Zas Caravala, principal analyst at ZK Research. I'm joined by Rouslana Zerska from AWS and we're going to talk about how you know AI right now we're seeing a pretty big fundamental shift in how companies are approaching AI integration. what started off I think has really business tools to solve some very tactical things has transformed more into something much bigger. In fact AI is being looked at by a lot of companies as really an integral part of the members of the workplace. That was actually a big part of Matt Garman's keynote this morning here at reinvent. And so that's why I'm really excited to be joined today by a distinguished leader who is driving AI innovation not just within her organization but actually across a number of Amazon customers and so I think there's a lot of excitement there. so I want to welcome Rouslana to this. You are when I get your title right VP focused on the future work at AWS, right? you bring over two decades of experience in transforming how companies operate from revolutionizing video advertising at Amazon to scaling Expedia affiliate network and now you lead AWS's vision for the future of work. Thank you Zas. Yeah, lovely to be here. I appreciate the time and well you're a fellow Canadian so I wanted to make sure you got on. Well, it's always lovely to connect with fellow Canadians so many places. Yeah. And so before we get into the topic though, just a quick bio on yourself and how you wound up here in this role. well you know it's it did start in Canada but I ended up I actually went to University of Wateroo near Toronto just north of Toronto I did my undergrad in computer science there and in between Amazon or my current role I did about 10 years at Expedia following that and then last year I celebrated my 12 years at Amazon. Yeah. And you have actually have a very fascinating background math and computer science. I chose math and physics. So we have a lot of things in common to transforming advertising and now workplace technology. And so how does the diverse background you have influence your approach to reimagining the future of work? You know, it's interesting for me. it's kind of three main things that kind of always drive me. I would say first is really curiosity. I know sometimes it kills the cat, but we'll see how that goes, right? [laughter] and it's really around I get excited about the problem space and drives me to learn more about it and about the business and the opportunity and that's common across you know my time at Expedia and reimagining how people",
        "start": 5.92,
        "duration": 331.12000000000006
    },
    {
        "text": "the cat, but we'll see how that goes, right? [laughter] and it's really around I get excited about the problem space and drives me to learn more about it and about the business and the opportunity and that's common across you know my time at Expedia and reimagining how people destination the activities they do all the way through how people discover new brands and new products and advertising and now thinking about how do we bring different experiences for the end users within enterprise right so that they can do their work very differently day-to-day. the next one is really around complexity. It has to be a cool problem to solve. It has to be ambitious, ambitious, and it has to be a space where you can reimagine significant portion of it, a significant portion of the experience. And lastly, I think it's really around proximity to the customer, right? It's important to me that whatever I do, I have a way to connect with my customers on a daily, weekly, monthly basis. understand what type of pain points they're trying to solve and how we can help them solve them different help them solve those pain points differently and kind of just create very new delightful experiences you know so like if you think about the current chaos of us working and us going through many application and many tabs work coming at us from many different directions for us to try to figure out who needs what from me today and what do I need to get done is very different you know the other day I was driving my son to school and he once in a while borrows my phone to do research and he goes, \"Mom, you're using 501 tabs. Do you need all of them?\" I'm like, \"Wow, I have 501 tabs open. That's bizarre. I'm flipping between them.\" He's like, \"Are they all important?\" Well, I don't think they're all important, right? And so, I think I see the world in which with AI teammates, the work comes to us and so they help us prioritize how we spend our time, how our attention is used, right? And so we think about those and those priorities through a very different lens in the future. So let me ask you do you know when you talk about the reimagination of work do people when you talk to customers do they know work is actually fundamentally broken and because the customers I talk to they don't until you start asking them a different type of question right so if I say do you think you could work more efficiently sometimes you get sometimes they get no but then if you start thinking about like what percent of your time is spent managing work right hence going through those 51 tabs, right? my research shows that it's about 40%. And so when you bring that up, then they realize there must be a",
        "start": 171.2,
        "duration": 611.198
    },
    {
        "text": "sometimes they get no but then if you start thinking about like what percent of your time is spent managing work right hence going through those 51 tabs, right? my research shows that it's about 40%. And so when you bring that up, then they realize there must be a to me seems one of the bigger challenge. If you can reimagine work, there has to be an admission that work is actually fundamentally broken. I do think that's a journey we're on right now, right? I think we started with, hey, the consumer experiences are delightful, but the tools that the we use at work dayto-day don't have to be delightful. that we've we have not historically been obsessed about the end user experience there and what that looks like and I think there's a fundamentally huge shift in how we think about that experience and that brings us to like wait this is broken like why can I not use the same powerful AI teammate or AI model to help me on a daily basis come up with new insights that gives me like augments my capabilities gives me new differentiations new superpowers why can I use it in my daily life but I cannot use that in my day-to-day work, right? So these questions are coming up and so then the realization to your point of like hey the my work today day experience is not the same hence it's broken. Right. Yeah. Yeah. So when I look at your background, you know, going back to Expedia, you've seen some really major technical transformations here through your career, right? We had e-commerce, digital advertising, and now AI. And so when so when you think about that background and the transitions you've seen, what's what are some of the commonalities and what really excites you about this moment of workplace technology right now? So I think there's probably three to four things that fundamentally excited me about the role I'm in and the opportunity ahead of us. I'll start with the fact that we have this opportunity for hyperpersonalization and much more holistic employee experience right and it's interesting because if you think about travel how you experience it is such a personal way of kind of going being exploring seeing new places enjoying new food exploring new coffee shops. , if you take that to shopping and e-commerce and discovering new products is also highly personal like what you like, how you research, how many tabs do you go to to find that next, you know, smoker you might be cooking your turkey on, right? Versus how my partner might be that's very different, right? So, it's highly personalized and I think with technology that is upon us, we have this opportunity to really create this hyperpersonalized experience at work, right? how I work, what I do in the morning, how I focus in the morning, how I choose to spend my time in the morning",
        "start": 313.199,
        "duration": 904.718
    },
    {
        "text": "it's highly personalized and I think with technology that is upon us, we have this opportunity to really create this hyperpersonalized experience at work, right? how I work, what I do in the morning, how I focus in the morning, how I choose to spend my time in the morning right? Right now it's all the same. Like we try to sort this out for ourselves. No one assists us or help us to figure out this is how what is the best way to use my attention or your attention first thing in the morning or in the afternoon, right? So then if you think about like even the evolution and and transition that we've been going through, right? So we went from like the desktop to SAS and you'd say oh that was that easier. I actually think that was more complicated. It added more layers, added more tabs, more things to kind of go in between, right? What's local, what's cloud, how do you think about that as a end user, right? , so then where we are today, instead of adding more layers, I think we're actually bringing simplicity. it might not feel yet as simplicity but as you have couple of these genuinely collaborative teammates that help you sort of think through what you need to do when you need to do and kind of how you go about it and actually maybe even doing some of this work for you while you might be you know sleeping spending time with your son playing soccer whatever that might be right and so I think that's the part that that excites me is this hyperpersonalized but also very holistic employeecentric experience that we that's upon us and we can kind of reimagine it. the other thing is proactive element of it right. So think about today it's a very much collaborative experience and well you could say individual right you and the AI teammate as it unfolds I think it's going to be about a team and AI teammates collaborating so it's human AI collaboration further unfolding and I think it's going to get much smarter and it's going to continuously learn and it's going to be proactive and it's going to help you and your team to be much more efficient and effective in how they sort of spend time and spend energy. Yeah. And so you know those are the key pieces that excite me. And then the pace I mean I love the speed the speed at which it changes it's incredible right for if you think about evolution of internet that took us a little years right evolution of cloud took us years and now in this agentic AI we talking weeks maybe months but we're not talking years and so the speed at which this changes is dramatic. So those yeah I think we're going to unlock productivity like we've never seen before. In fact, I know tomorrow you'll",
        "start": 461.599,
        "duration": 1169.8389999999997
    },
    {
        "text": "took us years and now in this agentic AI we talking weeks maybe months but we're not talking years and so the speed at which this changes is dramatic. So those yeah I think we're going to unlock productivity like we've never seen before. In fact, I know tomorrow you'll frameworks at the reinvent executive summit and so could you share an example of how the right team structure actually helped unlock AI's value and more specifically if you go into your own example about how you've done that with your own team. It's interesting as you speak of like unlocking productivity. You know, we've traditionally thought about scaling compute, but I don't know if we can say with confidence it also scaled productivity. You could say maybe arrived at more complexity as I Well, there's an argument being made that we are as we've added more applications, we've become less productive because we're spending more time managing work. Right. That's right. And so I wonder if the era that we are in right now is really around as we scale compute, we might be scaling cognition and we may be scaling ability to actually be productive and think about how you know an engineer on my team can deliver 3x the production ready code and delight the end customer with a new capability, new product, new feature not in years but in ours, right? So, I think there is a fundamental change in in in how to think about sort of productivity and what that means in my mind, especially for our ability to innovate on behalf of our customers, right? for my team specifically, you know, we started this journey at the start of this year in how the was the goal like, hey, can we all get to the point where we have what I would call AI forward team, right? So where they develop code in partnership with AI on a daily basis and it wasn't easy. I think it's fundamentally a cultural change. It's a people change not just technology change. We arrived at hey we need probably clear set of goals and a good really clear way of measuring what success looks like. we can't really start at entire organization level. We might have, you know, we started with three small teams that were multifunctional and gave them a couple tools that they can kind of test and see what works for them. And then from that ground up, we arrived at, hey, here's kind of one of couple one or two things that actually really made it easy to ship a piece of code and or , you know, do a spec of existing codebase and then give it to Kira to rewrite that , old application. And so with collection of these use cases, we then said okay one or two of them actually have shown meaningful results. So how do we now scale it across across the team right?",
        "start": 596.48,
        "duration": 1496.9599999999996
    },
    {
        "text": "spec of existing codebase and then give it to Kira to rewrite that , old application. And so with collection of these use cases, we then said okay one or two of them actually have shown meaningful results. So how do we now scale it across across the team right? culture kind of create the community around it celebrate the wins right every time both from a adoption perspective and how the team has been using AI on a a daily basis as well as for all the new discoveries and new kind of scaled instrumentations throughout the year right so so it's it's it's it took us a while and I will say we made a lot of good progress but we still have work to do until next year. Yeah. In fact, I've noticed something when people start using AI tools is there's a big attitude shift. So, at first people think, \"Oh my god, AI is going to take my job and then they start using the tools and they realize I can never do my job without it.\" Right? And that's part of the maturation process. And it's a little bit like, you know, I say you wouldn't hire an accountant that doesn't know how to use Excel, right? So, down the road, you'll never hire a developer that doesn't know how to use AI. And and I think it's really an important part to understand right now that everybody in the workforce can use AI to make themselves more productive. And if they're resistant to it, it's the old expression, right? It's not AI that's going to take your job. It's somebody that uses it that will. So with that being said though, I know you speak to a lot of customers and I've seen a bunch of different use cases and I think we're moving to an era where we're going to have humans and AI agents working together, right? And so this whole concept of AI and human interaction. So from the customers you've talked to what works and what doesn't work. You know it's interesting. I feel like organizations that we enga we're engaging with and where we help them deliver solutions at scale have gone through various phases and a lot of them have done tons of different sort of experiments and pilots and have unfortunately been not successful to scale them across a larger body of their of their teams. , some of it I think has, as I've stated when sort of I've explored this with my own team, it goes back to very clear way to measure what success looks like, right? It's sort of you start big and you don't have a clear focus and you don't have a clear measure and you don't know what to measure or maybe you don't even people don't know what to measure, right? And so I think if you have no idea what to measure, then how do you",
        "start": 761.92,
        "duration": 1748.0009999999995
    },
    {
        "text": "big and you don't have a clear focus and you don't have a clear measure and you don't know what to measure or maybe you don't even people don't know what to measure, right? And so I think if you have no idea what to measure, then how do you even in our case, we had to sort of think through what is the right way to to measure, right? Is it just total amount of code lines shipped? Well, that doesn't seem like how do you think about quality, right? So, it's really what is production ready a production sort of productionized code, right? That actually delivers the capability to customers. So, you kind of have to iterate and you have to be willing to iterate on the measure, right? Arrive at a starting point, you know, keep understanding it and see like evolve it. one of my customers I work with it's a large public sector customer and so they started with hey I have a you know over 20,000 developers and I want to enable all of them with some sort of AI teammate an AI agentic experience and they've sort of spent a year frankly not making a lot of progress lots of little pilots but nothing at scale that landed so they've hit a reset button and went into Okay. Well, I'm going to take five teams, small teams, you know, seven, we call it Amazon, you know, one one pizza team, two pizza team maximum, right? How many people do you need to feed them a pizza? , and so small teams, but also product manager and a designer are part of it of of this of this little unit, right? And then give them a set of instead of tell them, hey, you can explore whichever solution you want. Here's the five solutions that we believe would add value. like work with them and then from the bottom up from these five teams start gathering what are the actual use cases that have shown effectiveness and you can scale right so so that was that was interesting and then another customer more in sort of media space they actually been working on this you could call it Salesforce agent right it's a character that collaborates with your sales personnel and I could see as this agent becomes much more context aware and much smarter we might you know we might never have to log into a CRM again and you could you could have them update your you know pipeline sales pipeline you could also have them retrieve information that's critical and be much more proactive in bringing kind of the right opportunity to the forefront and so that's an interesting another collaborative experience that they unlocking for their sales staff and and their current SAS applications well there is a thesis that apps as we know won't exist anymore that their primary interface will be through some",
        "start": 889.68,
        "duration": 2028.9619999999998
    },
    {
        "text": "kind of the right opportunity to the forefront and so that's an interesting another collaborative experience that they unlocking for their sales staff and and their current SAS applications well there is a thesis that apps as we know won't exist anymore that their primary interface will be through some to to it. You'll ask questions. It'll log things for you. It'll do a lot of the mundane, but it fundamentally changes the way we interact with things. And in fact, I think even with consumer apps and things down the road, like you think your old company, Expedia, if I want to book travel, why do I have to go log in? Why can't they just ask it to book for me, right? And so, it's going to be fascinating to see how that happens. Obviously, not everything is going to move that way, but clearly, , a big part of the way, just like, you know, when you think back to the internet, the rise of the internet, right? the the internet is really integrated into every fabric of the way we live. AI is going to going to be the same I think. So now given the pace of AI innovation and we were talking about the need to be able to understand what to measure, right? What should organizational leaders be doing to help them prepare for what's coming so when they're ready to put in they know what to measure, they know how to measure it. Yeah. so they can actually get the value, right? Yeah. Yeah. Yeah. No, I think I think that makes sense. And I guess as everyone is sort of closing on 2025, it's always fun to have reinvent kind of the first week of December and have all this new innovative capabilities. Thanksgiving is over. Come to reinvent. Yeah. Exactly. Exactly. and be grateful for so many things and then you immerse yourself right into sort of 2026 and and how do you think about having much more effective let's say collaborative experiences with with AI? I think the challenges I still believe the challenges are really cultural much more so than than technical. Exactly agree with that. and I think it's really about the people transformation which you sort of go back to the old days. What does it mean to change a culture and how do you think about people don't like change right? we we don't we don't we're not really big on change right so hence you have to bring the people along you have to help them understand what what is a delightful day was this AI collaboration experience that you might have right and so then the other piece is if you don't focus on one or two critical goals that you might be able to measure or should be able to measure then it's very nebulous and kind of vague and it's hard to embrace right and so I think that's",
        "start": 1032.24,
        "duration": 2286.4809999999993
    },
    {
        "text": "right and so then the other piece is if you don't focus on one or two critical goals that you might be able to measure or should be able to measure then it's very nebulous and kind of vague and it's hard to embrace right and so I think that's two goals, right? Clear set of measurement. If in doubt, revisit the measurement, right? And keep iterating on what you measure and how you measure until you have confidence that this is measuring the right thing, right? so start small, stay focused is kind of really where my view is as if you're thinking about how do I take some of those pilots that showed some positive results and scale them across my organization. And then you do have to kind of head on address the human concerns, right? like how do you help the team see that this could be a very different way of working a very different way of being in the future right so for my team it was interesting for the you know these three teams and you say let's say one of them is m maybe the most AI forward team right they sort of came at the realization that hey I am not really I'm an orchestrator I'm not an executor I don't execute all these tasks as I code I orchestrate how this has happened. So there's like a new way of new rhythm of building. So fundamentally the team had to rethink what is a new way of building a product right a new way of creating on behalf of our customers. which I think is is different and I think the other piece that you run into and I think a lot of companies already run into is our codebase for instance wasn't optimized for AI to engage with and understand and so you realize that there's work to be done there to arrive at that before you can actually see fundamentally very different value from AI and team collaboration you bring up an interesting point too on rethinking the output of people and it reminds me of a conversation I had with this global sales leader oh 20 years ago where he was talking about if I want to get people to adopt new technology, I simply just change their goals because if I give them the same goal they had last year, then they're going to do the same thing they did last year. Or if I create a stretch goal for them that they can't accomplish by working the same way, they're going to find different ways of working and that drives them to use the new technology. So I think it does come down to from a cultural perspective be willing to either use a carrot or a stick to incent people to use the new technology. But I do think in AI in particular these these tools once you start using them really",
        "start": 1162.799,
        "duration": 2557.1220000000003
    },
    {
        "text": "the new technology. So I think it does come down to from a cultural perspective be willing to either use a carrot or a stick to incent people to use the new technology. But I do think in AI in particular these these tools once you start using them really do a lot of things that frankly people don't like doing like logging call summaries things like that. So well now one of the the challenges I see though is that and maybe this is the even a bigger challenge in security is that most organizations data isn't structured in a way that AI can use it effectively right so when you talk to customers how are you helping them go through that process of making the data more AI ready yeah I think there's there's significant cost to this fragmented fragmented intelligence if you wish and I've always said fragmented silos of data lead to fragmented insights, right? Yeah. And it's a lot of time wasted, right? It's a lot of time wasted at bringing the data together and figuring out how how to make sure it's in one place to start with. But I think the current era that we that we in is really around sort of e continuously refreshed data that is sort of real time or near real time. Right? So if you think about it for me and what my team learned when we thought about kind of the scaling from pilots to a scalable solutions the data it's not about having huge data lake anymore or having lots of data like a lot of data is useful this is how you get tons of context and tons of ability for AI to continuously learn and get way better at being much more helpful on a daily basis but it cannot be stale right it has to continuously evolve which means you have to have both structured and unstructured data in one place and it has to be continuously updated. So that near real time right. So AW at AWS quick suite and more specifically quick index might be a fun starting point that can help you bring both structured and unstructured data together and unified it in a searchable repository right with sort of existing permissions in intact right and so that might be a fine starting point to have to to arrive at the a data that's AI ready yeah and the other part of the data coin then is security it reminds me of a conversation I had with a a CEO about a month ago where he was saying you they have their own private instance of AI and then but then he realized the stuff he works on mergers and acquisitions you can't put in that right and then he also knows he's got developers vibe coding you know using PR teams using public data sites things so when you think about how companies manage security and access to",
        "start": 1299.84,
        "duration": 2868.4030000000002
    },
    {
        "text": "but then he realized the stuff he works on mergers and acquisitions you can't put in that right and then he also knows he's got developers vibe coding you know using PR teams using public data sites things so when you think about how companies manage security and access to issue is Is it a technical issue? Is it a combination of the two? What's the right approach to make sure that people can use AI and get the benefits of it without putting their company at risk? It's a little bit of everything. I think there is an element of we as you know was as employees we don't want to do the wrong thing, right? So there is an element of trust, an element of feeling safe that you can engage with these solutions effectively and give them the right information at the right time. So I think it's a collection of things I think but at the same time I do strongly believe that security and AI innovation can coexist. You just have to make sure that foundations are right right. So you have the right governance in place right with the right foundational pieces around identity management and access controls in place and as a result that will and education right so you have to bring your team along again goes back to how do you bring the team along how do you help them feel like these are the tools that are available to you and they are safe like they are fundamentally the right tools to use on a on a daily basis so within AWS we built security in the foundational layer of the AI and you might know but we are the first major provider that received the ISO for 2021 responsible AI certification. So I think there so there is a way to do that again you have to think about both how do you bring the people along how do you train them how do you help them understand that the tools they engage in are safe and then at the same time I think you do have to make sure that it's a part of your foundations and the government and I think it has to be foundational I don't think this can be a bolt-on otherwise it won't scale so all right well I appreciate the conversation before we wrap up though just a couple more questions from your vantage point as someone who's leading applied AI solutions AWS What excites you most about the way AI will transform the way we work in the future? You know, if I look at how even let's take this year the pace at which things changed, you know, where we first engaged with some of the models, we were like, \"Oh, this thing doesn't work. It is not very smart. It's not very useful. It kind of works, right?\" to where right now, and right now, we're",
        "start": 1457.2,
        "duration": 3140.4029999999993
    },
    {
        "text": "take this year the pace at which things changed, you know, where we first engaged with some of the models, we were like, \"Oh, this thing doesn't work. It is not very smart. It's not very useful. It kind of works, right?\" to where right now, and right now, we're really insightful oh this is really different oh I haven't thought about that right so your way of interaction is exactly in a year right exactly in a year how much progress and it's probably not even full year you know if I think about me engaging you know with some of the solutions kind of late January and onto today it's very different but I think the other thing that changed dramatically is ability to make decisions already right it's already changed your abil your your time from I need to learn I need more information to I need to make decision is kind of near real time there's no more I need a couple weeks to learn then maybe couple days to sort of sift through the data I have and the information I have and then I will make a decision right as I entered like I as I joined my my team and and started the new role last year it was like instantaneous you had to make decisions you had to make decisions quickly and having this collaborative experience erience that's a part of your daily work was fundamentally changing how I operated and how quickly I can guide my team help myself learn and make a decision. went from you know weeks to seconds u which I think is beautiful and very empowering and then you know the other thing to think about is I mean there are lots of different data points around how much of kind of decision making will be automated so to speak right I think something like 15% by 2028 I think it's going to be probably more and I think that's probably true you know and so what does that look like and what does that empower us to do then and how we spend our time to your earlier point today you know we spend a lot of time doing what I would say silly work right so if you don't have to do as much of that silly work or if you don't have to do a lot of that frustrating silly work that you don't really like to do then you get to do what you love to do and I think that's a very beautiful way of u of working right so your work is something you actually genuinely enjoy doing and so in my mind I'm envisioning a world where teams and AI I collaborate continuously on a daily basis and creating unprecedented value for our customers. Yeah. So, one of one of the piece of advice I always give people which is a little tongue and cheek though is if",
        "start": 1595.44,
        "duration": 3418.8829999999994
    },
    {
        "text": "so in my mind I'm envisioning a world where teams and AI I collaborate continuously on a daily basis and creating unprecedented value for our customers. Yeah. So, one of one of the piece of advice I always give people which is a little tongue and cheek though is if that you don't like doing, stop doing it. Find a way to have AI automated out of your job. Yeah. Right. So, and may maybe that's the best way to think about it too. So, all right, last question for my audience. I know a lot of people that I work with are thinking about AI. They're stuck in a little bit because they're not sure how to proceed. couple pieces of advice you can give them. How do you get going with AI? Well, use it yourself first and foremost. Yeah. If you don't use it daily, find a way to use it daily. If you have a question, you're figuring out how to answer it. Why not use AI to help you do that, right? , so everything you do, think why am I not using AI to do that with me? So that I think it starts with you because that will help you to be a better executive sponsor and unlocking that across your organization. Then pick a goal, clear way to measure it, small team, and get going. All right. It starts with you. Starts with you. Yeah, I love that. I love that recommendation. And in fact, I personally believe this is the biggest technology shift we're going to see in our lifetime. , I don't think when it comes to AI, I think there are no fast followers. I think you either get on board with AI and you watch your productivity go up or you fall behind very quickly. So, , any closing thoughts? Anything else you want to reiterate? Well, enjoy reinvent, make the most of it. There's a lot more coming. Exciting announcements this morning already and look forward to seeing you around. All right, so on that note, on behalf of Rouslana Zka from from AWS, I'm Z Caraval from ZK Research saying thanks for watching. give us a like and also hit that subscribe button and I'll see you next time on my next episode of Zcast. [music]",
        "start": 1738.399,
        "duration": 3608.822999999999
    }
]