[
    {
        "text": " Welcome to ZCAST [music] everyone. I'm Zas Caraval from ZK Research and I'm here with Cisco's chief product officer G2 Patel and also Bob Liberty from the Cube Research. So we're going to do one of our joint Zcast analyst angles and I'm really excited to have G2 here. So we're a partner summit. The innovation train is rolling. G2, you've been chief product officer now what like 18 months something like that. 18 I don't know. I have to check LinkedIn. Seems seems like a long time. but since the day you took the job, you have espoused the value of the platform and I think everything you've done to this point is to get the company to that to that point. And so let's just take a step back and when you took the job, why was this pivot to platform so important? You know, when you have a large company, one of your big advantages needs to be breath of capability. And you had breath. And we had breath. Yeah. But our breath was our liability at the time because it was not integrated. So you had all these kind of we felt like a holding company with a bunch of acquisitions that were kind of all like nicks and knacks that didn't talk to each other. And that actually really hurts us because at that point in time, you're neither here nor there. You're you're worse than a startup and you don't really have the big advantage of being a mega cap. over the course of the past I'd say three years we've made a concerted effort to make sure that this becomes a holistic platform and now our breath is our biggest advantage right and and I feel like in in my mind until we had gotten to that point we would not be able to hit escape velocity and u and so I was completely focused on two dimensions we got to build a platform advantage where the marginal cost of ingestion of every new technology from cost should go down precipitously and every technology that you buy should have a compounding value not just to the thing that it does but also the things that you might already have from us. If you can do those two things for the platform advantage and then the second thing was to create an open ecosystem. Y I feel like if we get got those two things right then we would be a very kind of effective company to be able to grow way faster than market. And I think you're starting to see this happen now. Okay. Yeah, I think that that makes a lot of sense. And you know, obviously today you can't have a conversation without talking about AI, right? I think Chuck said it's not coming. It's here now. And so I'm wondering if you could maybe highlight the importance of having that platform as organizations look to transform and modernize their",
        "start": 5.12,
        "duration": 328.1600000000001
    },
    {
        "text": "of sense. And you know, obviously today you can't have a conversation without talking about AI, right? I think Chuck said it's not coming. It's here now. And so I'm wondering if you could maybe highlight the importance of having that platform as organizations look to transform and modernize their the way that we think about AI is there is I I think you have to look at this saying is this a mega trend or is it a hype cycle because if it's a mega trend you can't fight it and if it's a hype cycle you shouldn't pay attention to it. Yeah, it's quite clear it's a mega trend and it's you know and so we felt that way about 5 years ago and Zeus when I first joined you and I you were the first person that I met with when I joined Cisco and and it was very clear to me at that point in time that we got to double down on AI. I think we talked about this in the first conversation we had. The first acquisition we made was Babel Labs when on on my first week, you know, I actually worked on my vacation to make sure that the acquisition happened. and the reason that we had so much conviction on that was because it was very clear that it was going to be a mega thread. Now, by the way, back then we didn't know that this was going to get even more accelerated because of language models and chat GPT quite to the degree that it it has happened now. Sure. But given the fact that it's a mega trend, then the second thing you have to ask yourself is what are the things that could hold it back and we think there's going to be three constraints. There's going to be an infrastructure constraint. Right now, the reason open AI is not 1.6 billion users and the 800 million users is because they just don't have enough infrastructure to serve up the demand, right? You know, number two, there's a trust deficit. People don't trust these systems. They're not going to use them. So, we got to solve that problem. And number three is there's a data gap and specifically the data gap is in machine data because people don't have a way to go out and correlate machine data and time series data into human generated data and and now when you start seeing what's happening we are running out of human generated data to train these models that's publicly available on the internet. And so what's really taking off is synthetic data. Yeah. And then machine data is going to skyrocket. 55% of the growth is happening in machine data right now and that's only going to go up. So given those three constraints, we said all right if these are the three constraints, it seems like Cisco is perfectly poised",
        "start": 168.08,
        "duration": 593.4419999999999
    },
    {
        "text": "data. Yeah. And then machine data is going to skyrocket. 55% of the growth is happening in machine data right now and that's only going to go up. So given those three constraints, we said all right if these are the three constraints, it seems like Cisco is perfectly poised in each one of these constraints. And it's not like a artificial jamming in of ARC products into a new trend, right? This was a very natural thing. It's like yes, these GPUs need to be correct. We're the best networking company in the world. AI needs to be secured, right? We're the best security company in the world, right? When you actually think about Splunk and security pulled together and then the data that needs to be focused on in this data gap, machine data needs to be incorporated into that mix. And we are specialized in machine data with Splunk. We ought to take those three things and make sure that we bring it to market, which is exactly what we've done. And we've done that with hyperscalers. We've done that with neoclouds. We're doing that with sovereign clouds. We're doing it with service providers and the enterprise. And actually, every one of those customer constituencies is helping the other and is helping out the enterprise. Got it. So, one of the other hallmarks of your tenure here over the last 18 or whatever time it's been has just I've been in this job for 14 months, I think. Yeah. Okay. [laughter] We're trying to give you extra. Yeah. It seems like 18. Seems like 18, but Well, yeah. Yeah, I mean it seems like from what you've accomplishive from [laughter] what you've accomplished it's been a lot more than that, right? So there's been, you know, dozens if not I don't know how many dozens of innovations that have been announced. I think at Cisco Live there were over 24 25 announcements alone. Is there any looking back now over all that time? Is there any one announcement that you feel like had a really big impact or a couple of them that have had a significant impact for customers? I think if I were to say what is the one big thing strategically and this goes before my time I don't get credit for it is the fact that we make our own network silicon and AS6. Yeah. You know I think that is probably one of the most strategic things that we have done as a company. We would not literally have a hyperscaler business without them. Right. so that would be in my mind the number one piece. The second thing that we've done which is really really important is we've fused security into the fabric of the network. Yeah, I I don't think these will be two distinct markets. I think they'll fuse together and I think we're the only ones who can actually bring those together in the way that we can.",
        "start": 304.32,
        "duration": 873.4419999999998
    },
    {
        "text": "which is really really important is we've fused security into the fabric of the network. Yeah, I I don't think these will be two distinct markets. I think they'll fuse together and I think we're the only ones who can actually bring those together in the way that we can. innovations we've done on open ecosystem. Yeah, I can actually keep going because there's like three more I can think of but like open ecosystem is going to be a big one. our partnership with Nvidia, our partnership with Microsoft, our partnership with AMD, our partnership with even what we've done with companies like Zoom. and you know, it was a very unnatural motion for the company to think about doing something like that. We've actually not only have we pulled it off, we are now one of the most open open companies in the world and customers depend on us to actually, you know, carry that mantle forward. Yeah. And then a couple others is an entire campus branch refresh. That's a pretty big deal. I think the data center you know kind of pulling all all the things together in the data center the way that we have. and then lastly specifically in the past 6 months what the Splunk team has been doing is been remarkable. Yeah. Yeah. And it's funny because I remember when you did the Microsoft announcements I'm sure I'm forgetting something. I remember talking to Salesforce and they were not comfortable at all talking about working with teams because they were so used to be competing against it but they got religion pretty quick. So that was I I have to give credit to there's this guy named Mike Tutour tu cn. He was he was at he used to be in the SQL server team years ago when I used to work at docuabs and I was having dinner with him at in his place in Seattle one night and he taught me this this lesson cuz you don't eat one. Yeah. He said to me one time, he said, \"Anytime that you have more than 20% share in the market, when someone has more than 20% share and you don't partner with them, all you're doing is excluding yourself out of that 20%.\" Yeah. You're not doing anything different other than that. And that was like a light bulb moment for me because it was like, you know, if we just stay completely open, it's just the right thing to do for customers and it's the right thing to do by us. And then at Box, we practice this very religiously, right? You know, and I I felt like this was something that we needed to do at Cisco. And I I'm I'm so glad that one of the things I'm really grateful for at Cisco is the air cover that Chuck has given me when I've had to do things which seemed unnatural. he's always actually trusted me to",
        "start": 444.56,
        "duration": 1163.0420000000006
    },
    {
        "text": "was something that we needed to do at Cisco. And I I'm I'm so glad that one of the things I'm really grateful for at Cisco is the air cover that Chuck has given me when I've had to do things which seemed unnatural. he's always actually trusted me to Yeah. You know, take some risk. Box lives. Erin told me 100% of the customers have Google Drive or One Drive. Right. And so that's a good example of that. Now we are here at partner summit. So let's talk about the payload of innovation here. you had the unified edge product as well as unified branch and to me those I think are great examples of the platform that you've been trying to build and so can you go into some details on those and then the outcomes you expect customers to have. So I think the the unified edge is like let's take a step back. What is the most important thing that most companies and countries are thinking about right now? It's the metric for success in the modern era is token generation. Yeah. If you can generate tokens at the most economical way with the lowest amount of kilowatts of power, you will actually be successful. Yeah. Right. and so tokens per kilowatt per dollar is actually the metric of success. So the token generation ability is going to be directly proportionate to your country's GDP, your economic prosperity as either a country or a company and national security and the security posture of a company. So when I think about that and say okay so what are what is the world doing with token generation right now there's probably like5 to7 trillion dollars of buildouts happening all throughout the world of data centers gigawatts and gigawatts of capacity being built out where data centers are being built close to where the power is available but our thinking is we shouldn't have data centers be the only place where tokens get generated right we should have tokens also being generated at the edge wherever the data is. Wherever the data is. Yeah. Right. And so if you happen to have you know a branch office or a factory floor or a stadium or you know any of these kind of [snorts] different locations which might not have an IT staff but you want to have some lightweight token generation happening over there from an inference perspective. Yeah. We should make sure that we make that simple and you have to make in inferencing plug-andplay for the edge so that you have an end to end core to edge strategy on token generation and that's essentially what Cisco unified edge did is we massively simplified the and I mean right now when you go to a branch office you'll see like four different devices all wired together wires dangling everywhere you don't really have enough plugging outlets you've got some kind of an extension strip that's",
        "start": 594.08,
        "duration": 1494.961000000001
    },
    {
        "text": "what Cisco unified edge did is we massively simplified the and I mean right now when you go to a branch office you'll see like four different devices all wired together wires dangling everywhere you don't really have enough plugging outlets you've got some kind of an extension strip that's this clean, simple, magically easy, and manageable from the central point? Like, wouldn't that be something that every company is going to want? Yeah. And and so we did that. And I think I give a lot of credit to Jeremy Foster who's actually our our leader in the space. he had a lot of conviction in this. And this is the beauty of it is when people actually feel strongly about something and they've got instinct, they will actually have the debates internally and they will fight the resistance internally to say this is the right way to go at it. And I'm so proud of the team for what they've done. Frankly, I would say that I stand correctly. I stand corrected. I wasn't as sold on this in the early days when they told me this. Yeah. And then over time as I've talked to more customers, man, this was this is a no-brainer. Yeah. I think that's perfect. So you've got the customers covered from end to end, right? You're enabling all the the scale out and now you've got scale across as well. So for what you're en you're enabling people to leverage those tokens at the edge and now you're enabling them you said one of the biggest constraints is power. So that scale across capability that you've now released is enabling organizations to have those distributed AI clusters. So let's talk about the scale across because that's a pretty big deal. I mean we like I said earlier the the fact that we make our own chip really helped to because we now have a 51.2 TB terabit chip. Yeah. That actually has deep buffering on the chip, right? And when you tie that with the system which is the 8223 router, we're able to go hundreds of kilometers apart for data centers and have low latency, high performance, 65% better energy consumption or lower energy consumption you know kind of packet transfer. Yeah. And and because of deep buffering, you're able to take these two data centers that are hundreds of kilometers apart and have them operate like an ultracluster for a training run, right? Like 3 years ago, if someone told you that, they you you'd think they're nuts. Like this this defied laws of physics. Yeah. Well, a 51.2 TB chip itself, I would have thought was nuts. Yeah. Yeah. Yeah. And so I I feel like and we're the first one to actually put the whole system together, right? You know, yes, we've got the chip, but yes, we've also got the system and we've actually gotten it out in in in in",
        "start": 760.079,
        "duration": 1788.4010000000012
    },
    {
        "text": "have thought was nuts. Yeah. Yeah. Yeah. And so I I feel like and we're the first one to actually put the whole system together, right? You know, yes, we've got the chip, but yes, we've also got the system and we've actually gotten it out in in in in is is a pretty big deal. So now we've got scale out, we've got scale across, we've got core to edge. , I mean this, you know, we've got networking, we've got security, we've got observability, , we've got compute, we've got optics. You pull all of that together, like our breath is our asset, right? Really helping organizations to transform and take advantage of the opportunities they have with AI. Yeah. Yeah. Yeah. And [clears throat] and so what's what's next? What what's on the road map for you? Look, I think we are in like I was giving I was on one of the TV shows today and I was telling them like they like what how far how early are we in this entire transition. I'm like, you know, I'd like to give you a baseball analogy, or a cricket analogy, whichever, depending on which part of the world you come from, but it's very early innings. Yeah. Right. So, you you're probably in the second inning of the ninth inning if you look at a baseball analogy because I think there's so much more to be had and we are just getting warmed up and just getting started. But here's the thing that I think is underhyped. I think there's two things because the the common question we get is are we in a bubble? Yeah. And my answer is actually we're underestimating the infrastructure buildout and the capacity that's going to be required to go out and fulfill the needs and we haven't even started with the enterprise yet. Yeah, just the consumer we are underestimating the bubble. Forget the enterprise like it's going to be every company is going to get refactored. So the first question on the bubble I feel like we are we are way underestimating demand signal. Number two is how do we think about this from from the standpoint of like what comes next? Every segment, every vertical, every customer will have their business processes reimagined and refactored. Yeah. Every job will be refactored, right? And so when you start thinking about something that's that seismic a shift and it's happening at the speed that we're talking about right now that compression of time within which we're doing this very massive amount of work I I feel like it's something that's once in a lifetime opportunity. I don't think any one of us have seen it correct in a I mean I lived through the internet era. I lived through mobile. I lived through cloud. I lived through when we were going to client server and PC. Like none of that felt like this.",
        "start": 909.12,
        "duration": 2081.120000000001
    },
    {
        "text": "lifetime opportunity. I don't think any one of us have seen it correct in a I mean I lived through the internet era. I lived through mobile. I lived through cloud. I lived through when we were going to client server and PC. Like none of that felt like this. closest analogies just because it's you know I used to go to internet conferences I used to you know think about it that way you know and I think Cisco does a great AI summit if you're doing the AI summit in five years you failed at what you're trying to do with it because by then it should be really integrated into the fabric of our life like I don't actually think AI should be talked about as like what's your AI strategy should just be yes right and and yeah you won't have this kind of concept of this is the person that's running my AI I division in the company because AI is going to be part of the fabric of the entire company. Correct. It'll be hard to think of a job function that doesn't use AI because like what are you doing? Like how are you going to be able to get your job done? And by the way, people keep saying like, well, is AI going to take our jobs? I feel like there's three levels of maturity. Maturity level number one is you worry about AI taking a job. Maturity level number two, which means you've graduated one level, is you're like, AI is not going to take my job, but someone that uses AI better than me will take my job. Yeah. And maturity level number three is when you start realizing without AI, I can't do my job. Yeah. Yeah. I think that's a great that's a great analogy and it's so true. And so it's just now it's an organ it's up to all the organizations to fully embrace it and move on. Yeah. Yeah. Yeah. And All right. So to wrap up you know I think while you and I both agree that then we all agree that AI is going to have a big societal impact, companies really struggle with where to get started, right? and and what what's some advice you can give them on how to think about this and where to get going? So, I'll give you advice for individuals and for companies. For individuals, my advice would be don't sit on the sidelines and own your own learning. Like every single individual, regardless of your job function, should be getting experience with AI. I think it's super important that that happens. And my advice to companies is going to be very similar, which is on the company front, there's only going to be two kind of two kinds of companies in the world. Ones that are very dextrous with the use of AI and others that are going to really struggle for relevance. Yeah.",
        "start": 1058.559,
        "duration": 2322.3210000000013
    },
    {
        "text": "to companies is going to be very similar, which is on the company front, there's only going to be two kind of two kinds of companies in the world. Ones that are very dextrous with the use of AI and others that are going to really struggle for relevance. Yeah. that we raise the bar and get everyone upskilled on AI on a continuous basis. But companies cannot say, \"I'm going to wait on the sidelines and I'll wait until later.\" And one of the things that's happening right now in a lot of enterprises, there's a lot of experimentation going on. There's a lot of prototypes. But what they aren't doing is when something works, they're not doubling down on that. Yeah. So to some degree, you have to double down on two, three, four things in a really big way. Like you can't just sprinkle it all across and have every effort be like one of the things that we've doubled down on massively is AI coding. Yeah. like there will not be an engineer at Cisco in the next 18 months if you don't use AI and you're employed at Cisco there is something that is wrong right because we need to make sure and by the way the it is it it should become a part of the way in which you work now that doesn't mean that I want to reduce my number of engineers we've got 25,000 engineers I'd like to get throughput capacity of 250,000 engineers right because there's no shortage of ideas we're not idea constrainted we're execution constraint if we can unlock the execution with AI coding that would be you know that is the currency of a tech of tech company is how much engineering capacity you have if I can 10x my engineering capacity I've changed the nature of my company anything else no I think that's I think that's a great way to end it yeah all right GP well I thank you for being here yeah no thank you for joining us wanted to get a status on where you were platform so on behalf of Chief D Patel from Cisco and Bob Liberty thanks for watching this joint zcast Analyst Angle. , give us a like and hit the subscribe button and we'll see you in our next video. [music]",
        "start": 1180.0,
        "duration": 2522.5010000000025
    }
]