[
    {
        "text": " Welcome to Zccast everyone. I'm Zas Caraval from ZK Research. I'm here at Beth Page Black, home of 2025 RDER Cup. It's day zero, if you will. I'm with Michael Cole, the CTO of the Ryder Cup Europe. Michael, I first met you a couple years ago at Marco Simony. I've been trying to track you down since then. So, I appreciate you doing that with me. I've been busy. Yeah. No, it's Well, you're always busy, right? So you know when you you gave us a presentation you talked about this being the first AI enabled Ryder Cup. Why don't we start there? Obviously AI is a big buzz word. What does that mean in the terms of the RDER Cup to have it AI enabled? I think the RDER cups historically have been complicated operationally with lots of manual input inputs and lots of manual kind of processes to to to get things done. Quite frankly, what we're seeing now is with the evolution of technology, we've been able to kind of take a step back and and and to implement AI enablement to help drive efficiency and and help drive additional insights that we arguably wouldn't be getting before. So the one example would be through AI operations and and using the technology really to to spot the symptoms. That could be anything from intrusion detection in in a cabinet through to a change of temperature and our network operating systems and identifying when that system or symptom comes about the technology is triggered and and coming up with the key insight and hopefully in even the evolution of that. So you know we have a number of examples of where AI is being deployed. Of course the smart city evolution is let's see. Yeah. And and so it's really all parts of operations now. AI I guess is playing a role. I know one of the things you talked about in this little press conference and thus is turning a green field not green field a green field right into a smart city. But it's in some ways it's more challenging than that. I wanted you to maybe get into a little bit of that where a smart city you would have I don't know 50 60,000 people. You kind of know where they are. But here because of the nature of the Ryder Cup, people move with the the players, right? And so you might have a lot of people on hall one at 9:00 in the morning, but there's going to be nobody there at 11:00, right? After all the groups are there. So talk about the challenge in front of manage an environment where you're the the the smart city citizens if you will are constantly moving. Yeah. In in in a more simplistic world where we were a single venue kind of sport you could deploy the technology and and it undertakes its job. For the",
        "start": 4.96,
        "duration": 372.6390000000002
    },
    {
        "text": "in front of manage an environment where you're the the the smart city citizens if you will are constantly moving. Yeah. In in in a more simplistic world where we were a single venue kind of sport you could deploy the technology and and it undertakes its job. For the environment. a golf course by its nature is anywhere from 250 to 300 acres. you could get almost 200 football pictures in this environment. So, we have to think about the deployment of technology in a different way. You know, one example is the the vision analytics. We've got over 80 cameras out there that are low located and deployed in what I will call more kind of tactical hotspots. So, running cameras in our merchandise. We've got 26 cameras in our merchandise for example, just in merch. Just in merch. We've got three on the ingress, we've got 20 inside, and we've got three on the exit. The ones on the ingress and the exit are doing people count. The ones inside are looking for densities of people. So, we're looking for, you know, the hotspots of where there are high density, high density of people, lower densities of people. And then we're using the intelligence to kind of work with us in terms of why is that important? Do we have too many people in merch? Do we not have enough volunteers? and and looking at the key insights, are there more attractive areas? Have we got the the layout of merch in the right place? Can we make changes mid tournament? The key difference, I think, from from previous RDER Cup to where we are now is on the one hand, we could say this is the first truly AI enabled Ryder Cup. On the other hand, I could also say it's the first time we've had real time analytics being able to to to action and respond proactively to the moment and and that is a a key difference from this Rder Cup to previous Ryder Cups. Yeah. Now, whenever you have this kind of environment with cameras and sensors and things like that, the network's going to play an important role. I know HPE is a key is a critical supplier of infrastructure. So can you talk a little bit about the relationship with HPE, how the role of the network's changed and how you're working with them in making sure that all the things you want to do, the network's going to enable you to do. Well, infrastructure is critical. It's probably almost the less sexy part of what we talk about when we talk about innovation and creativity, but it is essential for what we have to deliver. It's what I call building the stage. You know, the show follows through the innovation. If you don't get that stage correct then you are you know you are sitting on a likelihood of failure at some stage and that failure could come",
        "start": 190.959,
        "duration": 695.3590000000002
    },
    {
        "text": "essential for what we have to deliver. It's what I call building the stage. You know, the show follows through the innovation. If you don't get that stage correct then you are you know you are sitting on a likelihood of failure at some stage and that failure could come activity or or non-malicious but unintentional activity or just sheer volume of people. One of the points you mentioned earlier on is you know you may have five six 7,000 people following Rory around the course or following you know Bryson de Chambo around the course. and and you know that has an impact. You know it may saturate the cell network. It may slow down the the the onboarding and the internet access through the Wi-Fi. And we've got to be able to scale this infrastructure not only to accommodate changing environments but ensure that you know we are giving people a level of connectivity wherever they are on the course and we have to work with a range of technologies. It could be cellular, it could be satellite connectivity or it could be Wi-Fi private 5G you know all of those are in operation around this course. That's part of the complexity that we have that doesn't exist in a single venue sport environment. Yeah. Well, that's fascinating that all those have to work together. In fact, I think Marcus Simone in 2018 was the first time private 5G had been deployed using it a back haul as a back hole. But it plays a more important role here today, right? That you're using 5G for more than that. Yeah. Yeah. the there's still a degree of evolution I believe in the adoption of 5G and you know there are still choices to be made around you know public network slicing or or private 5G infrastructure. equally 5G itself isn't necessarily the ultimate answer in terms of its true capability is like it's you know the the range of 5G in terms of connectivity can be a little less but once you get that connectivity then you're going to be advantaged through faster up speeds and in in in you know faster downloads as well. so it's really about how we use these technologies in a complimentary way and put the right technologies in the right areas utilizing private 5G traditional Wi-Fi cellular working with the cellular providers doing mobile offload if that is necessary satellite connectivity where we can't get to areas of course because there isn't the power in Marcus Mooney we had solar powered access point and and why do we do that not because It was a great story. It's because those parts of the course we physically could get power to. So we had no choice. So you know we operate in this complex environment and and and the true solution is not single technology. It's how technology solutions complement one another and give you that blended approach. Now, from for the AI",
        "start": 354.8,
        "duration": 1038.7190000000005
    },
    {
        "text": "the course we physically could get power to. So we had no choice. So you know we operate in this complex environment and and and the true solution is not single technology. It's how technology solutions complement one another and give you that blended approach. Now, from for the AI some of the operational benefits, but as a fan of the game, if I'm a patron of the Ryder Cup, am I going to notice AI? Is there are there things here for me? yes, we've got a great feature. I think one of the big successes in Marcus Simone was the outcome IQ and this was really our version of probability analysis. You know what is the probability? What is a consequence of Tommy Fleetwood shot out from the third on day three in in in the four ball? you know where does that put him in terms of likelihood of winning his match team Europe's session and and what does it mean overall for the match? Now probability and and outcome I was hugely successful for the fans but also the broadcasters and and the media. So we've taken that further now for the RDER Cup this year. We've introduced AI enabled outcome IQ. So now we're not only given the probability analysis or the statistical analysis, we're putting shot context around that as well. what was the distance the drive from the T? What is the distance from from from location to the pin? What is the consequence of this shot if that likelihood of probability exists or doesn't exist? and that is all driven through into through AI intelligence. The speed of doing that is down to singledigit seconds. You know, virtually impossible to have any form of manual integration deriving the same insight and intelligence. So that is, you know, a good example of actually where AI is is benefiting the fan through greater contextualization of every shot that's being played. Yeah. Well, AI everywhere, I guess. And I'm getting the hook here. So, just one last question. As we look ahead to 2027 and we move the Ryder Cup back to Europe, what are some of the things that you're looking at today that you think might impact operation and fan experience in 2 years? Well, technology is is moving at a massive faster than I've ever seen. where and and it's you know one of our big challenges is is how we can kind of predict and forecast actually where technology is going to be even in as short of here it is 2 years but I know AI will have a key place to to to play. I think we will see a greater evolution of agentic AI. So we go from generative AI and and in automated integration to now where actually technology is not only spotting those symptoms and that insight but is now acting you know it's doing the the behavioral outcome on",
        "start": 528.959,
        "duration": 1372.559000000001
    },
    {
        "text": "play. I think we will see a greater evolution of agentic AI. So we go from generative AI and and in automated integration to now where actually technology is not only spotting those symptoms and that insight but is now acting you know it's doing the the behavioral outcome on because it means through technology I can extend my team. It may not be actual people it's technology doing the work for me. So I think aentic technology will have a key role to play in two years time but also personalization giving the fan the ability to to to follow the player on the whole at the session on the day that they want. so I think personalization taking that content and driving it down to individuals requirements through the infrastructure again is going to play a big part in the in the innovation story. All right. And one final one. Europe going to retain the title? Of course. Yeah. Goes without saying. All right. So I guess we'll see that on Sunday. So so for this Rder Cup AI everywhere, both from a fan perspective, operational I know a lot of the players rely on the data that comes out of AI today. So it's really changed the game. Yes, it has. The you know, both captains are are put in a greater emphasis on on analytics and performance. then you know this afternoon we will see the pair of st the the parents come out and I know the captains will be utilizing technology as well as their own sensors. Yeah. to help them formulate what is the right teams throughout the wider cup. Yeah. Well I that's a great way to end because no matter how much AI we have we still need people to use some common sense to make sure we're doing the right thing. Indeed. So on behalf of Michael P, CTO of RDER Cup Europe and the DP World Tour, I'm Zas Caraval from ZK Richards and thanks for watching. give us a like, hit that subscribe and I'll see you next on my next episode of Zcast. So thank you very much, Michael.",
        "start": 696.72,
        "duration": 1574.0780000000007
    }
]