[
    {
        "text": " [Music] Welcome to Zcast everyone. I'm Zas Caraval from ZK Research and we're in San Diego at Cisco Partner Summit 2025 which is Cisco's annual partner conference. I'm with Liz and Tony runs the CX group at Cisco. Liz, your first time on delighted to have you. And before we get into some of the content and some of the things I want to talk about just a quick intro on yourself and what the CX organization at Cisco does. Yeah, thanks for inviting me. Yeah, I'm happy to be here. so I've been at Cisco for 25 plus years. the majority of it in in in the product organization both in in engineering running engineering teams as well as running some of our key businesses as well. And about a year and a half ago I moved to customer experience. it is think about it as including everything from professional services where we help a customer with the plan design implementation of like say it's an SDWAN or an ACI implementation and adoption. So customer success so helping them adopt our software. It is renewals across all of Cisco software and services and all of customer support. So think about it's like you know from product all the way to CX. It's like the full life cycle of a customer. Yeah. And I just want to say personally as a former VAR and Cisco customer, I think one of the reasons I use Cisco as much as I did was because the services and support I got were really best in class and I think sometimes it's an underappreciated part of Cisco. Obviously a strong product company. Now you have a very strong product background. In fact, I've known you for a long time and I've known you primarily as a product person, which makes you running the CX organization interesting. And so, how does your product background really fit into what you're trying to do with customer experience? I would say the primary thing is bringing product and services together and focusing on the customer outcome because it's likely in the past we've run it as separate siloed organizations, right? But customers look for us to deliver outcomes through the entire life cycle. Having that product background allows me to look at it as the experience goes all the way from when we start designing the product to when we sell it to actually when we help them adopt it and support it through the entire life cycle. And having those relationships on the product side helps me also guide my team in terms of giving for example feedback back to the product teams. adoption is a great place to be able to do that. Customer support is a great place. So, we're closing the loop and delivering the customer outcomes better than we've ever done before. Yeah, that would make sense. It's in fact, you would almost think that's a necessary part of running an",
        "start": 0.04,
        "duration": 338.68000000000006
    },
    {
        "text": "a great place to be able to do that. Customer support is a great place. So, we're closing the loop and delivering the customer outcomes better than we've ever done before. Yeah, that would make sense. It's in fact, you would almost think that's a necessary part of running an a survey earlier this year and I there was interesting data points in there and one of them was that over 90% of executives say the network is more important to business operations than ever before. That shouldn't surprise you. Now almost an equal number though said it's more complex and when I think about more important more complex those seem like two opposing forces and so first are you seeing the same thing when you talk to customers and second how's your organization help customers navigate through that duality of complexity and importance you're right it is a duality right because when you when you think about it the the networking environment or the environ infrastructure environment our customers have it's critical to be able to deliver quality digital experiences then you have demand for more and more AI workflows and applications and on top of that at the same time managing this environment is getting complex and so our focus really is on with like you said the network being the backbone of a customer's business operations how do we take our customers from the age-old way of managing networks and I started in network management at Cisco. So the age old way of managing managing their environments whether it's networking, security, observability to modernize it to where you're you're automating and you're not just building automation in one on top of the other, but you're also helping our customers change the their workflows. You know, today even 50% of a network administrator's time is spent on things that are manual. Yeah. So our focus is really around how do we move our customers for towards more automation while keeping their environments resilient and secure simplify it because the complexity is also driving more of the manual you know kind of task out there and so we've put a lot of focus around simplifying the environments with more automation as well as looking at how we can help them with manage their environments more proactively. ly and then when it is reactive we resolve issues in almost near real time. You know it seems like every event I go to AI is a big part of it. this one is no different and every executive I talk to AI is on the near-term road map. And so how is AI adding to this duality of complexity and importance? So every everyone has is talking now about every customer I talk to wants to move from experimentation to actually deploying AI applications in production for example but their AI their infrastructure is not ready for that you have infrastructure that was built for a prior generation and they",
        "start": 170.4,
        "duration": 679.3200000000002
    },
    {
        "text": "importance? So every everyone has is talking now about every customer I talk to wants to move from experimentation to actually deploying AI applications in production for example but their AI their infrastructure is not ready for that you have infrastructure that was built for a prior generation and they security is not ready for that because you've just you know AI while it helps us secure better and secure AI as well, it creates new attack surfaces for example. So when you look at the amount of data between our devices and the edge, we're seeing data flows beyond what we've ever seen before. So the complexity is getting even more intense than where it was before. But our customers are the majority of our customers infrastructure is not ready for those AI work workflows. The second thing is we still have talent shortages. Yeah. And you have talent that's managing between a legacy environment and kind of a new more modern environment because we don't find any environments where it's like just brand new. It's a combination. It's a hybrid for example. So when you look at you know at the speed at which our customers want these AI applications and workflows deployed their operational teams are not able to keep up with it because you have a combination of a hybrid environment and the way you're managing the networks because you're still dealing with the problems that we had like for 25 plus years around you know config issues for example a quarter of our service requests that we yet still are config issues. So until you can solve more of these and automate more of these, the speed and agility with what our customers want to do in terms of their innovations is dependent on moving towards, you know, more automation, more simplicity of it and reooking at the workflows on their teams from taking away some of the cognitive load and burden from their teams and taking some of those repetitive tasks and making it a lot more autonomous than before. And that is what we're focused on in CX is how do we help our customers with addressing issues that they've been dealing with for years, reduce the amount of manual work that they have, cut down their costs, reduce the number of surprises that they have, and help them in their security and compliance and lower that risk as well. Yeah, it's interesting you brought the talent piece of it because every you hear all this rhetoric about AI taking jobs, but yet whenever I talk to a CIO or even a business leader, they talk about how they can't fill jobs fast enough, particularly in security and networking. And so if you can use AI to close that gap, then that's a win for everybody. Because frankly a lot of the things you talked about the manual documentation and the the all those manual tasks I",
        "start": 344.08,
        "duration": 995.7190000000005
    },
    {
        "text": "how they can't fill jobs fast enough, particularly in security and networking. And so if you can use AI to close that gap, then that's a win for everybody. Because frankly a lot of the things you talked about the manual documentation and the the all those manual tasks I studied and became a CCA to do a lot of that stuff. Exactly. Yeah. Yeah. And so that's it's good it's good you're working on that. Now a big initiative for Cisco over the past year or so has been the platformization of the Cisco technology stack. And so I know the chief product officer G2 Patel has talked a lot about how Cisco historically was a good product company but now it's really shifting to that platform. And so how are you thinking about connecting the dots between what customer experience does and the platform? I think when you think about the, you know, when you think about platforming, if I can even call it that, it really is simplifying for our customers, giving them insights into their environment, creating agility for them so that they can speed up both, you know, consuming technology and driving innovation. We're mirroring that on the on the customer experience side. So, we launched Cisco IQ as you know, and on Cisco IQ, it's a single place. It's a single very intuitive unified interface for our customers for both their customer support and their professional services needs as well. Our focus was around how do we make our customers environment how do we simplify it? How do we keep it highly resilient? How we can drive time to value for all the technology investments that they've made with us. And so it's one place where they can go in and for example have a very dynamic view of what is in my environment. What are the assets in my environment? What are the security risk? Maybe the security risk are related to like the last day of support. We have a number of customers who have a lot of legacy stuff that's sitting in their environment. It's unbelievable how much old stuff is out there. So exactly. So but today a lot of that is done manually. How do we simplify it provide the to them in within one interface and gives them the visibility real time dynamic visibility not a static view of it. So their infrastructure assessments how do we do things like security compliance and security assessment as well. How do they how do they consume like massive data sheets of like hardening assessments? you know a networking admin will get in like a 7020page document. We've reduced that down as we brought context of the customer's environment in into a summary of what is really relevant in that hardening document for your environment. So we've carried that you know platforming through towards to CX as well in terms of simplifying focus on keeping the environment resilient",
        "start": 504.16,
        "duration": 1310.2789999999995
    },
    {
        "text": "reduced that down as we brought context of the customer's environment in into a summary of what is really relevant in that hardening document for your environment. So we've carried that you know platforming through towards to CX as well in terms of simplifying focus on keeping the environment resilient doing is really a focus on proactiveness helping customers optimize the environment so address issues before it even becomes an issue. Yeah. And then while because of how we're using AI both with our to help our engineers as well as bringing context to the customer's environment, we can personalize it for them. So we're able to solve issues four to eight to 10 times faster when we cannot handle it proactively. So I think we've carried that theme through. Yeah. And I'm glad you're focusing on the proactivity. You know, it's funny as a former IT pro, whenever I read in the media that it needs to be more proactive. It needs to be proactive, I took a little bit of offense to that because it's not like it didn't want to be proactive. We just didn't really have the data nor the tools to do that. Exactly. And and so now that you're giving them those tools, I I think that'll be really greatly embraced. Now, on I want to go back to the topic of AI. So, a lot of customers I talked to are are looking at moving from pilot to production. Finally, there's been a we've gone through this long period of kicking the tires. As that happens and AI becomes more infused in business operations for your customer, do you see their job new challenges coming up or do you think it magnifies some of the existing ones or a little bit of both? A little bit of both is what I would say. And similar to you, you know, I I get the privilege of talking to customers pretty often and when they were mainly looking at lowrisk use cases like I want to do summarizations for example. Yeah. So, it was easier to do. Now, as they're looking at, okay, how do I move beyond pilots to production, a few things that that I'm seeing, which may sound kind of like pretty table stakes and and kind of baseline. The top one I see is finding the right use cases. like AI is here as a tool to solve for something and it's it's more around people go out and see a demo of like okay you can have an AI assistant that handles your calendar and all of that but when they come in and look at their own environments it's the first thing is more around let's find the use cases and let's actually have very key very well- definfined success metrics so when you're making the investment and you're engaging your teams to be able to use it. The why becomes really clear and not",
        "start": 663.279,
        "duration": 1613.717999999999
    },
    {
        "text": "their own environments it's the first thing is more around let's find the use cases and let's actually have very key very well- definfined success metrics so when you're making the investment and you're engaging your teams to be able to use it. The why becomes really clear and not the number of customers we talk to about like very specific use cases. The second one is around the infrastructure piece and then given where you know what we as a company provide in terms of product and services obviously we go in helping to help our customers with let's modernize your infrastructure bring it into the AI age because you know your networking needs to be upgraded security architecture needs to be upgraded as well and then the third one that I see very often is we all talked about the fact that We have multiple years of of data, right? That's an asset. That's a competitive advantage. But data is becoming like one of the biggest long poles in the tent because many customers that I talk to who see data as a competitive advantage also have this data sitting in multiple different systems. It's fragmented. There's data that's missing. Yeah. So the amount of time that we have to spend on that data preparation I think it's a surprise for a lot of people around you know I've got to spend all this all this time so that becomes a surprise. The other one is around governance and kind of the responsible AI because there's a trust factor to it just like we take that seriously before people even started talking about responsible AI we used to talk about it since 2012 before it became kind of fashionable to talk about it but that's important in terms of you know our customer trust is so super important how we collect the data how we handle it who has access to that data how we use that data and So customers are seeing that they need to have their own very defined governance and policies around use of the data to retain the trust that their end customers have with them as well. So these are all of the things that I think everybody knew about it but certain things that seem obvious need to be worked on a little bit. Yeah, it's interesting too the when you brought up the the the right metrics and the things to measure for AI success, it reminded me a lot of that MIT report that's kind of gone viral where I I I actually thought it was the way they positioned that was a little irresponsible frankly because I do think customer companies are having success with it. I think in a lot of cases those projects are failing because they just don't know what to measure and and that's the bigger problem with it. It reminds me of the early days in cloud where people were just lifting shift",
        "start": 817.36,
        "duration": 1910.4389999999994
    },
    {
        "text": "think customer companies are having success with it. I think in a lot of cases those projects are failing because they just don't know what to measure and and that's the bigger problem with it. It reminds me of the early days in cloud where people were just lifting shift I cautioned customers not to do AI just to do AI. Exactly. Yeah. Now on the topic of AI I think at last year's partner summit you talked a lot about wanting to infuse AI into Cisco CX and so can you talk about the progress to date on that? Yeah. So, CX even prior to me had been using machine learning and what I would say you know kind of traditional AI for quite some time but we were doing it in silos like the customer support team did their very own thing for example the adoption team did their own thing what we've done is taken the expertise like 40 plus years of expertise that we have and fused it with like Gen AI and machine learning and you know traditional AI and automation for example. So we're able to look at a customer journey and how we deliver the outcomes end to end. So for example, if I look at you know today working with the product teams and our sales teams, how we even help a customer design and implement their environments is based on hey the product was built for like three architectural blueprints in terms of how you roll out a unified branch. So today along with unified branch you now have services as code to where you're actually pre-esting some of the configurations before you even roll it out and you're bringing in using AI the context of that customer environment so that those configs are designed with that customer intent in mind and so what you're doing is you're reducing the the risk of misconfigurations later on not eliminating it completely but reducing it and giving more confidence as well Before it was not possible for a human to actually do this with this amount of data and personalize it, bring in all the context and account history, their support history and bring in best practices on what we've done with other customers. So we're able to customize it and personalize it for a customer even more so. And we're doing this at scale because for us it's not about tens or hundreds of customers. You have to do this for thousands and tens of thousands of customers. So just one example of it on the support side, we had been using AI for a long time, but now as of this quarter, 91% of our 1.5 million support cases are touched by AI and automation. Yeah, that's amazing. We are solving a much more consistently higher quality and we're solving more complex cases in one day. I mean, CX is like the sweet spot for AI and",
        "start": 968.56,
        "duration": 2227.1600000000003
    },
    {
        "text": "now as of this quarter, 91% of our 1.5 million support cases are touched by AI and automation. Yeah, that's amazing. We are solving a much more consistently higher quality and we're solving more complex cases in one day. I mean, CX is like the sweet spot for AI and out there and look for use cases and and metrics. Our long pole in the tent right now is execution. Yeah. No, it's obviously very data intensive group and just when you think of the years of data that you just had from TAC, from all the Yeah. all the support calls that you've had. It's unbelievable how much data that you have. now at this year's Cisco Live, you you rolled at IQ and you mentioned that. Can you can you talk about what IQ is? Take a step back and then how it's different from what customers might be used to. Yeah. So what customers are used to or were used to and what I heard coming into CX was you give us a lot of insight, a lot of data and it comes from multiple different tools and interfaces. We need you to simplify it for us. So our first goal was let's just simplify single unified interface for our customers where they have visibility for example into everything in their environment. So customers are looking at it and going hey in terms of proactive support like it's great that you can help me in re in almost real time when I hit an issue but to keep my environment highly resilient and secure I need to to I need guidance on how do I optimize it. So things like our asset intelligence is a dynamic view for them. They can create their own dashboards that say, you know, if I'm if I squeeze my assets a little longer, what does the degradation look like in my environment? We highlight for them, you know, we puts out there, we put security advisories out there. It customizes for them. It personalizes for them. Out of those hundred advisories that you have, what are the top two that are relevant in your environment? So the personalization of this helps reduce the amount of time it's needed to really manage their environments and helps their teams, you know, not have to go through like a whole bunch of data. We're taking the data and creating insights and assessments for them, which means we're freeing up some of their time and reducing the friction in how they're doing their job. So our focus was around more visibility for customers, more insights for them, drive more proactive support and when we do have to address issues in real time, bring in that context and history of that customer so that the support we're providing is personalized for them. We we are sending it to the right expert. You know, today close to 80% of the",
        "start": 1129.36,
        "duration": 2530.999000000001
    },
    {
        "text": "more proactive support and when we do have to address issues in real time, bring in that context and history of that customer so that the support we're providing is personalized for them. We we are sending it to the right expert. You know, today close to 80% of the expert with what we're calling intelligent call routing. So you don't have handoffs. Can you imagine how frustrating that? So I could tell you like 50 stories in terms of how exciting it is that we can deliver these experiences for our customers that just it simplifies their life. Yeah. No, as a again as a former customer, I I lived through those handoffs and so and a lot of it you could navigate through if you knew the right people and things like that, but that was really more the exception than the norm. And so it's good you're doing that. Now I understand the c the benefits of the customer. We are at partner summit. What are the benefits to the partners? So, we waited to launch Cisco IQ at this partner summit because the message to our partners is it's not just about the benefit to Cisco. We have a majority of what of Cisco's business goes through partners. We want partners to be able to take these insights, take these assessments, integrate it into a customer workflow. So all of a sudden their engagement with customers is not at the service request processor level. It's at a much more higher strategic level as well. So you're talking about higher profits, higher margins for example, much more of a strategic engagement. And so this week we are showing to our partners how we're enabling them with the training on Cisco IQ. our partner delivered Cisco IQ will come through in a couple of three quarters here as well. But this is it was critical for our partners to to know and understand it and be able to leverage it via APIs and either in as part of their own practice or you know helping our customers as well. And so I would say is we showed a preview of it to a few customers and you the the feedback has been really positive. I would say is it's been a long time since they equated CX and innovation and that's what we heard from a few of our partners. Yeah. No, that's fair. And I talked to a lot of partners. I know they're they're all thinking about how they evolve their own businesses and I think if this can be used to help them fasttrack that evolution that that's nothing but positive for them because it's it's every one of their partners' business models is changing now. Yeah. Now when you you said it better than I did in terms of I'm going to use those lines. Yeah. Now Liz, when you look ahead right there's a lot of innovation in the area",
        "start": 1283.919,
        "duration": 2836.4389999999994
    },
    {
        "text": "them because it's it's every one of their partners' business models is changing now. Yeah. Now when you you said it better than I did in terms of I'm going to use those lines. Yeah. Now Liz, when you look ahead right there's a lot of innovation in the area like that and so what's next for your group and what are some of the things you're thinking about? Yeah, we've just I would say started on the on what's really possible and the starting point itself is so exciting. So if I think about like internally we've looked at every workflow across all of our teams because the ability to really you know kind of unleash that human intelligence that we have the technology is there to make it possible. So we're looking at every one of these very repeatable workflows and we're going how do we reduce the friction? How do we take the cognitive load of our of our teams so they can think of you know h spend more time with customers think about you know how do I solve problems for my customers I think the future that I see for CX is where proactive becomes table stakes like right now proactive is like hey that's great you we can do it in pockets no it's like proactive becomes table stakes so my expectation is that we'll see fewer a lot fewer service requests and our teams are more focus focused on where every customer the the reason that they will feel like their only customer because our teams are spending more time using these agentic systems which are learning they're predicting they're acting on it and they're helping our teams work with the customers to optimize the environments get more proactive so that we'll have less and less of the actual service request processing which by the way has already gone down last year we were at 1.67 67 million. This year we're at 1.5. I expect that to go down significantly. Natural language and what we're using in terms of WebEx is getting so much better that the reason I bring that up is I expect my low severity cases in the future to be handled primarily by an agent. I would expect that too. Yeah. And with the voice agents from like WebEx, you know, it can detect emotions to where even if it's a low severity case and our customers really upset, it can deflect it to a human, for example. So I see, you know, like a an evolution of where some of the things that we're talking about becomes table stakes for our customers. And I think there's, you know, some of the things in the future that's coming up like quantum readiness assessments. I mean, this is one of the things that we're focusing on now as a as a service to to build up on. How do we help our customers move from cryptographic",
        "start": 1438.64,
        "duration": 3132.678000000001
    },
    {
        "text": "think there's, you know, some of the things in the future that's coming up like quantum readiness assessments. I mean, this is one of the things that we're focusing on now as a as a service to to build up on. How do we help our customers move from cryptographic crypto cryptography? So, what does that assessment look like? Because the networks in the future are going to be hybrid. You're going to have traditional as well as quantum networks. And so there's so much that we is out there for us to do and reducing the cognitive load on my teams allows us to think about all these new services and capabilities that we can deliver it to our customers. Yeah. All right. Well, so we covered AI quantum and using Cisco IQ to unleash human potential. anything else you want to add? Yeah, I'm I'm excited to be here because I do think that we are just starting to show our partners the ability to engage with our customers on a much higher I mean we use the word strategic often but I do believe we'll be having the conversations around how do we help them drive agility and innovation faster and the technology and capability allows us to to elevate and have that conversation us and our partners together. Yeah. Well, at the Cisco AI Summit, I remember one of the speakers saying in AI there are no fast followers, right? And so, , the work you're doing, I think, help the partners and customers evolve their environments. And so, , keep it up, I guess. Thank you. So, on behalf of Liz San Antonio, I'm CS Caraval from ZK Research and thanks for watching. , give us a like and also hit that subscribe button and I'll see you next time on my next episode of ZCast. Thanks, Liz. [Music]",
        "start": 1589.679,
        "duration": 3321.716000000002
    }
]