[
    {
        "text": " Welcome to Zcast everyone. I'm CS Caraval from ZK Research and I'm today I'm going to be talking with Fletcher Kester GTT's chief product technology officer. GTT is a leading network and security as a service company and we're going to be talking about the impact of AI for enterprises and the steps they need to take to succeed. we'll also take a look at how GTT is using AI to transform its own operations and customer experience. and so in a lot if you want to think about it, we're going to look at GTT for AI and AI for GTT. That's a good way to think about it. so before we jump in though, Fletcher, just talk a little bit about your background and where GTT is today. Yeah, great intro. I love the AI for GT and GT for AI. intro there is yeah a little bit of background what I'm responsible for at GTT is really within that product and technology umbrella is all of our go to market product offerings our product engineering and software development and engineering as well as our CIO and SISO functions and an enterprise program office and so you know one of the things that I've thought for quite some time I've been in this industry my whole career one of the things that I've always thought thought about is that the you know our industry and the companies in them have for too long kept it software engineering and product in separate silos when in the reality what we are building and selling to our customers are the same things that we build and consume for ourselves and those worlds have merged together and sometimes organizational constructs haven't kept up with that and so you know for me it's been a tremendous amount of fun I've been at GTT for about two years and having those together into one organization has really helped us propel some of our ideas a lot faster than I think we otherwise would have and so the first half your question second half of what are we doing with AI And we started this journey for us about you know probably a year and a half ago with a visit out to Nvidia where everyone goes to the mountaintop to get information [laughter] right and you know started having conversations about what they were seeing in the service provider and telco space and really through the a lot of input from them where we decide how we decided to do this is really kind of that go slow to go fast model and the or the crawl walk run however you want to think about that and we really started with a three a very purposeful three chart approach with AI I one is was and I'll explain them detail to prepare ourselves to test and learn and then to grow and scale and what I simply mean",
        "start": 5.44,
        "duration": 283.601
    },
    {
        "text": "run however you want to think about that and we really started with a three a very purposeful three chart approach with AI I one is was and I'll explain them detail to prepare ourselves to test and learn and then to grow and scale and what I simply mean of time in the front in the early days preparing our data for AI right it's kind of that boring pick and shovel you know roll up the sleeves get your hands in the dirt type of work but if you haven't prepared your data be to be consumed by AI platforms you're really not going to get the benefit from it and of course I'm not talking you Chad GBT or Gemini or other public facing models right because we obviously that's you know public data I'm talking about our own private GTT data and how we need to organize and structure it then we worked with a partner insight and deployed you know three nodes of an AI factory on Nvidia Dell infrastructure in the US in the UK and in Europe you know and have a distributed footprint and platform of an AI factory and then within that factory we built you know a framework network of architecture of multiple LLMs, multiple orchestrators, you know, multiple knowledge bases and MCP servers and and overall orchestrators to then not limit us in terms of what we could use in the overall architecture, but to give us flexibility and scope scale for what we want to do internally and how we thought about securing that. And so that's where we started. And the second phase of test and learn was then to start developing our own agentic workflows, right? And really the Gentic workflows in two categories. One for internal use and driving you know efficiency and benefits inside the company and then two for customer workflows. And so where we are right now we are deployed our first set of you know probably at this point 20 to 25 operators and agents that are you know taking human work you know workflows that had human movement of data left to right and require specified human knowledge to transact and have are implementing those in real time. Right now we're turning our attention now to embedding aentic workflows into the customer experience and our portal and envision DX. And then the third that we're really looking towards now is how do we build new products and revenue generating offers that we take to market and then third step is how do we grow that so let's take a step back and just talk about where enter companies are so we were both at you know Nvidia GTC and we saw got to experience a lot of the hype and obviously AI I think is going to change every aspect of our lives I don't think there's any question about that but that's the future state",
        "start": 146.48,
        "duration": 565.1210000000001
    },
    {
        "text": "enter companies are so we were both at you know Nvidia GTC and we saw got to experience a lot of the hype and obviously AI I think is going to change every aspect of our lives I don't think there's any question about that but that's the future state see right now as the most impactful and immediate relevant trends that you're seeing in enterprise AI and what kind of impact does that have? Yeah, so the the two trends and I and I'll talk first in terms of what our customers are talking to us most about right now, what's top of mind for them is, you know, really AI security and data sovereignty. And those two things aren't aren't aren't mutually exclusive. and then the third is how do they get you know value out of the investments they've already made right and so you know and that the first one in terms of you know really or one of them around data sovereignty was a driver for us by why we deploy both in the UK and Europe because of those requirements that are coming from our customers and they're they are trying to figure out how do they deal with you know especially for our European headquart customers how do they deal with the you know the geopolitical laws that are coming down and sovereignty laws that are coming down especially in France and Germany that are that are very, you know, that are very specific, right? And so, how do they deal with those? And, you know, what we're working with our customers on is how do we help support that need for them? And that that doesn't even get into the use case or the application or what are they doing, but how are they actually they're deploying? And then, you know, really around how do they protect, right? How do they protect that data? And they're, you know, you know, really the just like people, you know, have done some said differently, people are on still on the journey to zero trust, right? Just like people are still on the journey to how do I prepare my data to be consumed and used and those two things we see them coming together in a very important way in terms of again how do you organize and structure and secure your data right we can talk about that you know long if there's any follow-up questions but then secondarily the trends are how do you then ensure that when you build agents in agentive workflows in an enterprise that those agents can only have access to and do the things you're asking it to do and that's a very that's a pretty complicated problem statement and shows Those are the trends and those are the again those foundational things of getting to the what everyone wants to be able to do with agentic workflows inside of an enterprise is to take all those",
        "start": 289.6,
        "duration": 806.7200000000001
    },
    {
        "text": "to do and that's a very that's a pretty complicated problem statement and shows Those are the trends and those are the again those foundational things of getting to the what everyone wants to be able to do with agentic workflows inside of an enterprise is to take all those human based at the end of the day moving information and data left to right right I picked yeah I have a task to do it's I have to do it over here I got to do something with that information and I got to pass up to somebody else to transact it you know within a function or cross functionally but then you know how do I do that in a way that is you know protected and secured And that's, you know, really what we're seeing in the in the trends of where people are getting stuck, right? We've all seen reports of why things are are not working. And that's that's kind of that point where, you know, getting through that phase is really important in terms of making these things pay off. Yeah, it's a complicated world because it's a good point on the sovereign and cloud and data privacy and security, right? Everyone's focused on that. But then all you need is in fact I was talking with the company about this yesterday that was talking about how they're okay with their developers using you know some of these coding assistants to help optimize like code that's five six years old. But certainly if they're writing something new that's, you know, directly related to their intellectual property, you can't be dropping that code, you know, into into and so and so you're leaving it up to the developer to understand what I can do, what I can't do, you know, and I'm sure out there out there somewhere there's some marketing people that are taking like press releases and, you know, for financial results and turning them into earning scripts and things like that. And so while I think Agentic holds a lot of promise, right, there's a lot of things that are procedural as well as on the security and data side. And so when you talk to companies about Agentic, what are some of the things you think they need to do to make sure they're successful with it without putting their company at risk? Yeah, it's really a great question. It's really in a foundational question. Maybe maybe not answerable, right? Yeah, [clears throat] I think there's the we are still learning as we go. Yeah. Right. To part of that, but you know what you're bringing up the difference between generative and agentic is that's a really big difference between hey, yes, you can go, you know, put together a proposal, you know, in five minutes rather than a week or what whatever it may be, right? Or to go gather information that you need to make an",
        "start": 413.919,
        "duration": 1068.9589999999996
    },
    {
        "text": "difference between generative and agentic is that's a really big difference between hey, yes, you can go, you know, put together a proposal, you know, in five minutes rather than a week or what whatever it may be, right? Or to go gather information that you need to make an more about AB and see that's all you'll find good. But exactly like you said, when it starts to get into things that touch your either your intellectual property, you know, data that is private customer, you know, CPNI issues around customer, you know, internal, you know, you know, trade secrets, whatever it may be, or specifications about your product that you don't want out, you know, intellectual property, it really is is is a very different thing that we're talking about. And we've you know again I've always taken the approach of let me say if we've taken the approach over the course of the last few years of getting to that point of zero trust and how we are building the agentic process is we are treating agents just like an employee where we're loading them into active directory where we are giving them you know role based access and we are defining what data they can actually are allowed to get to. And one of the kind of you know different ways we're thinking about our data is we've always oftentimes thought about things in terms of you know databases or data links you know whatever it may be. We're actually thinking about the fact that you know you know you know knowledge bases are new are the new databases. What that means is that we're taking the data from across our our universe of data and organizing them into constructs around specific topics and then securing those knowledge bases so that again that that if somebody gets into it they can't move laterally left to right inside of the you know inside of our network but they can only use that data where you know for the reasons and purposes that the agent was built for. I think that's really important and all that to bring it back to the you know get to the answer to your question or or a piece of the answer to your question is that you know it really is a matter of not of when you start when enterprises start to think about how they're going to build the agent workflows it really has to get down to that fundamental level of how am I protecting my data how can I ensure that when an agent accesses it there is no data leakage or data loss once that agent is into the data to perform its function it can't get to other places that it's not allowed to get to, right? And that's a it's a really complex problem and it's a lot of work required to get there. But, , we've taken a pretty again the the go",
        "start": 547.279,
        "duration": 1325.6789999999996
    },
    {
        "text": "is into the data to perform its function it can't get to other places that it's not allowed to get to, right? And that's a it's a really complex problem and it's a lot of work required to get there. But, , we've taken a pretty again the the go what does a security architecture look like relative to AI and really thought that through. And it's also part of why, you know, I decided to give the responsibility for the AI the AI program that we're in to our CIO SISO. We've combined those two functions into one person and they're also leading the AI program because it has to be we have to do all this from a from a security point first and then the functionality and then the use cases. Yeah. The it's going to be interesting to see how this plays itself out too because with Aentic, a lot of these agents are going to talk to agents from other vendors, right? So if you think about a like just a customer service inquiry, you're going to have your contact center vendor, you're going to have your CRM system, you're going to have your workflow management system, right? And so you may be able to protect your own data, but then you got to worry about the downstream effect of these other agents talking to each other. So, but we, you know, we figured that out for the most part with supply chain security and things like that. I'm guessing we'll go through something similar as well. Yeah, I think the questions and we've had been having some conversations with some other companies around the like the point you're bringing up is how do we need to evolve our thinking about you know securing that supply chain or securing the actions that are being taken you know within the technology and the you know as we all know the you know the difference with one of the differences of the many with AI is that it's not just processing information it's making decisions about on that information especially in the agentic space and so when those decisions are happening in you know in runtime. How are we securing that? Right. And the very thing that you said is what are we allowing when we connect a an internal agent to an external agent or even to like for us when we connect our customerf facing agent into the service now agent. How are we ensuring either internally or externally facing that that agent can can only do the things that it's been programmed to do and beyond that not and how are we securing the intent if you will versus just simp you know the physical or the logical infrastructure and that's a it's a new problem statement but it's getting a lot more attention we're starting to have those conversations and I recommend to anyone who is you know in the process of",
        "start": 676.64,
        "duration": 1580.8789999999992
    },
    {
        "text": "the intent if you will versus just simp you know the physical or the logical infrastructure and that's a it's a new problem statement but it's getting a lot more attention we're starting to have those conversations and I recommend to anyone who is you know in the process of to be have to be thinking about that and having those conversations too. Yeah. Now let's let's pivot a little bit and talk about GTC's GTT specific AI strategy. You had an announcement recently a partnership with Nvidia, Dell and Insight to develop a dedicated AI factory and to me you know that sounds almost gamechanging for your customer base. So can you talk about that and the value it brings your customers? Yeah, we we believe it will be as well. And so again really was a you know the deployment of a you know three node three node AI factory if you will because you know even if one even if there's an issue with one we still need to be able to move between the others. It also helps us solve some of that data sovereignty concerns that our customers customer customers may have. And you with the footprint we're deploying, we could do it in more locations if we as we need to or or we choose to. And so the you the couple things I'll say about it, the impact that we believe it will have on our customer base. You know, you know, one is, you know, set aside the the internal internal things we're working on use cases because that's about making us more efficient. you but what this what this factory is allowing us to do and the architecture we've deployed on it is you know really to embed an agentic experience into the you know you know what faces our customers and you know for us that's our envision DX platform and we're we will be launching at the end of the year you know thanks to the iFactory you know what we call EVO which is the envision virtual operator right it'll be that interface when customer logs in they'll be they'll speak to EVO and all of a sudden things like hey can you show me my inventory of both physical and logical services throughout my network, right? And that that will be able to then go and find and grab that information, you know, and you can think of all the other questions that might come that somebody would want to know. Can you tell me when certificates about to expire? Can you tell me if this, you know, there's a on the device that I've got deployed, if it's when will be, you know, end of service, end of support, all that information that we know about what we've deployed for our customers, we can expose and make available to them, you know, via that virtual operator. And then you know and in",
        "start": 806.32,
        "duration": 1823.3589999999988
    },
    {
        "text": "that I've got deployed, if it's when will be, you know, end of service, end of support, all that information that we know about what we've deployed for our customers, we can expose and make available to them, you know, via that virtual operator. And then you know and in the quoting and ordering processes that we are now building with AI. And so I'll use a really specific example about what we're already doing with that. and then there's other things we're planning on doing as well down the road. But you know, one of the you know, interesting challenges for our industry is and for us as a as GT, we're we're a global access aggregator is one of the capabilities that we have. So we do business with you know literally thousands but primarily a couple hundred other providers around the world and the process of getting an accurate and timely quote across that that base can sometimes be challenging for our customers and so we've deployed you know a quoting capability inside of our envision platform that leverages the factory meaning that you know customer can drag drag and drop a you know a list of locations whatever form it doesn't matter because on the once they've given that to us There are LLMs who are good at parsing information out of whatever form it comes into, normalizing them, geo, you know, geocoding them and then once that happens in real time, we can start quoting against all the potential various vendors who are out there in the universe who supply services to that location and within a process that used to take, you know, hours, days, weeks can now be done in seconds and minutes. That process is we're leveraging that capability to be able to process large amounts of information and, you know, feed back the information we already have in a very different way. And then that then leads to the obvious quoting and ordering and provisioning and assuring services for our customers is one. And so it's really you know again a game changer in terms of the speed and accuracy at which we can provide solutions and services to our customer. the really exciting part and I'll speak you know if I had a forward looking this is a forward-looking statement therefore blah blah blah I'd put it here but the the you know of course there's the cost you know cost reduction benefits of AI but really how do you do it to generate new revenue streams too and new products and shouldn't we be able to use these capabilities to do new things for our customers and two in particular that we are you working on and doing kind of that you know test and learn you know and get feedback from our customers is you know is one is more of an advanced threat intelligence capability [clears throat] to where you know because of what we're",
        "start": 928.639,
        "duration": 2086.6379999999995
    },
    {
        "text": "two in particular that we are you working on and doing kind of that you know test and learn you know and get feedback from our customers is you know is one is more of an advanced threat intelligence capability [clears throat] to where you know because of what we're platform and some of the tooling that comes along with it as they'll say at a high level the ability to ingest our customer network information or not information but data and within a very short period of time learn the natural flows of traffic through the customer's network and you know a combination of AI machine learning and digital fingerprinting we can determine pretty quickly what's a baseline nor baseline normal for traffic patterns in a customer network. But the real benefit of that is that we can then also can then in real time detect anomalies, right? Because we can see something happen happen out of standard pattern and that can then trigger an action to take, hey, you know, you just saw we just saw a spike of traffic to this location, this website from this place that is not normal. Would you like us to act on it or do you want to act on it? We want to know about it. And so those are capability that we are that we are building out and having some really you know good conversations with with our customers. A second that this platform and factory allows us to do is you know really you know part of the service we provide is we deploy you know edge compute edge functionality out to our customer. We manage the devices and that's we deploy networking routing networking security functions on it. And we're also in the process of, you know, building out and rolling out edge compute in those same devices. And so within those devices, we're going to start including GPUs, right? One or two. And so then and to be able to connect all that back into the core of our network. And so one of the the ideas that we've been you know working on with a couple customers is you know as customers are learning how to and learning where to run their workloads whether it be inferencing does that go back to public cloud does it go back to a neo cloud does it go back to where does it go to be most effective what this will allow us to do is you know as we roll this out is to have say a customer has 100 locations and in those 100 locations they've got a device out there the premise that has a GPU in it. we can manage the workloads across that entire footprint. So all of a sudden it becomes like a you know a hundred you know 100 GPUs working together as a farm to be able to run. of if a if a AI",
        "start": 1061.76,
        "duration": 2339.759000000001
    },
    {
        "text": "the premise that has a GPU in it. we can manage the workloads across that entire footprint. So all of a sudden it becomes like a you know a hundred you know 100 GPUs working together as a farm to be able to run. of if a if a AI power at the physical location, it can consume, you know, capability from other locations that has spare capacity. And so, and both of what I've talked about are new revenue, new revenue opportunities for us on top of what we already do. And these are kind of things that we're thinking about about how do we make these these things come to life and of course ensuring that there are customers out there who, you know, want to buy them and see value in them. Those are the concepts and ideas that we were bringing forward in addition to just adjust in addition to an enhanced customer experience. Yeah. What I like and what I like what you talked about too was the u being able to use the AI factory to do things you couldn't do before. Right. I think I think often when we deploy technology, we do it use it to optimize things that we're currently doing, maybe lower cost a little bit. And then down the road we think about the things we could do that we couldn't do before and it seems getting not in front of that which is good. Now with with that being said when you think about the CIO's job you know when it comes to AI when when you look out in the future what are some of the things that they should be paying attention to in the next 12 to 18 months? [snorts] Man, yeah. Another another funamentally important question. And I I know I know it's going to sound like I'm going to hit the repeat button here. but I think really the first and foremost thing CIS have to be thinking about is how am I thinking about security from the agent all the way through down to my data and how I'm doing in a way that that is connected. So I'm not limiting the effectiveness of the technology and the capability but that I'm preserving my corporate assets and I'm preserving my intellectual property and I'm preserving my customer data and I'm ensuring that I can you know that I can control the agentic activity within my organization the best that I possibly can. I think that's a is and like like you said earlier that's a really complex and really farreaching problem statement but but it has to be thought through and it has to be solved and it has to be sorted [snorts] and the other the second one I will bring up and this is a really important one and you know there's and I tie and I tie this one back to this idea",
        "start": 1191.36,
        "duration": 2597.358000000003
    },
    {
        "text": "to be thought through and it has to be solved and it has to be sorted [snorts] and the other the second one I will bring up and this is a really important one and you know there's and I tie and I tie this one back to this idea projects have have failed or being shelled for a while or not producing the value is the reality is that the AI didn't fail the technology didn't fail is that organizations weren't ready to change and embrace to the point where they can really take advantage of the capability. And I think that's another thing that CIOS really need to be thinking about is how do how do I as a CIO collaborate with my peers throughout the organization to really help them think through what does this mean for your function or the cross functional activities inside of an enterprise because this really is a fundamentally different way of doing business, right? And so I you know spot you know speak really broadly here is that companies and organizations and functions have been organized around silo based activity. Those silo based activities require you know functional knowledge of experts. What we all know is that models can now learn can now learn a lot about function specific knowledge. And so that that that value of functional organization and silos that have been built over the current and the ending of the industrial age that we are currently in that has to be rethought and that's a hard task you know to drive even at these executive levels. How do you get people thinking differently about how organizations are structured and how organizations work together and the things you can build from a agentic workflow that are far more horizontal and deep than has been been the case in the past. And if you don't have that buy in, if you don't have that agreement about what people are willing to embrace and adopt from a organizational and human perspective, the technology will will continue to fail. And it's again, it's not technology, it's the organization's ability to evolve, to embrace and adapt. Yeah, you know, it's interesting you bring that up because there's been a lot of valley who about that MIT report that said 95% of projects fail, right? And I I think a lot of it is it's not technology because there's a lot of really successful AI projects out there. It's an organization's willingness to transform. And part of that, the recommendation I do too is take if you look at your process. You and the the process itself is fundamentally flawed. Don't AI it or you're just going to speed up bad results, right? So you you got to be willing Yeah. You got to be willing to look at really changing a lot of things. It reminds me a lot of early in the cloud days, right? If you took a",
        "start": 1321.919,
        "duration": 2886.1570000000015
    },
    {
        "text": "AI it or you're just going to speed up bad results, right? So you you got to be willing Yeah. You got to be willing to look at really changing a lot of things. It reminds me a lot of early in the cloud days, right? If you took a and shifted into the cloud, it's still a poorly performing app. It's just a little lower cost to run, right? if you're going to refactor it and rewrite it for cloud native, then you're going to get better results. And so I think it's a good lesson for CIOS now is when you're looking at this, you you can't just look at it in isolation. You got to look at it with the context the entire workflow if you're going to be successful because to your point, it's not a technology issue. It's a leadership issue. So yeah. Yeah. Yep. 100%. 100%. So when you when you look at GTT specifically, we've discussed your shift to Aentic AI and the big investment you've made in your AI factory. And so looking at kind of beyond that immediate impact that you'll have with those, what's next for you guys? Well, when I think about what's next, I look at the next six, 12, 18 months and I see how much we have to do, you know, how much how much work that we're still doing to really drive, you know, you know, the the execution of the strategy we just laid out, right? And there's a lot of things we're doing there. So really what's really on front of mind for us right now is is really I'll cover in a couple different ways. One is the continued evolution of the company, right? And the transformation of the company around the the concepts and the technologies that we were just talking about, but then also two then how how are we then expanding and growing our our routes to market to get to our targeted customer base who we're still in in the process of, you know, continuing to educate people who GTT is today. right versus who GTT was two years ago or four years ago or eight years ago. And so for us it really is you know opening opening up those additional channels to market right and there's a lot of work we're doing here in the US with you know with the channel itself with tsds with technology distributors and partners to get broader and deeper access into that CIO office that syso office that we might not have had have had access to before because of the value of the solutions that we're bringing to bear right and so that's very important for us right now but I think the you know if I if I think about it from a product and technology perspect effective. Of course, that's a really brief summary of, you know, what's really important to us right now",
        "start": 1468.08,
        "duration": 3130.3160000000016
    },
    {
        "text": "bringing to bear right and so that's very important for us right now but I think the you know if I if I think about it from a product and technology perspect effective. Of course, that's a really brief summary of, you know, what's really important to us right now it really is on the product and technology side of bringing these ideas to life because at the end of the day, what I I oftenimes think about us is in layers, right? And layers being how we bring together these global capabilities of global access aggregation to where we can truly get to any location on the planet with wired, wireless, satellite, whatever it may be. aggregate aggregating them into our and bringing them back to our global network, right? To get connectivity, deploying, you know, the physical devices out to the customer premise in our network that can then serve as a place where we deploy and run and manage virtual functions for our customer. The most simplest way, that's the question. And so, how do we continue to evolve really the platform and the physical the physical platform for me is access networking devices. Yeah. and really and really automate that whole process through again through the AI factory and the capabilities we have there. So that changes the paradigm of how services can be delivered physically. But then we're also working through as we deploy and run essentially software on top of that. How do we do that differently as a service provider because software acts differently and virtual functions acts differently than a network. You putting connectivity and unless you need to upgrade the physical line, you don't have to do that much to it over time but software has a life cycle that moves at a much faster pace. And how do we allow customers to deploy and then remove, deploy and then remove, deploy and then remove and to do that in a way that's getting simple for them to do is really for me the next horizon of what we're what we're working on because then at that point in time if we can execute that vision then really what we're able to do is we're able we give our customers the ability to you know in a co-managed managed way deploy where they where they needed to deploy and to have freedom of movement which I know has been a promise for a a long time. But that's really we're thinking about that as an outcome of how do we get closer to it, right? It's a again hard problem to solve, but you know, if it wasn't hard, it wouldn't be worth solving. Yeah. Well, that's what they say. And you know, it was great talking to you because obviously the network plays a really important role in the success of AI. I think that's one of the things that couple years ago probably wasn't well understood but I think",
        "start": 1594.48,
        "duration": 3387.0360000000014
    },
    {
        "text": "be worth solving. Yeah. Well, that's what they say. And you know, it was great talking to you because obviously the network plays a really important role in the success of AI. I think that's one of the things that couple years ago probably wasn't well understood but I think you're going to secure it. It's where the performance is going to come from. And so you know it's it's it's always great talking about things like that. Yeah. And part of it for me when you think about the network it it is without it you can't do all the things we're talking about and that got downplayed for the last couple decades probably. I think it's now coming back around and the two things as we think about it right how do we create differentiated value for ourselves and value to our customer right because at the end of the day we have to give them something that like hey economically this makes more sense to me to do it this way than I was doing before. That's why when we think about you know we talked about you know before you know data sovereignty but when you start to think about cloud repatriation and topics like that you know or when you start to think about you know the idea of charging for a for AI workloads with tokens right and so all of a sudden you start to think about okay when when will that apply you know and if you've got we all we all know the cloud story it's easy to put data in it's hard to get it out is or it's expensive to get it out but then if you can start to deploy in different locations and you have a network to move those that data around is a very different economic equation. Yeah. Just as again what we don't know is as tokens become more understood and become a unit of measure that will eventually probably be charged for will that just become the new cloud egress right you start to run your run things and all of a sudden that cost of the token just went up 10% 20% 100% I mean we don't know but if if so maybe better to have a dedicated infrastructure and how would you do that yourself if you could right you things that that is a good point in the token so it might beat the new egress. So, anyways, on that note though, I'm looking at the clock here. it's probably good to wrap. This is a good place to wrap up and so anything else you want to add? No, great conversation. Appreciate the question and and thanks for the time. Yeah, well, congrats on the partnership with and Nvidia and Insight. I think having a company like yourself be able to offer AI factories can certainly speed things up for customers. So on",
        "start": 1725.6,
        "duration": 3630.5560000000023
    },
    {
        "text": "else you want to add? No, great conversation. Appreciate the question and and thanks for the time. Yeah, well, congrats on the partnership with and Nvidia and Insight. I think having a company like yourself be able to offer AI factories can certainly speed things up for customers. So on Caraval from CK Research and thanks for watching. give us a like and also hit that subscribe button and I'll see you next time on the next episode of Zcast. [music]",
        "start": 1848.72,
        "duration": 3651.278000000002
    }
]