[
    {
        "text": " Welcome to Zcast. [music] I'm Zas Carval from ZK Research and I'm here at Extreme's AI Summit in New York. We're at MLB's headquarters. Big Extreme customer. I'm with Nibil Bukari, CTO of Extreme. Nabil, it was really a great day. Yeah, it was great. I mean like this is the first time we've kind of gotten you know a bunch of our partners and customers together a little more intimate 70 80 people and really laid out the vision of where we want to take AI for networking. So yeah, super excited. I think it went really well. Yeah, I talked to Carla this morning about the goal of it and she said part of it was the new product but also to drive a little bit of thought leadership. Do you think it accomplished that? I think so. I mean like the fact that one of the customers stood on stage and said that you know this kind of thoughtful development on AI I don't expect that from my networking vendor but I was so pleasantly surprised. I'm like that sums it up. So I I think it accomplished you know it accomplished its its goal. Yeah. Yeah. You know one of my big takeaways is I think you you you did a very good job of connecting the dots between AI and the network. especially on the campus side. I think if you look at a lot of the messaging coming up from the Nvidia the world and stuff everything's very data center focused right but when then in fact Paul Dory the keynote speaker this morning talked a lot about physical AI and edge AI and of course all that's going to be front-end network not backend network and that's really one of your strengths. Yeah, absolutely. And and look, you know, it it's twofold, right? So, one is the as inferencing and the front-end network comes into the enterprise, so we play on that side and obviously our fabric is the best suited network for that, the underlay for that. The other part is that as you bring AI into enterprises, you are thinking about devices, people, applications, sensors and everything. Well, guess what connects them? That's also the network. So this is what as you know as you noticed like at the end of the panel I was saying that hey networking is not just the connecting fabric for AI it is fast becoming the context in AI and I think that is going to be more and more and more true and in enterprises there's nobody better suited to accomplish that goal than we are. Yeah. Now during your section you showed a product called extreme exchange to be released sometime in the distant future. No date given. will keep your boss happy on that. and but just talk about what it is and what you're hoping to do with that. Yeah. And and look, yes, we we talked",
        "start": 5.12,
        "duration": 288.40000000000015
    },
    {
        "text": "section you showed a product called extreme exchange to be released sometime in the distant future. No date given. will keep your boss happy on that. and but just talk about what it is and what you're hoping to do with that. Yeah. And and look, yes, we we talked imminent. It's not that far away. and the idea there is that when we built platform one, we really started from an AI core. And while platform one is run off of AI core, platform one is very specifically targeted towards network operations, network administration, security, access security and stuff. But the AI core capabilities are much more diverse than that. So that was one thing and we wanted to expose those capabilities outside of platform one as well. So extreme exchange really is think of it as a really smart modern catalog or app store whatever you want to call it which really houses all of these AI components. [clears throat] So think about multiple different AI agents, different integrations, different MCP servers and all the tools that it brings and so on and so forth from us from community from our partners in one place. So that's the first aspect for it. The second pillar for it is what we talked about the agent flow and look I won't go into the detail of it but I'll say what I said there. Automation has been around for a long period of time but the automation has been rulebased. If this then that if this then that. We really want to bring it from the world of rules to the world of reasoning. So now your automation can be intelligent and you can add AI agents, you can add AI tools, you can add AI integration and your automation thinks and to me that is the biggest value that AI can deliver to enterprises today. So that was the second pillar and the last one obviously is micro apps and you know we kind of showed the the venue intelligence. So that was as an example of what is possible when you really start thinking about AI as not just something that does an action for you but really starts to think where you as a human stop thinking and and that's a little bit more futuristic in nature but but that's extreme exchange. Yeah. Now I'm not surprised you showed venues because you [laughter] are so big in venues. Yes. , one of the really interesting aspects of that demo that I thought was fascinating was the fact that you didn't prompt it with anything. It just collected a lot of data and then it suggested we need to think about congestion management and how people move around without any prompting at all. Exactly. And this is really the power of look look you can take a piece of data and you can put a chatbot on it and you",
        "start": 149.44,
        "duration": 558.8010000000003
    },
    {
        "text": "of data and then it suggested we need to think about congestion management and how people move around without any prompting at all. Exactly. And this is really the power of look look you can take a piece of data and you can put a chatbot on it and you do that but for us the real the immediate nirvana I'm not talking too far out but the immediate magic of it is that given a set of data we ask AI tell me something what I'm missing teach me something that I don't already know right and that is what we showed at the micro app for the data related to venue especially for MLB And to me, this is the promise of AI for enterprises and look, we'll bring it out to our customers pretty soon. Yeah. Well, and that's really takes AI to another level. If I think about the can I call them legacy A products and what you know the they were like two years ago and now they're legacy. Yeah. [laughter] they they focus a lot on being a a co-pilot, right? and helping me understand, you know, if I got a Wi-Fi problem, I can ask it why that is and it'll tell me that I need to put a new AP here. This really is truly that coworker. It's somebody that's watching the network 24 by7. It understands the data. It can do the analytics and it can tell you, hey, you should take a look at this. Exactly. Because it's noticing something that's not right. Exactly. And you know, we talked a little bit about Paul, the key speaker, and he was brilliant guy. Brilliant guy. Right. One of the things he was talking about he was sharing his maturity model and he was talking about like co-pilots are the first maturity or or no chat bots are the first one co-pilot's the second one then he talked about agents and then he talked about these workflows that are smart and thinking and the fifth one was autonomous I don't think anybody is at the fifth one but if you really think about it this is us pushing into that fourth stage of maturity where these workflows and these micro apps they are thinking for you and perhaps going beyond beyond what a human can think and it is doing it without you really prompting it because I feel like the whole world is here at prompting. I think for us where I'm thinking about is I want to take AI beyond prompting because when the AI is tied to prompting it is still tied to how well you prompt. I want to take it beyond prompting so we are not tied down to the prompting powers of a user. Well, that's what I was talking about becoming a true co-orker, right? And so what are you obviously showed that as a sample micro app. Do you have any",
        "start": 286.4,
        "duration": 830.4810000000004
    },
    {
        "text": "prompt. I want to take it beyond prompting so we are not tied down to the prompting powers of a user. Well, that's what I was talking about becoming a true co-orker, right? And so what are you obviously showed that as a sample micro app. Do you have any customers to try and get some ideas, but are there some that you think really good low hanging fruit? We we have many. I mean internally think about we we have a backlog of like multiple dozens of them that we totally experiment on it. I mean the some of the other use cases that I can think of and I know will be very useful for our customers would be planning and I'm not talking about planning capacity and stuff look you know we talked a little bit about AI we talked a little bit about fabrics micro segmentation end to end dynamic that responds to everything else the biggest problem on that is people have a hard time wrapping their headers around it so how do you help them plan that model that and stuff like that so you can imagine obviously we're extreme fabric company we're going to apply this to fabric you know I see a lot of use cases on Wi-Fi side on that as well especially related to you know here obviously I'm coming back to the venue so spectator engagement and stuff there are so many use cases for it the key as I said earlier is it's not just about having data it is also about having the expertise the domain knowledge then context which is ontology and knowledge maps and stuff and then controls because customers are not going to allow you to do things like that unless you show control and security and everything. , so yeah, exciting times. Now, you touched on segmentation, but how do you see this being used in the context of security? Yeah. Is that clearly is one of the biggest challenges companies have? Absolutely. Absolutely. Right. So, for me, , security is is at multiple different layers, right? So, it could be all the way from their data plane, which is our segmentation. You can go up and you can talk about security at the access layer. You can talk about security at the user level, use the stuff like that. You can talk about Yuba, you can talk about XDRs and so on and so forth. I think some of the biggest areas where we can apply is really where the boundary of network security and data security sits and I think if you can bridge that gap there then that can make security that much easier because there's nothing that can solve the security problem. It's an ongoing thing but I do you can expect that we will apply this tech in that space. But if we can tell if if nothing else, if we can tell the relationship",
        "start": 424.88,
        "duration": 1087.201
    },
    {
        "text": "that can make security that much easier because there's nothing that can solve the security problem. It's an ongoing thing but I do you can expect that we will apply this tech in that space. But if we can tell if if nothing else, if we can tell the relationship right? The reason why segmentation doesn't work today isn't the fact that it doesn't work because it does. It's just people don't know how to segment. Yeah. Yeah. Right. It's too complicated. [clears throat] Yeah. You know, I would tell you is that segmentation in the network, especially done dynamically, is one of those amazing tools that people just don't know how to use it and because it's too hard. It's too hard. So now imagine with the kind of technology that you saw here, we can probably take it from it's too difficult to where it is so easy to deploy and I think that will help everybody you know from a security point of view. Yeah, I can I I can see that. All right. Well, that wraps up exchange. I want to ask you about the fabric which you mentioned and we talked about this at your investor day about when you think about the evolution of the campus network and the amount of inferencing traffic that's coming and how it just changed things. Why do you believe the fabric your your layer 2 fabric is ideally suited for the AI era? Yeah, you know, and and this is something that you will hear us talk about quite a bit because and you have talked you and I have talked about it for a while now. Look, think about it this way. , think of for a moment as an analogy. Think of inferencing as a brand new kind of application that has its own requirements and stuff. Every time you layer on an application on top of network, it has different kind of requirements all the way from bandwidth, SLA, latency, access, security, so on and so forth. So inferencing has very specific kind of requirements on the network and since more and more inferencing is actually happening outside of the data center. So now you don't have the pristine environment of a data center you just built 6 months ago. you have this messy enterprise, you know, network that has four or five generations of technology and you know, probably it's not as clean as you would like and now you need to make sure that inferencing is working well on this messy network and you know that is where we shine. And that is where enterprise fabric from us is purposeuilt for. So I believe as there's more and more inferencing on the edge or inside the enterprise is they're going to realize very quickly that the old school networks from a lot of different vendors are just not going to cut it. They don't even have the",
        "start": 554.88,
        "duration": 1354.721000000001
    },
    {
        "text": "us is purposeuilt for. So I believe as there's more and more inferencing on the edge or inside the enterprise is they're going to realize very quickly that the old school networks from a lot of different vendors are just not going to cut it. They don't even have the serve that application the new application called inferencing. Yeah. Well and you know you think of the hierarchal networks we have companies designed them largely in the internet are for north south traffic. pretty much and we've shifted more to east west but really when it comes to AI you need both you need both and it's just almost like and I think in a fabric there's no concept of east west north there's just traffic well that's what I was going to talk about like the beauty of the fabric is that north south east west direction doesn't really matter right northwest southeast yeah [laughter] exactly you can go in whichever direction you can change your direction midway and stuff and and that's really the power of fabric and then this dynamic segmentation directly on the data plane that ties into the access security like UZNA for applications and data. Now all of that you bring it together and all of a sudden you say like why would I ever deploy anything other than this combination if I am putting inferencing in the enterprise side. So you can see that we will we will do a lot of things with that. All right. so we got extreme one's now in production. It's been out for a while. you have extreme exchange coming. we're moving into 2026. What are you looking for at the next year? What should we expect from Extreme? I think Exchange is probably the first one. It's towards the early half of it. There's a lot more things planned for platform one itself. Yeah, we talked a little bit about fabric, so you can expect I can't give you all the things, but you can expect some big things from us, you know, on the fabric side. And then, of course, Wi-Fi 7. you know, Wi-Fi 7 from a portfolio point of view, we are already well on our way for having pretty much everything in our portfolio from a Wi-Fi 7 point of view, but a lot of the capabilities of Wi-Fi 7, they need to be now exposed in a way that customers can use it. So, you can see a lot coming in that space. and then we will continue to develop our AI core because that's just the intelligence system that drives everything. Yeah, I do think Wi-Fi 7 is the first real gamechanging Wi-Fi we've had in a long time. Yes, it's not just the 6 GHz, but No, it's a lot of other things. In fact, in fact, I think a lot of private 5G took some Wi-Fi at the at the fringe where deterministic traffic was needed.",
        "start": 690.24,
        "duration": 1619.0409999999993
    },
    {
        "text": "the first real gamechanging Wi-Fi we've had in a long time. Yes, it's not just the 6 GHz, but No, it's a lot of other things. In fact, in fact, I think a lot of private 5G took some Wi-Fi at the at the fringe where deterministic traffic was needed. back. It's just it's easier to use, it's cheaper, and people like Wi-Fi. You you know, I'm very very involved on the 5G side as well. you know, I'm on on the board of some of the public companies on that space. it has its own use cases and I feel those use cases are more and more and more on the consumer side and that will continue to grow as well. but I feel that some of the early thoughts of enterprise use cases that people had around 5G I think Wi-Fi 7 and the upcoming ages does it so well that you know it it it just but the good thing is that they're both amazing technologies and they both have places in the network and they don't have to compete with each other. Yeah. Lockam's Razer says, \"When there's multiple solutions to a problem, the simplest one is generally the right one. And Wi-Fi is certainly the simplest and the cheapest one.\" Yes. [laughter] First square foot. All right. , anything else you want to add? I I think Well, first, thank you always for a big year this year. , we had a big year. You know, we're just coming off of ringing the NASDAQ. You know, we had a great investor day. You were part of that. , you know, we had a great quarter. you know, we you know, we we beat and we raised and you know, at our investor day, we kind of reinforced and kind of reiterated and maybe pushed up the expectations for this year. so overall, I think we're coming, this is turning out to be a really good year from a calendar point of view and we're midway through our fiscal and we feel really good. Yeah. Well, you got the product in a good place and now it comes down to execution. Yeah. Look, in the end, all of the technology and everything we it needs to translate into real value for the customer and then obviously the scoreboard as a public company. We all know what that is. All right. Well, until we meet again, always appreciate the time, Nil. Absolutely. Thank you so much. It's good to see you. So, on behalf of Nibil Bukari, CTO of Extreme Networks, I'm Zas Caraval from ZQ Researching. Thanks for watching and I'll see you next time on my next episode of Zcast.",
        "start": 824.88,
        "duration": 1834.4809999999995
    }
]