[
    {
        "text": " [music] Hello and welcome to what's new in networking. I'm Bob La Liberte from the cube research and I'm joined by Zas Carafella of ZK Research. Hey, how you doing Bob? So another great addition here. this time we want to be talking about Cisco and more specifically what's going to happen with Cisco in 2026. Yeah, was certainly a seminal year for Cisco. I think we will look at 2025 as kind of the a real watershed moment for Cisco. The stock hit a price not seen since the dotcom days. the in fact it was about 14 15 months ago G2 Patel told us that Cisco would be unrecognizable in a positive way and certainly has been. I mean we saw plenty of products announced and rolled out. Everything has been refreshed and I mean the numbers speak for itself, right? Yeah. I mean the the Oracle of Cisco, right? His his innovation train that he created there has been really something to behold over the last year. Every event we go to there's more and more innovation being released being announced and so and now we're starting to see I think the the you know the stock and so forth is starting to see the results of that. their numbers that they're putting up for the AI infrastructure are mindboggling. I think they had done a couple billion last year and then in the first quarter this year they already did over $1 billion in the first three months alone. So obviously you know a lot of people are talking about is this a bubble? Is it not? Clearly what we're seeing is there's still a lot of adoption and a lot of demand for organizations building out those those AI environments, right? Whether that be the hyperscalers, the neoclouds, and I think we're going to start seeing the enterprises get into this a lot more as well in 26. This may be a bubble. , it's a good question. , but I think the bubble is still relatively small compared to how big it's going to get. It may pop sometime, but I mean it's going to be it's going to get a lot bigger from here cuz we haven't really seen the impact of this on the campus network yet. We haven't really seen it on the data center buildouts yet. Like hyperscaler, sure. Yes. Neoc clouds are just starting, right? But enterprise haven't really started to move at all, right? And that's really Cisco's sweet spot. In fact, Jensen sent on his earnings call that he's got line of sight into 500 billion in sales through next year, right? And so if you want to look at that as the leading edge and then everything else falls off and as the derivative effect, I mean, I I don't see how Cisco just doesn't continue to keep the train rolling. Yeah, you could have argued before that maybe the product",
        "start": 0.654,
        "duration": 316.57800000000003
    },
    {
        "text": "And so if you want to look at that as the leading edge and then everything else falls off and as the derivative effect, I mean, I I don't see how Cisco just doesn't continue to keep the train rolling. Yeah, you could have argued before that maybe the product product's been completely revamped. So, yeah, exactly. We we've seen that and I think as organizations move into adopting more of the inferencing than really the large model training, you're going to see again there I think at one point Jensen had said that'll be 10 or 11 times bigger than the training piece as well. So, this whole inferencing wave that's about to hit and that's obviously going to be not so much in the large data centers but more at the edge. Yeah. And you're starting to see evidence of the loosely coupled, tightly integrated, I think is the way G2 call it, right? Yes. AI canvas is a good example of that. The unified edge box they rolled out at Partner Summit, another good example of that. The branch architecture. , and what I like what Cisco is doing, Bob, is they've kind of gotten back to what made them so good in the early 2000s. And that, in fact, John Chambers used to talk a lot about this, the value of architectures. You put things together for the customers, you make it simple to deploy, and they buy more. And you can get a price premium for that. And you know they I don't know why Cisco ever got away from that but it took G2 to bring it back. Yeah. I mean the challenge was prior to him you had all the capabilities just separately and now what we're seeing with their platform approach they've been able to actually unite all those bring them together so they can deliver more value. So now it's not just about networking or networking and security, but it's networking security and collaboration and observability, right? All these other pieces of the puzzle are all coming together to be able to deliver more value for organizations. Yeah. And so I think what's interesting too, Bob, is if you look the value for networking is is clear, right? They've rebuilt their networking portfolio. The the new 9Ks, the new Nexuses, it's all new. But they've done it in a way now where security, like I've always said that the biggest needle moving opportunity for Cisco is security, but they've always had trouble executing on that. And now they've actually got a strategy where security is actually integrated into the network. Correct. Which is crazy that it took them so long to do that, but whatever. But they seem to be there and so they can actually bring quite a different approach to security. They the Tom Gillis's whole turn every port into a firewall. Right. Correct. And I I don't know if we've even seen the",
        "start": 161.599,
        "duration": 586.5789999999998
    },
    {
        "text": "took them so long to do that, but whatever. But they seem to be there and so they can actually bring quite a different approach to security. They the Tom Gillis's whole turn every port into a firewall. Right. Correct. And I I don't know if we've even seen the yet. Yeah. No, I I think that's a fair point and that that I guess it's not in decline anymore. So correct. Yeah. Well, but that distributed nature of the security is what's going to be required in these obviously these environments that are far more complex that are far more distributed, right? So, putting the security where it's needed as it rolls out in every environment in every possible way I think is going to be helpful. Having the observability to see what's going on in those distributed complex environments will will play a bigger role. [snorts] and then obviously you know I think it's we're also seeing even uptick on the the collaboration side and the contact center side where organizations are seeing value. I think a lot of these are tied to the network. The network is still the common theme right the Cisco is still a networking company but they're able to you know deliver far more value by having these integrations of these technologies that are surrounding the network. Yeah. One of the best examples of this integration though is a thousand eyes on the Cisco devices. Yes. and so if you're not familiar with what that is is th obviously thousand eyes is a great internet monitoring tool. [clears throat] Every Cisco device now is a thousand eyes node. And I know when we talked to Brian Stout, the leader of collaboration sales, he talked a lot about their the whole concept of the future proof workplaces making the device as important an item as Wi-Fi or networking because you need observability. You need all the telemetry to tell you why apps aren't your AI apps, not just collaboration aren't working. And now they can do that with thousand eyes everywhere. Yeah, absolutely. And some of the devices that they have have the built-in GPUs from a from a security perspective to authenticate an actual user. So there's no deep fake from videos and so forth, right? And voice and whatnot. So yeah, there's there's clearly a lot going on there. , one of the other areas I wanted to touch upon because obviously one of the keys to C Cisco's long-term success has always been its channel partners, right? And they have a what's that number? 500,000 over, right? 500,000 channel partners globally. So really impressive. And they've had That's mindboggling. It It is when you think of it. 500,000 channel partners. I think Oliver knows them all. He He probably does. He probably does know them all. so, you know, that's sort of like, you know, how do you how do you then change your partner program to align with what",
        "start": 298.56,
        "duration": 871.8579999999998
    },
    {
        "text": "It is when you think of it. 500,000 channel partners. I think Oliver knows them all. He He probably does. He probably does know them all. so, you know, that's sort of like, you know, how do you how do you then change your partner program to align with what while G2 said that the company would be unrecognizable, right? the partners don't want to, right? They they they obviously want to have predictability. They want to have profitability and and so they've been touting this for a while now. They started back, I think, in April or so, right, when they said, \"Here's the new 360s coming.\" No, no, it was before It was Partner It was Partner Summit a year ago. Okay. So, it was a year ago, right? Okay. So, that's [snorts] So, you know, and the the key things that I heard when we were at Partner Summit is that the reason they took so long is because it is so important to get it right. And so they've gone through a lot of revisions and a lot of changes after speaking with the partners, going back and forth, making sure they're going to get it right, making sure that the partners see the opportunity to sell the Cisco platform. So it seems like most of the partners we've talked to are encouraged by this and they're going to we'll we'll the truth will be will be told this when they roll it out at the start of the year in February. So that will really when we see what happens. But they've clearly spent a lot of time on partner on this on the 360 program. They want to roll it out. They want their partners to be successful and they want them to focus more on selling the overall platform and not just one or two products. Yeah. And well it's a it's a value based program, right? And so you have to meet different criteria. in fact I have seen, pardon the pun, a complete 180 on the attitude toward 360. I'd say when they announced it at Partner Summit 2024, feedback was almost universally negative and I know you know the company has done a lot of work going back to its partners. I talked to Brian Oralls from WWT this they they had a lot of input on how the partner program should look and how you score and things like that. they brought in Tim Kugan to run it. You know, he he's a really good guy, well liked by the channel partners and they've just they've continued to iterate and iterate and iterate it until it's at the point where the partners now are bought into it and I you know obviously that's the right thing to do. we'll see you know once it rolls out how the partners feel about it if they're the real test is are they making more money correct? Yeah. Are [clears throat] they",
        "start": 443.599,
        "duration": 1122.7379999999994
    },
    {
        "text": "where the partners now are bought into it and I you know obviously that's the right thing to do. we'll see you know once it rolls out how the partners feel about it if they're the real test is are they making more money correct? Yeah. Are [clears throat] they success? are they able to to retain and be that strategic partner for their for their customers? And I think for the partners, they got to understand too that the world is changing, right? So a lot of the maintenance break fix business that you had, you're not going to do as much of because AI is going to take care of a lot of those problems, right? And so you got to change your business as well so they can get into more of the consultative type of selling, you know, helping them with architectures and things like that. And so I think 360 allows them to break away from the traditional channel model and into this. So yeah. Yeah. No, that makes a lot of sense. Cisco CX also changed. Yes. Right. That was announced a partner some summit. It was Cisco IQ. you know if you look back this year I think that was one of the more notable moments. It's really interesting having Liz Sanony run it because she's a historically a product person. Yes. But I think that brought a better product lens into services where they've always had services people there and they I her organization's done a fantastic job of inserting AI into the services framework and now it's I mean if you look at the interface it's this really interesting kind of proactive type of environment where you can just ask it a bunch of questions about licenses about what's coming up for renewal about you know what's what's close to end of whatever and it'll it becomes sort of this administrative of well not or technical coworker to help you do things that you couldn't do before. Yeah. I think the words I've heard from her repeatedly have been that shift from being reactive to proactive and even predictive in a lot of cases. Yeah. So it's that's a it's good to see the evolution of that and I suppose you know Bob we shouldn't have been surprised with that. Every aspect of Cisco has evolved and so the services business the the CX group would have had to evolve as well. Yeah. Correct. Yeah. They they've really touched upon like you said like G2 had said you won't recognize this in a year from now and every part of the business has evolved and again that loosely integr loosely coupled tightly integrated model. I think the fact that G2 and Eric are like buddies now is a good indication Eric Yuan over at Zoom is a good indication that this is an unrecognizable company. So what to look for in 2026 I would just say they",
        "start": 571.36,
        "duration": 1385.137999999999
    },
    {
        "text": "loosely integr loosely coupled tightly integrated model. I think the fact that G2 and Eric are like buddies now is a good indication Eric Yuan over at Zoom is a good indication that this is an unrecognizable company. So what to look for in 2026 I would just say they now not all of it's G right we're still waiting for AI canvas that's an early next year a lot of the products they pre-announced as well so they got to hit those deadlines right so if if the product team's making promises but hitting the but assuming they do that then what 2026 becomes is year of execution can they can they actually come out and take advantage of this AI wave can they and I suppose that would manifest itself into share gains in areas where they historically have lost like you think about Cisco and networking and SDWAN and things like that they've lost share every year you know they started with a huge pile of it right so you know I I guess that would be the ultimate test they start taking back what they've given up over the last few years yeah and I think for me what I want to see is from all these announcements that they've had and the innovations that they've had being able to correlate that into real business value. Yeah. So as this becomes GA, especially AI canvas gets rolled out that organizations are adopting it and getting value from it is something that we definitely want to see. And also the same thing for all of the integrations as well that that oneplus 1 it sounds great that one plus one on equals three on paper but seeing it deployed used in a meaningful way in the field and delivering real value for these organizations. Yeah, I think you know Bob, I have not seen Cisco this dialed in I guess if you want to use that term in a long time. Like again it reminds me the early days of the internet where they were a company that was set out to help you take advantage of the internet economy, right? And now they are all in on AI and they are like everything they do is dialed in on that and helping their customers take advantage of the upcoming AI economy and Yeah. Yeah. all the all their work with Nvidia, the integration of silicon 1, the integrate the new P200s that they have coming out for scale across. So a lot of capabilities there that they have that will be coming to market in in 26 that will actually help drive again that AI infrastructure space as well. And where I think G2's had the biggest impact too is that they are now bought into some of these trends right like you know when they bought Maro they really bought into cloud you know they wanted a cloud product I think more for defensive",
        "start": 703.68,
        "duration": 1657.4559999999988
    },
    {
        "text": "infrastructure space as well. And where I think G2's had the biggest impact too is that they are now bought into some of these trends right like you know when they bought Maro they really bought into cloud you know they wanted a cloud product I think more for defensive not like you saw the Moroi influence on the catalyst group or anywhere else right so for almost 10 years yes and so you know they made the acquisition but it's it would be arguable that they weren't really fully bought into that and I you know, this is something a discipline G2's brought in. Like they're building good products. They've got everybody is focused in the same direction. they don't really have the same competing, you know, inside anymore. I mean, yeah. I I used to talk to people, you know, they and us, right? Catalyst, dynamic tension between the groups. Sure. Yeah. Yeah. And so that's good to see. And so and you know if as we get into next year looking towards the end of next year I would expect to see you know again revenue up stock price up. I would think that some of the the security area is still a bit of an area of concern u in that and Mark Patterson actually their CFO explained on the last earnings call. They're still feeling the effects of the one-time revenue of the legacy products versus the ratable revenue of the recurring revenue. I'm not sure when that bottoms out though. Yeah. And but when it does, you'll start to see security grow and I think you'll see it grow see it grow pretty fast and that'll have a big impact on well and then there's the question of will security grow as a standalone independent business or it will be always tied to the platform and the the networking piece. Well, that's an interesting piece too. So if if they sell a bunch of security through the network, does that count as security sales or network sales? And maybe trying to figure that out isn't worth the exercise. Just overall Cisco growth is what we should be looking at. Yeah. And I'm also looking forward to, like I said, they they've really set the tone this year for innovation. I know from talking with a lot of the engineering leads, they're they're heavily leveraging AI for their development and that's helping them keep this pace up without burning out. Yeah. And so looking forward to 2026 and seeing what that brings as far as that again that sustained pace of of innovation that's happening and the accelerated pace of innovation that they're delivering. Yeah. And in fact, I'm not when somebody asked Chuck you know who his best hires have been he Oliver was one that and then but G2 he pointed to and I'm not sure I remember somebody coming into Cisco that's had that big an impact. obviously they",
        "start": 843.279,
        "duration": 1934.8169999999977
    },
    {
        "text": "they're delivering. Yeah. And in fact, I'm not when somebody asked Chuck you know who his best hires have been he Oliver was one that and then but G2 he pointed to and I'm not sure I remember somebody coming into Cisco that's had that big an impact. obviously they growing up inside Cisco so is Kougan and Liz but that was really a maybe the key higher in the Chuck Robbins tenure. Yeah, he he seems to have the team in place that he wants and so like you said 26 will be all about execution. Yeah. Well, Chuck, you've been in place 10 years now as CEO and I think the company's finally at the point where it's really execute really ready to roll like it did. It hasn't done I don't know 20 years, 25 years, right? So, it's good to see. Yeah, it certainly is. And and we look forward to to watching the progress over 2026. All right. All right. Well, Zas, thank you very much again. I'm Bob La Liberte. Thank you for joining what's new in networking and we'll see you next time.",
        "start": 984.88,
        "duration": 2028.6579999999974
    }
]