[
    {
        "text": " [Music] Welcome to Zccast everyone. I'm Zavar from ZK Research and I'm here in Japan at Zcaler Zenith Live event which is part of their APJ series. this part of the ZK series also known around the world with Nathan Al. Nathan group VP with Zcaler I think it's in a third continent I've done a video with you in. We met in Barcelona, Mobile Congress, Vegas, I think you can see Zenith Live, maybe somewhere else. The Arc Arena with the Warriors. Yeah. Oh, that's right. And now here in Japan. So, Nathan u great to talk to you again. quick intro on yourself and actually we're here at the Zcaler Cellular standard for people maybe that aren't familiar with that. Talk about what that is. Yeah, happy to. And always good to have a conversation with you. So, very briefly, Zcaler Cellular is the next foray into zero trust everywhere. Hence the sign behind me. The idea really means that Zcala has been forwarding and protecting users, workloads, clouds, locations for many years. But devices that were outside the bounds of those ecosystems, things like robots that are moving or vehicles that are out there, they needed connectivity into that zero trust policy that customers have. And that's what Zcalator provides that in that path in for them. And so how does that work then? You're actually building your zero trust software right on the SIM itself. Not quite. We are using SIMs and SIM identity for that, but we've actually integrated our system into the mobile network. So, what it means is that a SIM when it goes onto the network, it says, \"Hey, or any mobile carrier for what it's worth says, hey, I'm a Zcala SIM and I'm customer A or customer B. Connect me to this the customer policy.\" And we've built a policy engine within the mobile network. So, we bolt in there. That means this little robot or whatever may be out there when it connects in it goes directly into the customer's zero trust policy. So the SIM acts like an identity identifier for that to get in. And if you weren't doing that off that the the SIM connected to your to your network, how would you do that? Is would it even be feasible? It's kind of feasible, but you'd have to have client side software. And that's the thing we wanted to do is not actually have any client initiation or software installed. You put the SIM in a device or you use a QR code e SIM and that gets a device directly on a zero trust policy. So there's no client configuration. There's no client side software. It's a direct installation, none of that. We put a SIM in and we just go. Now I think when we talked at Mobile World Congress, you had just signed up a couple of operators I believe. we are here in the APJ region, right? And so",
        "start": 0.04,
        "duration": 299.23999999999995
    },
    {
        "text": "client side software. It's a direct installation, none of that. We put a SIM in and we just go. Now I think when we talked at Mobile World Congress, you had just signed up a couple of operators I believe. we are here in the APJ region, right? And so lot of big countries here. And so talk about some of the partnerships that you have here on the carrier side that are embracing this. And so to be very clear, we partner globally. When you take a SIM from us, it can go and operate on around 530 carriers globally. So that could be NT here, it could be Deutsch Telecom in Germany, could be AT&T in the US. But we want to give our customers that ubiquity of simplicity so they can get any networks. But to your point and your question, we work with partners, very specific partners. And so we have partners like NT Docomo here in Japan or their global business with their entity data partners globally where we're working with them on they provide the SIM we provide the security. Same thing goes with maybe some of our partners in Australia like Telra. and we're doing the same sort of things globally where we're finding select partners that help us provide a local interconnect with a good customer base. And that's the main goal is we don't want to be a mobile provider. We want to work with providers. We actually want to serve our customers by making this available so that all the other stuff like this robot can get on to their zero trust policy without all the complexity of all the other stuff that comes with it. In fact, shout out to Telra and Zed partner of the year down at the the Melbourne event. So that was good to see. and then so from a the partnership perspective for the mobile operator, they provide the connectivity, you provide the security, correct? They can then get into managed services. Exactly. Right. Things like that. And then that becomes a win-winwin. customer simplicity, right? Spot on. And we look at it kind of three ways. There's the MSP kind of managed service. There's going to be the the the value resellers to kind of resell the product itself. And then also we start working with manufacturers like this. It becomes an OEM conversation. They will sell the service whether that's a service from us directly or whether it's a partner like Telra or NT and we build the security into this product. This product whenever it's roaming around in airports or wherever it may be, it's securely connected by Zcaler. All right. So here we're here with Coco. Yeah. And so tell me a little bit about Coco, what it is, what it does and how where how are you integrated? Yeah. So Coco is from a company called SECOM. And SECOM is a Japanese local manufacturer. They build these century",
        "start": 151.12,
        "duration": 549.64
    },
    {
        "text": "right. So here we're here with Coco. Yeah. And so tell me a little bit about Coco, what it is, what it does and how where how are you integrated? Yeah. So Coco is from a company called SECOM. And SECOM is a Japanese local manufacturer. They build these century they are a kind of offsetting and helping security guards in buildings around the like like airports and other things. The goal being is that that they can be out with a camera getting a view of the site, the location, providing information directly back into a control room or to an operator to be able to say, \"Hey, there's a problem. Someone's jumped a fence or maybe it's a sporting event, someone's fallen over and they're injured.\" And then they can alert someone to send real people to help. So, the whole idea of this is to be interactive with humans, but to also keep an eye on on the scope. So, you don't have to have people everywhere. And this gives a lot of insights back to the operators. They have LAR, they have sensors at the front. Aren't they allowed to detect if someone's fallen down? They have a comm two two-way communication flow so that you can be in the comm's room on on your CB and say, \"Hey, get out of the way sort of thing.\" And it all goes over multiple different types of communication network. In this scenario with us, it's going over Zcale cellular. I think these even have things like a motion detection, right? So they can tell if somebody's aggressive or not. You can put in a, you know, preschool. There's all kinds of use cases or something like that. Exactly. This the idea is not to be aggressive robots. This I think we just discussed it with a manufacturer. This is a top speed of 6 km an hour. Yeah, it's really burn it through. But it's meant to be that to collect information and you're right. And that information is not just about security risks, but it's about emotions and challenges and problems that people have. So, well, I guess the benefit is if it becomes self-aware, we can outrun it. Well, that's true. I mean, I don't know how fast you are, but that's maybe that's at least on my bike. Yeah. And well so that's where that's fascinating that you can power these things now and it it raises kind of a bigger interesting question here and I know to me a big theme the theme of the show is the trust gap. Right. Right. And so this is the classic example of something where there would have been a huge trust gap because when you mentioned you could have had a workound by loading software. These things really aren't an open to load software. It's not like this is running on Windows right. So what am I loading the software onto? some right and so",
        "start": 278.08,
        "duration": 785.319
    },
    {
        "text": "would have been a huge trust gap because when you mentioned you could have had a workound by loading software. These things really aren't an open to load software. It's not like this is running on Windows right. So what am I loading the software onto? some right and so that now. Exactly. So it I think about you know when I look at this device I think about the keynotes given by Jensen Huang the CEO of Nvidia where he talks about how the next wave of AI and he's assuming that Aentic's here right is physical AI right where we're going to live in a world where we have more connected things and a lot of those will be autonomous machines. My son's actually working at a company that's building autonomous forklifts. Cool. Yeah. And so just talk about you know that opportunity for Zcanner when you think about when you look out ahead and this world of physical I be AI becomes real you know just from a how excited are you about that? Oh I mean massively I think you go back to the simplicity what Zcaler is. We don't allow any communication to happen. We are building a trusted communication path session by session between entity A and entity B. And that was a user that was a workload that was a workload that was a cloud. But now we're talking about other devices. And exactly heading where Jensen's outlining, there are now these huge ecosystems of different devices that exist, not just robots, but there are sensors on highways. There are vehicles. Every vehicle you drive, every car has multiple SIMs in it. They're all communicating about information, whether it be what video you're watching in the car or what Spotify stream you're listening to, but it's also what's actually happening with the car. That's needs to be collected and securely put back into a customer's ecosystem. And that's where from my point of view all that need for then intelligence to be able to be generated and understood we pull that together through the zero trust exchange. We bring that information through Zcala send it on to the right application and we do it securely using Zcale cellular so that this robot knows exactly where to go based upon all the other telemetry information has been collecting. So yeah that in that the dream that the Jensen in the video talking about is spot on where we believe it as well. The big advantage that we have is that now all those things that are out there, what if something happens to this guy and does something bad? What if someone to your point is actually not running Windows, it's running Linux, but what if somebody breaks into the Linux box here and it starts doing things that shouldn't be what do we do with the traffic then? Coco is getting breached. I don't think so, but it's a",
        "start": 398.319,
        "duration": 1031.3169999999998
    },
    {
        "text": "if someone to your point is actually not running Windows, it's running Linux, but what if somebody breaks into the Linux box here and it starts doing things that shouldn't be what do we do with the traffic then? Coco is getting breached. I don't think so, but it's a So, and it's connected. So, if you're using Zcale Cellaria, it can't be breached because we're we're protecting it with our zero trust policies. Yeah. So it's not just the connectivity and protection, it's that visibility that plays into the AI direction which is amazing which is where we fully well and I wanted to ask you about that the this is where the platform advantage really comes into play right because the same you know management console and policies that I'm applying to my users in the office on those Windows PCs and perhaps all my users out there on my Apple iPhones can be applied to these type of devices right so one set of policies to manage and then if it is breached like talking about just the platform advantage on how I can use that to troubleshoot faster. Yeah. Yeah. Well, there's troubleshooting is one thing because obviously you now see every packet from this guy is going through your policy. So you have full visibility to know is it right? Is it wrong? And then if it's doing something wrong you can get into the whole zcaler world of like well I can troubleshoot it. Is there a problem? But it could also be well maybe I want to block it cuz it's bad or I could maybe send it to a honeypot and use it to go and collect high fidelity information about an attack vector. So there's visibility comes off this and everything it does and it's fully secure. Then you have that path of security, protection, visibility and allows us to then give that to every device that exists in any location around the world. It's a real interesting opportunity to redefine sock operations too. Absolutely. Right. So that's another video though. Happy to do it but yeah this is your video. I don't want to keep talking for hours. So and so what's next for you guys? Well this is the biggest part right now is how we deliver more and spread across the ecosystem. We're working a lot with big industrials like energy companies, , more manufacturers. In fact, for those of you who may see this a bit later, we're doing another session in Singapore in a few in a few days time where we having additional robots like dogs that are running around running SIMs. So, working with more manufacturers around those use cases. , working with vehicle manufacturers delivering on this maybe not as just a customer consumption, but maybe as an OEM into your air conditioner or other things like that. So we ensure that every communication coming out a zcaler",
        "start": 522.399,
        "duration": 1272.197000000001
    },
    {
        "text": "running SIMs. So, working with more manufacturers around those use cases. , working with vehicle manufacturers delivering on this maybe not as just a customer consumption, but maybe as an OEM into your air conditioner or other things like that. So we ensure that every communication coming out a zcaler there we roll into we've you mentioned AI we've got I was going to ask about the intersection of AI and Zcal. Well you you see already we've got a huge amount of AI because in our cloud because we have that entity A to NCDB going through our policy. We know what that is. We can start being informed. We can start doing a lot of very interesting things. And you mentioned SEO ops and again could be a longer video but now we have intelligent information about different devices that can be pumped directly into secops and automate actions could automate responses could automate if we see something from a sensor on a camera in this case we can send the century robot out automatically because it's seen it it's connected into the zero exchange it's one place secops doesn't have to be just sec ops for IT sake it can be secops for physical sake well it's going to have to be has to be right I mean that's coming it's coming pretty fast that's what Jensen said like we're going in a physical world. So right now we see it as AI for us is just another communication flow through our zero trust ecosystem where we are able to provide context insights and then give the customers the ability to act on that and now we can act in a much larger ecosystem rather than just the good old IT space. All right so good way to wrap this up I guess is physical AI coming soon to a business or neighborhood or school near you. Yeah, right. Make sure it's connected securely. And frankly, I think in this world where we have everything connected and a lot of them will be using AI to communicate, , I'm not sure you can get away from zero trust everywhere. I think it's the only way to secure this kind of increasingly connected world we live on. Is that is that accurate? I have nothing more to say. All right. So, well, on that note, we'll wrap up. So, I'm Nathan Hal from Zcaler and Coco. All right. , I'm Zas Caraval Valor from ZK Reaches and thanks for watching. , give us a like, hit that subscribe button, and give Coco a like, too. So, and I'll see you next time on the next episode of Zcast. Thanks, Anthony. [Music]",
        "start": 643.68,
        "duration": 1495.7190000000007
    }
]