[
    {
        "text": " Welcome to ZAS everyone. I'm Zas Carval from ZK Richard and I'm here in Savannah at the Talk desk analyst summit. I'm with one of the customers of talk desk, Melinda. Good day. this is a great case study. You you actually presented the analyst a little while ago. I wanted to capture this on film because I thought your use case was kind of interesting. Before we talk about it though, just a quick intro on yourself and what the company does. Okay. So a little bit about the company. So, it's called Oro, previously named Netspen. Our products are called Net Spend. , it's a prepaid account and a debit account. , focused to help the underserved and the unbanked and those who don't want a bank account to provide another financial option for them. So, our goal is to provide financial empowerment and choice for these customers. Yeah. I like that. The unbanked. Yeah. Yeah. Which is actually pretty high percentage of, right? It is. There are. Yeah. And you know some have bank accounts and they just want another account to you know to be able to work with. Yeah. Now when you think about the role you play you're in the customer experience area right a lot has changed in that space in the last few years right there's more obviously online more digital there's more social right there's more AI and so just talk about all the changes you've seen in in your area in the last couple years. You know, I think the biggest change has been our interactions with our BPOS. , so we have the, you know, I just moved into this role in April, but I don't I don't want to take credit. So, we've had a team in the last year that has been working really hard with our BPOS and to be more collaborative and ask them for feedback on what we could do better if they have any recommendations on process or training or content for agents and for customers. and so, we've partnered with them quite a bit because they're the ones talking to the customers and handling all of that and really working on that collaborative partnership. to be able to improve our customer experience. So with that means we've had to make a lot of changes to accommodate that technology changes, process changes, documentation, knowledge based articles, retraining our agents to have a customer first mindset to hear the customer, you know, to be more empathetic to provide the next level of service. Yeah. Now BO is certainly not a new industry, right? And so what's what's different about today than a couple years ago that's driving this need to retrain? So I think it's our our vision now is to really focus on improving the customer experience and leveraging the BPOS in ways that we haven't in the past. Okay. to be able to elevate that for the",
        "start": 4.72,
        "duration": 335.1989999999999
    },
    {
        "text": "today than a couple years ago that's driving this need to retrain? So I think it's our our vision now is to really focus on improving the customer experience and leveraging the BPOS in ways that we haven't in the past. Okay. to be able to elevate that for the their feedback and recommendations and ideas. and so that collaborative approach has given us another view that we previously you know weren't incorporating in in that same level. So is that being driven by just customers expecting more? Now it's driven by you know our leadership team and our mission and vision to really give customers a better level of experience. Okay. And when you think about that process of going and retraining the BPOS's I mean that's not an easy task. And so what are the some of the challenges around doing that? Well, some of the challenges was understanding that we have the content in a way that they understand so that they can troubleshoot the call or guide the customer appropriately. So making sure that we had the most recent information on our knowledge base that it was in a way that the agents could understand so that they could explain it to the customer. So, it's re-evaluate everything we had simplifying it and making sure that we had feedback from the from the PPOs that they understood what it meant so that they could help on the calls. Yeah. Now, one of the interesting I guess expected changes in the industry that hasn't really manifested itself is this is the everyone talks about the death of voice, right? They got so many alternate channels, self-service, whatever. , but I'm almost seen like a rebirth voice and I'm curious what you know from your customers calling into you and I know financials are a little different because when people want to talk about money they generally want to talk to somebody right and so I'm curious as to what you're seeing in that area versus some of the other channels. Yeah, we I mean we definitely get a lot of phone calls every day from customers. So there are some customers who are digitally engaged. and so you know we want to provide them with that avenue but we do get you know quite a bit of number of phone calls for customers who want to speak with somebody to either validate information or help guide them. you know we have customers in all age brackets and financial brackets and so we want to be able to provide them with a service that they need. But we are seeing though people are becoming more digitally engaged. We're still seeing that many customers want to speak to us. Yeah. And so we want to be able to provide that to them as an option. Yeah. And does that tend to the the use of or the desire to talk to talk to a",
        "start": 172.16,
        "duration": 620.6409999999997
    },
    {
        "text": "becoming more digitally engaged. We're still seeing that many customers want to speak to us. Yeah. And so we want to be able to provide that to them as an option. Yeah. And does that tend to the the use of or the desire to talk to talk to a demographic from what you've seen or is it across the board or [sighs] you know it's also situational you know. Yes that's true. So there there are simple things that customers can resolve on our IVR, our automated phone system or online or on the web and yet still sometimes they just want to validate that with somebody or if they want to dispute a transaction or understand the product a little bit more, they still they still want to speak to somebody. Yeah. All right. Well, so I have to ask you about AI because I think you have to be asked about AI now. obviously in this world of everybody wanting answers faster, AI is the big promise out there, right? That's going to allow us to elevate a customer experience. What are your thoughts on it? Where where is Zoro with that? We're definitely evaluating that right now. We're partnering with Talkesk. so we currently work with them now on a lot of our avenues and channels like email, voice, chat, our knowledge base. So all of our articles we leverage talk desk and so we're partnering with them now in the same way that we are with our our BPOS to understand and validate some scenarios around Agentic AI. we want our CS agents to be able to be focused on the customer to hear them and to solve them and not have to do repetitive things or research things. So we're our goal is to have AI help agents be more effective by taking care of the redundant questions or processes. You know we we are a heavy regulated area and so we need to ensure that there are checks and balances. so AI can help us in to reduce cost to put that money towards providing a better service to customers because now the agent can we you know we can upskill agents that gives them more opportunities and we can give the customer a different level of customer service and are you using AI in a customerf facing way where it'll actually interface with customers or is it primarily behind the scenes I'm going to help the agent do so right now we're still piloting so we haven't implemented anything. but our plans are to have something customer based, customer focused to to just confirm that c you know to get a feel of how customers feel about it. and then we do use it internally you know we do use it to help make certain processes more effective by leveraging AI so that employees and team members can focus on solving a problem or coming up with a strategy and not",
        "start": 316.4,
        "duration": 922.7219999999998
    },
    {
        "text": "feel of how customers feel about it. and then we do use it internally you know we do use it to help make certain processes more effective by leveraging AI so that employees and team members can focus on solving a problem or coming up with a strategy and not we're using it in different levels to be more effective. Yeah. I got to imagine the one of the big wins for you is being able to use it as an agent helper, right? Because nobody takes very good notes, right? , a lot of post call summaries very rarely get, you know, entered properly. And so there's a lot of I think one of the things people don't understand about contact centers is there's an awful lot of heavy lifting on the agent that isn't customerf facing, right? It's just a lot of kind of messy work that nobody really likes doing. Yep. And that's where Talkesk has really come in to help us. , we, you know, they do the call transcripts. They have an AI that summarizes the call. So, the agents able to focus on the customer instead of having to take notes during the call and also just copy the summary that gives all, you know, all of the highle points of the call and then they just add it to the note on the account. That has saved a lot of time and productivity. Yeah. and allows the customer to to hear the customer be more present than having to take all all of these notes. So we definitely have seen an improvement and talk to us has given us that capability. And so for the testing you've done what's the agent feedback been like? Have they been like oh my god it's going to take my job or oh my god this is fantastic. I don't know how I did my job without it. No I think at this point you know we have asked for feedback around just talk desk as it as a whole because we do use it in different ways. , so they do love the summary. They like being able to search for art articles quickly. , and I'm excited to see some of the new things that talk to us is going to roll out here pretty soon that's going to allow an AI to , join the call and be able to , bring up articles that the customer can reference, I'm sorry, that the agent can reference versus having them having to search. So there are capabilities that talk desk is going to bring here very very soon that's even going to help agents even more. Yeah. And so when you think about the future, how are you thinking about this world of like human agents and virtual agents working together and then how you manage that workforce because it it is quite different, right? It is I think they can be very",
        "start": 470.4,
        "duration": 1180.4009999999994
    },
    {
        "text": "agents even more. Yeah. And so when you think about the future, how are you thinking about this world of like human agents and virtual agents working together and then how you manage that workforce because it it is quite different, right? It is I think they can be very your assistant, you know, having somebody to help you to do some of the easy work for you so that by the time you get a call, the AI can help you prep and give you a summary of, you know, the customers calling to dispute. Here's all the information, here are the steps, and it kind of streamlines and helps it even better. because we do have, you know, some goals for our agents to be able to help us upsell and cross-ell. and having AI handle the easy tasks then will allow the agents to be upskilled to be able to do that. And so you know we think that not only will it streamline and make the calls more effective but now we can have the agents focused on another level of customer service and selling and upselling and that will give them more opportunities. Yeah. See I don't know who wouldn't want that. Right. And then so as that happens though then do you think of the agent as being more [snorts] revenue generating versus just just traditional service? So that that is a a new view that we're looking into. I think historically it's been look at as a cost. We think that with AI we'll be able to actually be able to bring another line of revenue by upselling, cross-selling talking about different promotions and different things. And so now we'll be able to look at customer experience as a a potential line of revenue, incremental revenue versus just a cost. Yeah. And so you know when that happens though a lot of the metrics with which you use to measure contact center effectiveness, average handle time, things like that maybe aren't so relevant. So have you has thought through like how you start to measure the how the KPIs in your contact center change? Yeah, we'll definitely need to to sh to make a shift in regards to that to determine well how productive are the agents being and the Gentic AI agent. is that saving us money? How can we also bring in additional revenue? by as I mentioned like upselling and cross-selling are customers still happy, right? So there's certain metrics that we would still want to monitor, but now we would want to expand it to be more aligned with company KPIs and not just the standard, you know, customer experience ones. Yeah. All right. Now, so specifically with Talk Desk, there's a lot of vendors out there that promise AI in the contact center, right? I guess what was it about Talkisk that you thought was so compelling that you wanted to use them",
        "start": 600.959,
        "duration": 1487.4399999999998
    },
    {
        "text": "the standard, you know, customer experience ones. Yeah. All right. Now, so specifically with Talk Desk, there's a lot of vendors out there that promise AI in the contact center, right? I guess what was it about Talkisk that you thought was so compelling that you wanted to use them Yeah, so there were a couple things. So one was, you know, we're a 25-year-old company and so we were ready to modernize and because you're on prem now, right? We were on prem and so this was an opportunity for us to get in the cloud to work with a partner who provides all of the avenues that we that we need versus working with different vendors. So we're going to have our IVR with them, our voice, email chat, our knowledge management. And so that is all in one pl. Our surveys call transcripts, they were able to provide data analytics that we didn't previously have. so they definitely were more they were going to help us expand from a revolutionary standpoint and modernization. And also because they're on the cloud, then they're able to make more changes quicker than something off the shelf. And honestly, it's been it's been the relationship that was also another big component. we've been partnering with them for a year. and as part of that we have seen that they listen to our customer and and agent pain points. They've worked through some of those pretty quickly. We collaborate on our road maps. We're working together and learning together. and with that when we were you know evaluating other AI vendors you know they mentioned that they offered something as well. And so given the experience in the last year and their relationship and you know we decided that we would work with them on that so we're working on a a PLC with them now. Good. And so what do you see as as next in the relationship for you? I guess it's the AI right? Yeah. So right now so we're in in in progress of moving our IVR and automated system over to talk to us. So that'll be the next big thing. Followed by that would be the Gentic AI. So the calls that are not managed through our our IVR and get transferred to an agent identifying the right scenarios to have Agentic AI there to kind of help the customers the best that we can and also help our agents be more effective so they can focus on the right things on those calls. Yeah. All right. And so last question, I'm glad you brought this up. how important was that the concept of that unified platform because most you're not unlike other context you Frankenstein everything right and so when you think about the future and the things you want to do how important was it to have all of those in one vendor you know it there has definitely",
        "start": 757.279,
        "duration": 1779.3599999999992
    },
    {
        "text": "the concept of that unified platform because most you're not unlike other context you Frankenstein everything right and so when you think about the future and the things you want to do how important was it to have all of those in one vendor you know it there has definitely then you're able to incorporate changes It's easier than working with different vendors. So now we can share our vision and our plan with talk desk and they can work on how to help us get there versus having to convince you know several vendors and aligning all the things at the same time. so I feel like that's going to help us move forward more quickly. Yeah. I actually think in the AI era though having all the data in silos would eventually hold people back. So I think this is the direction you would have had to go down eventually. So good good for you for doing that. So thank you. Yeah. anything else you want to add about the company or no so I think just just lastly you know it's great to to work for a company that helps our customers and to be aligned with a partner like talk desk who's going to help us really improve and elevate the customer experience and for our agents they're you know just as important well I can say on behalf of the other analysts it was wonderful having you here typically we come to these things and it's from a bunch of other industry analysts so to hear from someone that's actually using the product is always good to have Thank you thank you for for having me. Yeah. So, , all right. So, on behalf of Melinda, , Gide from Oro, , Zs Caraval from ZK researching, thanks for watching. , hit that subscribe button. I'll see you next time on the next episode of [music] Zcast.",
        "start": 911.279,
        "duration": 1923.278999999999
    }
]