[
    {
        "text": " Welcome to Zcast everyone. I'm Zas Caraval from ZK Research and I'm inside the Expo Hall at WebEx 2025 in San Diego with Monica Name. you're on the collaboration sales team. Yeah. Monica, I think the last time I talked to you was a year ago. It was exactly a year ago today. Yeah. So, so that's exciting. Now one of the reasons I like talking to you is in addition to being a smart person in your role, you talk to a lot of customers. I do. Yeah. And the theme of this event was obviously AI, right? In fact you know G2 talked a lot about in his part of the keynote how there's two types of companies, ones that use AI and ones that are going to fall behind, right? So I'm curious in your conversation with customers, where are they with AI today? What are they are they really excited about it? Are they scared of it still? I think we're across the emotional spectrum with it. I think a lot of customers are really excited, but they're still trying to figure out how they adopt it and get their employees to adopt it because as you've seen, there are a ton of different tools out there that are not necessarily regulated by the companies and everyone's trying to absorb all this stuff and then company data is getting lost and so they're excited, but they're also trying to figure out a way to really put a bubble around it and protect the company's assets. Yeah. I'm still waiting for the first earnings call where somebody misforcasts and [laughter] says, \"Well, there my AI agent said this is what we're going to do.\" Right. It happens. It's going to come right. Yeah. Now, one of the things that in the keynote I think it was very visionary which I liked where they talked a lot about the the evolution of AI and the evolution of work and other they're really part of the same thing where historically it's been people talking to people. Now we're in an era where we have people talking to agents and in fact I think one of the things G2 said was that we're all going to be kind of the supervisor of a bunch of agentic agents and eventually we're going to have agents talking to agents. store in 3 years. The ZS agent will talk to the Monica agent and we won't actually do one of these. Right. So, but and I'm curious is that align with what you're hearing from your customers? It is. I think we're eclipsing more of the Gent AI to your point. We have a lot of companies adopting more of that management of like these AI agents and humans, but they are leaning more towards the AI on AI, but you know, it's only as good as the data that their company has put into. And so, that's",
        "start": 5.759,
        "duration": 253.44100000000006
    },
    {
        "text": "to your point. We have a lot of companies adopting more of that management of like these AI agents and humans, but they are leaning more towards the AI on AI, but you know, it's only as good as the data that their company has put into. And so, that's right now. Yeah. And so, how is Cisco helping them unstuck their position on the data? cuz I do hear that too. Security is number one and data is number two and I think Cisco's got a strong play in both of those. I do. I think we have a really good play. I'm not sure at the keynote this morning. I know you're right up front, but we've announced a lot of really exciting things about ways just to make everyone's life a little bit easier. And so, , it's really working with all of the things that are going on in your meetings and your notes and trying to understand what's happening or really picking up on the sentiment and the tones and conversations to create polls as simple as, hey, I think this meeting needs to move back an hour or , just even with like the experience when you go into the contact center and , helping an agent access information a lot faster, whether it's somebody's calling in about benefits or all these changes and just having everything at their fingertips and making sure that it's qualified and more thorough than it used to be. Yeah. And so in the keynote were there a few of the announcements that you're like yes that that's going to be a home run for me. So you know what I it was a lot of the stuff we were announcing in the content center but I'm also a sucker for anything we do that's device related and so that I like the 26 for the room OS I was like a it's beautiful. It's clean. We can do a clean commercial. So I love when you can walk up to something because what my leader actually says is best but collaboration is an emotional purchase. And so when you can see it and you can touch it, you can use it. They'll buy it. So this is an interesting thing that you bring up and I'm glad you brought up the devices because I know Cisco has aligned their product along three categories. AI ready data centers, future proof workplaces and digital resiliency. And to me it's really the future work the future proof workplace is the AI workplace. And we think of that as router switches, right? Things access points. But the device is a critically important part of that. especially the Cisco device that's got thousand eyes integration and things like that and so to talk about that when you talk to customers are they do they think about the device as part of that or is this still part of a learning process",
        "start": 132.4,
        "duration": 473.4399999999999
    },
    {
        "text": "critically important part of that. especially the Cisco device that's got thousand eyes integration and things like that and so to talk about that when you talk to customers are they do they think about the device as part of that or is this still part of a learning process process I think they see it on the desk and it's a tangible thing but I don't think they fully have grasp what like the role that it plays or to your point like we always say it's like a Trojan horse once it's on the desk and people see it they love it and they learn it and they want to adopt more of it and so we have some customers that are fantastic at like making sure that I mean one of our customers that's has over 400 devices in their environment, right? , and so they're an avid user of our devices. But you have some that are like they just don't necessarily see it as to your point, the future proof workplace yet. And it's really about that distance zero thing that we're trying to get to people. They're people that I've never actually met in person and they're like, \"Hey, like we've known each other for 8 years and we realize we've actually never met in like a physical environment, right?\" So I think we have some customers that are still eclipsing that, but it's definitely gaining fire. Yeah. Well, and and I and I do think that's an important thing for Cisco is to help customers think about the device and the endpoint as part of the overall experience cuz these things for those that aren't really familiar, they're loaded with a bunch of telemetry information. It can detect how many people are in a room, humidity, yeah, all all the stuff. And it really is it's become an environmental sensor. And so even if you don't use it as a device, in fact I think some of the integrations you've got now with Copilot and Zoom solve a lot of problems in the areas of interoperability in theory now you could actually turn a device on, capture data, and then flip that information over to C-Pilot. And so for you Microsoft customers out there, Webex can actually help you get more bang for your Microsoft dollar spend. Sure can. We're all about making sure that we're really like if you have those things in your environments, we want to work better with you, right? And I think G2 said it best on stage today that we're not naive that we're going to there's going to be always a multi- vendor strategy and so we're really trying to make sure to your point that we're helping everybody capitalize on their investments. Obviously we'd love to win every day and all day but we do partner very well. Yeah. And the other part of the Cisco go to market now I think where I've seen",
        "start": 243.92,
        "duration": 690.0009999999997
    },
    {
        "text": "we're really trying to make sure to your point that we're helping everybody capitalize on their investments. Obviously we'd love to win every day and all day but we do partner very well. Yeah. And the other part of the Cisco go to market now I think where I've seen has been the chief product officer is the rise of the platform. Yes. Right. And I think this is an area where historically Cisco had good products, but it was really just a collection of random products. Yeah. And now very siloed. Yes. Yes. Now, so if I want to build a contact center, I need to make sure it's secure. I need to make sure I can manage the performance. And so, you know, so all of the Cisco products actually lead to that. So talk about the platform strategy and how that's helped you really bring more value to your customers. Absolutely. We're really focused on the one Cisco story and I think I came from the portfolio side of the business. So, I understood the value of that, but not everybody who has come in through acquisitions and everything like that. They all just kind of see the the tunnel that's ahead of them. And G2 has done a really good job about making sure that everybody understands the platform play, that we're all working together, that we all understand the value that each person's bringing, and that we can tell that cohesive story. And so, our customers are really just invested in it now. They're like, \"Oh, okay. So, you're not only coming in to talk to me about route and switch or data center or security, like it's truly like a holistic approach now.\" they're like this makes more sense cuz you can tell a complete story versus just puzzle pieces of it and so I think it's it's our customers are really understanding the value now which has been really wonderful. Yeah to me it's a lot like and Ji uses this analogy all the time which I think you stole from me but the Apple ecosystem right I've got you know iPhone, Apple Watch, iPad, you know, MacBook but I can't now switch. Yeah. Oh no invested, right? Because the the experience of being able to do all this stuff together works so well. And I think those magical experiences maybe aren't quite here yet. They're gonna be, right? And you're starting to see it. And I think one of the areas you see is in AI canvas now from a to troubleshooting perspective. Think how hard it was before to troubleshoot you know a a poor performing call. You'd have to look in thousand eyes. You'd have to look in DAC. You'd have to look in control center. Now touch points. Yeah. And now with the AI canvas, it pulls all that together. Right. So that's to me a very basic magical experience. But that's come a long way quickly.",
        "start": 352.639,
        "duration": 914.9610000000002
    },
    {
        "text": "to look in thousand eyes. You'd have to look in DAC. You'd have to look in control center. Now touch points. Yeah. And now with the AI canvas, it pulls all that together. Right. So that's to me a very basic magical experience. But that's come a long way quickly. to make our customers job simpler and easier to your point where it's all cohesive and all works together that's really what G2 and his team have really put together for us. And when that experience is there it makes it our jobs a lot easier to make sure that we're in front of the customers and creating to your point that magical experience. All right. And so to wrap up WebEx positive experience. Yes. Yeah. And this is one of the best ones I've been to in person. They really outdid themselves this year. Yeah. Well, certainly the energy levels here in fact and I think part of that reason is I think AI is now at a point where we've talked about it for so long now it's time to actually put it into motion and so I just interviewed one one of the banking customers here bank first and he was saying that now they're really aggressively trying to roll the AI agents out to their customers and so the time for talk's over it's time to deploy right yes yeah okay absolutely okay now I want to shift gears a little bit and actually I was wrong. The first time manager wasn't at Webex. Oh god. It was a global citizen. It was a global citizen. And you were there representing Covenant House and Cisco had just announced a new investment in that. And the reason I want to talk about it is because you're actually on the board of Covenant House Pennsylvania. I am. Yes. Yeah. And so those maybe aren't familiar with Covenant House. That is what is that? It's a beautiful organization. So we really focus on homeless youth. And so you were one. I was a homeless youth. Yeah. , at the age of 16, I had nowhere to turn. And organizations like Covenant House saved my life. They're all about making sure that they rehabilitate youth. They help them. They give them emotional support, physical support, they help get them on their feet, they feed them, and it's all unconditional. And so, this organization is truly just there to provide for these youth that have never had a good experience, right? , whether they were kicked out by their families because of drug use like my mom was, , or whether, you know, they were kicked out because of their gender or identity or, you know, just whatever the cause may be. , it's a place to turn. It's a place to turn. It's a place where you don't have to. I grew up in North Carolina and it was a lot of things where people if",
        "start": 467.84,
        "duration": 1139.2009999999996
    },
    {
        "text": "because of their gender or identity or, you know, just whatever the cause may be. , it's a place to turn. It's a place to turn. It's a place where you don't have to. I grew up in North Carolina and it was a lot of things where people if give something in return. So, it's either you have to come to our church or be a part of our congregation or Covenant House isn't like that. It's all unconditional and they truly just want to see these youth be the best versions of themselves. And so, it's a privilege and an honor to sit on their board and just have the opportunity to be at a phase of my life where I can give back to these youth. Yeah. And so, what are the kinds of things you guys are working on now? I know you got the sleepout coming, right? Yes, we have the sleepout. So, Covenant House Pennsylvania just announced their sleepout at the Philly Stadium. It's November 20th. So, if you want to sign up, find out how to reach me. But, , it's really great. So, we have the November 20th sleepout. That's where we do a generous portion of our fundraising. And then we, , have other events like throughout the spring, but the 20th is actually across all the United States. And so, there's like 50 some locations that are going to be participating in this. And it's a great opportunity to give back if you really love. Are you going to sleeping on the field? We're sleeping out on the field this year. This is the first time. Normally, we're on the streets in Philly. So, we got a little bit of an upgrade this year, but , this year it's in the Philly stadium. I welcome you to join me. Yeah. and October 20th. November 20th. November 20th. It's a little cold in Philly. It's a little chilly, but I mean I'll tell you what, if I'm not if I'm not travel, I'll come down and do that. And the and the goal of that though is to just show people one night what it's like to sleep on the street, right? Yeah. So, it's overall goal is to raise critical funds needed for these youth, but then it's also to give people an inlook like in-depth experience of what this is actually like. , and so to, you know, not be able to sleep throughout the night to understand what it's like to be in the cold or the elements or be exposed or have people around you maybe where you're not really sure like who they are, what's happening. , but these kids face it way worse. So, it's really insightful too because we have youth that come and share their stories and that really just want people to understand that like they're trying their best to get back on their feet. And I will tell you one",
        "start": 581.92,
        "duration": 1327.6800000000005
    },
    {
        "text": "happening. , but these kids face it way worse. So, it's really insightful too because we have youth that come and share their stories and that really just want people to understand that like they're trying their best to get back on their feet. And I will tell you one I had people look at me and they're like, \"Oh, you were homeless.\" Like shocked by it. I'm like homeless has no discrimination. , and that's the part that people don't understand. And so I almost doesn't look like the people that you see sleeping on the street. It could be anybody who's just trying to fight to live a better life. and so you don't know what's going on behind closed doors ever, but this is an opportunity to really come and experience this with the youth and really understand what it's like and then to really be a part of the organization. Yeah. And when people go through that, especially people like, you know, me that maybe live a pretty privileged life, right? does that wake them up and they go, \"Man, that was really hard.\" Yeah, actually. So, we have a lot of people that we were created at first time sleepers last year and they woke up the next day and I'll never forget it. One of them just had tears flowing down their face and like I had no idea. Like they had seen the sleep out and they were like, \"Oh, it just kind of felt like a little commercialized and then they got to interact with the youth and then they were like, I didn't sleep all night. I'm tired. I'm hungry. I want to go home. I get to climb in my bed.\" But these kids don't have that. So, every day they're just waking up and exhausted. And it was like this very eye openening experience for this person. and they they were just so grateful that they had that experience. Yeah. And typically, how many people show up to one of these? So, we're hoping to get 750 this year at the Philly Stadium, but in years past, I would say we normally have like 300 350 at the Philly location, but again, it's the entire United States is participating. So, you don't only have to be Cisco to participate. but Cisco, I want to say last year, I think our goal this year might be like two or three million. but we have quite a few Cisco employees that do it and we welcome our analysts and partner friends and everybody. Well, and Cisco, I think last year announced they were making another donation to it and they've been a big supporter of it. really from Chuck all the way down, right? So, yeah, Fran's heavily involved and she's done beautiful things. Patrick Morsy, we have a lot of really great sponsors. I think G2 even participated in California last year and so one thing",
        "start": 676.959,
        "duration": 1529.4400000000014
    },
    {
        "text": "it and they've been a big supporter of it. really from Chuck all the way down, right? So, yeah, Fran's heavily involved and she's done beautiful things. Patrick Morsy, we have a lot of really great sponsors. I think G2 even participated in California last year and so one thing philanthropic and so this is a cause that almost everybody's behind. Yeah. Well, that's great. I'm glad you're doing that. So, any other anything else you want to point out about Governor House maybe for my audience? Just find like everybody thinks that you have to do something big and so what I would say is start small. If you're not sure how to give back to your community or even if it's homeless youth, then just try to do something really small and first steps only step you have to take. Okay. Well, if you look in the YouTube description below, you will see a link to come and help us and you can register. You can donate there. You can donate. I'm all about donations. You can sleep out with us. You can do anything. $35 provides a septic pass for youth. $5 provides a hygiene kit. $50 provides a sleeping bag. so these are all tangible things that the kids get right away. Yeah. And so I will also include Monica's LinkedIn handle and then you can you can reach out and if you want to learn more. All right. So we covered WebEx1 and Covenant House did you know thanks for your time but more than that. Thanks for all you do with Covenant House trying to help people not be in the position that you were in or at least get out of it. Right. Thank you for the platform. It's always a privilege to have this discussion with you and thank you for highlighting Covenant House is something obviously I am near and dear about but it's a privilege to be a part of this with you. Well, I would I would think that most of the people here haven't gone through what you've gone through, so it's very brave of you to help. Everyone has a little bit sharper lens. My my plane just was a little lower than everyone [laughter] else's. So, all right, Monica, anything else you want to add? No, thank you. This has been great and I appreciate it. I look forward to seeing you soon. Yeah, sleep out. Yeah. So, this Yeah. So, on behalf of Monica Name, I'm Zas Caraval from ZK Research and thanks for watching. make sure you give her a like, right, and hit that subscribe button and I'll see you next time on our next episode of Zcast. Thanks, Monica. Thanks. [music]",
        "start": 779.12,
        "duration": 1725.219000000002
    }
]