[
    {
        "text": " [music] Hey everybody, welcome to this I think we're up to episode eight of what's new in CX. I'm Zas Caravala here with my co-host Bonnie Doli, also known as the people in pink. we for whatever reason we dress alike today. You look good in pink, Z. Yeah, I like wearing pink. and funnily enough we're doing this at something like 11:00 Berlin time where I am and Wanita, you're in the Philippines, so it's actually tomorrow for you, right? It's tomorrow for me. Yes. Yeah. Well, buy some lottery tickets. Let me know what the numbers are. So, [laughter] anyways, it's we talked last week, but we had a big week for CX. We had a lot of CXE type things. the first one I want to talk about, I'm going to call this the news of the week. Was it the biggest announcement? probably not, but it follows a theme that 18 and I have been talking about for some time and that is 8 by8 real recently announced his workforce management solution which would be included as a standard native capability in every 8 by8 customer contact center se at no additional cost. and this is you know interesting because we've been talking about this whole coming together of WFM and CCAs. I think it it increases 8 by its TAM somewhere between the five to10 billion range depending on how you measure it. Historically as you know oneita WFM was a bolt-on used variant or something like that to bold collaborate or bolt it onto your product. More and more though we're starting to see vendors build their own. Zoom built their own. AWS built their own, WebEx built their own, Ring Central bot community, WFM. And so what did you think of this and why is there such momentum in building your own? Yeah, I think that is is momentum. We've been we've been talking about the Z for a good bit of time, right? And so just following this trend is so exciting to see because it's something that one we've been talking about. So it's kind of like this prophecy being fulfilled. And I think that the reason it's happening is because customers are wising up to hey we can't just consider the customer aspect of delivering contacts to the business. We also have to consider the workforce whether that be h AI or whether that be actual human workforce. the workforce is becoming hybrid, right? And that's what workforce management does, right? So, you know, when the 8 by8 news broke, I was like, this is amazing. It's I feel like is it's well overdue for the industry, right? When a customer buys contact center and they say, hey, I want to deliver a great customer experience. I want to make sure that my customers get to the right person or the right resource if that's AI at the right time in the right place so that they can get",
        "start": 0.654,
        "duration": 337.1410000000001
    },
    {
        "text": "a customer buys contact center and they say, hey, I want to deliver a great customer experience. I want to make sure that my customers get to the right person or the right resource if that's AI at the right time in the right place so that they can get service. We have to consider workforce right like we have to consider who's going to be on the other side of that engagement whether that's AI or human and you need workforce management to do that. So, it's like it's like going to the car dealership and them saying, \"Oh, yeah, you get seat belts with your car.\" You know, like yeah, I I I I think I need that, you know, like that's not a that's not a congratulations. That's like a it's a safety prec precaution or or a saying, oh yeah, you get an engine today with your car. It's like, okay, yeah, I kind of need that, you know? , and so I think as the industry pushes AI more and more into the forefront and work forces become more hybrid, it's only responsible that CX leaders , , begin to think, okay, if I'm delivering this interaction to the business, whether it's voice, email, chat, social, what's going to be the resource, human or AI on the other side of that equation to handle that? And that means I need seat bills, right? That means I need workforce management. Yeah. And what's interesting is 8 by8 included it at no charge which you know and you think 8 by8 actually serves kind of mid-market down market right. and so those customers may not have used the tool before just because they don't want to pay up or even if they want to sometimes you got to go with separate contracts. and you know, one of the things that's been interesting to to see here 18 is when you look at who's rolling this out as an integrated part of their stack. It's not the traditional contact center vendors, right? It's you know, ring bought it, they're you can think they came from the UC side, so did WebEx, so did Zoom. Amazon and Nice of course have been leading this for a while. But you know, where is 59? Where is Genesis? What are they doing in the space? I know both of them OEM and you wonder first of all what this means for them long long term and talk desk as well and then also if you're a customer right and you've and you've got an RFP and you're checking the WFM box how do you actually know it's native and fully integrated or not like what do you advise your customers yeah so two things you hit on right where is you know talk desk and 59 and Genesis in this you know because we're seeing this being rolled out from who we would necessarily expect like more",
        "start": 174.16,
        "duration": 622.9010000000001
    },
    {
        "text": "native and fully integrated or not like what do you advise your customers yeah so two things you hit on right where is you know talk desk and 59 and Genesis in this you know because we're seeing this being rolled out from who we would necessarily expect like more that are more CCAST stronger vendors and I I I think one of the reasons we're seeing that is because the one vendors that we associate with stronger on the CCast side they're really hedging their bets on this AI you know and agentic AI and and these things which I don't I don't necessarily think is wrong because again as AI push more into the forefront into the hybrid style workforces, somebody's got to solve for it. However, I think that's why we're not seeing them focus as much on WFM. I think this it it will create a gap though when it comes to user adoption when it comes from a customer perspective because again when I talk to customers they want AI they want aentic AI they have budget for AI they have all these different things but they are not at the point to where they're actually even rolling out AI and agentic AI they're still trying to figure out how many people do I have here today how many people do I need where do I you know do these different things. And so I think this creates a user adoption gap between the CCast vendors that are hedging their bets on AI and Aentic AI and all the different things. It puts them further ahead than where the customer actually is. And so I think that's where we're seeing them at right now today. And then when we look at the second part of your question around I actually forgot what the second part of the question was around yeah I just think from industry perspective I'll change it a little bit like if I'm a standalone WFM vendor or I'm a varant or something am I doomed like do do I have to now go acquire some CCAs assets or how long do you think the runway is for a standalone player you know socass has always And traditionally the first purchase, you know, it's it's not like people typically go and say, \"Oh, I need to figure out my workforce.\" Like typically you have customers that deliver to the business and then you figure out workforce. I don't know if that's chicken and egg and egg and chicken, you know, like which came first and which one should. But but I don't think the short answer to my your question is I don't think they're doomed. I think that they do need to think differently though in how they approach the customer journey. Right? Again, customers are delivered to the business and then we are saying okay, how do we resource and serve those customers? I say this all the time.",
        "start": 318.8,
        "duration": 930.3390000000005
    },
    {
        "text": "I don't think they're doomed. I think that they do need to think differently though in how they approach the customer journey. Right? Again, customers are delivered to the business and then we are saying okay, how do we resource and serve those customers? I say this all the time. regardless of size, business, vertical, whatever, right? Regardless of how much money they're making or not, they they have three goals. Ser, get customers, right? So they have to get customers. They have to serve those customers. So they have to have the resources whether that's employees, AI or whatever to serve those customers. And then they have to do so profitably. Like that's the every organization has to do that. And so when where workforce fits into that equation is and vendors that are workforce focused is they have to be able to tell a story on how they help their customer get customers, how they help their customers serve those customers with employee resourcing or resource resourcing and then how they help their customers become profitable. If they can tell that story, then even as a standalone option, as a standalone solution, they're still in the game, right? Because every company has to solve for those three things. Yeah. All right. Well, it's certainly changing. Interesting times. I don't think it'll be long before hopefully we'll see another WFM native. So, but good for good for 8 by8. I think they've got a good product and it's good to see him add these agencies, too. I like Sam, too. He's a good guy. Second up was a big week for Ring Central. They announced earnings. they had an investor event that actually I spoke at I did a panel out with a couple partners and but on the product side they announced a whole bunch of different AI tools. So I've got a list here because I couldn't remember them all. They added through their agentic voice AI communications solutions they or sweet. So they rolled out something called air which is their AI receptionist which I think is an interesting product for companies because nobody wants to hire receptionists. they they have an AI virtual assistant. So this is an interactive voice assistant that can do things like provide call summaries, message translation, things like that. They have something called u ACE which is their a they really like their acronyms by the their AI conversational expert. so this is something that you can talk to that'll help you unlock you know business insights. They they also announced ring whim which comes from which came from the community acquisition. So that's their quality management, workforce management, interaction analytics and screen recording. and then their customer engagement bundle which is can think of it as call center light for Ring EX customers. So you would think of in fact one of the use cases I talked to one of the partners as like if you have",
        "start": 475.599,
        "duration": 1226.5790000000002
    },
    {
        "text": "management, interaction analytics and screen recording. and then their customer engagement bundle which is can think of it as call center light for Ring EX customers. So you would think of in fact one of the use cases I talked to one of the partners as like if you have to bring in a contact center to help with outbound notification the buses are running on time or it's a snow day or something. Typically have somebody in the office you can just automate that right now right and so you're not going to buy you know Genesis for that right but you you you would use something like that and so I think for you know Ring they're doubling down on AI. I think this opens up a lot of new market opportunity for them. And I was pleasant justly surprised. I you know I think I've got a almost kind of a renewed interest in what they're doing on the CX side, but they certainly loaded up on AI features and so anything there catch your eye. Yeah. I what what I find particularly interesting about Ring and in and all of the AI things that they're rolling out and solutions that they're rolling out is more so timing. Right. I find the timing of it very interesting because remember we covered the news about ring and community, right? So they went and did this WFM acquisition or or merger and and so now they have the WFM component of things, right? They've been talking about quality. They've been talking about all these components of how we make sure again that resource part of the equation is accounted for. Now then now they're layering in this AI stuff right which is a hybrid workforce. They're now saying hey air reception this you know the the the ACE right the one that you're mentioning about ACE. So now they're layering in all of these AI components, which is again back to my point about the hybrid workforce. You can't deliver interactions to a business and then try to figure out on the back end, okay, well, who's going to who's going to serve it? You know, you figure out who's going to serve it, right, with your resources. Oh, this is going to go to a human or this is going to go to AI and and and and then you actually figure out how we deliver that to the human or the AI. And so the timing about how Ring is going about their solutioning and and product roadmap is really interesting to me because it feels very thoughtful in the manner of which they're saying, \"Oh, yep. WFM, we're going to need that. We're going to need the quality pieces. We're going to need all of these.\" Oh, yeah. Now, let's loop back around to this AI piece, which again, like I said, I'm I'm I'm a I love AI and I love",
        "start": 626.48,
        "duration": 1517.5400000000002
    },
    {
        "text": "they're saying, \"Oh, yep. WFM, we're going to need that. We're going to need the quality pieces. We're going to need all of these.\" Oh, yeah. Now, let's loop back around to this AI piece, which again, like I said, I'm I'm I'm a I love AI and I love and agistic AI and all those different things. I think timing matters in how they rolled this out in their product roadmap. So I love what that's my my kind of two cents if you will on Ring. Yeah. When they first rolled out Ring CX, it was a pretty basic product, but they've come a long way. And so it'll be interesting to see longterm how they manage the relationship with NICE and Ring CX. But they can certainly address, you know, right now what they're saying is, you know, small market, mid-market, simple context center use cases. Ring CX more advanced ones. It's a nice partnership. but there certainly is a blurring in the lines happening there. So we'll see what they do. Now, next up on the docket was Zoom. they acquired a company called Bonsai who maybe maybe are not all that well known in CCAT circles but you can think of them as a an all-in-one client engagement and business management platform. It's actually designed for small businesses and solarreneurs. So you know folks like you and I. and it has a a number of you know think like a unified workspace with tools for client relations, project tracking, contracts, invoicing, payment. It's a think of it as kind of a mirroring of like QuickBooks and CRM, right? And so, , for [clears throat] customers, you know, for Zoom, , you know, Wanita, they're really a fascinating company because they they started with the core meetings, they added CCAS, but they've added docs, they've added mail, and they are really trying to be that all-in-one work platform. You know, like Eric's vision is you're going to work in Zoom all day long. And now, you know, as a small business, you can do a lot of your, you know, your record keeping, invoicing, things like that. And these are all customer related things, right? Things. So, they're they're not kind of their definition of an adjacency is certainly different than the rest of the industries. And you know I I think they're moving into in fact you know from a TAM expansion perspective I know that kind of solar prneur software markets like $7 billion and stuff and so it's choosing to go down this path is really interesting because it's not something you would kind of expected from a UKcast vendor. Yeah, Zoom is very interesting to me because Zoom feels like an ecosystem in and of itself, you know. you know, way to put it. Yeah. Yeah. They Zoom is an entire ecosystem in and of itself. Like I don't I don't typically think about Zoom, which I I",
        "start": 773.6,
        "duration": 1835.779
    },
    {
        "text": "vendor. Yeah, Zoom is very interesting to me because Zoom feels like an ecosystem in and of itself, you know. you know, way to put it. Yeah. Yeah. They Zoom is an entire ecosystem in and of itself. Like I don't I don't typically think about Zoom, which I I So, it's a good thing and it's kind of a a negative thing, right? and in and that I don't place Zoom in contact center box, right? When I think about Zoom, when I think about Zoom, I think about the entire work experience or just the human experience because you have chats, you have your meetings, you have video, you have conference room, you have hardware, you have like you have it's an entire ecosystem. So, you could totally right get away with saying I'm a Zoom, you know, like you hear you hear people say this, oh, I'm a I'm a Microsoft shop. you could get away with saying, \"Hey, I'm a Zoom shop.\" Right? like, \"Hey, I have docs. I have video. I have this.\" And and and completely and be fine, right? And so when I think about Zoom, I think of them more of an a ecosystem player. If if I don't even know if that's a real category or not, but making one up today. I I think of them more of an ecosystem player. Yeah. No, it's they've really taken this concept of adding adjacencies to the next level. And so we'll see what they do. But you know, the one thing I'll say about Zoom is in general workers, people like Zoom. People like working in Zoom. I use Zoom and I've got access to all the tools because it's easy to use. the interface is pretty easy to understand. and this whole concept of meetappy has extended to work happy. And I think they're going to have some success with this. So you know, good for them. So good. Yeah. All right. anything else you want to add? think that covered a a pretty good chunk of news from the week. No, that was I think we it was a a pretty exciting week. I I was excited when I saw 8 by8. You know, I'm WFM lover at heart. so I I was pretty excited about that. so that that was that took the cake for me for news of the week. What took the cake for you for news of the week? Well, I I I thought the eBay one was just because it it's just following a trend that we've been talking about now for a while. So, it seems like every week someone's someone's doing this. So, yeah. Yeah. Who's next? Who's who's gonna be next? Who Who do you think's gonna be next? I I am still expecting Tom Bravo to buy 59 and merge him with Verit. So, okay. I I think that makes a lot of sense. So,",
        "start": 934.399,
        "duration": 2107.058
    },
    {
        "text": "week someone's someone's doing this. So, yeah. Yeah. Who's next? Who's who's gonna be next? Who Who do you think's gonna be next? I I am still expecting Tom Bravo to buy 59 and merge him with Verit. So, okay. I I think that makes a lot of sense. So, We'll be We'll see. We'll see. We've been following this trend for a while. So, I'm excited to see what what happens. Yeah. So, all right, Wanita. And I guess I'm going to see you in person in a couple weeks down in Savannah. Yes. At Talk Test. I'm I'm looking forward to that. Yeah. So, all right. so, I'll let you get back to your days since it's Saturday there in in the Philippines and the clock is going to strike midnight here for me in a couple minutes. So on behalf of 18 Koli I'm Zas Caraval from CK Research saying thanks for watching and we'll see you next time when we have more to talk about in what's new in CX.",
        "start": 1071.919,
        "duration": 2177.938
    }
]