[
    {
        "text": " Welcome to Zcast. I'm Zas Caraval from ZK Research and I'm here inside the Expo Hall, WebEx 2025 in San Diego with Joe Ber, the one and only Joe Burger from Worldwide Technology. We're back. Yeah, we are back and another WebEx one. , what' you think of it? I think it's great. A lot of announcements. , you know, I it's funny. I've had a couple conversations around this today. I think in the past couple years AI was sort of this new thing everyone was talking about. Now it's just it's out. It's being used. It's practical. It's real. but I think you know Cisco came out with a lot of stuff today right off the bat. So there's a lot to talk about. I thought the the vision statement G2 laid down there about connected experiences where it's really going from people talking to people which was distance zero and then people talking agents people to AI to AI. Yeah. And I thought that was kind of an interesting thought process and but I think that's the direction we're heading. I'm curious from your customer base like you deal with a lot of large enterprises that aren't exactly most big enterprises aren't cutting edge, right? They want to make sure that all their eyes are dotted and tees are crossed before they move ahead within that spectrum of distance zero to connected experiences. Where are we here? It's definitely a mix. I think it's really still the people to AI everyone's trying to figure out. We've got a lot of customers who have deployed AI and they're out of their pilots and they've already got their next use case starting to get defined. So, they're deploying it and then there's other customers who are like, \"Whoa, my data is not ready for this. Hold on, I don't want to touch it yet.\" So, it kind of runs the gambit. , but yeah, we we we work with customers of all sizes to to kind of help them get through this journey. Yeah. So, I'm glad you bring up the data because when I when I talk to customers, what holds them back, right? I think there's a strong desire to do AI, right? But when you ask, well, what's holding you back? There's obviously the security and guard data and security and guard and even the data management piece of it, right? And I think a lot of what Cisco's done with their portfolio and the whole platform story has been about trying to secure your contact center, secure your meetings, secure Zoom, right? Or whatever AI platform you want to use. And are you finding that's working? Like are people buying into the platform story now? It is. And I think Cisco putting that security wrapper is such a big piece of it. I think G2 has finally started putting all these different business units of Cisco together and telling that",
        "start": 5.759,
        "duration": 281.2000000000001
    },
    {
        "text": "And are you finding that's working? Like are people buying into the platform story now? It is. And I think Cisco putting that security wrapper is such a big piece of it. I think G2 has finally started putting all these different business units of Cisco together and telling that had to kind of do that in order to to kind of move the company forward to have this sort of one Cisco vision. I also think where he's you know he talked about today between the AI data center futurep proof work and digital resilience. I think that message is finally starting to resonate with customers. Yeah. Now, so and again you you know you talk with a lot of large enterprises that typically tend to have siloed IT organizations when you think about those plays they're all cross architecture correct maybe not data center well even that to some degree right how are you able to navigate that from a a sales perspective and help customers consume it but still maintain their organizational structure well I think part of it is actually able to tell the story to the right audience it's not necessarily the IT director who's going to care about this cross domain thing, you know, the telecom guys is probably not going to care so much about the networking side, too. So, you have to go up a little bit to talk to customers. The other part of that, too, is also then making all making sure you can consume it simply. It's not just telling the story, but it's how does the customer actually buy it, consume it, then ultimately adopt all of it. So, Cisco, I think, is getting better on the consumption side in terms of how it's licensed and how they can actually sell it. , so yeah, I mean it's sort of evolving, but I think the story of it is finally resonating like, okay, here's where the future of work is. I get how the network now affects my video endpoints and how I use observability tools to actually understand what's going on. , so I think that story in itself is starting to really work. Good. Good. Yeah. And then, , I also wanted to ask you about a lot the the future proof workplaces has really tied into return to office. Yeah. Right. And I think a lot of the what they've announced AI in the devices workspace designer the new feature I can't remember what it's called they rolled out today about being able to use AI to model the room create like a digital twin yeah have you used those tools yet or we're starting to test them out. I mean the digital twin idea I think it's great because you can actually see what is going on within my room and like does this make sense? So, I need to put another mic in the ceiling or another",
        "start": 146.72,
        "duration": 546.5610000000001
    },
    {
        "text": "those tools yet or we're starting to test them out. I mean the digital twin idea I think it's great because you can actually see what is going on within my room and like does this make sense? So, I need to put another mic in the ceiling or another customers a chance to actually say, hey, what's going on with my space? Then also, how do I repeat it? Because what we get into a lot is customers say, hey, I want to take this room, but I want to do 50 more of them just like it. They want to make sure that what they put in the room is going to work every time. Cisco doesn't isn't cheap, but it does offer really a a tremendous experience, right? It does. And so without something like Workspace Designer, you could put the stuff in and then you're going to wind up with holes and audio and video and then and then people are going to think, well, the stuff doesn't work, right? And so then you get this lesser experience and that makes you look bad, makes the equipment look bad. And so something like that actually helps you model out before you deploy it what the experience is going to be. Yeah. I would say their workspace design tool for companies like us where we can go to a customer sit down with them and go okay here's what your large meeting room looks like here's what we would recommend in there size of screen distance from the table it does make it easier for us to help customers understand like what are the right tools to go put into that room and then how do I build a catalog of those tools say hey I need 50 small rooms 20 you know medium rooms it just makes a lot easier to plan versus going room to room every time. Yeah. And you know a couple years ago when I talked to you I asked you what you want to see out of Cisco and you had said more thousand eyes more thousand eyes and they've loaded that yeah everywhere including the devices and I was just talking to somebody about this that so should the device be considered part of that office infrastructure just like just like you would do Wi-Fi just like you know as we talk about you know LDOS for a lot of these big networking deployments or these campus refresh refresh is how do I start including the video endpoint as part of that refresh because you have to start looking at it more holistically and I think you know Cisco even talked about today around the is it the network enabled video yes they had a term for it yeah where it's now all kind of connected but you want that visibility into the room into the branch and in the campus and they've now allowed things like thousand eyes to",
        "start": 282.88,
        "duration": 789.9210000000005
    },
    {
        "text": "talked about today around the is it the network enabled video yes they had a term for it yeah where it's now all kind of connected but you want that visibility into the room into the branch and in the campus and they've now allowed things like thousand eyes to these different segments yeah and as we go down this AI path and we start having agents you know automated processing and stuff I'm not sure how you can separate security, networking, and observability. To me, those it all starts to come together, right? Yeah. And I think Cisco's Splunk acquisition because Splunk's been a big help for that, too. Yeah. It was very timely and I don't know, Jo, it just seems like we've been waiting for the story for so many years and now it's like it's finally here. I think the story's come together and what we're also really excited for is AI canvas. Yeah. We showed today the collaboration piece coming into I got to tell you from an AI perspective, AI for IT operations has probably one of our hottest topics that customers are asking us about because they're now seeing the value of AI from an IT perspective and they're trying to figure out how do I implement a lot more of these tools and honestly it might be a tool reduction at some point for some of these customers but I think they just want to say how do I take all the information and how can AI actually solve the problem or predict the problem before and it becomes a problem now and AI canvas is going to do a lot of that. Yeah. Well, this is where I think when you talk about the early use cases of AI, people talk about CX, right? Easy one context and there's but I think number two is the IT operation side and I think the commonality in both those cases is we talk a lot about is AI going to take jobs or is it not in IT and in contact center they can't hire enough people. Yeah. Right. And so if I can use AI to close that gap, that's a big win, right? 100%. Yeah. Yeah. Yeah, especially contact center has been a really easy justification for us. It's pretty easy to go look at contact center numbers. You know, how many calls am I getting? how quickly can I get an agent off a call? What's meeting summarization wrapup? If you know those numbers, you can quickly come up with your ROI of like, hey, AI is going to solve me this. It's going to get my agent back on a call within 1 minute versus 3 minutes. It's an easier way just to say, you know, it makes financial sense to go down this path. I think it is going down the same thing with how do I resolve tickets quicker? How do I troubleshoot something faster? Yeah.",
        "start": 406.96,
        "duration": 1035.6810000000003
    },
    {
        "text": "on a call within 1 minute versus 3 minutes. It's an easier way just to say, you know, it makes financial sense to go down this path. I think it is going down the same thing with how do I resolve tickets quicker? How do I troubleshoot something faster? Yeah. ask you about and this has got to be music to your ears is the openness which with the platform itself. That's great. So we saw Eric on a video with G2. We who would have thought. Yeah. From that CEO of Zoom. I didn't have that on the bingo card this year. They they talked about co-pilot integration. The Zoom and Microsoft integration that they announced. Yeah. A a couple years ago. Zoom and Microsoft were were literally mortal enemies. In fact, if you mention those two companies inside here, they'd run you out of here. But time changes. Now, from your perspective, I'm sure every customer is saying, \"Look, we got Zoom, we got Teams, we we want to use it all together.\" This has to make your life easier, right? We love it. Especially, I mean, you know, about a year ago when when Cisco really got into the Microsoft Teams game, we just started seeing a tremendous amount of activity selling Teams rooms. I think customers wanted that level from a company like Cisco to get in that game, especially with Microsoft. Now with the announcement of Zoom, it's just, you know, it's hard to beat that that combo. But to your point, the interoperability out of Cisco these days, it's not something we would have expected years ago. And it's for us because we work with all these different partners in this ecosystem, it just makes our story more compelling, too. Now, yeah. Well, when I was a reseller, the the one thing, in fact, the first maybe 15 years of my career as an analyst, what people would always say is they're proprietary. They're trying to lock you in, but that does not appear. Yeah. So that's a good thing and for customers, I mean, it's just a huge value ad. You know, they can go, you know, Cisco can work with all these different meeting vendors now and it just gives you a lot more options than you ever had. Yeah. All right. Any other thoughts from the show? No, I think it's been great so far. A lot of announcements, everything AI. , yeah, we're excited. Yeah, I do think in a in the not too distant future, we'll stop talking about AI. Yeah, it's like saying cloud or the internet. In fact, I was talking to Aruna, their CMO for WebEx about this. She put on the AI summit that was and I said, you know, if you're doing this event in 5 years, the event kind of failed, right? Cuz it cuz I remember back in the day I used to go to internet",
        "start": 531.12,
        "duration": 1273.4420000000011
    },
    {
        "text": "to Aruna, their CMO for WebEx about this. She put on the AI summit that was and I said, you know, if you're doing this event in 5 years, the event kind of failed, right? Cuz it cuz I remember back in the day I used to go to internet imagine going to internet conference today? Tell me more about this internet thing. Yeah. Yeah. And AI is going to be the same way. In fact, the somebody asked G2 that on the analyst Q&A and he said it's eventually going to be embedded into the fabric of everything we do. And I think that's right. when you want to go today, if you want to go to a restaurant, you Google it, right? You look it up. You'll just ask whatever agent you have on there about it. Maybe WebEx agent, right? Or something. Yeah. We've been trying to get a little more purposeful around our AI go to market. You know, one thing that we're doing a lot of is this notion of like workforce AI, AI for IT operations, AI for contact center. Get a little bit more like, hey, where's the purpose of it? What's it trying to solve for? Where's the ROI behind it? So, we've been spending a little bit more time there. Yeah. , all right. But I I agree like in five years it's just native. Well, let me and let me do you the sol giving you a shout out for your AI proving ground. If you want to test AI, come to the AI proving ground. Yeah. Which is a a virtual environment that you can try all things AI and leverage the equipment that you have from all these all the major vendors. Yeah. Come see what the latest and greatest is, see how the interop works between all of them. All located within our advanced technology center. Yeah. And so if you don't want to buy all the equipment yourself, rack and stack it, call Joe Burger Worldwide. Call me. You got it. Yeah. All right. So on behalf of Joe Ber from Worldwide Technology, I'm Z Carval from CK Research. Always great to get a partner perspective and I'll see you next time on my next episode of Zcast.",
        "start": 650.64,
        "duration": 1446.4820000000009
    }
]