[
    {
        "text": " Welcome to Zcast everyone. I'm Z Carval from ZK Research and I'm here in the sports tech area at the Consumer Electronic Show in Las Vegas. I'm with Rachel Yang from a company called Lumastar. Rachel, you got some tennis, you got some basketball set up here. first intro on yourself and what Lumar does. Yeah. I'm Rachel and I'm the CMO of Lumiar. Lumisar is a sports technology company. and we're focusing on providing AIdriven technologydriven products to make professional training training available to everyone who's passionate about sports. Okay. So we're at the tennis station right now and you got a you know tennis driven role. What are you what data are you trying to capture and I guess tell me how the system works? Yes. so the major difference between our products and the traditional tennis shooting machine is our d our whole machine is driven by AI and the vision too. So we have two cameras on top at at 1 meter high of the machine. it sees you see the full port and see the balls including the ball status like top st spin and also the ball trajectory predicts the trajectory and also the speed and then it sees the person clearly. So if it will correct your forms and it will detect your full core and just see if your ball's landing at the right position, if it's in and out and it will do a full analysis of all your ball landing points. And how many data points are you capturing? I would say as many as all that is needed for a tennis player. like the ball landing spots, your your your your swing angles, your forms, and where you standing, and the the ball speed, the trajectory. yeah, anything that that's helpful to improve your skills. And is the goal here to be a training aid or a coaching tool or both? both. Okay. Yeah, both. It does both. So, you don't really need another person or a coach to be with you while you have the machine. Yeah. And so ex so if I recorded myself swing what kind of advice would it give me u footwork handling? Yeah footwork your if your body is is on the correct position we have the technology demo over there you will see your joints and then the depth distance of of your position. yeah and then once you swing it will just give you suggestions like a professional coach. Okay. And then is it paired with a mobile app or is there It is. Yeah. The app we the camera not only it records it will analyze you but also records all the videos for you. So it will just automatically editing the videos for you. You can share on social easing. Oh you can. Okay. And I see you're wearing an Apple Watch here, right? Or or this is a Lumi Star wristband. Okay.",
        "start": 5.279,
        "duration": 351.92100000000005
    },
    {
        "text": "will analyze you but also records all the videos for you. So it will just automatically editing the videos for you. You can share on social easing. Oh you can. Okay. And I see you're wearing an Apple Watch here, right? Or or this is a Lumi Star wristband. Okay. machine while you're standing on the other side of the court. For example, I can do the demo for you. Because of the limited tech limited space, we can only do a very limited demo asking the machine to hit one of the letters. let's try hit L. Yeah. The one of the technology that we have behind it is having the ball it hits a very accurate point. Hit a hit. I Oh, cuz it's the smallest. Yeah. Yes. It's just And that robot itself. Yes. I've noticed there's how many cameras? Like can you talk a little bit about the tech that's in that? Yeah. So there are two cameras and at 1 m high. Both of the camera two cameras are very different features. So one is a wider lens. So it captures the full cords the width make sure the width. The other one is a tally lens. So it make sure the the the the the distance it covers the full court and it will also see very clearly on the other side how you how your movements as well and the camera make sure the machine can follows your lead if you wanted to. and it does the editing like I said the editing and recording. Oh that's cool. Okay. And then is it and I assume the software uses AI and it Yeah. Yeah. It's AI show. Yeah, we have to talk a little bit about the AI features. Yeah. So, we have a advanced the chips built in the machine. So, it does all the algorithm behind you and then the calculation takes only.1 second. So, it sees you, collects all the data it needs and then does its calculation within.1 seconds and it gives the ball back at you which which is a very adaptive ball. Okay. And so do you actually have to have the the the robot serve you the ball or if I'm playing with somebody, can it just record us and still give us information? Yeah. Yeah, you can take the camera away. You can take a camera in your pocket and then hold it somewhere and the camera will works as a sports camera. Oh. Oh, okay. And so the camera itself is detachable from the robot. Yes. Yes. And if you buy the standard version and later on if you want to upgrade to the pro version, you can just buy the camera. Okay. And if people want to learn more about this, where where would they go? they go can go to our website which is lumisar.ai and also follow our Instagram. it's Lumisar online global. we will",
        "start": 180.8,
        "duration": 654.0030000000002
    },
    {
        "text": "you want to upgrade to the pro version, you can just buy the camera. Okay. And if people want to learn more about this, where where would they go? they go can go to our website which is lumisar.ai and also follow our Instagram. it's Lumisar online global. we will our social. All right. And now you're also doing a basketball demo here. Oh yes, let's do it. back with Rachel. We're here in front of the basketball shooting area. we got to watch our heads in case. Yeah. [laughter] And so what what are you doing here for basketball? So for this basketball similarly we have the AI technology and then AI vision to it. we got three cameras on top of the basketball. One watching the ball, two others watching the person. So the basketball actually follows you wherever you are in the port it shoot the ball right at you after you do this gesture. Yeah. So traditionally if you wanted to practice shooting long distance shooting you have to shoot from a distance and then run back to pick up the ball. But for this one you don't need to do that. And you can see that's happening right now. Yeah. It's shooting at you wherever you are. Yeah. And also we have the competition mode where two people can stand at certain points and shoot the ball at different person. Oh, and you can have a different little game or something. Yeah. You get a little punishment. Yeah. Yeah. And similarly to the tennis one are you you're capturing the video and showing shooting angle. It it analyze your forms. So you know how important forms is well form is everything. Yeah. you're practicing the basketball, but it does record all the forms and then we'll have the AI report for you after you done a a certain session of the training. Yeah. And I'm a terrible basketball player. You have no form. So, [laughter] this one you probably can become a pro. Yeah. Yeah. Well, that's really cool. Okay. And and and so this again is all camera vision. The cameras are mounted in what in the device that there are three cameras you see over there. Yeah. and one other thing that is very important to mention is our machines very easy to deploy. that's why we can sell to a lot of the individual consumers. So currently a lot of the basketball shooting machines is standing still in the basketball station because it's just too bonky and it's hard to move around. But our it's very easy to deploy. you can take a look in here. So you just need to click one button, it extend and then collapse by itself within one minute. Oh, that's interesting. Okay, great. All right. And so what's next for you guys? You looking at other sports or yeah maybe t soccer, baseball. Yeah, we we want to tap into basketball and tennis first because I",
        "start": 339.36,
        "duration": 933.6020000000001
    },
    {
        "text": "one button, it extend and then collapse by itself within one minute. Oh, that's interesting. Okay, great. All right. And so what's next for you guys? You looking at other sports or yeah maybe t soccer, baseball. Yeah, we we want to tap into basketball and tennis first because I that. What's amazing about this technology though is and I was talking to the NFL about this. five, six years ago, camera vision really wasn't good enough to do this. So they they had to put sensors all over the players, right? Now with camera vision being so good. I mean you guys are capturing so much. There's no sensors. There's no like the player doesn't have to wear anything. They just shoot. Right. And even you know I'm a big golfer and before you'd have to put things on your body to track your swing back in all the camera vision now. So the fact that you can actually do analysis of shots with just cameras and tennis actually just shows how far the technology has come. Yes. Yes. Yes. Thanks to the technology, we can all become a pro. Yeah. Yeah. Yeah. So all right. Anything else you want to add? yeah, that's about it. Okay. Yeah. Well, I appreciate your time and that was a great demo. And again, it's loomstar.ai. If people want to find it, can they buy it off the site? for the basketball, they can buy in May and then for the tennis they can buy in March. Okay. All right. And so from the Luminar stand with Rich Yang. I'm Zas Caraval from ZK Research and thanks for watching. give us a like and also hit that subscribe button and I'll see you next time on my next episode of Zcast. [music] [music]",
        "start": 480.639,
        "duration": 1080.974
    }
]