[
    {
        "text": " Welcome to Zcast everyone. I'm Zas Caraval from ZK Research and I'm here in Las Vegas at the Consumer Electronic Show. this is Brian. I'm with Brian Tippens SVP of social impact for Cisco. congratulations Brian. You're actually Zcast 1 for 2026. Awesome. I'm happy to be your first guest of 2026. Thank you. And this so this is an interesting show. You run purpose at Cisco. A piece of purpose. for piece of purpose. Yes. talk about what that entails. So I work for our chief people, policy and purpose officer, Fran, who I believe has joined you on ZCAST in the past. And in that I look after social impact and inclusion. So it's all about how we leverage Cisco's resources, our people, our dollars, our advocacy, our volunteer hours, etc. to make maximum positive impact in communities around the globe, both internally and externally. And so we are here at the CES, which is consumer show. Yes. why are you here? What brings you here? Well, I'll say I've been at CES for decades. is I'm a tech I was going to say nerd. Is that appropriate? I'm a tech enthusiast all my life and I work for more consumer based companies like HP for many years of my career. So I'm accustomed to showing up every year seeing the new technology that's coming out and even as I've joined Cisco about three years now and focus more businessto business and consumer there's certainly a lot of lessons and applications that we take from technology roadmaps that are applicable even for us inside Cisco. Yeah. And I think nerd's okay. I think that's okay. Good. Is that appropriate? Good. Yeah. I think you know one of the things I was interested in here and I know you are from our conversation is really this kind of intersection of purpose and tech you know tech for good if you want to call it that you know we've had a lot of problems in the world Brian for a long time some have not really been solvable but now with the advent of a lot of robotics and AI they are so what are some of the things you're hoping to see here well I'll say you know at Cisco we think a lot about you know the fact that we've long run a good business that allows us to do good in the world. We think about how we could use those resources to maximize positive maximize positive impact in communities and that's largely by investing in early stage technology nonprofits that are doing unique things to leverage technology for good. And so I'm interested in seeing how some of those applications come to life here at CES. There's long been this focus on wellness around wearables and the the visual technology and and ways to think about our own health and wellness, but it's evolved towards a lot of assistive technologies. Yes. How we're leveraging",
        "start": 5.52,
        "duration": 273.1200000000001
    },
    {
        "text": "seeing how some of those applications come to life here at CES. There's long been this focus on wellness around wearables and the the visual technology and and ways to think about our own health and wellness, but it's evolved towards a lot of assistive technologies. Yes. How we're leveraging impaired or hearing impaired or have mobility impairments. And so I'm interested in seeing how we're using that technology to help those who might have those impairments kind of advance their own abilities. In fact, I thought those technologies really came through last year and I'm really curious to see how how they advanced last year. I know they had a almost like an exoskeleton that went around somebody that couldn't walk. Definitely, right? So now they can get up and move on their own. And you think about the implications that people in nursing homes, people, you know, things like that. in fact I was talking with the the the say of a hospital like if you watch Jensen's keynote one of the things in video he talks about the next wave of AI is physical AI which are robots and things and you think well what kind of impact could that have in society and the CE of this hospital was saying that if they can get autonomous machines Yeah. to do things like like a wheelchair be take people to the curb you're not all of a sudden you're freeing up clinician time. Exactly. And you know, it's funny, Brian. I don't know how you're feeling this on AI, everybody talks about AI taking people's jobs. Totally. Well, whenever I talk to people like at this hospital, they can't hire people fast enough. Exactly. Yeah. Right. And so, is it taking jobs or is it Not at all. You know, I love the what our our chief product officer G2 Patel always says, we shouldn't be worried about losing our jobs to AI. We should be worried about losing our jobs to people who know how to use AI better than we do. And I think frequently think about the benefits of AI. think about cost efficiencies or reductions in workforce because we could do more with less people. I think we have to evolve past and I think we're getting there to how we could use AI for the impacts. What are the results we're truly trying to drive? The exoskeleton that you talked about, that's one. There's some cool assisted technology around the wearables for those who may be visually impaired who can aim at a thing and have AI tell them what they're looking at. Am I looking at an inspire expired milk carton? Am I looking at the what I want to see in the grocery store, for example? Right. So, I love that we're evolving past just thinking about AI for cost savings and efficiency and think about true impact. Yeah. In fact, I think one of the",
        "start": 141.76,
        "duration": 513.44
    },
    {
        "text": "inspire expired milk carton? Am I looking at the what I want to see in the grocery store, for example? Right. So, I love that we're evolving past just thinking about AI for cost savings and efficiency and think about true impact. Yeah. In fact, I think one of the Brian, is that we've talked a lot about how we're going to raise like corporate productivity, but I I think one of the differences between this and the internet era was a lot of the value of the internet was how it would change things society. And I don't know if anybody's really been that I suppose visionary at an industry level talking about how AI is going to change things in society. Right. I think we're going to evolve there. I think we're kind of at that point right now where we're again moving past just thinking about efficiencies to think about the ethical applications of AI but also our obligations as tech employers whether we're B2B or B TOC and thinking about how we're upskilling and reskilling workforces to better leverage that technology but also demystifying AI for those underrepresented communities that can benefit the most but maybe a little bit afraid of AI right now. And so we think a lot about skills development, training, and upskilling individuals so we can all play a role in this future of AI. And so here's the impact I think it can have from a global perspective. If you think about what the internet did was it democratize access to information. Yep. What AI does to me says to me is it democratizes access to expertise. Definitely. And so now if I'm oh I don't know when I you know somebody who's interested in weather patterns, I don't know something like that. You know historically you you need to go you you need a lot of training and things like that but with AI a lot of the basic analysis is now done by machines and it's the interpretation of that analysis that becomes important and so you know just like we saw on the internet a lot of jobs and things move overseas we saw a lot of economies kind of grow out of nothing I know talking to France he's very looking forward to seeing you know how Africa you know Ivory Coast Nigeria things like thatly grow. I I do think you could see a big changing of economic status around the world. I I think so. You talk about Africa specifically, I think the folks, especially the young folks on the continent sort of overindexed on the use of AI, also overindexed on aspirations to be entrepreneurs and business owners. I think we've got this obligation, this opportunity to kind of tip that balance, right? just using AI and SHA GPT as a search engine on steroids to really like pull out that expertise and prepare some competitive advantage. And so I think",
        "start": 264.08,
        "duration": 781.0390000000003
    },
    {
        "text": "aspirations to be entrepreneurs and business owners. I think we've got this obligation, this opportunity to kind of tip that balance, right? just using AI and SHA GPT as a search engine on steroids to really like pull out that expertise and prepare some competitive advantage. And so I think Yeah. And so from a Cisco perspective, how do you then take a lot of the stuff that is consumer first and work that into the work you're doing because I know Cisco does a tremendous amount of work at a country level helping them think of how to digitize the economy. Most people think of Cisco as plumbing, right? But then it's the applications that sit on top of the plumbing. Yeah. That become important. So how do you marry those two things together? I think it's a couple things. I think about when I talk about communities, we think first about our internal communities. We're 90,000 team members around the globe operating in many localities around the globe. And so we think a lot about how we bring these technologies in to enable our own workforce internally, right? To provide opportunities for all. We talk about, you know, our mission or purpose is to power an inclusive future for all. And we say we can't have an inclusive future without having an accessible future. So having that for our own team members is one and then two everywhere where we aspire to do business even if it's from business to business standpoints we can be a contributor in those communities right we can uplift communities through our investments our investments in skills delivery we also make a number of financial investments and early stage startups that are investing in these new technologies sometimes it's Cisco adjacent technologies sometime it's not because we all benefit at the end of the day yeah and one of the things your your boss Fran and I have talked a lot about is that the work you do on purpose Some people look at it with a bit of a skeptical eye, right? And is just Cisco , you know, obviously you're doing the world some good, but is it Cisco really taking a loss here, but her her stance has always been you can do good for the world and also have be good for business and your thoughts on that? I completely agree. We say that a lot. Good for the world, good for business. And it's multiple levels. I think it starts inside the four walls of the company of our 90,000 team members at a time. We're in a fight for the best and brightest talent with a lot of the companies who are here at CES, right? They had a lot more brand gravitas. Exactly. They've got great brand gravitas, but not all of them have the same commitment to employee engagement and allowing employees to contribute in their communities and kind of addressing",
        "start": 399.6,
        "duration": 1009.2000000000008
    },
    {
        "text": "talent with a lot of the companies who are here at CES, right? They had a lot more brand gravitas. Exactly. They've got great brand gravitas, but not all of them have the same commitment to employee engagement and allowing employees to contribute in their communities and kind of addressing an ethics standpoint and morality standpoint. Right? So I think we are able to attract a great workforce by the work that we do that drives more innovation, more longevity, less regrettable attrition. I think that's important. But also in communities, you know, communities buy from comm from companies that invest in them. And I'm convinced that the work we do around purpose helps to open the doors with buyers even at a businessto business or governmental level who look for an ethical player like a Cisco that's proven to do investments in community. So I think it's it's not mutually exclusive by any means. Yeah. And I know it's funny because I met with Fran at the end of last year and she said she gets a lot of questions about is Cisco going to back off, right? Because there has been sort of a global reshifting of priorities and she said not at all. In fact, why? And I'm glad you're not because if someone's, you know, not going to take the reigns on that, and it needs to be a company of some scale. I think so. And it's because we've got the scale. We've also got the history. We're a 40year-old company. We just celebrated our 40th birthday. And again, we've long run this good business that allows us to do good in the world. And we've been able to draw that line between doing the good and good for the business at the same time. They're not mutually exclusive. I think when they are when you do these investments that are purely for philanthropy, while it's a great thing to do, it's not sticky. It won't last through the tough times, but I think we do a great job of tying to business value both internally from a workforce standpoint, but also with our customers and markets. Yeah. Well, what I'm looking forward to, , you know, again, is just this is challenge. You and I aren't getting any younger. Oh, yeah. Exactly. Right. And so, you think about for a long time. Yeah. You think about the ability to see better through augmented reality glasses. Even things like I was on the show floor last year, they had speech interfaces. People with arthritis maybe can't use they're not not as dextrous as they used to be. Now they can be. And so I I think you know a lot of times we'll look at these advanced technologies some for the young but to me it's really some and I'm also really interested to that point in the convergence of different technologies. I know I saw I think it was in the Samsung Amphitheater last",
        "start": 515.2,
        "duration": 1246.640000000001
    },
    {
        "text": "think you know a lot of times we'll look at these advanced technologies some for the young but to me it's really some and I'm also really interested to that point in the convergence of different technologies. I know I saw I think it was in the Samsung Amphitheater last together various aspects of technology. Your wearable knows that you just did a workout because you were just on the bike that's also tracking. It also knows what's in your refrigerator because it's a smart refrigerator. Based on that, here's some recommended recipes that you could use to refuel and recharge, right? So, as we're getting older and need these assisted technologies, I think there's this new integration that didn't exist. So, here's something I think that the industry needs to do a better job too is and is connecting the dots. Yeah, exactly. Like I I know, you know, when you go to a doctor, they may pull some records, your watch is going to tell you something, but who's connecting the dots between the data that your watch gives you, the data that your, you know, maybe other trackable does, , and what your doctor has, right? Like, and if there's something that is noticeably different, why can't something flag different that Yeah. I think we're starting to get there where this Apple Watch talks to the Whoop band, talks to the various devices, talks to your Pelaton, bicycle, right? I think we can opt in and combine some connecting of the dots between various platforms. There's still these regulatory barriers between HIPPA and privacy to bring it all together, but I think we'll find ways over time to get past that to really find that connecting the dots that adds value for all of us. All right, Ben, just one more question. So, we're in 2026. Yep. Cisco last year reset that goal. You hit the billion people impacted now 40 communities. What would success be for you this year? So we set that big goal last year 40 communities over the next 10 years to invest in 40 connected resilient thriving communities across the globe. We announced our first few western North Carolina and Mumbai, India. We previewed Johannesburg, South Africa. So we started I think success for me is being able to execute in those few that we've announced and to announce a small handful more. We're learning as we go. As with most big audacious goals, you set a goal before you know exactly how you're going to get there. And so, we're building while we're executing. So, for me, success in 2026 means announcing a few more of those communities and being getting to show the successes that we've already had where we've kind of put a stake in the ground. All right. Well, Brian Tippens, , fighting the fight for people that can't. Thanks a lot. I appreciate that. Thanks. Thanks a lot. Yeah. Thanks. And",
        "start": 636.079,
        "duration": 1490.8010000000008
    },
    {
        "text": "of those communities and being getting to show the successes that we've already had where we've kind of put a stake in the ground. All right. Well, Brian Tippens, , fighting the fight for people that can't. Thanks a lot. I appreciate that. Thanks. Thanks a lot. Yeah. Thanks. And always good to hear what you what's happening in the world purpose. So for on behalf of Bri tip from Cisco I'm Zas Carav from ZK reaching. Thanks for watching. give us a like and also hit that subscribe button and I'll see you next time on my next episode of ZCast.",
        "start": 759.92,
        "duration": 1520.5610000000006
    }
]