[
    {
        "text": " Welcome to Zass everyone. I'm Zas Caraval from ZK Research and I'm here at NICE's industry analyst conference in Vienna, Austria. I'm with David Gustoson, your VP and GM of platforms for ICE. Correct. Yeah, it's an industry title for a for a company that we think of as an application vendor. So, I want to dive deep on the platform topic. before I do that though, since I do think you have kind of a unique role here, maybe an intro on yourself and what you do here. Sure. as you mentioned, David Augustson, GM of our platform. so I'm responsible for our our AI platform CX1 Empower. and that encompasses a number of different things. So part of that is the underlying shared elements of our platform. So we have many different products that are built on top of CX1 empower. they have a lot of shared componentry and that needs to be managed and built and run by the platform team. Yeah. And when you use that term platform, I do notice that that's a term that's banded about the industry kind of willy-nilly. Sure. some are platform vendors, some aren't, but within the context of nice and what you're trying to do, how do you define? How do you think about what a platform is? Yeah. to me is a platform where because I think some people think of a platform or a a suite at times as something that has it's built on the same architecture it has single sign on it has the same tenant administration and and things like that which obviously our our platform does but I think the more important thing isn't about that it's about what one critical element is data it resides in the same data structure the second is that the applications are not just in the same location, but they operate off of each other. So they are operating in in concert and in tandem and they can hand off capabilities and workflows and things to each other and it almost operates like one product as opposed to many products that have just been put in one architectural location. Yeah. In fact, I I wrote a post for Silicon Angle just published today that talks about how you can't Frankenstein CX anymore. And that's typically what we've had it. And so when I think about how how I think about your platform is it's really built around the unified data set for everything not just CCAs related but CX related. That's right. at least part of control. Now I can't help but notice that this pivot to platform also coincides with the industry shift to AI. I know it's an obvious tie together, but from where you sit, why is the shift to platform important to be able to maximize what you're trying to do with AI? Yeah, everyone talks about AI in every domain, every capacity, any industry. to me, and I'm very passionate about",
        "start": 5.759,
        "duration": 339.2799999999999
    },
    {
        "text": "I know it's an obvious tie together, but from where you sit, why is the shift to platform important to be able to maximize what you're trying to do with AI? Yeah, everyone talks about AI in every domain, every capacity, any industry. to me, and I'm very passionate about most important thing for AI is data. So, , in order to drive value from AI, in order for it to be accurate, , to be successful, you need really good data. Mh. , that's one. If you're building models, but almost more importantly, if a model is executing, if an AI model is executing and taking action, it needs to have the appropriate data to provide the context , in that moment and to provide the direction and the background and the insight about what should it do at that time. Data is critical to make sure the AI AI acts accurately. , the best way to have data for AI is to have a platform where all of that data and as much data as possible exists in a common AI ready data foundation layer in a platform. , so that all the applications that sit on the platform can access a common data element and the AI can be as accurate and execute as best as possible. Yeah. In fact, I think of when I think of those Frankenstein solutions you know that you partner for workforce management or whatever those might give you inconsistent inconsistent insights across the different you know bolted on components because those datas are in silos and so then you're leaving it up to the agent I suppose to figure out which of those two insights is correct right that's exactly right and I just the agent and [clears throat] I think you what you meant even the AI agent Right. Yeah. Yeah. Exactly. Right. And there's two different solutions that are both interacting with a customer in different ones that are both operating on different data sets. And in that case, you're going to have a disjointed experience. Yeah. It's not going to be as accurate. as opposed to two AI applications that are operating off of a common data set and not just a common data set, a common AI model that is at the platform layer that those applications are then then using. Yeah. Now earlier this year Nicebot Cogni who many people regard as one of if not the leader in conversational AI and now agentic AI how do you think that adds to the platform and what was the rationale behind buying it versus maybe building it yourself? Sure. you know in terms of building versus buying one of the things we looked at is there are a number of players in the conversational AI space. that already have a pretty good head start. we have the benefit I think as a platform to be able to we have many many customers that are using different",
        "start": 174.879,
        "duration": 646.3219999999998
    },
    {
        "text": "buying one of the things we looked at is there are a number of players in the conversational AI space. that already have a pretty good head start. we have the benefit I think as a platform to be able to we have many many customers that are using different them are integrated partners of ours. so we're in a unique space where we have the ability to really not just find out what people are doing but actually see what they are doing with our customers on our platform and evaluate which ones are are the best. So I think that's helpful in terms of figuring out the optimal technology solution for us and for our platform and our customers. but I think the big benefit that Cogni provides coming in and there's a big data play here. So Cogni, you're right, is the leader in conversational AI with the data that they had access to today. You plug that into a platform that is as large and impressive as CX1 empower and it creates this compounding effect in terms of the data that Cognagi has access to when it executes things like automated insights that you referenced. all the experience memory and data that a customer has had across the platform that makes Cogni even more powerful and then you take that Cogni data all the interactions that a customer has with a conversational AI solution and that goes into the platform and now the rest of the platform and solutions have access to that data as well. so it has a huge compounding effect. Yeah. In fact, one of the slides that you put up that I really liked was the flywheel effect. and just talk through that about how that sure it it it creates a compounding effect but it also creates sustainable differentiation and if executed on correctly if you are the leader it should actually let you pull away. Right. Correct. Yeah. Yeah. That's correct. Once the leader always the leader in this case. So you know we're we're coming in with a a really large impressive foundational AI ready data layer. So we have more data than anybody else in in this domain. With more data, you can drive more insights for your customers and for your application solutions, which then drives more automation. Mhm. When you drive more automation with AI, that drives more business value for your customers. As your customers get more business value, three things happen. They expand the footprint at their location for more agents. They buy more applications. and then you have references. So we get more customers that come into the platform. So as you have more agents, more applications, and more customers, you create more data. Yeah. And quicker. And now that you have more data, you continue that process of now you're drive able to drive even better results and even better automation and even better business",
        "start": 336.4,
        "duration": 942.2419999999996
    },
    {
        "text": "into the platform. So as you have more agents, more applications, and more customers, you create more data. Yeah. And quicker. And now that you have more data, you continue that process of now you're drive able to drive even better results and even better automation and even better business loop. Yeah. What's amazing about that data is actually machines creating the data, right? And the and so the better your service becomes, the more interactions you have and the more data the machines even create. And in fact the I was at the Splunk conference earlier this year and they were because you know they're all about data management but they were saying that I think last year 55% all of all data created was created by machines not people anymore. And so this flywheel effect becomes increasingly important because it's you know humans have a certain capacity they can work at machines don't. Correct. That's exactly right. Y yeah, one of the other you brought up an interesting value prop for nice and you felt that nice not only had the most data but it was also the best fidelity or high fidelity and talk about what that means. Sure. Yeah. Sure. So you can have lots lots of data. You can have a ACD data of a call came in and here's how long it took and the agent that took it. you have raw interaction data, a transcript. So there's all this data that a system kicks off that is being generated and created because it has to be you know in that in that system. , but then there's derived data on top of that raw interaction data. And I think it's really critical to figure out in this environment in space, what's useful by an AI system or what's useful by different applications. And so with with many many native applications in the platform, they are coming to the central data team and saying, I want to know the all the reasons and intents of these interactions. I want to know what actions agents are taking on calls. I want to know the outcomes. I want to know the likelihood to buy. I want to know the sentiment. I want to know their you know so so you have these and then what ends up happening is over we didn't just wake up today and say we wanted this data platform. We've been doing this for years. and we built en we started building enlightened AI models six seven years ago. looking at the agent behaviors that correlate to seesat looking at things like intents and so we have really high clarity on what is occurring in an interaction and on our platform with this derived data that we've generated. So not only do we have massive amounts of data, we have an immense clarity about what's happening, what's occurring, what does a customer want to happen, what's happened in",
        "start": 486.56,
        "duration": 1240.2429999999995
    },
    {
        "text": "high clarity on what is occurring in an interaction and on our platform with this derived data that we've generated. So not only do we have massive amounts of data, we have an immense clarity about what's happening, what's occurring, what does a customer want to happen, what's happened in AI systems. Yeah. So when I think about that, that's not data for data sake. It's correct. Data with a purpose for outcome sake. Yeah. For outcome sake. Yeah. Yeah. Maybe that's a good way to think about it. It's it's it's data that drives outcomes versus what's the outcome you want to have happen? What data do you need to understand what's needed to be understood so you can deliver that outcome? Yeah. Versus data is noise which I guess yeah now when I think about a platform from a definitional perspective there's you know having that underlying asset that provides value data as you talked about. in fact I think you know it's funny these MQs and waves and stuff look at a lot of the speeds and feeds. and I think over time they're going to have to change their definition to be more platform focused versus do you have feature 852 you know versus this vendor but anyway so that's one component the other one's APIs and scalability which I think you you've showed and then the third one is ecosystem and you called out some interesting ecosystem partners and I think it it's fair to say nice historically hasn't been super ecosystem focused but I have noticed over the last year or so there's been a change of attitude in the And you talked specifically this morning about Snowflake, AWS, SAP and Salesforce and so talk about the importance of ecosystem for you and then what those four vendors bring. Sure. And service now and service now. Yeah. Sorry. Yeah. so it is important if you're going to have a platform and you want to be the leading platform that drives the most value for your customers and CX doesn't mean you can always do it yourself and customers are going to want you to do it yourself. So you have to have an open and extensible platform. and we have a number of ways that we do that. We have a number of hubs that allow other solution providers to sit inside of hubs. we have the four strategic partners that you mentioned and we will have more. It's a big focus for ours. Those were all signed this year and there's a big focus from Scott our our new CEO and the entire leadership team of it's really critical we have a yeah Scott seems very eos it's very important to have a a growing strategic partner ecosystem and from my lens that I talked about today that's about data but there's many other reasons and go to market of why why that's important we also have our CX",
        "start": 636.64,
        "duration": 1519.3639999999996
    },
    {
        "text": "we have a yeah Scott seems very eos it's very important to have a a growing strategic partner ecosystem and from my lens that I talked about today that's about data but there's many other reasons and go to market of why why that's important we also have our CX program we hundreds I think we're probably over 400 dev one partners that has grown very significantly in the last two years. It was not a I will say it wasn't a huge focus for us two years ago. It is a huge focus that program is probably growing around 50% year-over-year in terms of number of providers that we have on the platform as an integrated dev one solution provider that either plugs a product gap of ours in some cases. So, Cognagi was a dev one provider before the acquisition because we didn't have have our own native solution there. so, it can plug a product gap or it can just provide choices to customers who may already have a solution they like to use and are used to and want to use it on top of our our platform. Yeah. And you know, I during the Q&A I poked you a little bit, you know, for for Dev1 and where it is today. But in fairness to nice and I suppose the industry if you had invested tons and tons of resources into dev one two three years ago I'm not sure it would have result in anything because I don't think the industry is ready right the the the communications industry historically has been very insulated [laughter] and didn't really think platform or you know or or partnerships and so that's that's been a big change and it the other impact that this is going to have I think now that you're heading down this path I I think you're going to see the decision making of the your CX platform in the AI era in a lot of cases move away from your traditional contact center manager to the seauite, you know, and I I was talking with a I was texting a partner friend of mine last night and he said almost all our deals now are seuite, right? And that really presents an interesting opportunity for nice to just raise its overall value proposition of what it does, doesn't it? I think that's right. Yeah, I think I think it does change in terms of our and and we're moving that way when you look at we're expanding the addressable market for us of not just you know in the a while ago it was front office humans now you're front office back office middle office humans AI agents it's a it's an expanding market and opportunity for us and it does also then that drives that up more to the seuite I think that's also where strategic partners are really critical and important is they have a good",
        "start": 777.76,
        "duration": 1792.644999999999
    },
    {
        "text": "you're front office back office middle office humans AI agents it's a it's an expanding market and opportunity for us and it does also then that drives that up more to the seuite I think that's also where strategic partners are really critical and important is they have a good decision does go up market and they want to make sure that a platform that they have is going to operate well with their other large platforms that they've made investments in as an organization and know that there's a a good relationship between the two. Yeah. In fact, I think the biggest misunderstanding Wall Street has when I talk to them about this industry is they believe that in fact, a lot of them hate the space right now because they think AI agents will remove human agents which creates destroys the economic value. But now that you're addressing not just front office but back office, middle office, while AI agents, yes, and AI, while there may be a net decline in the number of physical agents that do outbound service, right, I think there's just going to be huge uptick in the overall usage of platforms like Nice. That's right. And look, we've [clears throat] we've built our product suite and our platform and our company to win either way. Yeah. So, you know, if if that transition doesn't happen fast, I think it will, but if a transition doesn't happen fast, we have the products and capabilities to [clears throat] make sure that the that the human side of that equation is leveraging AI tools and capabilities on our platform as much as possible. If that transition happens more quickly to, you know, conversational AI and and full AI agents, we have the solutions to provide and do that as well. And I think that also if you're looking for a a company [clears throat] that can help you throughout that journey and make it seamless in terms of that transition, you want a platform that can do both and makes it seamless for you but also seamless for your customers in doing that. Yeah. And on your last slide with this you the last bullet talked about compounded value creation and I and I see that obviously with you and your ecosystem partners the that's why platforms work is because you create that but for your customers there's a lot of compounded value creation and can you maybe give some detail on what you're thinking there? Yeah. [clears throat] Yeah. I mean it cogni is a great example. So let's just say there's a c you know we have customers that have Cognagi and CX1 empower and those were independent organizations separate data models you know there there wasn't a lot of interoperability between the two in terms of of how they how they functioned. you bring those into play and you merge those together and obviously the",
        "start": 915.92,
        "duration": 2082.6459999999984
    },
    {
        "text": "have customers that have Cognagi and CX1 empower and those were independent organizations separate data models you know there there wasn't a lot of interoperability between the two in terms of of how they how they functioned. you bring those into play and you merge those together and obviously the 40 plus native applications that sit in CX1 there's more if you get down to a low level but the big buckets like quality you know feedback management co-pilot it's not like you combined cogni with a quality management product and there's an effect there you combined it with all these other things it creates this compounding effect where All of them get more value as a result of that and Cogni gets value because of all of those. So as a consumer, a customer of ours, you benefit from that that combination. As we continue to create new products, there'll be many new products in the coming years. Orchestrator is one we've talked a lot about here that's been out for the last year or so. We'll likely do more acquisitions. We have done a number of acquisitions. as every time you plug that in, it creates this huge compounding benefit for our customers of adding that onto a platform. Good. And so just last question, you know, the Halloween's almost here, so we're winding down 2025, looking ahead into 2026. what can I look forward to from your organization [clears throat] next year and and what are some of the things I should look for to tell me that the platform strategy is indeed working? Sure. Yep. I think the key themes of focus for us one is even if everything stayed static how do we create more AI ready data so and that's working you know almost think about data and platform as a product right as opposed to service with a so we do we have I have a VP of product for data it's a product manager and his job is to go figure out how we evolve that as a product that is used by the platform so there's a big focus around working with other people. What what additional data sources do we need that is enable able to drive business value? I think the next key area is to continue to pull in data from other sources. So how do we get data from our strategic partners? How do we get data from our dev one partners? from all of our integrated applications and solutions so that for our customers all of that data resides in a common location for them. there's a lot of focus there to get more and more data into the platform. and then I think the the next area next year focus will be really making sure that we work with our strategic partners and others of how to take CX data, interaction centric data and really drive immense value outside of what is",
        "start": 1062.88,
        "duration": 2397.3659999999995
    },
    {
        "text": "more and more data into the platform. and then I think the the next area next year focus will be really making sure that we work with our strategic partners and others of how to take CX data, interaction centric data and really drive immense value outside of what is into the middle, the back office and even outside into areas like sales and marketing of really trying to create huge value with that with that data set. So those are probably the the big things we'll be focused on in the coming year. All right, David. Well, nice looking to become the data platform for the CX era. Great. Thank you. CX era. Yep. Really appreciate the time. Anything else you want to add? Nope. Nothing. Thank you so much. All right. So, on behalf of David Gustoson from NICE, I'm Zas Caravalo from ZK Research and thanks for watching. give us a like and also click that subscribe button. I'll see you next time on the next episode of Zcast. [music]",
        "start": 1222.64,
        "duration": 2470.913999999999
    }
]