[
    {
        "text": " Welcome to Zcast everyone. I'm Zas Carval from ZK Research and I'm here at the HPE stand inside the expo hall at NRF 2026. Huge show. I'm with Bob Friday, head of AI for HPE networking. U formerly from Juniper Networks. Came over from that acquisition. Bob, this is actually your first time on with me. It's a shocking that you've never been on a ZCAST with me before. Well, I it's amazing Z is I've known you since my Cisco days. It is amazing to see. I know. It's like we we got to correct that. You got to be on more often. So, you are head of just before we get into some of the NRF things and the new products. Just a quick on yourself, Bob. Yeah. So, I'm Bob Friday. I was the co-founder of Mist went to Juniper and now I'm the chief a officer at HP networking driving the self-driving networking vision. Yeah. Well, it's certainly AI networking become a big thing. So, we are here at NRF and I want to talk about some of the trends. Before we get into that though, I do know that HPE announced a number of new products. , of course HP and Juniper are one company now. , any that you want to highlight? I know there's a new switch some new analytics. Some some mis products as well. Yeah, Z is we have a new CX 6000 switch connected to the central cloud. This really optimized for that point of sale type of user experience. 8 port switch. Perfect for like the retail store experience. Yeah. So, it's fanless, right? wireless every port's gig PoE I believe every port's POE yeah and so to me the value of that and you know maybe going a little more is just simplified operations right well I think this is part of that whole client and cloud application experience that self-driving vision we're driving you know point of sale is one of those critical applications in the store you know you want to make sure that point of sale application is up and running at all times and if it has any hiccups you want to make sure it's selfcorrecting so also I know that you you announced a new product in the analytics space, right? We're working on this new new Marvis Aentic CI and we're integrating all the goodness of premium analytics into that new Aentic CI. This is really helping all our retail customers with kind of that floor space, customer experience, utilization, right? How are people actually moving around the stores in the retail space? And describe what premium analytics are because I know Marvvis is filled with analytics, but this is a level above and beyond, right? So, yeah. So our standard marbage experience is like 3 weeks of data. Premium analytics extends out to over a year's worth of data. So it really helps our retail customers and understand the",
        "start": 4.64,
        "duration": 299.20000000000005
    },
    {
        "text": "I know Marvvis is filled with analytics, but this is a level above and beyond, right? So, yeah. So our standard marbage experience is like 3 weeks of data. Premium analytics extends out to over a year's worth of data. So it really helps our retail customers and understand the their store space. So it gives you a complete experience of space utilization, customer utilization, customer flow through the store. Yeah. So, by going back that far though, that would help like a retailer, a seasonal business maybe plan better for maybe what instore traffic might look like between Thanksgiving and Christmas. Yeah. Cuz you know how things are changing so fast in the retail space. You know, retailers really want to go back over last year and see from year to year what is those trends and nowadays we're seeing things change even monthly, right? So you have seasonal trends, but now we're starting to have things changing monthly as we start to see AI become more relevant to the whole shopping experience. Yeah. And I know you've also got a new the sensor now also integrates with Wi-Fi 7. And that's a pretty I think standard integration, but talk about the importance you think Wi-Fi 7 is going to have in retail. Yeah, I think with Wi-Fi 7 probably the biggest thing we're seeing is we're starting to see the integration of this minis technology, right? That's technology that basically makes sure that all your critical network services and business applications are up and running before the store opens. So, Wi-Fi 7 is the next generation and it's bringing actually another generation of data and visibility into the Marvis self-driving experience. Yeah. And how do you think you know it's interesting when Wi-Fi 7 came out I think there was a little I'm not going to say negativity or people looked at it as maybe just Wi-Fi 6E plus but it certainly seems from the retailers I've talked to that the extra security capabilities performance benefits of 7 are really above and beyond 6E and I actually think we could see some companies accelerate the replacement cycles to move to 7. Well, I think you know Wi-Fi 6, Wi-Fi 7, it really brought all that six gig spectrum to the party and it really brings that it brings a whole new band especially for business application critical applications that retailers are trying to run the store and they're trying to move them out of the two four and the 5 gig bands into Yeah. And that that is notable too. I was at the the Chase Center which of course is in HP Aruba deployment and we were testing the 6 GHz spectrum. line. We were right under the AP in all fairness, but we were getting almost a gig of throughput, which is unheard of for Wi-Fi. This whole concept of gig Wi-Fi has been a you know, I think something that the industry has, you",
        "start": 153.84,
        "duration": 584.56
    },
    {
        "text": "were testing the 6 GHz spectrum. line. We were right under the AP in all fairness, but we were getting almost a gig of throughput, which is unheard of for Wi-Fi. This whole concept of gig Wi-Fi has been a you know, I think something that the industry has, you I think it's actually here now. Yeah, I think we're starting to see close to gigabit per second because when we get up into the six gig bands, right, those wider bandwidths actually become usable. You know, 2, four, 5 gigs, that's always been 20, 40. Now we're up to 320 megabits, you know, meahertz of bandwidth actually used to actually get that speed. And then the last announcement was the was the non-stop update which I think is really an interesting product on the compute side. I know you're more on the networking side, but I think is one of the more underappreciated products in the HP portfolio and you know what are you guys doing there? Yeah, that so that is our new compute product for instore retail, right? And this is more about making sure like I said those business critical assets like point of sale. You got to really make sure your point of sale is up and running all the time. That's got to be like 59. That's what the non-stop compute is really bring tolerant. Yeah. And I was looking at some data on non-stop. In fact, I got pre-briefed on it. I think they said 90% of retail transactions actually go through non-stop. I had no idea the footprint of non-stop was that big. Yeah. Well, I mean, if you look at HPE now, especially with the Juniper acquisition, I think eight out of 10 of the largest retailers are now running on HPE network, you know, and that's what we're starting to see even at the biggest network is connectivity and fall tolerance is becoming kind of that client to cloud user experience at Cass. Well, well, let's talk about that because we are here in a retail show, right? And when I go around and look at a lot of the booths, we there's vendors running holograms in the booth. There's more. I was over at the Amazon stand and the new just walk out system is meant to be portable and works off Wi-Fi and things like that. And so how have you seen the role of the network change within retail over the last couple years? You know there's a couple of trends I've been seeing. I mean one is becoming like I said almost at a sea level becoming making sure that there's internet connectivity in their stores especially for the stores that are located out far away. I think the other interesting trend I've seen is around moving the buying experience outside the store and I think that happened during the co days, right? People a lot of activity is happening out and around the store and",
        "start": 298.8,
        "duration": 841.7599999999998
    },
    {
        "text": "especially for the stores that are located out far away. I think the other interesting trend I've seen is around moving the buying experience outside the store and I think that happened during the co days, right? People a lot of activity is happening out and around the store and more important in the retail experience and it's kind of sticking after co people got used to that experience. We're seeing that happen. Yeah. Well, it's all about this kind of integrated digital instore experience now, right? There's digital signs being used. more and more retailers are using wavefinding technology to help direct customers around. I know even when some of the retailers I go to now you pull up their mobile app and it can give you a little map like some of the larger stores retailers you go to it's hard to find things sometimes but now I can give you a map right to it and things. So that was very timely. I was just talking to one of our partners US that's actually working on the personalizing that whole loyalty app experience. Yeah, it's taking long enough. Yeah, I think we're probably I think we're finally there is that whole location personalized experience is becoming more real. Yeah. All right. I guess just yeah I know the show just started today but anything you're looking forward to seeing this here this week? Yeah. I think last year I was here I think what got me was the where the robotic technologies go. Right. That was I think this year it's really around kind of how do you deal with the the more educated shopper. You know, I think if you look where we're headed with Chat GPT, you know, the customer is becoming much more experienced walking into the store. And so, a lot of the retailers we're working with are also trying to make sure the associates can deal with a much more educated buyer nowadays cuz if you look at your phone, right, you know, it's no longer typing on your phone. It's like Brock, Siri, please give me the latest information on something. Well, you know, certainly that's coming. And on the topic of robotics, I was at the Consumer Electronic Show next week or last last week and I'll tell you something. That show was robot pulooa. There was literally a robot for everything. You know, lawnmowing ones, ones that fold close. Some I actually I think were kind of useless, but for the most part, this this the the era of autonomous vehicles has arrived and you're going to start seeing these things serve up people. In fact, I I saw one down in the food area like people could use it to clean up tables and things like that. So, if you're a retailer, robots are coming. They're coming soon and the network is the thing that allows those things. All those robots need to be connected.",
        "start": 429.52,
        "duration": 1097.6809999999996
    },
    {
        "text": "I I saw one down in the food area like people could use it to clean up tables and things like that. So, if you're a retailer, robots are coming. They're coming soon and the network is the thing that allows those things. All those robots need to be connected. update on the the new products and what you're doing here. Anything else you want to add? No, I just want to add, you know, probably is, you know, if you look what we're doing here at HPE now, it's all about soft driving networking and making sure we get a common soft driving network experience in both across our Aruba and this platform. Yeah, actually let's I'll I'll you know I lied. I I'll one more question for you on the on on self-driving, right? I think we've been talking about this journey to like level five if you want to use the automotive example. Where are we on that spectrum, Bob? How close are we to actually have a self-driving network? Indeed. So, the reason I'm still here pushing the rock up to here cuz I for you know Whimo Uber, you've done your Whimo Uber experience. Yes, I've done Whimo. Yeah, that's a fully drive self-driving experience right now. I would say right now we're kind of in the assistant. You know, we've been pushing this rock up the hill for, you know, seven 10 years and we got to the point where we do a pretty good job of assisting it in driving their network. You know what we're going to see over the next couple years with the Gentic AI is really getting to that fully self-driving IT experience where it does not have to keep us and I I think the assist is a good one because I you know one of the my takeaways from the CES show was in the automotive space you know while we're not at full self-driving yet although you know Whimos and things and you know test a few cars can do it but all the AI features brought in have allowed us to be smarter better drivers parallel park assist lane change alerts things like that, adaptive cruise control. And what I've seen Juniper deliver, you know, over the last few years is really those, you know, the adaptive cruise controls of the network, right? It makes us smarter engineers. It makes us better engineers. It allows us to do things faster. , you know, , even so, even though I'm not fully self-driving today, I'm a better, smarter, faster engineer because Oh, your car, right? I mean, if you have a self-driving car, you have to admit that thing is probably a lot safer. I'm trying to convince my 90-year-old dad to get a self-driving, you know, car cuz it's got much better faster reflexes than he is. But, , clearly it's coming and I know , you know, Mist has been a big",
        "start": 559.04,
        "duration": 1347.8419999999994
    },
    {
        "text": "have to admit that thing is probably a lot safer. I'm trying to convince my 90-year-old dad to get a self-driving, you know, car cuz it's got much better faster reflexes than he is. But, , clearly it's coming and I know , you know, Mist has been a big all right. , ready to wrap up. I'm ready. Yeah. Thanks for the interview, Bob. So, on behalf of Bob Friday, head of AI at HPE Networking, I'm Zas Caraval from ZK Research and thanks for watching. , give us a like and hit that subscribe button and we'll see you next time on my next episode of Zcast. [music] [music]",
        "start": 684.8,
        "duration": 1385.367999999999
    }
]