[
    {
        "text": " [Music] Welcome to Zcast everyone. I'm Zas Caraval from ZK Research and I'm here in San Diego at Webex1. This Cisco's collaboration event with Patrick Cornish, senior network engineer of Bank First. Patrick you're a WebEx customer. I think you're doing a talk later. and I want to talk to you about that. But first quick intro on yourself and Bank First. First off, thank you for having me. , of course, Patrick Cornish been here at Bankf First for eight years now. , I lead our architecture team working directly with our executives on actually migrating us over from Premise to Webex Contact Center now and leading our AI charge for our initiative. As far as the bank goes, we're about 15 billion assets. We're AC all across the state of Oklahoma and North Texas, over 160 locations, serving about a half a million households. You're a pretty big bank. Yeah, I like we like to think so. I actually came out of banking myself, too. I was in I started my career as a network engineer at a midsize at a regional bank in Maryland. So yeah, we're brothers here. So there we go. Yeah. Now, you're talking about you mentioned you're leading the bank's AI charge. talk about how the business has changed and why AI is so important for you today. Right. It's a it's a hot topic right now. it it it depending on who you ask on how you want to go about it, but there is some some a lot of ROI there. we kind of wanted to target the you know some low hanging fruit. miss balance inquiries, things like that. How can we really optimize, you know, some of our call volume, make our agents a little bit more useful, find ways to be more diligent in some of our efforts. but at the same time, we want to maintain that right blend of like that human touch. So, it's kind of fig out ways where we can really leverage AI but still keep a high white, you know, high touch, white glove treatment for our customers. Yeah. Now, do you envision a day where when customers call in, they'll actually in a lot of cases prefer virtual agent? You know, I'm happy you mentioned that. That's a great segue for this afternoon. And that's what my session is going to kind of showcase of how that first digital engagement will be, you know, AI agent and a lot of things that you, you know, may need. There may be some simple tasks and inquiries and things like that and things just a little bit more complicated. You know, we want to hand those over, you know, to a seasoned human in the loop to make sure that those needs are met for those customers. But we I don't want to speak too early, but that day is coming pretty soon where the the analogy is interesting because I",
        "start": 0.04,
        "duration": 272.04099999999994
    },
    {
        "text": "we want to hand those over, you know, to a seasoned human in the loop to make sure that those needs are met for those customers. But we I don't want to speak too early, but that day is coming pretty soon where the the analogy is interesting because I was part of the IT team that implemented the internet at the banks I was working at. And back then I remember my head of customer service saying customers are never going to want to bank on the internet, right? They're always going to want to talk to a person. And we still do. If we want to get a loan or do something complicated, we go in the bank. But for most of our everyday stuff, I want to check my balance. I want to send money to somebody. I do that online. Yes. And so I don't really see why the AI trend won't be any different. Right. Yeah. Oh, you know, I really love your your sentiment on that. We really should talk more because literally it is no different, right? It's just this biggest boom in technology right now. Literally where the internet came and even how far Telefn grew. People never thought that they would actually be using cell phones, a voiper, things like this, right? We're in a golden age of AI right now where we're able to use this and leverage so many tools and it's still a little nuance. So there's a little fear, but eventually this will become the norm and and it will become where you won't know whether it's a human or it's a AI agent. It'll be to that point and I feel like it's getting pretty close overall and even Cisco is doing a good job of that and we really value that partnership there. Yeah. And I think part of this too is frankly your agents like answering calls they got to reset passwords and things, right? Right. Yeah. I mean who does really, right? you know, so it's kind of like let's let's take some of that off of them and give them the more complex things, but at the same time, right, there's different AI tools that can give that wellness break or different things to check in to make sure they're doing well, too, and they're taking care of. So, it's trying to find that strike that perfect blend is always the goal. Now, while you have this vision of getting there, what are some of the challenges you think in getting there? Yeah. Well, you know, obviously being in financial, right, you you got to make sure you're compliant. You know, you following the right regulations. there's some ethical things that you have to take in consideration, right? How do you hold an AI agent accountable the same way you would like a human? Some things like that, right? Looking at your processes and just kind of looking",
        "start": 138.0,
        "duration": 477.4
    },
    {
        "text": "compliant. You know, you following the right regulations. there's some ethical things that you have to take in consideration, right? How do you hold an AI agent accountable the same way you would like a human? Some things like that, right? Looking at your processes and just kind of looking fit? we're in the Midwest. So the adoption for some some in AI is not as acceptance as others, right? So Silicon Valley it is not. So how do we still meet those customers where they want to be met when they have the fear of some of the taboo things they hear about it, right? So there's there's been multiple roadblocks and challenges throughout the process, right? and and we didn't you know we took a crawl run we didn't want to boil the ocean we've kind of slowly got a good process and a plan in place to do those things but it is challenging but I still want to encourage other customers to do the same and we're starting to have a lot of success with with using AI yeah now I I find it interesting that your title is network manager because if I go look around web X1 there's a lot of you know workplace engineers customer service managers how important is the role of the network in what you're trying to do oh my gosh I mean that that is the backbone I mean that is the pillar for everything we want to do right I mean that's how we that's how we able to across multiple digital channels you know reach our customers wherever they want to be met right keep that same the goal is at the end of this right once we finish our AI journey per se that we can have that same human touch of when you come into the bank that your same your same needs can be met over the network over telefan whether that's voice that's chat that's SMS whatever that is we want to give you a plethora of options or even the mobile app to where you can meet where we can meet you where you want to be met to get you served the best way possible And if we can save if we can save you a drive from coming into the bank, we'll do that as well. Yeah. And I was talking to someone this yesterday that when you think about contact center operations, we used to live and die by things like average handle time. Now once you go AI, things like average handle time won't matter as much. And so have you has the bank thought about how they're going to measure the effectiveness of the things that you're doing? Right. I will tell you we might be a little more tried and true. We we actually we we still care about the average handle time but to your point a lot of those KPIs and those metrics are",
        "start": 242.08,
        "duration": 695.2420000000002
    },
    {
        "text": "going to measure the effectiveness of the things that you're doing? Right. I will tell you we might be a little more tried and true. We we actually we we still care about the average handle time but to your point a lot of those KPIs and those metrics are sentiment you know we want to know hey was that customer happy we want to know those seesat scores even if you don't fill out a survey right we want to know and you can do that with AI right and we can do that with AI now right and we want to look at our first call resolution let's look at we've seen some really interesting stuff in the keynote that we will kind of take back hey is that agent too talkative if he maybe we should tone that back a little bit does he have the right knowledge now oh we need to add some more to that we need to add more knowledge to that AI agent maybe it's not as respect responsive or as accurate as we need it to be and with AI we can leverage those tools to not only home enhance the human in the loop but also that AI agent too. Yeah. Now, we just finished watching the keynote. Were there certain things in there that caught your eye? Yeah. I I can only imagine now how happy our supervisors are going to be when you're going to have a single pane of glass where you can actually see the AI the well actually the AI agent as well as the live agent and all the metrics that we're going to be able to capture. it's going to be phenomenal. You know, that that is something that I think is going to be a real game changer, not just for us, but for a multitude of customers cuz right now it's it's kind of siloed in different spots where you can find that data to actually get that. So, if we can just unify that and make that a little bit easier, I think we can really start targeting some of those metrics to have a quicker turnover to get a faster ROI. No one wants multiple panes of glass. No, no, no. And and what about some of the other AI in the UC side? Note takingaking capabilities, task management. Yeah. So, that's really awesome. It's very interesting because so being my we we're kind of a smaller team so we we we have a multitude of roles and a lot of different things we do. So even for me personally I use the AI assistant now for whether it's live translations I get the transcript and AI summary. So now I no longer will even have to actually launch a meeting to get my AI notes taken because a lot of the summarization a lot of times I'm leading the meeting. So then I don't really have",
        "start": 354.96,
        "duration": 898.28
    },
    {
        "text": "whether it's live translations I get the transcript and AI summary. So now I no longer will even have to actually launch a meeting to get my AI notes taken because a lot of the summarization a lot of times I'm leading the meeting. So then I don't really have actually launched the WebEx meeting to actually then get my notes and it's been phenomenal. So now the fact I don't even need to use, you know, launch a meeting to do that. We can walk into a personto person meeting. We have that and that was probably the biggest one. There was so many that was going to be really great for us. But I'm looking forward to that. And so you're a buyer into G2 sentiment where he said the AI maturity is the first phase is oh my god it's going to take my job and now you're at the point where oh my god I can't do my job without it. Right. We're getting pretty close. It's getting it's really close and then and it's going to become the norm right. We for transparency in our environment there's still some of that concern right like oh my guy's going to take my job but in reality you know it's not it's really meant there'd be a a there right there it has its place right right and Y2K and you name it right but you know there is a there's a place for the technology and it's not going anywhere and it's not and it's here to stay you know so it it is it would be you know really prohibitive if people really didn't adopt it and then kind to start to learn it integrate it now from what I understand you're a full stack Cisco shop and a big part of the keynote and some of the talks going around here has been that Cisco can deliver everything from network to you know they have AI defense they have a lot of security they have the you the calling platform the meeting platform the the CX product having all that integrated together how how much did that matter to you well it's really everything integration is really king I know there was the days of the past where you maybe wanted a little few more silos or you didn't want all your eggs in one basket if you lost this or that but in reality Even if you lost that, you you're still in a pretty bad spot. You really want that integration in to end. So you can know cradle to grave the full whether that's that call, that meeting, that transcription, is this node down, is is this is this branch down, is this site down being Cisco through and through? We have the the ability to see that and that integration really means everything. Yeah. And are you excited about AI canvas being able to you know I",
        "start": 457.919,
        "duration": 1119.1610000000005
    },
    {
        "text": "that transcription, is this node down, is is this is this branch down, is this site down being Cisco through and through? We have the the ability to see that and that integration really means everything. Yeah. And are you excited about AI canvas being able to you know I the market leader in single panes of glasses they have so many but AI canvas actually ties all that together and let you see observability security networking. Yeah. Yeah. So I'm really excited about it. I was here a couple months ago for Cisco Live and they first debuted it with the new security appliance and things and I was like well that's nice. okay, I kind of see it would really be nice to see this in other platforms and to be here today and to get to see it. That is really going to be transformative and it's all built generative. So then in real time we're getting a lot of those dashboards, those insights. I like how we can actually collaborate, bring multiple teams in and different people from different departments. So we can get that resolution really faster, you know, than we've ever ever have been been able to do before. Yeah. All right, Patrick. Well, I appreciate your time. Just one last question. you're moving forward with AI. I think G2 said there's two types of organizations, companies that adopt AI and ones that fall behind. For those out there that are thinking about AI, right? What's some advice you can give? I'll just kind of look at it like you don't need to boil the ocean, you know, just take it one step at a time. And he really identified it's kind of funny that I'm really piggyback piggybacking off a lot of that cuz I have a use case that I'm actually going to show this afternoon. I I don't want to give it away, but it's essentially something that's real to us, right? and how we're actually going to basically cut our handle time in the third by resolving this one issue which last month was actually the majority of it. It was actually a debit card replacement need, right? So leveraging the AI assist the AI agent. We didn't talk in detail of this one until after. Okay. Okay. So it's actually going to demo the AI agent where you authenticate them and then you need to pass it over to actually human agent and then the human in loop actually gets help from the AI assistant to actually feed you the transactions, help actually generate a card with the address to send the SMS to the customer to create that replacement, you know, for that debit card. So in turns, I mean, we're saving, you know, minutes on minutes, which is hours on hours, you know, and then dollars on dollars on dollars. and we're able to leverage that all you know with",
        "start": 570.0,
        "duration": 1324.3600000000006
    },
    {
        "text": "SMS to the customer to create that replacement, you know, for that debit card. So in turns, I mean, we're saving, you know, minutes on minutes, which is hours on hours, you know, and then dollars on dollars on dollars. and we're able to leverage that all you know with AI agent and that's just one use case right it's no longer so you're starting use case by use case right and this is the thing too right I think the mindset needs to be it's no longer can this be done it's now how do we need to do it because we have so many dispos tools at our disposal that Cisco has throughout the you know just the the AI ecosystem per se that it you definitely would want to leverage them but just find things that's real to you don't do features for the sake of features find the thing that that's most niche to your use case and then find ways to build it, implement that, start from there and then and the rest, you know, it'll take care of itself. Yeah. I call that chip shots, not moonshots. Right? If you look out ahead and you decide I'm going to put AI across my whole company, I'm going to transform customer service, you're never going to get there because it's too intimidating. If you're willing to just do these little steps, one project at a time, you can measure the success, prove it to your bosses, which is important as well. Absolutely. Yeah. you you want to keep the seauite and those stakeholders happy, you know, especially especially in my line of work. It it'll be good. All right. Anything else you want to add? No, I appreciate it. Thanks for your time. Really appreciate having you on. Sounds like you're doing some great things at Bank First there. So, on behalf of Patrick Cornish from Bank First, I'm Zas Caraval from ZK Research saying thanks for watching. give us a like and also hit that subscribe button and I'll see you next time on our next episode of Zcast. [Music]",
        "start": 674.56,
        "duration": 1484.2410000000007
    }
]