[
    {
        "text": " Welcome to ZCAST everyone. I'm Zas Caraval from ZK Research and I'm here at the PaloAlto Network stand at Mobile Congress 2025. I'm with Anna Dwall, SVP of PaloAlto. Anna, how you doing? Good Z, how are you? Good, good. I'm excited to talk to you. We're here at MWC. I think let's talk a little 5G, right? it's interesting that show that I think see now every year for the past 3 four 5 years this was going to be the year of 5G and it wasn't but I I do notice a different tenure this year that it does seem like there's more 5G momentum and I'm curious if you're seeing that as well. Yeah Z first thanks for having me. absolutely yes this is the year where I feel there's more 5G momentum than the last couple of years and I think it's real. You're seeing customers now getting into deployments 5G in the enterprise space, private 5G deployments in manufacturing sites. It's happening finally. Yeah. And and what do you account that for? Like I I think one of the big drivers for 5G is AI. Just like you know cloud drove mobile, mobile drove cloud, I think AI and 5G you know really help each other out. Are are you seeing the same thing? Yes. I think the interesting thing is that the 5G and AI are both coming of age in some sense at the same time. The conversion is happening at the same time and it's driving some very very interesting use cases for what we're driving for our customers. Yeah. Okay. And obviously when you start thinking about 5G and AI coming together you got to talk about security. Absolutely. Right. And so explain how you when you think about 5G security how does PaloAlto approach that? Very good. If you think of 5G and security, Palo Alto approaches it really in three broad ways. First, what do we need to do to secure service providers and Telos's 5G infrastructure? So that's the internal core network. Yeah. Across all aspects. So the signaling layer, the data layer, the management layer at the edge, the RAM, the roaming interface, the GI interface, across all aspects of what they're trying to do. That's that's number one. Now as you know service has spent a ton of money on spectrum and building this massive 5G infrastructure over the last couple of years. Now how do they monetize it? So we want to help them monetize it by value added services on top of that. So 5G slice as a service for enterprise customers or just yesterday we announced a brand new product Prisma Sassy 5G really exciting and we'll talk more about that. The third is as private 5G deployments are going more and more. I talked to a partner yesterday that said they have 2,000 plus private 5G deployments right now mainly leading for manufacturing but also in utilities oil and gas mining.",
        "start": 5.2,
        "duration": 309.75899999999984
    },
    {
        "text": "5G really exciting and we'll talk more about that. The third is as private 5G deployments are going more and more. I talked to a partner yesterday that said they have 2,000 plus private 5G deployments right now mainly leading for manufacturing but also in utilities oil and gas mining. what they need to do for the OT infrastructure both visibility and security? Okay. And and so double click there in the 5G the Prisma 5G sassy launch. what is that product? How does it work? Yeah. So if you think about there are many devices today which are SIM based devices in the enterprise. Yeah. Right. more and more coming more and more coming how do you ensure that you have the same security services the same policy constructs that you have on the wired or the Wi-Fi network right without changing the service infrastructure so in this case what we do we don't have any agent on the same based device use the same authentication mechanisms from the service provider the same packet core and then you cross connect that that traffic to our Prisma Sassy infrastructure for secret processing granular based on MC based on IMEI or any other construct you have. So now you can have the same policies that you had on your wide infrastructure on your SIM based devices and that's a game changer for all right and so to me that that from a 5G perspective from the data center well from the core network all the way out to the edge of the device secured by one continuous threat threat protection system% yeah okay so on that note let's shift gears a little bit to platformization that's been a big topic conversation within IT circles, everything from the network to systems. What does platformization mean to you in the context of security? Yeah. Look, when you talk to most customers, what do they really want? They want to make more money. They want to save money and they want to be out of trouble. Yeah. Right. If you think about and that last one's big for the CIO. Yes. Exactly. And if you think over the years, network security is complex and fragmented. What you want to do is you want to simplify and unify network security, right? You want to have the notion of a consistent policy. any user, any device, accessing any application, any data consistently secure. What we've done across platformization is helping our customers reduce their operational cost, simplify all the outcomes they want, have that consistent policies. I'm in the home, I'm in the office, I'm on my mobile device, I'm on my managed device, I'm on my SIM based device, same policy, same manageability for threats that we see, from operational thing that we see across the enterprise. And that's really what we're driving with platformization. Yeah, you know, it's interesting. At Black Hat last year, I talked to a CISO that said to me that",
        "start": 159.599,
        "duration": 583.0389999999998
    },
    {
        "text": "my SIM based device, same policy, same manageability for threats that we see, from operational thing that we see across the enterprise. And that's really what we're driving with platformization. Yeah, you know, it's interesting. At Black Hat last year, I talked to a CISO that said to me that longtime CISO, too. They he finally realized the best of breed security doesn't lead to best-in-class threat protection. In fact, it's the opposite of that, right? So, the the notion that a platform will have mediocre components is what what is is also not really true. So, we're trying to get in best-in-class components integrated in a platform and a single UI. At the same time, you don't have an open ecosystem. there are some services that I don't have but I want to be able to integrate those third party services onto the platform seamlessly so we can have a consistent experience for the customer. Yeah know that makes sense and I I think you know in perspective we talked about this concept for a while but what's been the customer holding customers back from being more aggressive with platform? Yeah, look in in many cases it's a journey for customers because what happens is that they've already already invested a lot of time and money in solution that they have they have contracts expiring. So it's it's it it becomes down to a more economical discussion. So what we're trying to do is how do you make them ready the platform doesn't mean that I have to everything in the platform on day one. It's a journey for most customers. I can start with we have customers who have our firewalls have hardware and software firewalls and they move to sassy and have consistent policy. But third of our customers in Sassy are net new. They use Sassy first and then say hey look I would have a consistent policy. I'm going to now replace those firewalls I had which are fewer in the data center now because I'm consolidating my data centers and have [clears throat] palto firewall. So now I can get that platformization. So it happens both ways and it happens at the pace that customer wants. The goal is what is the end goal you want to have and how do you navigate to that end goal. Yeah. Now so when I think of platform again if I think of some things like people always talk about Apple as a platform right and but they have a watch laptop they only three four devices in the world of cyber I mean there's hundreds of devices and so u from your perspective what are the key components of a platform and I guess that's another way of asking what would be the starting point for customers from a network security perspective like I said you can start a journey from a data center where you have our firewalls",
        "start": 298.96,
        "duration": 834.0799999999998
    },
    {
        "text": "u from your perspective what are the key components of a platform and I guess that's another way of asking what would be the starting point for customers from a network security perspective like I said you can start a journey from a data center where you have our firewalls hardware appliances that did DNA security or malware prevention, right? and now you subsume those on the firewall and then as you move towards software and and and cloud delivered sassy secure enterprise browser all those components across threat prevention URL filtering sandboxing DNS security IoT and SAS security manage unmanaged devices data and SAS security AI like look employees accessing AI applications we're building AI applications you don't need to deploy additional sensors additional proxies for those those should be all be features on the platform Yeah. Okay. Now, every time a vendor tells me something to me, there's no better proof point to what you're telling me is true than customers. Oh, yeah. So, can you talk about customers and the success they've had and the outcomes they've had? We've had thousands of customers in network security. Use all three form factor of network security and the platform because they get that consistent security across any use case. They get a single pane of glass to manage everything from day minus one to day end configuration policy AI ops alerts anything that they need to do from a policy perspective it's all fully integrated into the platform so we we're seeing tremendous traction on customers on the journey of platformization and like I said it's a journey it's different for different customers yeah okay good well anything else you want to add then no I think like it's it's mobile world congress 5G AI they're coming together and deliver through platformization yeah well congrats on the on the launch of Pris 5G Sassy. just one last any customers using that yet? Yes, we announced yesterday Singtel is already a partner using Prisma Sassy 5G for the enterprise customers to give them the same services that they have on the wire line side. Yeah. And actually that's a good customer because I know in the Asia pack region 5G they've been a lot more aggressive with there. In fact, in a lot of those countries I mean there's barely any terrestrial and we have many more in trial right now but that's what announced publicly right now. All right. So 5G coming to an enterprise near you if you're going to secure it take a look at 5G sassy and from a platform perspective obviously PaloAlto the leader there. Thank you. Thank you Z. All right so on behalf of it Oswell from PaloAlto I'm Zas Caraval from ZK Research. Thank thanks for watching. hit the subscribe button. I'll see you next time my next episode of Zcast.",
        "start": 426.16,
        "duration": 1099.8399999999997
    }
]