[
    {
        "text": " Welcome Zcast everyone. I'm Zas Caraval from ZK Research. I'm here in Davos, Switzerland at the World Economic Forum, also known as Davos. I'm with Dr. Helmet Risinger from PaloAlto Networks, CEO of AMIA. , welcome Helmet. Welcome. Thank you so much for having me, Z. Yeah. And so, we're going to talk about some of the themes at Davos here and some of the stuff you've actually written in some of your blogs. quick Joe just a little introduction on yourself. I've been four years now at Paltera Networks running EMIA business and EMIA is one of the strongholds of global Palo Alto Networks performance. Before that I was 14 years working on global service provider business of Orange Business Services in the last four years as their CEO in Paris. Oh well that's a big role. That's a big company. Yeah. So the theme of Davos this year focuses on something called the intelligent age. And as we look at global growth, I think the economics of security also have to change. In fact, you've argued that the old ROI model of preventing a breach is no longer relevant. And can you get into that a little bit and expand what you mean by that? Yes. Historically the cyber security industry has been built out of very fragmented estates which means on average a large organization has about 30 to 40 sometimes even 70 different tools to protect their digital essentials. We believe that's no more good enough. Now you mentioned the word intelligent age that talks about intelligence. If we think about an analogy between military and cyber security, if you want to have good data in military in the military world, you try to combine data from land, from sea, from air, from your cyber command and maybe not only from your own perimeter, you probably want to share with allies and get even better data. And then you say well based on that if I look to the field that's what I need to do. Cyber security in a very fragmentaryary state was looking very differently before but now we call this platformization as palatoto networks takes telemetry data from firewalls networks cloud assets endpoints. This can be an industrial machine of seammens. It can be a notebook from somebody. and we combine this and done we run our automated playbooks. Why is that? Because we believe in the future cyber security given the avalanche the increase the vast increase of data will have to be automated and real time. Yeah. In fact, we're already there with the amount of data. I talk to security professionals all the time that simply can't keep up with the volume of data they have. In fact, I I did a survey last year that asked cyber professionals what percent of the alerts they get to and a third and a half maybe. And it's not they don't want to, it's just that that it's gotten so",
        "start": 5.68,
        "duration": 321.75899999999996
    },
    {
        "text": "up with the volume of data they have. In fact, I I did a survey last year that asked cyber professionals what percent of the alerts they get to and a third and a half maybe. And it's not they don't want to, it's just that that it's gotten so of it is interesting too because we are moving into an AI era. And so I've always argued that with AI, good data leads to good insights. Silos of data lead to fragmented insights. And when you think about the way we've deployed like EDR, firewall, all these things separately. All we've had is silos of data. Yeah. Yeah. Absolutely. And by the way, talking about this analogy between military and cyber security, in my mother tongue in German, it's called lag build. What's actually the current situation and I mentioned cyber security will and we are enabling automated cyber security because we cannot fix the issue only with adding people in the security operations center but it also has to be real time and here if I may link this back sales to what you said about AI AI drives never seen before record speeded data exfiltration we have seen about 9 days in 2021 that it took from time of a compromise to excfiltration now we are down to an average one day on average but even with AI attacks we see it takes sometimes only 20 minutes so real time highly automated and then the new ROI compound which means it needs to offer a path to simplification and therefore business benefits so that's our mantra and proposal to our customers we offer you better security outcomes based on this unified view and platformization but also then simplification and business benefits with platformization yeah now another big issue that's arisen in this era is supply chain disruptions. In fact, we've seen that rampant. I think it's [clears throat] driven a lot of tension at the board level in AM in particular where the geographies are so disruptive. And so have you seen more board level interest in cyber versus simply having it be an IT task? Well, absolutely. I I had the pleasure recently to present to a a large European countries meeting of all of the chairman of the stocklisted companies and resilience there is a key topic if I quote one of the latest CEO discussions I had he said and he's the CEO of a big bank big European bank he said look our business model is going well we have done the right transformation my big worry is resilience and to your word supply chain attacks that involve high Complexity attacks because everybody has an interconnected system relying on third parties. The supply chain means that you're exposed and those vulnerability points need to be tackled. One of the big innovations we did lately is to introduce secure enterprise browser which basically extends your zero trust perimeter even to third",
        "start": 166.72,
        "duration": 626.4800000000004
    },
    {
        "text": "attacks because everybody has an interconnected system relying on third parties. The supply chain means that you're exposed and those vulnerability points need to be tackled. One of the big innovations we did lately is to introduce secure enterprise browser which basically extends your zero trust perimeter even to third enforcement point of security right at the third party that you're partnering with that you need in your supply chain. whether you're an automotive company or whether you're a bank for example. Yeah, that's in fact there's a very always been a subtle difference between cyber security and digital resilience but the two are really I think the part and parcel of the same. Now I want to go back to the point that you made about the the 44 days which was the the data xfiltration down to a few hours. Are we in an era now helmet where human speed socks are simply obsolete and if so what is the role of human in the sock now move forward? Well, we have done recently a very big analysis together with one of our very large security operations center clients. By the way, they have consolidated from four different tools. They're running across 200 countries. There's one global security operation center and it people will still be needed there. It's the question how do you want to scale better? Meaning for them a business case was not to reduce people not at all. It was I cannot cope with the avalanche of data increases and analysis that needs to be done. I need more automation. So that was the driver for the simplification and automation. And what we saw is that nowadays a security operation center expert can do in that case 2.9 more volumes of alerts/ in this case incidents that they're able to handle than before thanks to a much bigger preloaded automation already done by their systems. and they can therefore focus on what is essential to their business and to the securing or increasing the resilience of their business that they're protecting. Yeah. I think historically you've scaled socks by just adding more people but I guess you get to a point where that's exponentially not possible anymore. Exactly. I mean you can throw infinite people at it but I mean there's a certain cost for we still have the same topic of of shortage of talents in the industry. That's very true. But that's why the solution will be partly training more people. Fantastic. On the other hand, it will be simply driving real-time and highly automated cyber security. The speed, the people side of it is interesting too because everybody's worried about taking jobs, but cyber there's so many open headcount that if you can just close that now should not be a worry to anybody in the industry. Yeah. No, in fact, we need more. So, another theme at Davos every year is always trust, right? Central pillar of",
        "start": 320.08,
        "duration": 897.92
    },
    {
        "text": "worried about taking jobs, but cyber there's so many open headcount that if you can just close that now should not be a worry to anybody in the industry. Yeah. No, in fact, we need more. So, another theme at Davos every year is always trust, right? Central pillar of commitment to Europe vision, you actually discussed the five pillars of digital trust. So how can global companies balance the need for digital autonomy with this borderless enterprise that's coming with AI? Well, basically we tell our customers as well that they own also their telemetry data. We of course leverage global telemetry data in order to give and give better and more effective security systems. But specifically also if I talk to the European but also in the Middle East is the same topic or in South Africa. Trusted cyber security partners are very critical in that and therefore trust in both the data plus also the exchange that you have are critical. Therefore big focus on our side given following the local regulations that are needed adapting to that whenever it's needed and making sure that we can stay this trusted player that I think we have been positioning ourselves over the past years. Yeah know you've done a a good job of being that trusted player. Now PaloAlto Networks recently was the you were the first pure play security vendor to actually sign the AI pact right and so how are you working with European regulators to ensure that security isn't just a checkbox item has been for so long but it's actually built into the kind of operational flow and resilience of the company. Well honestly as you describe it just now it it it works at different levels. First of all, you need to understand well where is regulation heading. Second, you need to accompany industries, companies, public organization onto that journey. NIS 2 the new regulation also for critical infrastructure companies and institutions across various countries is not implemented within one day. It has been implemented step by step into local legislation country after country. So this is where we try to play both panimea plus also country specific and then of course it depends on the industry and it depends on the customer industry because the financial service industry has Dora as a key regul regulatory framework whilst for example a big chemical company or national critical infrastructure company has more needs too to follow. Yeah. No, that's I think those those standards are great, but I think companies often struggle to get them adhered to and so it's good that you're working there now, but also the standards are evolving. If you think about u was it 3 years back the new SEC ruling said that you need to to alert on critical incidents within 4 days calls for one day. So we are evolving because also technology is evolving. Therefore, by the way, 4:1 day means real time cyber security is",
        "start": 457.919,
        "duration": 1206.8789999999992
    },
    {
        "text": "think about u was it 3 years back the new SEC ruling said that you need to to alert on critical incidents within 4 days calls for one day. So we are evolving because also technology is evolving. Therefore, by the way, 4:1 day means real time cyber security is Yeah. Well, that 4:1 was a certainly big implications companies, but frankly, as a consumer, right, you want to know that stuff sooner than later. So, yeah, but we as a consumer, even if I step into my other shoes, being a consumer as well, if suddenly certain financial services would not be available or remember the famous outage on the gasoline lines on the eastern side of the United States, suddenly you feel the impact. What does it mean? Resilience. Yeah. Yeah. Yeah. So now you talk about something called security debt which is the hidden liability of disconnected point products. And so if you were to advise a CEO in a room today, how would you think about re you know use a financial refinancing security to actually clo get rid of that debt? Yeah. Well, I would look into a certain KPIs. For example, what is the meanantime to remediate in our security operations that that we can or how many point products do we have for example in network security to enable our zero trust perimeter or if I'm a big production company how many solutions do I leverage for example in the production line in my OT operational technology environment or you can do the same thing in a security operation center hey what are the big stress moments for my teams there and how many tools are we using is there a way to simplify plus also if I combine it with the question on meantime to remediate do I know it number one and second then is there ways to improve it and how could I do I compare with other companies in my industry and there are notable differences yeah and right and in fact the benchmarking part of that I think is has always been very interesting to me because I think when you start doing that comparing yourself to other companies you may think you have a highly mature security model but then when you start benchmarking yourself you realize maybe you don't right and so I an awareness of what other companies are doing. It's always good to have a reality check. It is. Yeah. So, as we look ahead to the rest of Davos, if there was one or two piece of advice you could give a board member, questions they should be asking their CISO today, what is that? Well, , are we ready for the AI age? 83% of the companies will deploy AI or are having it in news? Are we ready? Second question is that are we sure we do not have shadow AI? just two questions which link to the topic of",
        "start": 616.079,
        "duration": 1474.8779999999983
    },
    {
        "text": "what is that? Well, , are we ready for the AI age? 83% of the companies will deploy AI or are having it in news? Are we ready? Second question is that are we sure we do not have shadow AI? just two questions which link to the topic of used and in the end for today to further automate the industrial processes you will leverage agents are we securing those agents and the language models so I would frame it around the context of AI because the next pace of leveraging knowledge on a more consolidate will be leveraging also AI across whichever process of whether this is a back office process whether this is a service process whether it's a production process and therefore focusing on that and asking the team, have we been ready? Are we ready for that next step? Is already a good thing to start with. Yeah, shadow AI is pretty rampant, too. And I'm glad you brought that up. It's the one thing that every CISO I talked to struggles with. because, you know, it's there. We've, you know, we've always had some form of shadow IT throughout history. And so, how are you helping customers actually deal with it? Well, let me let me give you one famous quote of a of a of a truly admirable lady, CO of a big European bank. and she literally said your AI will be used. It's like water. It will follow the flow, right? And and therefore in order to make sure and we have leveraged a comprehensive program called AI runtime security including AI access security. I think you need to look at it holistically and therefore with that you get immediate visibility and then you can protect it. All right. just last question here at Davos. what excites you? What what are you looking forward to the rest of the week here? Well, as you as you know, as you can witness, we are living in a very noisy world at the moment. There's a lot of u news out there. I'm looking forward to better understand what are the big trends also in international relations, but particularly how can we as Pala Networks help countries, nation states, big organizations, public institutions and private enterprises to be better resilient in this fast changing world. Because what's going to happen certainly is there going to be change and it's going to be happening faster and there will be those a notion of AI in it. Yeah. Well indeed not making any political statements here but the state of international relations I think is never been more I don't want to say disruptive but demanding. Yeah. Yeah. Demanding and certainly uncertain. True. Yeah. All right. anything else you want to add? No thank you. All right. So on behalf of Dr. Hammer Risinger from Palo Alto Networks from the World Economic Forum in Davos. I'm Zas Caravalo from ZK Reaches and thanks",
        "start": 750.72,
        "duration": 1748.4789999999985
    },
    {
        "text": "disruptive but demanding. Yeah. Yeah. Demanding and certainly uncertain. True. Yeah. All right. anything else you want to add? No thank you. All right. So on behalf of Dr. Hammer Risinger from Palo Alto Networks from the World Economic Forum in Davos. I'm Zas Caravalo from ZK Reaches and thanks hit that subscribe button and give us a like and we'll see you next time on my next episode of ZAS. Thanks a lot. Thank you. Thank you so much. [music] [music]",
        "start": 889.519,
        "duration": 1767.7989999999986
    }
]