[
    {
        "text": " Welcome to Zcast everyone. I'm Zarval from ZK Research and I'm here in New York at the National Retail Federation show. I'm at the Cisco stand inside the Expo Hall. I'm with Jesse Ali, SVP commercial sales. Jesse, it's your first time on with me. I'm really excited to have you. we're going to talk about first of all this and some other stuff at the Cisco stand. but before we do that, a quick info on yourself. Yeah. Well, thank you Zas. Thank you for being here with us at NRF with Cisco. I'm the SVP of US commercial. that means I cover about my teams cover about 7.5 billion dollars of Cisco's business. We cover about 5,000 of the largest customers in the US in addition to about 280,000 small and mediumsiz businesses and we cover all the different verticals but today we are focused on retail and NRF. Yeah. So, you know, retail is an interesting industry. Historically, a little slow moving, but now with AI, one of the fastest moving industries, right? And so, , you know, from the conversations you've had here and obviously with other customers, you know, throughout the year, , what's how has AI impacted retail and, , so what changes do you see coming and more importantly, what new challenges do you think that brings? Yeah. Yeah. I would say retail is moving very quickly right now and AI is changing everything which is why our theme this year is AI ready infrastructure for the future of retail. and the conversations I'm having with customers are really exciting. So there's a you know what Cisco's focused on right now is our one Cisco approach. And I think you and I have spoken a little bit about this in the past, but it's really driving that platform, that comprehensive platform around security, scalable infrastructure to go drive retail applications. And where they're focused is they're focused on operational efficiency and insights. They're focused on customer experience and they're focused on really helping their customer contact centers serve their customers better. So if you think about operational efficiencies and insights, think about cameras in a store using computer vision to grab analytics of where their customers are. So the customers are all they're walking around the store and they're looking at merchandise. Do you have the merchandise placed in the right in the right location? Do you have the employees in the right places? Are you staffed in the right locations? What does supply chain look like? Inventory, etc. So there's a lot of things we can do around insights. If you think about customer experience, what does that look like? Are we personalizing that experience when a shopper walks into the store? Are we recommendations? And then serving the customers in the contact center is really calls in, they want the right answer at the right time. So, if you're trying to track an order, if you're",
        "start": 5.359,
        "duration": 328.5610000000001
    },
    {
        "text": "that look like? Are we personalizing that experience when a shopper walks into the store? Are we recommendations? And then serving the customers in the contact center is really calls in, they want the right answer at the right time. So, if you're trying to track an order, if you're if you're troubleshooting, well, we're leveraging AI and our contact center solutions to really bring a better customer experience. Yeah. And so, one of the things I like about your the booth you've had at NRF in years past, it's a great showcase for technology. , I want to talk about this in a bit, but what are some of the demos you're showing here? Our WebEx AI agent is a really good demonstration of what I had just talked about before which was how do you improve that customer experience. So we have in our WebEx AI agent we can provide a conversational AI assistant. So you can talk to a customer take their order it can troubleshoot etc. But maybe you want to you want proactive engagement and you want to channel multiple channels. So you want to be able to you want to have a conversation with your customer over text, over audio, maybe over whatever whatever mode of whatever mode of communication they use. We we want our retailers to be able to communicate their customers and meet their customers where they are. maybe you need to escalate a call and it needs to the AI assistant is not meeting the needs of the customer, but you need it to get it to a human being. Vit's actually got AI technology to be able to have a really good conversation based on the challenges that they're having. So, there's a whole bunch of use cases for AI agent. Yeah. And well, you know what I what I like about what you said is it echoes what Mario said on stage last night at your customer event where the internet show isn't a technology show anymore. It's a show about outcomes based on technology. Right. So, everything you just said leads us to outcomes. Yeah. Z and and this is all about helping our customers, our retail customers drive revenue, lower their cost, and really drive operational efficiencies for the IT teams. So, Jesse, I got to ask you about this hologram. , this is Kaylee. I've met her before based off a real person, but how would a retailer use something like this? Yeah, so what Kaylee is is she's a sis, she's our Cisco store digital assistant. And if you think about in a retail environment, you could put this in any store to help a customer. Maybe you want to talk about what these what does the inventory look like, what are the new products, etc. Or think about like a quick service restaurant. As you go through the drive-thru, maybe you want to have a digital an AI",
        "start": 169.68,
        "duration": 592.402
    },
    {
        "text": "in any store to help a customer. Maybe you want to talk about what these what does the inventory look like, what are the new products, etc. Or think about like a quick service restaurant. As you go through the drive-thru, maybe you want to have a digital an AI allow your employees to do other value added things within the quicks service restaurant. So there's a lot of different applications for an AI digital assistant. And this is running on the unified edge product, the newest unified edge product, right? It is. And so it's right here, right? And so can you tell me about that product? Yeah. So the obviously the unified edge can run AI store assistance, but really it's helping our customers do AI inferencing at the edge. And today when you think about all the different use cases for AI in a store that will cause a proliferation of agents and you're going to need the right infrastructure to be able be able to power that at the edge. So it was a purpose-built comprehensive single platform that enables you to add compute storage network security observability with GPUs inside the platform. And that's what unified edge is. And it's really bringing simplicity to our customers and operational excellence or operational efficiencies. And it also has a cloud single cloud management platform. And so like the benefit for a customer is you can go and deploy these things literally in minutes instead of days, weeks. I mean it takes a long time. You have thousands stores. It would take a long time to go and deploy it. And so why don't we have Kaylee also tell us about about how Unified Edge is being used here. Yeah, it' be great. Cisco Unified Edge is a next generation retail solution that redefineses edge computing. It enables next level retail experiences by delivering data center performance, modularity, centralized management and built-in security at the edge. This platform is designed to be quickly deployed and scaled across all stores supporting both existing store applications and new AI applications. One of the things I wanted to ask you is, you know, you have a lot of point product competitors in the retail space and I know Cisco more and more has been going to market with this full stack solution and so how has that been received and and what kind of competitive differentiation does that create for you? Yeah. first of all, we have made a big transition within the company to bring platforms to our customers and that's what we're talking to. I've been talking to customers this week. I literally just left a meeting and we were talking about simplicity and the customer has multiple point products and what they really want is a platform approach and that's where Cisco's been focused. G2 Patel our chief product officer is really focused on bringing a platform comprehensive integrated solutions to our customers. So it's our",
        "start": 303.36,
        "duration": 892.5619999999999
    },
    {
        "text": "and we were talking about simplicity and the customer has multiple point products and what they really want is a platform approach and that's where Cisco's been focused. G2 Patel our chief product officer is really focused on bringing a platform comprehensive integrated solutions to our customers. So it's our about networking it should be secure networking. You think about AI infrastructure, it should be secure AI infrastructure and we bring observability on top of it and we're weaving AI through all of our platforms. Well, as a Cisco observer, good good to see the integration of more and more security into the rest of the central portfolio. So, one of the bits of the stack I did want to ask about though was Splunk. It's been about 18 months since closed on Splunk. , I think the integration of Splunk across the portfolio has been both broad and deep, right? And so how has Splunk been used by retailers? Yeah, Splunk's been an incredible acquisition and there's been a lot of work that's been done over the last 18 months. And what Splunk does is it takes data and turns it into actionable insights for our retailers. And we're seeing a lot of value from our retail customers right now by leveraging Splunk and leveraging the endto-end visibility across an AI enabled retail landscape. So what we're doing here today is we have Splunk integrated into our WebEx platform into our Maro platform. So that'll give you the security in the network, integrated into the thousand eyes for visibility and integrated into third party business applications. So now customers can see the full continuum visibility across all of their operations in their store and also be able to make better decisions around how to drive a better customer experience, operational efficiencies, etc. Lastly, you'd mentioned WebX AI agent. And what I find interesting about that is most people think of that as just maybe a contact center, a meeting tool, but retailers are using it for more than that, right? Yeah. Yeah. Yeah. They're using it. So WebEx, you know, the WebEx platform, it's, you know, it's for meetings, it's for calling. We can deploy calling out at the stores. We've got video conferencing and video endpoints that plug into WebEx. So there's a lot of different use cases for the WebEx AI engine. All right, Jesse. Thanks for the interview. Always great to see the latest technology in the Cisco suite inside NRF. , anything else you want to add? I think we're good. No, thank you for being here. We really appreciate it and we look forward to more customers coming by the booth. Yeah. Yeah. All right. So, on behalf of Jesse Amaly from Cisco, I'm Z Caraval from ZK Research and thanks for watching. Big shout out to Kaylee for being our hologram assistant here. And give us a like and also hit that subscribe button and I'll see you next",
        "start": 455.44,
        "duration": 1181.0010000000002
    },
    {
        "text": "booth. Yeah. Yeah. All right. So, on behalf of Jesse Amaly from Cisco, I'm Z Caraval from ZK Research and thanks for watching. Big shout out to Kaylee for being our hologram assistant here. And give us a like and also hit that subscribe button and I'll see you next [music]",
        "start": 600.72,
        "duration": 1183.0210000000002
    }
]