[
    {
        "text": " Welcome to ZCAST everyone. I'm Zas Caraval from ZK Research and I'm here in Savannah, Georgia at the Talkesk Industry Analyst Summit. I'm with Pedro Rand the VP of AI for Talkesk right and Pedro it was a great couple days. it was a different event than I thought. Typically when I come to one of these events for companies in your category and maybe that category is changing we talk a lot about contact center and see right and so this event largely revolved around what you see here customer experience automation or talk to CXA and you seem to have pivoted everything around that now which was a really pleasant surprise and so can you first talk about what CXA is and why talk desk has made this change. Yeah, absolutely. So, CXA stands for customer experience automation. , it's a new category a category of platforms that automate all the different steps of the customer experience journey. So on talk desk [clears throat] we build talk desk CXA which is a platform that contains all the capabilities to allow the transformation of that journey. It's not just about having a conversation over a phone or an email or a digital channel, but then how do you automate that across the journey? It's not just about having an automation in self-service, but also being able to assist agents with AI capabilities and do analytics. So basically, talk to SKSI is composed by four different moments. the discover phase where you mine process and understand what what are the key things that are affecting your contact center and how you can improve them. Then you move into the build to the build moment where you are invited to build those those capabilities from the data that you discover and during the discover phase and then you put them all to run in the orchestrate. Orchestrate goes from like I said from routing to deflection assistance analyzing post call interactions in terms of quality measurement and then the all the last part is the measure part is where basically you see all of the those automations coming into into place and how they are affecting your experience how you are bringing that and translating that into measurable outcomes. All right. And so this to me it's really more of a you know that high level customer experience AI tool right versus where you've been in the past which is more on the service and support side. Now how does that relate though to your underlying context in our platform? Wow. Right. So before we had what we called infused AI. So AI was infused in the different parts of the journey in the Sikcast. Now we changed that. we changed that because multiple reasons but being the most important one understanding that we need to create and a new new set of platform that wasn't that is based on agentic capabilities that agentic was",
        "start": 5.279,
        "duration": 389.3599999999999
    },
    {
        "text": "in the different parts of the journey in the Sikcast. Now we changed that. we changed that because multiple reasons but being the most important one understanding that we need to create and a new new set of platform that wasn't that is based on agentic capabilities that agentic was performance and when you bring this when we start building this capabilities we also had in mind that other customers that are running on other platforms that were not our contact center platform, they also need to benefit from that. And that's when we came up with that that category of not just orchestrate and run and build all those capabilities across the journey not only for top desk cas but actually being able to deliver that on top of other u platform and that's when we have that capability now available as well to run on other customers that are running in Cisco on prem or a vaia or genesis on prem solutions that allow allows the customers to have you know the keep the benefit of running their on-rem solutions without rushing in moving that that product into the cloud but still benefiting from the benefit of getting the benefit of AI automation the modern tools for AI automation on their existing on-rem solution. So it sounds like pre CXA Talkesk was a contact center vendor that used AI to make its products better, but now you're an AI company that happens to have a contact center stack to actually fuel its AI. There you go. That's exactly that. So it's a consider that CXI as something that you plug on top of your contact center automating the several moments of that journey. Yeah. And I think what's interesting there what you said was and I want to make sure people understand this is that it's not dependent on the talk context center stack below it. You can run on a competitor's on prem platform cloud platform and so that lets companies modernize without actually doing some big rip and replace and as we know in the contact center nobody really likes to [laughter] do that right. Yeah. And this actually it's taking time for for companies to to move into the cloud right it's not a small project and but the urgency of optimization is now so they cannot afford to wait several months or eventually years to do that move into the cloud they need to take that opportunity the AI opportunities now and that's what we offer we offer this platform that can sit on top of their platforms and keep doing their operation on prem but getting their benefits of AI on top. Yeah. Now from a go to market perspective if you're going to help companies apply AI to their customer experience processes very few companies in fact no two companies the same and when I talked to Melinda yesterday from Morrow she actually talked a lot about how you did some code",
        "start": 199.599,
        "duration": 731.2
    },
    {
        "text": "Now from a go to market perspective if you're going to help companies apply AI to their customer experience processes very few companies in fact no two companies the same and when I talked to Melinda yesterday from Morrow she actually talked a lot about how you did some code know built some things and so was is is that a one-off example or is that part of the standard that code development is that part of the standard go to market process right now right soad Glad you asked that. So here's the big thing. when you deploy AI that is not a turn on capability, train the people and move. Yeah. Flip a switch and go. It's not and you need a you need to have more an approach of digital transformation. It's it's totally different transformation. It starts from the top of the company from sea levels that they need to modernize their operation, optimize their operations and in that perspective we need to get into this motion of having a skin in the game. co-develop co-develop with with the customer making sure that we understand we we nail down the use cases that get more value. we get our teams and partners working with those customers and that is the the way to go. delivering AI is a a motion of getting a use case making them successful iterate understanding other use cases and iterate and getting guarantee that this is a is a journey it's not a implementation one and done and you need to keep fine-tuning your results to optimize all the all the all the KPIs that are more important for you and that need for that motion You need to have this level of partnership. You need to have this relationship with the customer. You need to be there. You need to sit with them deeply understand the problem and then provide a recommendation. The AI is a tool. What you do with it depends on on the your use case and what are the goals that you want to achieve and that is the most difficult part. And that's why you we are here to help those customers doing that move doing that shift into this modernization. It's require that level of skill and this partnership is important for get them to you know reduce the risk accelerate the time to market because today our customers they they they have this urgency as well of optimize but they need to come back with some measurable outcomes and so fast iterating fast and proving the value and the return on investment fast is something that is important for them and that's why we also have we need to take a part of that journey as well. Now within your customer base, how does this change who you sell to? Because when I talk to the conversational AI companies, they're like, we're all about CIO or line of business. And when I talk",
        "start": 373.759,
        "duration": 1079.5199999999998
    },
    {
        "text": "we also have we need to take a part of that journey as well. Now within your customer base, how does this change who you sell to? Because when I talk to the conversational AI companies, they're like, we're all about CIO or line of business. And when I talk center side, they're still dealing with the contact center managers. And so, , have you seen a change in the people you sell to to be able to bring CXA in? Yeah. So that is one of the things that when you are in this journey of transformation you change your persona the persona in which you sell to you see now having CIOS and CTOs and CEOs with that pressure of modernization there is budget the problem that happen is the trust on the technology and the trust on the the guarantee of return investment is one of the things that stops those companies sometimes to move at the speed that they they wanted. So today the organizations they have they are mandated by the CEOs and CTOs and CIOS to innovate with AI. The problem most of the times is where and contact centers are usually the number one place where innovation with AI can can make may come in. So the then the next step is who is the partner that we are going to trust to help us. And that's that's the right words. It's a partner. It's not who is the provider who is the vendor that is going to help us. That makes the all difference in the world. And that's one of the things that we're being extremely successful this year allowing us to get to those reference customers that you you you were mentioning. Yeah. Well, that's and that's a it's a big shift from from a go to market perspective and I think you're early out in front of that and what I think that actually that I liked about the event was during Thiago probably your CEO's talk track he was very frank about like what customers are going through now there's some headcount reduction coming there's a lot of transformation of processes you know some people are going to be replaced and often when I talk to some of the other companies in the space they're almost afraid of that change where it seems like talk desk is a lot more willing to take that on which I which I think is an important part of success. So absolutely absolutely the biggest if I have to say I have to mention one reason for that success is that link strong link with those customers and the fact also that we have though that vertical specialization is really important for us that is going helping is helping us to reduce that risk with with the we have solutions that are already tested pre-built pre-trained so talk we'll talk about those verticals I Talk desk has always been big in a",
        "start": 550.16,
        "duration": 1393.1999999999991
    },
    {
        "text": "we have though that vertical specialization is really important for us that is going helping is helping us to reduce that risk with with the we have solutions that are already tested pre-built pre-trained so talk we'll talk about those verticals I Talk desk has always been big in a FSI, retail. Yeah, retail. But now you've added more to that roster and so what have you expanded to and what do you see your value ad being in some of those? So we have a massive team building and working and co-working with with with customers and in those in those use in those use cases. So we have a team that that is deeply specialized in those case. They know this industry very very well. We know what are the use cases that work, what are the use cases that worth to be automated as well, right? And by doing this on our own and and deploy when we deploy those use cases, we have a way higher guarantee of su success and that is one of the key things that customers value on us is the fact we are not going to a meeting with a customer trying to do a discover. Oh, what's your situation? where where should we start? Actually when we go we we come with recommendations because we know exactly how it worked. We know their market. We know their operation. We know what are the use cases that really make a difference and can bring that return on investment and that is going to help us moving fast reducing the risk and a fast time to market which is the number one KPI that those CIO CTOs and are required to demonstrate by the applying AI and I think Pedro from from what I saw too the moat around building that vertical expertise is quite high so it's not like competitors could say, \"We're going to go have a government expertise tomorrow.\" Not only do you need the sales force to do that, but you've actually, from what I understand, built your own small language models for those specific industries to help some of the nuances. Correct. Yeah. It's not about So, it's not about technology and it's not about people. It's a blend of two, right? So, you need to have the right people that knows the industry, that knows the use cases, that knows exactly what is the process. and you need to have the technology as well. So that part was a fundament it's a fundamental blend. Not all you can't just expect to bring a generic tool like a large language model right and expect that this is going to be a tool that is going to solve all the problems. This verticals they have specific needs. The way you want those responses to be articulated by an automation or the reasoning behind an automation system will depend on by dramatically depend on if you are",
        "start": 708.16,
        "duration": 1704.8789999999985
    },
    {
        "text": "this is going to be a tool that is going to solve all the problems. This verticals they have specific needs. The way you want those responses to be articulated by an automation or the reasoning behind an automation system will depend on by dramatically depend on if you are healthcare. let me give you an example a response that you need from for example an unstructured set of data you want to extract a response from from that data in FSI is much much focus on percentage much focus on volumes and amounts while on healthcare is a totally different way it's more detailed in specific things like impacts diagnosis as symptoms, correlated effects, all of that requires a total different tool and that's also another area of investment. We invest on people that knows the business and also invest in technology that help us to that to bring that verticalized asset. All right, Pedro. So, you've got the platform built now, you've got the verticals picked out. What do we what should we expect from Talkes in 2026? So that's a a great question and I have I think a direct answer to that. We right now and my key focus is adoption. next fiscal year the most important thing that we and all I think that all providers in this in this market are looking for is adoption. Adoption adoption. We need to have those customers successful out of the door with very successful return invest positive return investment use cases implemented with epic customers and epic contact contacts as well. So that is the number one focus. do the tools are in place? we have the people in place we have aggressive go to market strategy with this core development strategy in place. What we want is to have those customers be happy using the solutions, consuming those products and getting the return on investment as promised by AI. So we need to make make that reality that promise a reality and that is 100% of the focus during the next the next year. All right. And so last question for people watching this everyone wants a better AI and as you mentioned the lowhanging fruit is in customer service, right? So, , for people out there that are still scratching their heads, not sure how to go from this vision to production, what are a couple recommendations for them? So, see, , number one recommendation I would do is start, just get started. Yeah, just get started. , pick , pick one use case, but pick one use case that can be you can you can measure. So that important thing is that's the most important [clears throat] thing is pick one select one metric and try to change it. That's the thing where you should start and I think that until you get this done stay stick with it and and iterate over it until you get that metric optimize it one then",
        "start": 865.839,
        "duration": 2074.318999999998
    },
    {
        "text": "most important [clears throat] thing is pick one select one metric and try to change it. That's the thing where you should start and I think that until you get this done stay stick with it and and iterate over it until you get that metric optimize it one then pick one that creates impact select a metric and make that metric change with the usage of AI and that's a place to start don't try to boil the whole o ocean try select one and go move. Yeah, I've called that chip shots, not moonshots. If you try and do a moonshot, you'll bury yourself in analysis and never actually get there. There you go. All right. Well, that was fantastic. Anything else you want to add? No, I've been just being quite interesting times for AI. AI is moving now more from a technology perspective into a value realization perspective. And I think that for all the companies working in this segment now figuring out smart strategies of making AI really return investment positive is more important than actually trying to dig into more innovative and more capabilities. We have great tools. We have good solutions make them really deliver value and that's the thing that is most important right now. And I and I like the advice of get started, right? You just you just got to go sometime and I think it's important to do that soon. I was at an event a little while ago where a speaker from Microsoft said in AI there won't be any fast followers, right? You're going to either do it and move forward or you're going to fall behind really quickly. And so if you sit around too long and iterate. Yeah. Absolutely. Yeah. So all right. Well, thanks for Thank you very much. This was a pleasure being here. Yeah. And so from the talk desk analyst summit on behalf of Pedro Andra VP of IT for talk desk. Welcome Zas Caraval from CK Reach and thanks for watching and we'll see you next time on America's episode of Zcash. [music] [music]",
        "start": 1052.48,
        "duration": 2275.9859999999985
    }
]