[
    {
        "text": " Welcome to Zcast everyone. I'm Zas Caraval from ZK Research and I'm here at Equinex's headquarters with Dee Dupta, VP of product marketing for Equinex. Dee, it's been a while since we caught up. how you been? I'm good, Z. Always good to see you. Yeah, know I've been looking forward to catching up to you because we're going to be talking AI and of course AI is on everyone's mind today and in fact every show I go to, AI is there, right? That's right. Now, what's what's interesting about AI is people have tried to compare it, you know, to the birth of the internet and cloud and all these different things, but it's really unlike any other application or workload we've ever dealt with, right? It runs in different places. You know, you got to deal with all the different data and so and so talk about some of those differences and what makes AI so unique. No, 100%. And I think you hit it. It is it is very different from any other application we've had to support in our data centers or clouds or collocations because it is inherently multi-stage and multilocations. You think about you know training versus fine-tuning versus inferencing versus genai versus analytics. I mean you need all these stages and also each of these happens at a different location. You can't have the same infrastructure for each of these stages. So very different from any other application we've used whether it's you know enterprise applications or applications you and I use it's very different with those are mostly in one location. Yeah and that's that's really I think caused companies to completely rethink their architecture and so so talk about why where it runs is as important as really is the model itself right and why that and how companies should think about that. Yeah, I mean think of each of those stages that I talked about as a specific application itself and you know different applications demand different infrastructure needs. So for instance, you want your training to be where compute is abundant, GPUs are abundant. That's where training does best. you want fine-tuning to be in a place where you've got specialized models, companies building their own models and a lot of this data needs to stay behind the corporate firewall. So that mandates where that can run. Then you've got inferencing which you know is best done where the data is being generated which is all at the edge. And so you just look at these different parts of the application. They just need a different infrastructure. But then what they need is all of this to come together. Yeah. And that in fact what you mentioned about edge and data residency I think is has been a big mind shift over the last few years. I think a couple years ago when companies were first experimenting with AI, there was a big movement to trying",
        "start": 5.52,
        "duration": 329.44
    },
    {
        "text": "to come together. Yeah. And that in fact what you mentioned about edge and data residency I think is has been a big mind shift over the last few years. I think a couple years ago when companies were first experimenting with AI, there was a big movement to trying Now that's really expensive moving from clouds but also impractical. And now I think the strategy seems to be leave the data where it is and see if we can move AI to it. Is is that what you're saying? Absolutely. I mean it's you know you heard terms like data gravity and now with sovereignty it's not just the data gravity but it's a mandate where the data needs to run and it's so much simpler easier and cheaper to move your model to the data versus the data to the model. Yeah those egress costs will kill you. They will they will. Yeah. Now if I I know we've had predictions in the industry about is this the year of AI? Is this the year of AI? I do believe 2026 will be the year we really start to see AI accelerate. In fact, I just ran a survey asking about AI adoption and of the companies looking to do AI I think it was 38% said in the next 6 months another 25% said 6 to 12 months that's 63% in the next year. Yeah. Right. And so that actually I I think is a very positive sign for the industry. Right. And with with with with AI being so imminent now, how are companies talking to you about how they're adapting their infrastructure? Yeah, look, I mean it's a journey for every customer. It's a unique journey for every customer where they go through these stages of you know maturity going from experimenting with a few applications to being really an AIdriven and AIled organization and you know our 10,000 customers who are all to your point talking about AI they want to hear you know how other they adopt how what their you know what our recommendation is each one of them is in a different phase what's also unique is each one of them has their own unique requirements combination of their applications, their sovereignty requirements, their regulation requirements. So this is going to play itself out very differently in every enterprise and that's why they're talking to us because we can give them that freedom and flexibility to have that journey on their terms not to be dictated by a vendor by a cloud but have their own unique journey. And the fact that we have you know more than 250 AI partners in our data centers today really gives them that choice and flexibility which is what we're able to offer. Yeah, I think in fact when you look out ahead, I think one of the things that concerns IT leaders is there's still a lot of uncertainty,",
        "start": 169.84,
        "duration": 641.9199999999996
    },
    {
        "text": "than 250 AI partners in our data centers today really gives them that choice and flexibility which is what we're able to offer. Yeah, I think in fact when you look out ahead, I think one of the things that concerns IT leaders is there's still a lot of uncertainty, things and so is the US. other regions of the globe are certainly being a lot more aggressive. and so I I think one of the themes that I hear about data is just companies need more control over it. Yeah. Because the regulations that are in place today may not be in the regulations in place in six months. That's right. And so you've got to be able to adapt your data strategy pretty quickly. And so if you've got all your eggs in one cloud bucket, which you might have had, you know, preAI Yeah. you couldn't find yourself locked into a you know, an architecture that you can't really That's right. avoid, right? That's right. 100%. Look, there is 172 different privacy laws from 172 different countries. Within the US alone, there's 21 states. Each one of them have their own privacy laws. So, this is not simple. It it really is a depends answer. And you know, things like data residency have been in place. I mean, we've heard about GDPR and data residency. What we're seeing now is the evolution of not just data residency, but digital sovereignty and full text act sovereignty. That's that's what we're seeing. And so, you know, with some of the capabilities we have, a we've got 270 data centers in or inside a sovereign border, right? So, that's one. But then, , with smart networking on our fabric platform, it's actually one of the things we're going to be announcing. We're able to control what traffic leaves the country or does not. And so, so that's naturally bringing us into these sovereign discussions. And more general Zas, the other thing I find very interesting about the AI application AI infrastructure discussions is we don't have just the IT team anymore. You've got at least three teams. You've got the data and analytics team. You've got the CISO and the regulations team. And then you've got the infrastructure folks. And so it is these AI infrastructure decisions are being made jointly. And I would say all three of them have equal say. Yeah. And frankly that's long overdue. That is that is that is now one of the things that's become apparent in the AI era is ecosystem is important right nobody can build you know an end to end AI stack. Correct. and so talk about Equinex's ecosystem you know who maybe some of the key providers are and why that's so important. 100%. look I mean we have always you know maintained a position of neutrality. I mean it's in the name of the company equal neutral internet exchange that's that's that's Equinex.",
        "start": 329.039,
        "duration": 952.9589999999993
    },
    {
        "text": "talk about Equinex's ecosystem you know who maybe some of the key providers are and why that's so important. 100%. look I mean we have always you know maintained a position of neutrality. I mean it's in the name of the company equal neutral internet exchange that's that's that's Equinex. I'd say there's about four or five important ecosystems that a customer thinks about. One is where is their data? More often than not that's in the cloud right and so our partnerships with AWS, Google, Oracle, Azure, the list goes on. So that you've got the traditional hyperscalers but what we're seeing now is you know a lot of these neoclouds. So we've got you know lambda and cruso and coreweave like these are the neoclouds. we just announced something with Nebus again these these are specialized AI service providers. Most of the most of them are GPU as a service providers. So the customers want them in the mix. Then we think about the data platforms like data bricks or snowflake. So that that's another group. Then you've got the where the traditional transport is all of our you know network service provider partners all the way to implementation partners like an Accenture or Deote and what customers are wanting is time to market. They don't have time to sit and do these integrations themselves. the fact that all of these names I just mentioned are part of like more than 250 300 AI ecosystem partners and then specifically we have very deep partnerships with Nvidia HP and Dell right where we're not only doing the interconnection bit the ecosystem bit but we are building custom platforms for specialized workloads like inferencing like fine-tuning with with Nvidia Dell and HP so that's that's just a quick overview of some of our ecosystem. Yeah. It reminds me a lot of the early days of private cloud except on steroids. Yeah. Right. Where companies really didn't know how to put these things together themselves and even if they tried to there was months sometimes years of tweaking and tuning, right? AI is that you know exponentially right and so I think your ability to bring a turnkey solution to them that includes network includes compute includes you know the data layer data management I think can really help companies fasttrack now I know you Equinex just had a number of new announcements right that can help companies move forward with the AI can you talk about some of the key ones and why they're important absolutely so there's two two big ones that I'll talk about the first one is our overall AI strategy which is distributed AI and you know we talked about this when data is distributed when applications are distributed when intelligence is distributed you need the world's number one interconnection company to interconnect it all and so we are announcing our distributed AI strategy it's more of an architecture",
        "start": 486.8,
        "duration": 1269.7599999999998
    },
    {
        "text": "strategy which is distributed AI and you know we talked about this when data is distributed when applications are distributed when intelligence is distributed you need the world's number one interconnection company to interconnect it all and so we are announcing our distributed AI strategy it's more of an architecture able to do distributed AI architecture we really had to go back to the network that we provide right and It's a network that not only connects more than 270 of our own data centers, but we have more than 38% of connections to the hyperscalers, right? And so we had to go back to that network and see what we could do to tune it to carry these AI workloads now, right? And so we are announcing a module called fabric intelligence. Fabric has been our product for more than 10 years, thousands of customers, but we're adding a module called fabric intelligence which which basically is monitoring this AI traffic at at you know 24/7 at all points in time and it makes dynamic routing decisions based on where the traffic is and where it needs to go. So those are the two big things we're super excited distributed AI and fabric intelligence. All right. Well, thanks for the overview of the new products. And so, , let's bring this home with just a couple recommendations. So, if I'm an IT pro and I'm watching this and I got my CEO saying to me, we have to have an AI strategy. We have to move forward. Couple pieces of advice at how to move forward, but do it in a way that's not going to put the company at risk or frankly their job at risk. Right. Right. No. So, absolutely there's multiple ways of of engaging with us. you know, everything that I talked about, it's, you know, you can go see it at, you know, equinex.comdistributed AAI. So, there's a lot of material there. , in addition, you know, you can talk to some of our technical experts. We're more than happy to come in, do a 30-day assessment and and tell you kind of on that AI maturity curve where you are, and then definitely help with not just the infrastructure recommendations, but we've got a whole managed services team at Equinex that can actually help the customer in every stage of the deployment. Yeah, personally I'm looking forward to the AI era. I think you remember the old the internet's going to change the way we work on learn and play. AI is certainly going to do that, but it's going to take us to another level and I think make us all just much more productive. Absolutely. So, anything else you want to add? No, I think that's that's good. We got it. So, on the behalf of DD Descupa from Equinex, I'm Zas Caraval from CK Research saying thanks for watching. , give us a like and also hit that",
        "start": 646.8,
        "duration": 1537.5189999999998
    },
    {
        "text": "all just much more productive. Absolutely. So, anything else you want to add? No, I think that's that's good. We got it. So, on the behalf of DD Descupa from Equinex, I'm Zas Caraval from CK Research saying thanks for watching. , give us a like and also hit that time on my next episode of ZCAST. Thanks a",
        "start": 784.639,
        "duration": 1545.4379999999999
    }
]