[
    {
        "text": " Welcome to ZCAS everyone. I'm Zas Careral from ZK Research and I'm in the amazingly crowded and insane Venetian Conference Center, part of the Consumer Electronics Show. I'm with Rick Vanover from VH. Yeah, it was funny bumping in here to my surprise. , and so Rick, , , for those who don't know VH, just a quick intro on them and then what the heck are you doing here? [laughter] So, yeah, hi Rick Vanover from BH. I'm on the product team here and you know, I'm in my 16th year here at VH on the product team. And why is VH at CES? Well, indeed, officially, we're just meeting up with some of our partners. It was actually surprising, Z, how many of our top partners are here, , have both exhibits and then private meetings. We're just meeting. we don't have a booth, we're not going there. But a lot of our partners who really are thinking about the edge and some of the data that lives there, it's getting important nowadays. So that was really the main reason as well as just momentum with those different product lines that our partners have. Yeah. Well, so while this is the, you know, a consumer electronic show, if you've watched any of the keynotes, big theme here, edge AI, whether that's automotive vehicles, whether that's robots, , you know, the I saw there was a session today in , on smart venues, there was another one in the future manufacturing. And while those are separate industries, the one commonality is edge is big across all of them, right? And so that means more data in more places. And what so what's that mean for you guys? I imagine that's why you're here. Well, exactly. In fact, one thing that really stuck out to me was the Lenovo Think Server and Think Edge new platforms as really going out or in some cases central to the data center either way to really process information on the edge AI as well as regular workloads. So that was actually important to me because I talked to plenty of folks that the edge is important as well and when folks start building workloads and systems and processes around the edge they'll need to protect and manage it as well as discover it you know know what they have and all those different governance things come into play as well. So when I think of veh I think of you as really the king of data protection. I mean all hail. Well well I mean you took over number one market share. You haven't looked back right. So when you bring edge AI into this how does that what kind of new challenge does that create? Well it really is education. I think a lot of organizations simply don't know what they have period. Yeah. And the only practical way to get your head around that will be AI and you know",
        "start": 5.2,
        "duration": 310.32000000000005
    },
    {
        "text": "AI into this how does that what kind of new challenge does that create? Well it really is education. I think a lot of organizations simply don't know what they have period. Yeah. And the only practical way to get your head around that will be AI and you know October when we announced our acquisition of security.ai AI massive momentum shift in the AI space for veh so that organizations can secure can understand recover keep their data resilient and then unleash the potential of what they have. So organizations are they almost don't know that they need this yet but they really need to be able to accelerate what we're going to call safe and trusted AI. And so from that standpoint, I'm wanting to be like looking around the corners to see what is coming on a platform standpoint because with what the current VEH product portfolio has from the AI standpoint as well as the portfolio of protection and resilient capabilities, we're already there. We just got to find these customers, these partners, these use cases and really get in front of it. I really thought that acquisition security AI was brilliant because the to me veh's never you've been security adjacent but not a true security vendor. So which is actually interesting because you you've benefited from the uplift in security without actually being a security vendor but security AI make moves you into the security space and it allows you now not only to look for the threats but then recover with what you guys do and to me the product that security has when I started thinking about the challenges that edge AI brings more data in more places I don't know it's like I'm not sure how you do it without a product like security AI right and I think you have to work a different direction in the supply chain of data and what I mean by that is that the security AI set of capabilities they can go onto the production estate and so a lot of people think veh and backup and secondary and cloud storage security AI goes forward in that process there's over 300 collectors across different applications unstructured data and more and so it really then when we think about the edge use cases and I I I don't know what you think but there may be this slight convergence of consumer techn technology and enterprise technology at the edge for these use cases. Everything from smart buildings to you know everything's connected now. Yeah. Exactly. So I think like I said I'm trying to be in the right place at the right time. Yeah. And let me run a thesis by I was talking to somebody from Nvidia about this where you know they've gotten a lot more involved in storage themselves and we were talking about how when people historically have thought about storage it's been by tier primary storage",
        "start": 159.36,
        "duration": 600.7190000000002
    },
    {
        "text": "right time. Yeah. And let me run a thesis by I was talking to somebody from Nvidia about this where you know they've gotten a lot more involved in storage themselves and we were talking about how when people historically have thought about storage it's been by tier primary storage that and in fact the whole backup recovery strategy is based around that now he said what's important is data velocity how quickly can I access my data right how quickly can I move from one place to the other can I you know things like that and that and and from a data recovery standpoint that really kind of changes the way you think about it, right? It it changes and the best thing going for veh is that we're software defined in the sense that we don't have like limitations. Like there's one storage partner, I don't want to throw their name out cuz I don't know if they want us to say this, but we were the only product that made the storage software hit the limit when we were doing some joint testing with them. And we can go plenty of examples beat the ghost dev that we did in 2021 and couple other things where when we were able to move just incredible throughput data from a backup and recovery standpoint. So we're there is there and and organizations that need those high performance environments, they're out there and they are really cutting edge and you're right, the velocity is that surprise bottleneck. Yeah. All right. , and so you maybe just let's wrap up a little bit and see anything fun you see here. , you know, I'm gonna I'm gonna go a little little rogue on the ZCAT here if that's all right. I'm gonna I'm gonna share one thing and I'm going to ask you the same thing. Most interesting thing you saw here at CES across everything and for me Zas, it was the Wi-Fi connected toilet. Yeah, I can see that. I you know, I never thought I'd see the day, but that was yesterday for I maybe the most interesting thing I saw was like I I ran into a company that makes a smartwatch that tracks different data metrics which isn't unique but they're trying to apply a combination of western and and eastern Europe and eastern medicine. And so Chinese medicine is very much based on a lot of homeopathic u you know herbs you know acupuncture things like that. So they're collecting the data, they can predict when they think you might get sick because western medicine is based on, hey, you're sick, go get cured, right? There it's preventative. And so what they're trying to do is by giving you those data points and giving you advice on things to change, you know, make you healthier. And so they're trying to prove the value of Chinese medicine in this western world, which I thought",
        "start": 307.68,
        "duration": 882.3200000000005
    },
    {
        "text": "cured, right? There it's preventative. And so what they're trying to do is by giving you those data points and giving you advice on things to change, you know, make you healthier. And so they're trying to prove the value of Chinese medicine in this western world, which I thought data to do it. I love datadriven decisions. Yeah. Yeah. Yeah. So, all right. Anything else you want to add? No. Hey, thanks for the opportunity, Z. Nice to see you again. It's always great catch up with you, Rick. I haven't seen you since San Antonio. Yeah, that's right. So, on behalf of Rick Vanover from Vietnam, Zas Caraval from Zay Richards, and thanks for watching and I'll see you next time on my next episode of ZAST.",
        "start": 450.72,
        "duration": 923.4400000000005
    }
]