[
    {
        "text": " [music] Welcome to Zcast everyone. I'm Zas Caraval from ZK Research and I'm here at Seahawks House in Berlin. I'm with Julie Souza, global head of sports for AWS. we're here for the NFL game this week. It's actually the Colts and Falcons or ironically at Seahawks House for which you're an AWS partner. How you doing? Great. Glad to be here. It's exciting. Now NFL AWS had a partnership a long time. Yes. why don't we start just with an with an update how things have been going with the NFL. you've been a few years you've been running a lot of analytics for him. I'm curious just what have you learned over the last few years. So what's exciting about the work that we're doing at the NFL is it spans a lot of different parts of the NFL. So you alluded to sort of the fan engagement, the nextG stats start and if you watch anyone who watches the NFL on prime can see the impact it's had, but you're doing a lot more work behind the scenes. Yes. And I really I particularly love a lot of the player health and safety work that we've done with the league. and so it's taking a lot of that same data that goes into nextgen stats, but analyzing it and adding it with, you know, computer vision technology to understand, you know, what players are call causing more injuries than others. How do we get in front of detecting, you know, injuries before they're sustained? the first year that the league rolled out their digital athlete player health and safety portal, there were 700 fewer missed games by athletes. Wow. That's a big Yeah. You think of the dollars of that, right? It's big 100%. I mean, players, you know, want to be out on the field. The owners certainly want those players on the field and the fans want their favorite players on the field. So, this is really a win-winwin. , and there's a lot of interesting insights along the way, too. Figuring out which players are more injurous and then changing the rules to maybe disallow those plays, which we saw with the hip drop tackle last season. Yeah. And so, give a couple examples of those. When you're prepping this, you walked me through them, but you they've actually been able to run simulations on plays and understand which plays are more dangerous. And so, can you just give a couple of examples of things the data that you saw and the rule changes that were made because of that? Yeah. Well, I think the the one that everybody's seen is the change to the kickoff rule, right? So, prior to this change, we found that there weren't that many kickoffs being returned. So, not that exciting to play, right? And that also also caused 2x the injury rate and 4x the concussion rate over a normal pass or run play.",
        "start": 1.309,
        "duration": 267.2209999999999
    },
    {
        "text": "the change to the kickoff rule, right? So, prior to this change, we found that there weren't that many kickoffs being returned. So, not that exciting to play, right? And that also also caused 2x the injury rate and 4x the concussion rate over a normal pass or run play. when you did, you got hurt. Yeah. Yeah. Exactly. [laughter] It's not the best combination. So, they took 10,000 seasons worth of data and simulated changes to the rules to optimize for those two things. Lower injury rate, higher returns. , and with the the rule introduced next last year, we saw the injury rate come down in line with a normal pass and run play. [music] And as of week nine in this season, 79 more 79% more kickoff returns. So, it's a more exciting play now and a much safer play now. So, you're getting net more plays and net fewer injuries, which is actually pretty remarkable when you think about Amazing. And they were also coming up. Last season was the lowest concussion rate on history or in history on in the NFL. So, you're starting to see those like I just mentioned the hip drop tackle. They knew by looking at the data that that play caused 20x injury rate. 20x. So, they're like, you know what, we're just banning this play. Right. even equipment changes, right? So, we were talking about like a quarterback is going to absorb a hit very differently than a wide receiver. So having a different position specific helmet to make you know players safer. Lots and lots of different changes in training in rules and equipment that are making the game safer. Yeah, it seems really the partnership with the N the NFL with AWS has brought I think are a few really big innovations that were just you didn't have before. One is the ability to stream the game so you can insert things into it. cloud production because you're not rolling trucks around and then all the cloud analytics and so as you mentioned being able to run those simulations I think from a rules perspective they want to change a rule they'd run it in a handful of preseason games and have to make a decision right so not enough data right yeah exactly no I think the whole point of the cloud in this is that it's making them more nimble more flexible and being able to do things at scale that would have been either cost prohibitive or just logistically prohibitive for them to be able to do in the past yeah now like I said we are here at in Berlin and I know the internationalization of the game has been a big initiative for really all the sports league NFL's probably taken it to the nth degree with all the places are playing games now. and you've actually helped them try and [music] we'll just talk about how",
        "start": 137.36,
        "duration": 531.2199999999999
    },
    {
        "text": "in Berlin and I know the internationalization of the game has been a big initiative for really all the sports league NFL's probably taken it to the nth degree with all the places are playing games now. and you've actually helped them try and [music] we'll just talk about how having to you know you think about all the infrastructure they need here. how are you working with them on that? Well, I think that's a real challenge for the league too as they go global. It's like, you know, you picking up and taking that whole implementation with you, which, you know, think about the stadiums back in [music] the US, we're, you know, they're all equipped and wired and all of those sorts of things. But as you go international, and the league certainly is looking at globalization as a part of their growth strategy, how do we make that sort of a lighter lift? , so moving work streams [music] to the cloud, whether it's from a production standpoint or a data tracking standpoint, making that all accessible. And then on the flip side of that, yes, that helps in globalization, but it also helps you create different versions of a broadcast, right? So if you're up in the cloud, you don't have to roll a separate truck for each kind of broadcast. You could do a data cast. You could do a 101 version of the NFL for new fans, right? Breaking the game down in a much simpler, accessible way. , and that's all, you know, that's all enabled by having cloud production technology deployed. Yeah. So if you're the local broadcast here in Germany would be a lot more I guess introductory in a way than what you're going to see which is like the data cast back on [laughter] Thursday. Yeah. Now you because you do a lot of sports right and have you and a few of them that you do like PGA Tour F1 do have that problem they pick up and move every week right and so have you been able to take some lessons learned there and be able to bring them to the NFL? 100%. I mean that's the great part is that you're learning all the time and you know deploying those learnings at scale across all of your partnerships but yeah PGA Tour is doing a lot in that space with they just have a and you you actually toured it and did a great segment on it their new production facility which they like to say the great thing about this there's no servers in the building right that whole production facility was built so that they could produce in the cloud which is really exciting [music] Formula 1 they're doing a lot of the same simulation you know work and so creating test cars and simulating on real very expensive cars. They're able to do a lot of that simulation in the cloud to",
        "start": 270.639,
        "duration": 771.7789999999999
    },
    {
        "text": "that they could produce in the cloud which is really exciting [music] Formula 1 they're doing a lot of the same simulation you know work and so creating test cars and simulating on real very expensive cars. They're able to do a lot of that simulation in the cloud to come up with race tactics if you're a team. So a lot of the same tools that the NFL uses are used by you know not just our sports customers but all of our customers. Yeah. Well and actually it's a good lesson for the average you know the the CIO of banks or retailers. The ability to simulate AI now in the cloud is truly gamechanging because if even if you want to know how I should lay out a retail store yeah how would you you'd have to lay out the retail store let people come in and then reoptimize. Yeah. Get their traffic numbers and comput those whereas you could simulate all of those different changes manufacturing all you name it. But you're right, it's that opportunity to, you know, simulate data at scale without having to incor incur the cost and the, you know, the time that was spent doing it in a much more manual way. I'm not actually sure how you would do it without that. I mean, Boeing and companies did it that way, but they obviously the lift for them was pretty heavy. Yeah. Yeah. So, all right. What's next for you in the NFL? , continuing that work in player health and safety to make the game safer for sure. There's always new NextG stats launching. We're looking at things in the, , officiating space. How do we use AI to help and and technology to help be a little bit more definitive? Like what's that first down marker? Can we get that down and you know in a within an inch? so a lot of exciting things on on the on the road map with them. All right. And you had some new things come up this year. So NBA is new. I I wrote about that pre-season. Yeah. Right. But now we're a good dozen or so games into the season. Anything you picked up from that? What have you learned so far? Yeah, that's exciting, too. So, we're working with the NBA and the W and the G- League and all all the NBA properties, all the NBA properties around the world globally, which is exciting. , so again, they they also have an international, you know, mandate. So, a lot of the work that we've done with the NBA, I mean, with NFL certainly is transferable in terms of the globalization efforts of the NBA. , you know, they're launching their stat, their version of NextGen stats, which is inside the game. And so, three of those analytics have launched. , and you'll start to see those woven into the broadcast in late November, so to",
        "start": 393.039,
        "duration": 1017.2180000000002
    },
    {
        "text": "in terms of the globalization efforts of the NBA. , you know, they're launching their stat, their version of NextGen stats, which is inside the game. And so, three of those analytics have launched. , and you'll start to see those woven into the broadcast in late November, so to introducing parody there too for the W and so it's not just you know the guys getting their analytics but the women too. and then you know other fan engagement tools you know things that you know helping you go back in history and look at different plays and understand those better and so what's exciting right now is that we're in that those talks of like what's next what's you know what what sort of do we want to invent together and you know it's a super innovative league. Yeah, I think actually the ability for the you might even have a bigger impact on the WNBA if you can create different ways to engage fans, drive viewership up, drive revenues up, drives player salaries up, and I know that's always a big issue within women's sports and men's sports. Well, even if you look at some of the things like obviously they're in a difficult time right now with their collective bargaining agreement, so I'm not going to comment on that. But if you look at some of the the you know, officiating is a priority, player health and safety is a priority. I feel like that's something where AWS can come, you know, and bring our expertise to bear to help them with that. If you look at player health and safety and obviously a lot of the work we've done here with NFL, a lot of the work in the field to date has been done on male athletes, right? And so, all right, can we look at this a slightly different way? Can we look at player health and safety use cases for the female athlete and advance player health and safety and and longevity, not only for WNBA players, but for any female athlete? That's an exciting thing to contemplate. Yeah, because they are different. I remember when NASCAR went through that when Danica Patrick and some of the female drivers the the cars were designed for men for safety reasons. Well, even just cars in general are actually designed like all the crash test dummies are men, right? So why do women get disproportionately car accidents? [laughter] You said it. Yeah. now, I want to also ask you since we're in Germany about Bundesliga. Now, that actually when I look at the data they produce and the stuff and the engagement they've had with fans, [music] that might be your most successful partnership, right? Just from an impact of the game. I love this because they actually when they launched Matchbox, which is their version of NextGen Stacks, they surveyed like their international [music] fan base. These are die hards, right? They",
        "start": 517.599,
        "duration": 1262.5789999999997
    },
    {
        "text": "had with fans, [music] that might be your most successful partnership, right? Just from an impact of the game. I love this because they actually when they launched Matchbox, which is their version of NextGen Stacks, they surveyed like their international [music] fan base. These are die hards, right? They the respondents said that it improved their game viewing experience and 97% said that they actually learned something more additional and these are already these are hardcore fans. Yeah. Yeah. Right. So it's like it shows you that if you present the data in a way that's like interesting and accessible and [music] aids the storytelling, people want to consume that, right? They're also DFL is really pushing the edges like generative AI and how they can deploy it to just sort of grow their impact. We were talking about this before. They are producing like you know long form stories and things like that. And then they're using Gen AI to create derivative versions like all right let's take this story whether it's a game recap or an upcoming [clears throat] you know you know article on something and let's create a Snapchat version a Instagram version a [laughter] they're showing us Tik Tok. They're very excited about the DFL. , so they're just they're using all of these technologies and they're and that's I think what we look forward to when we partner with with properties is like who's got that like innate curiosity and that spirit of innovation. , we were just on a call with one of our sports partners the other day and and I asked the question. I was like, I want your hard problem. Like what is it you're trying to solve for, right? And then let's figure out how we can maybe use technology to solve that problem. And so TFL has been, you know, at the, you know, they come at us with all their hard problems, which I love. Yeah. And I wanted to actually ask you about the impact because a lot of the AI that you've done has been analytics, right? I remember talking to swim Australia. It changes how they coach things like that. We are entering the generative AI era where it allows for more personalization. What kind of impact do you think Gen AI is going to have on sports? I think that's going to help a lot. Well, in the personalization for sure and just in that regional [music] or globalization, too, because you're seeing things like we were talking a little bit earlier about the PGA Tour as an example, 15% of the shots in a tournament are actually televised. That's leaving 85% of the shots on the table, right? And so, and with and when they're not televised, there's no voice over, there's no commentary, there's no context. So, the PGA Tour, as an example, is using that scoring data and their entire historical archive. and you",
        "start": 641.12,
        "duration": 1517.6189999999997
    },
    {
        "text": "actually televised. That's leaving 85% of the shots on the table, right? And so, and with and when they're not televised, there's no voice over, there's no commentary, there's no context. So, the PGA Tour, as an example, is using that scoring data and their entire historical archive. and you and they're creating contextual text commentary within their tour cast app so that fans can actually follow their favorite golfer and have context for what's happening versus just silenced, right? And so I think what that some of the generative AI tooling is allowing [music] content to be maximized and distributed in a more localized and personalized way. , and I'll give you an example. DFL actually did something really fun where they took again their scoring data. They created text commentary, [music] but they did it in multiple languages and then multiple personas within those languages. So, and I'll give you the example. One of them was just like a straight broadcaster view. One was like a really Twitter X style quippy feed. And then they had one they called bro and it was just, you know, the bro feed. A bro feed talking as you expect a bro, right? Like with their friends, a more casual tone of commentating the game. So, it's sort of letting fans meet, let the properties meet fans where they are and bring new fans in. So, do you envision a day where as a fan I'll be able to watch any sport, follow any players and and really digest it any way that I want to? That is my hope and dream. Yeah. I mean, I [laughter] really do think that and that and we were talking about this earlier too. We had this sort of somewhat [music] like this barrier of like a linear distribution model where you had a one to many stream and you had to produce the least offensive broadcast of as many people as possible. Now with streaming, people can sort of choose their own adventure. So, if you want to follow a particular player, if you want it in a certain language, if you want your fantasy stats updated in real time, if you want to be prompted to order Uber Eats 20 minutes before halftime, if you want to place a real money bet, all of those sort of engaging second screen experiences can be built into the primary streaming experience in a really personalized, really interactive way. And I think that's the future. Yeah. Well, sports betting and fantasy sports had a huge impact on engagement. Now, we just need the content to be able to follow what it is we're trying to engage with. Yeah, I agree. Yeah. And last sport, , let's talk a little PJ Tour. I think the the the advancements in AI that I saw in the PJ Tour app this year were off the charts. The amount of innovation from, you know, Hot Streak and Every Shot was",
        "start": 772.56,
        "duration": 1772.9779999999998
    },
    {
        "text": "with. Yeah, I agree. Yeah. And last sport, , let's talk a little PJ Tour. I think the the the advancements in AI that I saw in the PJ Tour app this year were off the charts. The amount of innovation from, you know, Hot Streak and Every Shot was They don't slow down. I'm more to come. They've got a really exciting one in the works right now. And it's just that's what I love about the tours. They they are relentless in their pace of innovation. , so they're they're really good stuff and and a lot of it really aimed at the fan, but they also have tooling that's making it better for the golfers, too, right? So, generative AI tools that are helping the golfers like, you know, approach a tournament logistically as well as from a you know a golfing perspective. Well, that's something again would translate across leagues. If you're a batter in a hitting slump, if you're a kicker who's missing field goals, if you're a golfer who's got the yips, to be able to look at when you're successful and when you're not successful and use analytics to be able to tell you why that is. It might just be, you know, your kicking motions off a little bit or something like that. It's a great thing. The PGA Tour, one of the execs there said something I love. They said it used to be back in the day, you know, they had swing coaches and now golfers and then they had like staff strength coaches, right? And now they have stats coaches, right? So they they sort of added their their coaching base, whatever. But these players are much more comfortable with data and they want to understand the data and how it can help them from a performance perspective. And so all of these analytics help them. Yes, it might be a minor modification in terms of you're favoring your right foot instead of your left. Let's build up strength in your left. , so it it's you you have like sort of everybody much more comfortable with using data and and players across all sports properties are sort of leaning in and asking for [music] more. Yeah. Well, you know, it's it's been great to see and I just think you know, keep it up. So everything from, you know, F1, NHL, NBA, , the production quality of all those sports has gone up and frank, the fan experience had. And that's really a win for everybody. And so I, and the other impact I think you've had too is being able to attract , non-fans and casual fans and make them hardcore fans. And I think you and I talked to this last time we talked where what AI does is it lets it democratizes expertise. And so a casual fan now can become have the same kind of insights as a hardcore fan",
        "start": 902.48,
        "duration": 2021.298
    },
    {
        "text": "non-fans and casual fans and make them hardcore fans. And I think you and I talked to this last time we talked where what AI does is it lets it democratizes expertise. And so a casual fan now can become have the same kind of insights as a hardcore fan for like in the NFL broadcast. I love that. The defensive alerts, right? I love that. Like if you're a, you know, if you're a former football coach, you're going to see the guy coming up, but as an average fan, you [music] might have no idea what that player's doing. Right. So So if we can signal, hey, look for this. You know, these guys are likely to blitz. All of a sudden, your eyes are tuned and and then when that happens, you feel smarter as a fan, right? Like I knew that was going to happen. Yeah. what we just showed you was going to happen, but or previewed that. It was a predictive model that helped it, you know, inform. But I do think when fans feel smarter about what they're watching, they will watch more of it. They will become a more invested [music] fan. So, well, then that drives up revenue and that's good for everybody. So, it Yeah. So, all right. , anything else you want to add? No, thank you. Yeah, we talked a lot of AI and really excited about the game tomorrow and you know, I guess next year at this time I'll be expecting Oh, more stories. Yeah, bigger things. Let's go. Yeah. So, all right. So, from Seahawks House in Berlin, , I'm a Julie Souza from AWS. , thanks for watching. Give us a like and hit that subscribe button. I'll see you next time on our next episode of Zcast.",
        "start": 1028.319,
        "duration": 2145.538000000001
    }
]