[
    {
        "text": " Welcome to ZAS. I'm Zas Caraval from ZK Research and I'm here inside the Expo Hall at AWS reinvent. I'm with old friend Andy Thurai who is at Cisco now. Andy, longtime industry analyst. now you're at Cisco. What do you what do you do at Cisco now? So I'm a field CTO. so my job is to obviously meet with the customers and then help them with the horizon 2 horizon 3 when they're trying to build this AI systems how do you how do you build in such a way whether talking about infrastructure observability security all of those things and how do you build that properly right so mainly my meetings involve mostly CXO level helping them more of advisory role pretty similar to what I was doing earlier just in a different side yeah well it's a great role for you and the timing is good too so as I mentioned we're here in reunion I think by all accounts This is the industry's largest cloud show. It's become largest tech show almost. Yeah. Yeah. CES. It's supposed to be a pretty major AI show. Matt Garmin did his keynote this morning. Big theme here is around accelerating the path to AI. In fact, he talked a lot about a world where we have millions of agents. Y and so talk about the partnership that AWS and Splunk have. So it's rare that the Splunk boot. Yeah. Okay. So the the one of the things when it comes to we talked about this earlier is you know in the past when people used to do this monitoring observing of the systems and stuff it used to be maybe megabytes gigabytes even terabytes of data now you're talking about terabytes of data a lot of data is coming in it's hard to manage that data management particularly the observability management data logs right so what what we are trying to do is that we have partnered with AWS not that's not the only partnership we have with Azure data data lake as well as with the snowflake and all that. But what's unique about AWS is we could store our data both in S3 as well as their security data lake. What that means is you don't have to necessarily let's say that if you're producing data to AWS, you don't have to necessarily send all of the data to our platform back in there. So you could have them in one place. You could have the the people don't realize it's not the storage that costs money when it comes to data. The the transportation is a lot more expensive as you know, right? That's one. And the second thing is you also don't have to duplicate the data. I mean when you start duplicating the data using it for analytical purposes and others there are the average industry standard is almost eight times. So you don't have to make duplicate copies.",
        "start": 5.839,
        "duration": 279.04
    },
    {
        "text": "know, right? That's one. And the second thing is you also don't have to duplicate the data. I mean when you start duplicating the data using it for analytical purposes and others there are the average industry standard is almost eight times. So you don't have to make duplicate copies. that's why we're working with them. So we'll have a centralized place where we can provide insights and then you can store wherever you want. If it is S3 is your choice go for it. We don't care. Yeah. So you've had this partnership a while and I think one of the interesting aspects of AI is it really changes infrastructure management right and historically companies have managed observability security networking you know performance all these things separately I know since Cisco acquired Splunk is in order to bring those worlds together right and so talk about that how that how that's been going well so if you think about it actually that that's a great point right if you think about it in the past it used to be security used to be separate you know wing doing things by itself. Observability used to be by itself and logs used to run all by itself. We are one of the first ones to combine. You know what there is a place for security and observability to to be together. We put that together. Now with Cisco we are doing even biggest thing. For example, if you had to think about it you know everybody talks about a full stack observability but if you had to think about it that's only in application stack. Not many companies do the network visibility combined with application visibility right? I mean there are companies do it separately. What we are trying to bring to the table the simplest way I would put it would be both vertical and horizontal availability. In other words abstract full visibility all the way from app to gem digital experience monitoring to the services visibility infrastructure of the old nyas but also hone the unknown networks the whole network visibility. So actually from end to end we are the only company who could provide the visibility to companies. Yeah, it's really redefining that stack right in the area of AI where like you said it's the app stack but also the infrastructure stack and I I guess that's part of scaling out as well. now I know one of the the challenges that customers have and talked to this a little bit but is in managing their data. in fact that was a part of Matt Matt Garmin's keynote this morning too and from your work as a field CEO talk about some of the challenges customers have in managed school data and and some of the ways you ala so the problem is when the data is being managed or terabytes level it's okay but when you're talking about terabytes even",
        "start": 145.599,
        "duration": 538.6400000000001
    },
    {
        "text": "and from your work as a field CEO talk about some of the challenges customers have in managed school data and and some of the ways you ala so the problem is when the data is being managed or terabytes level it's okay but when you're talking about terabytes even amount of AI applications the innovation speed that's coming into the market it becomes a little bit difficult for companies to manage So that's why we have this data management efficiency we brought into the edge processor combined with the machine data lake. So what it'll allow you to do is that you could catalog the data when you want to capture it and then send the data and store the data where you want it. So essentially it's not just always about a cost. Cost is also a factor where you can store it cheaply if you want. and also it's a lot more faster and efficient to process. So you don't have to slow process your cold data. So it's a lot faster and plus on top of it using the vision data league you can also build the time series model which we didn't even talk about that's another angle that we're bringing to the table right and I know one of the big innovation years ago this year was AI campus y and that was initially announced for networking correct and then I think in the back half the year they talked about splunk and a canvas integration correct how's that so essentially what what we are thinking about doing is you know you heard the term AI is a new UI in this particular case it literally is it literally is the new right so the when we talk to the CXO level the things what they tell us the most difficult thing for them is to build build maintain manage and feed data to the dashboards they'll have hundreds of dashboards and it's hard hard to manage that so what we are trying to do is that remove the dashboard the UI portion of it we'll have the data on the back end use the AI canvas to ask the questions you want. It'll know based on the persona what you're looking for, it'll string the data sources together to give you the information what you're looking for on time. So in a world with millions of bots, right, or millions of bots coming, how's the AI canvas helping? Yeah. So one is cuz I'm not sure companies know how to get a handle on that. Yeah. So look the AI canvas is more of a UI but also we have the agents that we whether whether pre-built or give you an option using the MCP server or the combination of you can build an army. You and I talked about this earlier with the AI velocity the application velocity that's coming in it's not going to be easy for companies to manage this",
        "start": 277.04,
        "duration": 797.5190000000001
    },
    {
        "text": "we whether whether pre-built or give you an option using the MCP server or the combination of you can build an army. You and I talked about this earlier with the AI velocity the application velocity that's coming in it's not going to be easy for companies to manage this So we think in the future it's going to be a combination of the agentic workforce and a human workforce working hand in hand together to make it work. So we are doing all the components a canvas is one MCP server is another building the agents using agencies another combination and governance we are working on all of the things to bring the agent workforce together. You know, I mean, I think you know, one of the interesting aspects of the Splunk acquisition too is that at partner summit, G2A, chief product offer at Cisco talked a lot about Cisco wanted to be the mission critical infrastructure for the era. I think one of the aspects that's kind of formulated with the reader and I wrote about this book partner summit is a combination of with Splunk network 3000 things like that. Cisco actually has more infrastructure data to power company's AI initiatives at least from an operations perspective. It is so this is why it's a truly a match marriage match made in heaven because we are combining that operations data of networking both owned and unowned networks and fitting into the full stack visibility literally right so that gives us a view of a full stack visibility. Yeah. All right. I think we got to wrap this up. It's getting pretty exciting. People are walking all over inside here. Soon as you're the field CTO though, I want to wrap this up with a couple of recommendations. Everyone out there that there's 50,000 people interested in AI or maybe more than that. Couple of piece of a couple of recommendations on how companies can get started with AI and do it in a way that's scalable and not going to put their business at rest. Simplicity would be use Cisco own. Okay. But yeah, no, all jokes aside, I'm happy to talk to any of them. Matter of fact, I am delivering two speeches here right at the booth tomorrow, one tomorrow and day after tomorrow talking exactly about this. How do you scale up your AI operations? Okay. , start simple as well. Thanks, Scott. So, all right. Anything else you want to add? I'm sorry. Anything else you want to add? Follow me on LinkedIn. Follow my blog post. I talk about all of this all the time. All right. So, from the Splunk booth inside the expo hall, the busy expo hall at AWS revent ZK region. Thanks for watching. , give us a like, hit the subscribe button, and I'm sure I'll have old friend Andy Tryion on again. So, thanks, Andy.",
        "start": 408.24,
        "duration": 1068.0800000000002
    }
]