[
    {
        "text": " [music] Welcome to Zcast everyone. I'm Zas Caraval from ZK Research and I'm here at Cisco's headquarters. I'm with Snor Jespu, SVP of collaboration and also GM of the group and that comprises everything under the WebEx brand as well as the Cisco devices. Correct. That is correct. Yeah. And I understand congratulations are in order, right? So u new role running the whole group now. you excited about that? you know, I'm super excited and not only that, it's my dream job. it's the job I've always wanted and and why is that? first of all, I think having it as one group makes perfect sense. You know, we have the contact center, we have meetings, calling the suite, we have the devices with both phones and video devices, but there's a number of common denominators across here as well and a lot of synergies. So bringing this under one umbrella bringing it as as one group is is very exciting and I jump out of bed every single morning to create the best experience is you know the best products and being allowed to do that for such an amazing set of products and not at least I have an amazing team. Yeah. And you use the word experience. I wanted to start with that because you've got really an interesting background. But right you you spent some time at a consumer company at Bang and Olson who's very well known for user design. You ran the award-winning devices group which also known for its user design. And how how does that background in user design do you think help you in this role running the entire group especially on the CX side which let's face it hasn't really been known for its great design over the years? No. As an industry. No, I I think as an industry I think we're doing a pretty decent job on on on contact center and CX now. But so what does that give me? I I think there are things with user experience and experience that that is key. It's about really putting the user first. But when we talk about users is there they're two users. They're the ones that actually use the product. That's the one that calls into the contact center, the one that use the device or use the meeting service. But it's also the ones that own and operate. So we have to think that both have both are users and you need a good experience for both because for the ones that own and operate you want to scale. You want to give them the tools that give them the superpowers right and for the users you want it to be be smooth. But what did the time at Bangan Olson what did that teach me? It taught me a number of things. First of all, at Bangan Olson, we had some fundamental policies and and ideas about how we design stuff.",
        "start": 5.894,
        "duration": 332.025
    },
    {
        "text": "and for the users you want it to be be smooth. But what did the time at Bangan Olson what did that teach me? It taught me a number of things. First of all, at Bangan Olson, we had some fundamental policies and and ideas about how we design stuff. be magical. It was always going to be the same type of shapes, simple geometrical shapes. the whole thing was about a product designed for the music lover, not a hy geek, but a music lover. and taking that experience bringing it into Cisco you go back into and you think that Bang and Olson it was time to music it should be as short as possible from when you did something on your phone till you had music time to music if you think about it from a contact center and a meeting and and calling point of view it has to do with the quality the stability it's actually time to connect time to install it's that first user experience whether it's going into a contact center or or into meetings and calling and I think that the that bringing that attention to detail is key and then about passionate about the details because in the end of the day it's about small details that makes a big difference and you could just think back to some of the products you love in your own life. The ones you really really love are the ones that that are doing what you expect them to do when you expect it. I'm frequently asked about great design. I'll just add this. And they and they ask me, \"What is great design?\" An axe is great design. An axe is doing exactly what you expect it to do. It's great in its in in the hand when you're going to chop that piece of wood. It's doing what you believe it's going to do. The same thing we need to think about our products as well. It should do exactly what you expect it to do when you need it. And and I think that's what I learned from from that time. Yeah. Well, let's face it. it's not just at at WebEx, but corporate software in general. Never, you know, nobody's going to say it. historically, it's been easy to use. So, it's good to hear you say that. Yeah. And [clears throat] I think it's it's blending a a consumer way of of using it with the right security level. I'm sure we'll talk about that later on. And then the last thing which is particularly important for a a corporate side is that if you look at all of these whether it's a contact center, it's calling meetings or devices, all of these are mission critical. It's the it's it's the front facing of your company. If it's mission critical, it means that the ones that own and operate this, they need to have the tools to be",
        "start": 171.36,
        "duration": 641.7840000000001
    },
    {
        "text": "of these whether it's a contact center, it's calling meetings or devices, all of these are mission critical. It's the it's it's the front facing of your company. If it's mission critical, it means that the ones that own and operate this, they need to have the tools to be and be on top of that all the time. All right. Well, I've talked to you plenty over the years about the user meeting side and so let's focus on CX for this discussion. , you know, there was a lot of chatter about AI coming into 2025 and now that you've you know, you're I know you're planning for next year. when you look back at this year, what did we get right in the industry? Where did we miss and what are you thinking about for 2026? Yeah, so if we think about what happened this year, we were really leaning in on the AI side and it was a lot of AI functionality and one of the things that we spent a lot of time on is what we call connected intelligence. So we talk about people to people, people to AI and AI to AI. And if we think about that in a contact center setup, the peopleto people is obvious. It's an agent talking to a [clears throat] person that's actually calling in. The second thing is when we talk people to AI, that's when you have a person calling in and actually talking to an AI agent. But what's also happened this year is what we call AI to AI and in a contact center. That's interesting because how do you train and teach the AI agent? You have another AI agent that actually monitors that. And I think that where we made great strides is on quality management for contact center where we had an AI agent monitor another AI agent. And take a financial company example. A person calls in, talk to an AI agent, and that AI agent did not pitch the new credit card at 3 minutes and 20 second, 27 seconds into the call. You have an AI agent also monitoring that. And I think that we saw the beginning of that in 2025. And I think that the connected intelligence piece is is really where we started to to push that in 25. And then you said where are we going in 26? I think the key thing in 26 is to go from technology excitement and excitement about a lot of these agents to actually tangible outcomes. So can we have higher customer satisfaction because you get result quicker? and I have an example of my own actually. , I was actually moving house here in in the valley not too long ago and I was trying to move my my broadband connection. I spoke to a human agent and I had no success and a little later I actually ended up conversing",
        "start": 328.639,
        "duration": 962.986
    },
    {
        "text": "example of my own actually. , I was actually moving house here in in the valley not too long ago and I was trying to move my my broadband connection. I spoke to a human agent and I had no success and a little later I actually ended up conversing actually solved the problem better for me than the human agent and I was super impressed with what they could do. So I think that what we will see next year is more focused on the final outcome and the numbers that will drive for for the companies. Yeah, you know, you you bring up an interesting point. In fact, my prediction this year for CX today, they asked all bunch of analysts for predictions was that in 26 we'll start to see some use cases where people prefer the AI agent over the human. And I first ran that actually by a Cisco customer at Cisco Live, one of the banks. And she said no no that she doesn't see that being the case. And I said well banking is a great example of that where back in the day nobody people said that about online banking. We'd never online bank because we can go in and talk to a person. Now nobody goes in the bank right. And I think for a lot of u simple use cases like what you were trying to do with the cable company. AI agents are just they're faster they're more accurate and they're always available. Yeah. And so why would you want to wait and on hold for a person when you can get something very quickly from an AI agent? Yeah. And not only that, but you know the AI agents they're really well trained. We have one example actually from a a customer ours where the AI agent was actually talking to an elderly woman and that AI agent actually remembered asking about her husband's that was ill with cancer and that meant the world to her. So I think that this is being the lines will be blurred and I think at least that the outcome the time to resolution the consistency of your brand if we think about all of this I spoke about mission critical earlier but if you think about the contact center it is literally the frontfacing part of your company and if that can be consistent it can be u exactly the way it it it should be. I spoke to another health company here not too long ago and they said we would like to be the Ritz Carlton of health companies. We would like to That's ambitious. It is. Yeah. And and they said we want to be able to have that you met like you were actually being a Ritz Carlton. And that kind of thinking if you think about what would that take and that might be easier to do with with AI than than",
        "start": 491.28,
        "duration": 1283.8670000000002
    },
    {
        "text": "It is. Yeah. And and they said we want to be able to have that you met like you were actually being a Ritz Carlton. And that kind of thinking if you think about what would that take and that might be easier to do with with AI than than rethink of the entire healthcare industry I think. So totally. Yeah. Yeah. Now I know 2025 was a big year for WebEx contact center. In fact I think Cisco pushed out more features perhaps in 25 than any other year before that. And so I don't expect you to know every one of those, but are there any particular ones that stand out in your mind? Yeah, I mentioned the one about quality. I think that's that's key. The other one was the AI concierge. that was that's also super key to us. that's that's helping out there. And then you know, a lot of the new features we've had has actually led to some really big wins for us. you know massive global shipping company you know a a a a big company in in in the building industry etc. so we have had some really successful wins as well and I think where Cisco is is unique as well is that not only do we do contact center but because we have the rest of of our portfolio on the collaboration side you know calling and contact center those two things go go really well together and well calling a big part of contact center it is and it's an instrumental part of contact center and you know having that massive calling footprint of ours and and all the things we can do with with calling both cloud calling and also onrem we have the ability to to really drive some of those features. Yeah. Well, it's good and you know like I said it was great to see the momentum [clears throat] and you know when I think about CX and AI going into next year. You talked a little bit about the outcomes, right? But and I do think every contact center leader I've talked to and even CIO to some degree is rethinking the way they measure the value from this because it used to be things like average [clears throat] handle time, first call resolution. Well, if you're using AI agents, it's always first call resolution, right? And average handle time could go up. And so when you when you're talking to customers, what are those outcomes they're looking for? Yeah. So the interesting thing and and let me be vulnerable for two seconds here as well. you know I'm fresh into running contact center as well and I just literally before meeting you now I came out of an hour's architecture view of where they're trying to basically teach me everything I need to know about the architecture and I find it absolutely fascinating now with the",
        "start": 655.04,
        "duration": 1596.2670000000007
    },
    {
        "text": "know I'm fresh into running contact center as well and I just literally before meeting you now I came out of an hour's architecture view of where they're trying to basically teach me everything I need to know about the architecture and I find it absolutely fascinating now with the using AI our circuit that we use here at Cisco to actually learn as much as I can about contact center one of the things that that I'm I'm seeing and and I get a kick out of learning this actually is that a lot of the contact center technology has been developed in the 70s and the 80s and and the '9s. Yeah. I mean literally no mean basic queuing we're talking mid70s and and and and same thing. Yeah. Exactly. and and it's the same technology that's almost there now. where I think this is actually at a watershed is that AI will be a disruptive technology to to all of the things that have happened there. So when you ask what are the customers wanting to get out of it, I think it's consistency. I think it's happier customers. I think it's it's making sure that you are using your human agents for the right escalations and that you're able to improve of the quality that that you're doing and I think those are the key things that it it's basically driving it and and also driving a reduced cost of operating the the contact center. All right. So you know when I talked to G2 Patel the chief product officer at Cisco he talks a lot about this platform advantage. Y that Cisco has and in fact he he he describes as being a force multiplier for Cisco. So talk about when when it's WebEx on a Cisco network and with the security what kind of how what is that force multiplier? Yeah, I multiple things but I think especially in two key areas. 1s around security and when we listen to G2 he always talks about how security is no longer at the edges it's actually fused into the network it's fused into everything we do and I think that also on the contact center side there is an immense development on the security side standing on the shoulders of what we do on security at Cisco is absolutely paramount and I think that with that we could provide really very different solutions for for the end customer. The other one where we get the true Cisco architecture is everything around manageability and observability and because in the beginning we spoke about the experience not only for the people that used the contact center but the ones that own and operate and I think that the tools we have for manageability and observability at Cisco that is key because that means that you can and not at least what we've done with AR canvas you can all of a",
        "start": 812.32,
        "duration": 1932.7450000000001
    },
    {
        "text": "that used the contact center but the ones that own and operate and I think that the tools we have for manageability and observability at Cisco that is key because that means that you can and not at least what we've done with AR canvas you can all of a able to resolve things quicker. You can start working on that AI canvas when there are problems that need to be resolved. And for this that's mission critical, I think that is key. another one I would like to say as well is that if we look across collaboration we made a very very easy interesting acquisition a couple weeks back of a company called Eidubs. Yes. And easy is a translation engine that goes spoken language to spoken language without going via text. And it makes it snappy and fast. And with that type of technology all of a sudden you can start offering services in multiple languages as well. And what we get then with the platform advantage is that you know this is useful for video devices for calling for meetings but it is also using for contact center because all of a sudden you can scale in your tone of voice not only for AI agent but also for a human agent where a human agent can speak in their mother tongue to and you can offer services a number of languages. So I think that when we think about the platform advantage we we really see that across but most importantly security manageability observability is is is really where it's coming in also for context. No that makes sense and actually I think the more AIdriven that CX gets the more I see the CIO getting involved more so than the traditional communications people and to me that's a big advantage for Cisco because you've already got the year of those. So, , just last question, you're being a, , a thought leader in this industry, , what's one prediction you have for next year that might surprise some people? One prediction for next year that might surprise people. You know, this is that famous last words because no one's going to remember this next year at [laughter] this time. So, so I think it's it's an area where I we should always be cautious, but but I think they're they're they're couple if I can if I can be so frank. I think that security will be paramount. I think anything around deep fakes, how do we know that it's you or me? indeed, how do you know? How do you know? And I think the tools around that and what we develop around that is going to be paramount. and I I think that all of the security that we're building, we already have some partnerships in that space and making sure that a contact sector is ultra secure and and and same way with with the rest of of",
        "start": 983.519,
        "duration": 2231.6270000000018
    },
    {
        "text": "we develop around that is going to be paramount. and I I think that all of the security that we're building, we already have some partnerships in that space and making sure that a contact sector is ultra secure and and and same way with with the rest of of we spoke about a little earlier. I think that we will go from really pushing a lot of different agents and features to being very very outcome driven. And what it will drive and I think what we will see in next year is that we will see really the outcome for the companies that have embraced using these type of tools where you will see higher customer satisfaction shorter time to resolve and and really get there. I think those are the two. All right. So if I were to sum that up, better outcomes coming to an industry that historically hasn't had great outcomes. Let's face it, for all the innovation we've had in contact center, people by and large don't have a great experience. And so that's good to hear. And then beware of the deep fakes. You got to have the embedded security. Is that about right? That is a good sum. Okay. Anything else you want to add? No, I think that's just good. Thank you so much. Always appreciate the time. So on behalf of Jespu, GM and SCP, a collaboration at Cisco, I'm Zas Caraval from ZK Research. Thanks for watching. , give us a like and hit that subscribe button and I'll see you next time on my next episode of NCA. [music]",
        "start": 1136.72,
        "duration": 2359.007000000001
    }
]