[
    {
        "text": " [music] Hey, Zar from ZK Researcher and I'm in Power Field, home of the Denver Broncos. I'm with Dave West from Cisco. New role for you, Dave, this year. It's a new role, global specialist. It's great to be here. Now, we are here, home of the Denver Broncos. This is one of many Cisco stadiums. I have noticed this year, in fact earlier this year to start this season, Cisco issued a press release announcing a number of new partnerships in NFL teams including the Vegas Raiders, Arizona Cardinals, Keer, which is Carolina Panthers, Buffalo Bills, and there's a couple more to go with the roster. The Patriots, 49ers, and a whole bunch of them have included. In fact, this stadium is Cisco Network. What's caused this kind of resurgence of stadium deals for Cisco? Well, I mean, we're so committed to sports and entertainment, and I think you see us winning many of the stadiums today, either applying Wi-Fi 6E, Wi-Fi 7, but really it's about delivering the full stack experience because we want to change the fan experience. If you look around here, everyone will be using Wi-Fi, will want connectivity because they want to be able to share that experience with others. Yeah. And in fact, let's dive deep in the concept of full stack. So there's a lot of competitors you have in the stadium in the stadium space, but when I talk to some of your competitors, their definition of full stack is network. With Cisco, it's actually much broader than that, right? There's IPV, the security, and so talk about that as a different that Cisco's definition of full stack at stadiums. It's abs it's absolutely much broader. We still talk about Wi-Fi networking, but we fuse security with what we're doing. things like hybrid mesh firewall, zero trust access, but there's other things like digital signage which really do enhance the fan experience. And so it's not just infrastructure, it's about how we enhance everybody around here's experience with using our technology, but really engaging with the team, being part of the entire, in this case, the Broncos experience. Yeah. And it all comes down to the network in a lot of ways. in fact in the press release you guys had at the beginning of the year talking about the new NFL stadiums you did specifically call out Wi-Fi 7 and hybrid mesh firewall both which are network services and yeah drill deep in both of those and why specifically those you feel are so important for modern stadiums. Well if you think about stadiums today it's high density. So when you have high density, you've got to be able to create the right coverage to be able to support all the users that are in here. So if you have a stadium of 60, 70, 80,000 all accessing the network at the same time, you've got to be able to prioritize the traffic and be able to",
        "start": 1.309,
        "duration": 342.659
    },
    {
        "text": "be able to create the right coverage to be able to support all the users that are in here. So if you have a stadium of 60, 70, 80,000 all accessing the network at the same time, you've got to be able to prioritize the traffic and be able to time, you need to be able to secure this entire experience. And you said hybrid mesh firewall, which includes firewalling everywhere. It's a defense and depth sort of approach. And so that's exactly what we're doing. And if you combine the network with security with the fan experience, that's what we're doing. That really differentiates Cisco. Yeah. And in fact, hybrid mesh in particular, Gattell, your chief product officers talked about that where you turn every switchboard into a firewall. You know, given every, you know, sports league stadium is doing AI now. , what's the importance of being able to make every port a firewall? Well, it just gives you granular control of every aspect of the network because you don't know where threats are coming from these days. You want to be able to control the entire experience because we know that one bad actor can ruin it for 70,000 people. And so driving security as deep into the network as possible is what we're trying to do and what we're delivering now. Yeah. And while we're here at one of the many NFL stadiums Cisco has, it's not just football, right? Cisco has got Formula 1, PGA Golf, you know, hockey, basketball, and one of the ones that was announced earlier, another one that was announced earlier this year, which I know you were involved with quite intimately, which actually wrote about Singapore Sports Hub, first Wi-Fi 7 deployment. can you give some details on that and why that was such a landmark win? Well, I mean the Singapore National Stadium is a landmark, you know, item in Singapore, but it's not just about the stadium. It's about the whole area. So, right, it's more than just the stadium. It's much more. It's really the sports hub as they do everything around Halang in that area. They want to create an experience like no other and that's exactly what they're trying to do. But they're also want to ensure that every user that attends an event, a concert, a music event, a sporting event, has an incredible experience when they walk away and they really feel good about everything that Singapore is doing around the sports with technology. That actually has become a pretty common u theme, I guess, for sports teams. It's not just the stadium. You look at Sofa Hollywood Park. You look at Gillette Stadium, they got paid for your place. you're you're these stadium CIOS now are really responsible for the user experience not just in stadium but retail you know even a lot of the hotels around there it's just it's just a much different environment than even just",
        "start": 175.28,
        "duration": 654.0999999999999
    },
    {
        "text": "look at Gillette Stadium, they got paid for your place. you're you're these stadium CIOS now are really responsible for the user experience not just in stadium but retail you know even a lot of the hotels around there it's just it's just a much different environment than even just it's it's totally different like everything is connected to the network the network touches every aspect not just the user it the retail consignment stands hotels that sit around here it's the entire experience but I'm super proud about what we're doing here at Empower Stadium. This is a Cisco powered stadium and I'm like super excited about the Broncos as well. Yeah. Can you give any just a little bit of a drill down on what tech one would find in here? So, you have Cisco Wi-Fi 6E, you've got our highdensity antennas, you've got our network, you know, you now got visibility and observability across everything that's going on. And it doesn't stop start and stop here. It also goes to the practice field. Everything that needs to happen in the back office as well. So it's a creating the best experience, the most secure and secure connected experience for everybody that's involved with the Broncos organization. Yeah. Why I love stadiums actually is they're a microcosm of society, right? You've got retail, point of sale, healthcare, security services, 911. All that has to work to deliver a great experience. Yeah, that's ex That's exactly. All right. Well, it's almost game time. Any predictions? Broncos, Packers today? Go Broncos. All right. So, , hopefully we'll see them win and keep their leadable top the AFC. Let's go Broncos. Anything else you want to add? I just want to add that thrilled to be here. Thrilled to be in the stadium and proud of everything that Cisco is doing in sports and entertainment. Well, Cisco making sports entertainment just a better experience, but also more importantly more secure for the fans. We got AI coming and that's going to be a gamecher. And I think you have to have that modernized foundation in place if you're going to do AI. And it's not just stadiums, right? This is really every customer you deal with now. Oh, without a doubt. So AI is going to change the game. And people will want AI. They'll want to use AI to predict what the play will be. They'll want to use AI to determine if it was the right play. Yeah. This might be the longest we've ever gone without talking about AI. So [laughter] thank you. Thank you so much as it's great to be here. Yeah. All right. So on behalf of Dave West from Cisco, I'm Zas Caraval from ZK Regent saying thanks for watching. , give us a like and also hit that subscribe button and I'll see you next time on the next episode or Zcash.",
        "start": 333.84,
        "duration": 918.58
    }
]