[
    {
        "text": " [music] Welcome to Zcas everyone. I'm Zas Carval from ZK Research and I'm here in Vienna, Austria at NIS industry analyst conference. I'm a fellow analyst, Katherine Stone with CX Foundation. We're going to be talking a little AI, a little Nice, a little Cognagi. Before I get into that though, this is your first time on with me. So, just little information on who you are and what CX Foundation does. Absolutely. my name is Katherine Stone. I work for a company called the CX Foundation. You may remember us as Get VoIP from back in the day. I do remember Get VoIP. We fortunately rebranded and we're starting a night an exciting new chapter. and I am very pleased to be stepping up in a new role as an analyst, an industry analyst. We analyze both CX trends in the broad more general sense. So more layman's terms, explaining things to software buyers and even employees that may not know what they need and that sometimes lack the basic definition and understanding of exactly what contact center software is, what it can and can't do, and what the features and capabilities are that will have the biggest impact on you and your company and helping you find your priorities within the CCASS vendor now technology partner case. So, CX Foundation has existed for about a year now. So, we're very happy to be coming out on the scene and coming out on the space and thrilled to be here in beautiful Vienna learning from everybody. All right. So, I guess since everybody has VoIP, they got VoIP. Yeah. Yeah. [laughter] Now, since you are looking at those trends, I'm curious as to what you're seeing there, right? And it's funny that you use both the term CX and CCAs because while they're related, they are not equal. Exactly. Right. And so when you're talking to customers about what they're thinking about from an CX and AI standpoint, how much of that is CCAs? How much of it isn't? Adjacent, I guess. Yeah, I think it depends completely on what the customer is trying to accomplish, right? They may have more initial familiarity with the term contact center. So, we start there, but then we want to make it clear to them that the capabilities that they think they're going to be getting with a traditional contact center, some may even still think it's a call center. A CX platform, customer experience platform, will take that to the next level, especially when it comes to automation and AI. And I think one of the biggest trends that I've been seeing recently is really the shift away from a technology vendor and a shift towards a long-term sustainable organic agile technology partnership. So a vendor would kind of set the clock and leave like a deist approach. They're giving you the platform. Good luck. A technology partner works with you looking at your current data, looking at your long and",
        "start": 3.929,
        "duration": 363.2719999999999
    },
    {
        "text": "vendor and a shift towards a long-term sustainable organic agile technology partnership. So a vendor would kind of set the clock and leave like a deist approach. They're giving you the platform. Good luck. A technology partner works with you looking at your current data, looking at your long and customer base. Then they choose the features, the capabilities and the platform based on their product offerings that would be the best for you. And they can integrate with the existing tools that you already know and love and that you're comfortable with. So it's not a rip and replace overnight. Yeah, you're you're kind of getting your seal legs. You're able to go at your own pace, but you have someone guiding you and walking you through and you have somebody building a bespoke plan for you and your organization. yeah. Well, that's certainly a lot more complicated than what [laughter] companies have done in the past. I actually It's interesting too cuz the the concept of that CX foundation, if you will, varies by who you talk to, right? So if you talk to nice, they're going to look at think of the concept of CCAs and the N10 platform as being defined within the contact center world plus some other stuff. Right. Right. If you go to like Adobe Summit, it's a very sales and marketing focused message. Right. But then there's companies like Quantum Metrics and Qualric and things that [snorts] look at like web analytics and they're all going to talk about customer experience and they're all right. But the reality is today that nobody really understands end to end customer experience because that's actually first mouse click to product retirement right and I I am seeing more vendors talk about being open and things like that and interoperate which gives me some hope that actually somebody someday somebody will understand that right and I think since everything's moving to agentic bots maybe there's some hope that eventually these bots can talk to each other, right? AI orchestration. Exactly. Yeah. And be able to do that. So, but I think NICE gets about as close as you can. And wanted to get your thoughts there. You know, they they were very precient, I guess, in the vision in 2016 when they bought in contact cuz they were just a WFM vendor and I just actually wrote a post for Silicon Angle that talked about thoughts from the event. And one of the things I said was you can't Frankenstein CX. And if you look at a lot of their competitors, they've got the core CCAS platform. They bolt on companies like Variant, they bolt on Calabrio, they bolt, you know, there's all these other companies that you bolt on and you know there's an expression in data sciences where I that I've said like good data leads to good insights, but silos of data lead to fragmented insights and I think a lot of those",
        "start": 185.28,
        "duration": 664.4719999999999
    },
    {
        "text": "Calabrio, they bolt, you know, there's all these other companies that you bolt on and you know there's an expression in data sciences where I that I've said like good data leads to good insights, but silos of data lead to fragmented insights and I think a lot of those insights, right? And so when you look at nice how do you when you think about the totality of what you have, how big do you think that platform advantage is? One of the things that stuck with me about the event and about some of the conversations that we've had here is that people have got to move away from this technology first approach. You know, they know they want AI. They're not really sure why they want it, but they know they can't not have it. And so, what I think is wonderful about NICE is that it's going to it's going to meet that demand. You're going to get the AI. It's going to be okay. But you're also going to get an omni channel experience that's actually seamless. You're going to get conversational AI insights. You're going to get real time agent coaching. And so this consolidation of your tech stack is actually possible because you're getting almost all of your needs met in one single platform, which makes it way less overwhelming for your team. much less we hope of a shorter onboarding process, faster time to value. , but I also think when people say something's intuitive, it never is. However, nice is about as close as you can get to an intuitive platform that's not intimidating to its user base, regardless of their experience with AI. And I would say it helps you avoid that Frankensteinian Frankenstein approach of you're just kind of throwing in some cases a couple hundred applications and third party integrations and APIs at the wall and seeing what sticks. nice kind of gets you out of the weeds there. Gets you to a great starting point, but then helps you gradually scale up both in size and features. So, you're not constantly learning, relearning, adding, subtracting. Once you get the hang of how to use one platform, suddenly you're switched to another. So, it's a much more streamlined, focused process for you. And that's your customers are going to see the benefit of that and they're going to your customers will have more independence. Yeah. So I and I think the proof point for NIC's platform is actually when they tell me when they win a competitive deal, they often replace a dozen or more other companies. That would Yeah. And I think the only other vendor that really does that is AWS with Connect, Amazon with Connect. And I think there's other interesting competitors like I think Zoom's got a really interesting platform approach. They tend to be building their own, but a lot of these legacy guys, you know, like Genesis and things, there's just a",
        "start": 338.4,
        "duration": 981.0320000000002
    },
    {
        "text": "really does that is AWS with Connect, Amazon with Connect. And I think there's other interesting competitors like I think Zoom's got a really interesting platform approach. They tend to be building their own, but a lot of these legacy guys, you know, like Genesis and things, there's just a create some competitive share shift because of that and that's going that to me is going to be really fascinating to watch. Now one of the adjacencies that nice has added is a AI and they did that through the acquisition of Cogni. This is the first time I think a lot of the analysts here have encountered Cogni and I'm just curious what you what you thought of what you saw. So, we were treated to a couple hours long demo of Nice Cogni's AI agentic AI virtual agent yesterday. It wasn't long enough. It was about an hour and I thought I could I could have stayed there through breakfast, lunch, maybe gone out for a glass of wine at 4:00 and then come back and had it for dinner because it seems like there's so much that it can do. And we were speaking last night and you brought up something that explained it very well is that nice brings you the data. Yeah. And Cognagi brings you the AI capabilities. and if you want to talk about trends in the customer experience space, voice AI, get ready for 2026 because it's going to be a lot in my opinion a lot of voice virtual agents. And what struck me was one the flexibility of the AI models and the different ways that you could use AI within the cogni acquisition and space, but also how omni channel you could be in terms of both testing, deploying and customizing all of those bots. I mean, and what another success that I saw was that they really do have AI for every level of AI familiarity. Yeah. My favorite, and I've never seen something like this before, so I just thought it was fun, was the virtual AI job market that they created. So, what Cognagi did in their nice partnership is they created a virtual job board that's filled with just AI agents. So you can browse and you can see and they each have avatars. I mean they look like people. So you'll see this AI would be great for building out your knowledge base or this AI is great for live in conversation agent assist and but they also you can break it down and see the code. So if you are a little bit more techsavvy you have a little more familiarity with that. You have that flexibility to be able to see what's going on under the hood. And if you don't like the pre-built ready-made AI bots, you can also completely customize one from the ground up in changing of course language spoken, but also the",
        "start": 498.0,
        "duration": 1297.9920000000002
    },
    {
        "text": "a little more familiarity with that. You have that flexibility to be able to see what's going on under the hood. And if you don't like the pre-built ready-made AI bots, you can also completely customize one from the ground up in changing of course language spoken, but also the more direct or do you want something that's a little more personable? , and I should be clear, so let me go back a little bit. When I say pre-built [snorts] and readymade AI bots, I'm not talking about oneizefits-all. Yeah. which I think is a big differentiator for nice. So what they do is they use conversational insights and [snorts] then just your standard KPIs that we all know and love to build you in seconds a truly bespoke AI agent based on your exact data and they give you the projections for when you can expect to see change. And I think that is a big differentiator because a lot of the things that we hear from customers are we need somebody with a proven roadmap to AI success. We need somebody that can actually tell us how to onboard because they've done it successfully. So if I can understand how it works within the course of an hour and a half, two hours, I think even and I'm not as techsavvy as some analysts. So, I think it's very approachable, but it's also going to be a lot a huge reward for very not very little effort, but for way less effort than you might expect. Yeah. One of the things actually that I really liked about their demos, too, and it you guys actually wrote about that MIT report. Oh god, how much time do you have to talk about that thing? which I actually find a for you folks in MIT publishing that was completely irresponsible like yeah we looked at the data methodology and you you kind of hit a few things but I but I get what they say where but you know and in the report we're referring to says 95% of AI projects failed in the pilot phase now if you go back to the early days of cloud or mobile or internet I would say probably 95% of those projects failed too didn't mean the trend didn't happen it just meant people's expectations weren't were wrong now one of of the things in Scarlet's demo that I thought was really interesting was it showed like the impact on say average handle time or containment or something like that over how many months and when you should expect to see you know 52 like within you know 18 months you'll see 52% of your you know call containment handled or something like that. But what that does is it helps the customer understand what you should expect this month, next month, the month after. Yeah. Excuse me. And then as you're going through deployment, you can track to",
        "start": 660.16,
        "duration": 1613.9120000000007
    },
    {
        "text": "months you'll see 52% of your you know call containment handled or something like that. But what that does is it helps the customer understand what you should expect this month, next month, the month after. Yeah. Excuse me. And then as you're going through deployment, you can track to can adjust your strategy. Exactly. Right. And so I think, you know, part of the reason I think AI projects have failed, if you want to call it that, is I just don't think people really knew what to expect. I think the expectations are completely out of touch with reality in some cases especially on the seauite and the executive level. because there's a sense I almost call it like a sense of panic about we're we're getting behind we're getting behind because we don't do enough with AI. Oh my god like our competitors are so just because somebody's using AI doesn't automatically mean they're ahead. Yeah. But just to circle back to the MIT study, as long as let's say the data was perfect, let's say it was correct, let's say none of my criticisms turn out to be valid. Interesting. But okay, we'll go there for the sake of experimentation. As long as I have a 5% success rate, and as long as I figure out eventually something that does work and does provide the deliverables and does meet and sometimes even exceed my expectations, I don't expect something to work overnight. I expect to have to tinker with it and to try and experiment with it and I want to dig into the data both from my customers and my employees to see what's working and what's not. So I think 2026 will be a year of adjusting expectations of learning what questions to ask your technology partners these platform vendors as they used to be called and understanding the specific capabilities that you need and having a better comfort and familiarity level with what AI can and can't do and how it can do it. Yeah, I I think 27 26 be interesting to watch too because I do think there's a certain level of urgency and I think maybe more than CEO Scott Russell indicated during his his talk directly because he did say speed's a choice. You can and I I wasn't sure I was super fond of that description but and what he meant was you can choose to go fast or not. You got to get the ball rolling. It's about moving forward. Yeah, maybe it's not speed, but it's about just get on the path. Yeah. And then adjust as you go on. Now, the message that speed's a choice may make some customers think that I don't need to move fast. And right now, I think we're early enough the cycle that speed perhaps is a choice, but I, you know, I was in an event last month and speaker from Microsoft said there won't",
        "start": 819.36,
        "duration": 1910.7110000000007
    },
    {
        "text": "that speed's a choice may make some customers think that I don't need to move fast. And right now, I think we're early enough the cycle that speed perhaps is a choice, but I, you know, I was in an event last month and speaker from Microsoft said there won't market is moving fast. And so, while speed's a choice today, I'm not sure it's going to be a year from now, right? And so you do need to hop on the AI wagon and start moving forward with it. And when I talked to you know Ty Wanders from Cognagi, I asked him for some advice for customers and he said you just got to do it. And in fact I've heard from many customers too. It's like how'd you get started? We just got started. Just did it. No, it's it's it's so much just throw yourself in. and and yeah, it'll be a little bit of a hot mess at the start, but I think people will be pleasantly surprised by how much less intimidating, especially with an ICE and Cogni acquisition, how much less intimidating it is than they expected. Yeah. Now, I wanted to shift a little bit talking about, you know, kind of risks to NICE and really the competitive landscape here with Cass Vendors. One of the, you know, when I was talking to them at dinner, I was we were discussing, you know, messaging to customers and I said, you need to be a little more firm in your messaging around you need to do AI. Now, I also don't think you should shy away from the message that AI is going to take some Asian jobs. Now, I do think it's going to create new jobs. I'm just not sure I'm just not sure what we know what those are and I'm not sure what the timeline's going to be. Yeah. And but it will create new jobs. In fact, David Solomon, the CEO of Goldman, I was at an event where he said, \"Every tech transformation's done three things. It's gotten rid of jobs, it's raised productivity, and it's created new jobs.\" Right? So, there's some pain in the transition, right? And when I described that to the nice person, he said, \"Well, if you talk to our customers, that's kind of a harsh message, but what my discussion with Cognagi really solidified my mind is that the buyer's changing, right? When Cognagi sells, they're not really dealing with this contact center manager. They're dealing with the CIO or chief digital officer or someone else in the seauite, right? And in fact, I was texting with a reseller buddy of mine last night and he even said the same thing. He goes, \"Most of our dealers now with AI are going through the seauite. It's not a contact center buy.\" And so my question for NICE is, you know, do they have the the sales",
        "start": 969.68,
        "duration": 2186.071999999999
    },
    {
        "text": "with a reseller buddy of mine last night and he even said the same thing. He goes, \"Most of our dealers now with AI are going through the seauite. It's not a contact center buy.\" And so my question for NICE is, you know, do they have the the sales things like that to talk to the seuite CIO, you know, buyers like that versus the traditional contact center buyer and time will tell. Scott's that was my exact statement. [laughter] Time will tell, but but I mean Scott's certainly a talker and he's, you know, obviously highly motivated and he said, \"We want to be the number one AI AI CX, what was it? We want to be the number one AI for CX platform in this space.\" And I think like why not be ambitious? Yeah. Why not be ambitious? Well, they're in the pole position. but historically when you look at you know other markets it wasn't server vendors that drove virtualization. It wasn't, you know, the AAIA and Nortells that drove voice over IP, right? You know, if we get VOIPE, that was a Cisco, you know, thing. And so, very rarely did the incumbents make their way through, right? , I do think the CEO change from Barack, super popular CEO, everybody, you know, wonderful, super popular CMO and Barry Cooper, right, would are very well timed just because the industry is changing. And I'm not saying Barack couldn't have led the company through here. Absolutely not. We Yeah. Yeah. I'm just saying that new market, new buyers, new leadership isn't a bad thing. I think so. And I think it's exciting, especially because AI is it's like the com, right? It's completely We're entering a new era. I think somebody said yesterday, what was it? We're going to see more growth in five years than we've seen in the past 50. Yeah. In terms of technology because of AI. And so sometimes that means turning the page and not starting over but trying something different. I think it's going to be an exciting time. Another thing that stuck with me from what we've been discussing over the past couple of days here in Vienna is this idea of security, privacy, and AI governance strategies and governance policies, even AI ethics. I think that's something that NICE could really lead the way on and I'm excited to see how they evolve and how they bring that to the front, especially with Scott's, you know, time here and what he chooses to do. , but I think that'll be another big conversation in 2026 is figuring out h how you use AI, what you what sort of limitations you want to put on it, how you treat the customer data. Of course, sometimes that's mandated, but it is something that you need to have in place. And that's a conversation that I that I hope nice can be at the",
        "start": 1109.52,
        "duration": 2491.2729999999992
    },
    {
        "text": "use AI, what you what sort of limitations you want to put on it, how you treat the customer data. Of course, sometimes that's mandated, but it is something that you need to have in place. And that's a conversation that I that I hope nice can be at the gap right now in this market that is waiting to be filled. Yeah. And you know, so my I guess my closing thoughts here are that they've got the platform, they've added Cognagi, which really rounds out a nice suite. I think the fact that they now fully run in AWS makes them infinitely scalable. they talked a lot about openness and I think you know the opening we talked about the importance of the broader world of CX and so that'll help them there and and so I think you know they're they they certainly have a lead over the other Gartner MQ competitors. [snorts] and I guess now it's time to execute. So yeah, now it's time to execute. I mean, if you right, especially because when there's a lot of people out there hoping you'll fail, but I don't know. To me, that's kind of exciting. But yeah, if you have the chance to see the Cogni demo, find a way to see it. It's incredible. That's my advice to to your viewers. It's it's we can talk about it, but I think until you see it in action, you won't really understand how and why it's different. Yeah. And I just want to say the technology work. Cogni is used by Toyota. , Luans is another big one. , I think Bosch is another one. And so those virtual agents are open working now. , I know they've had a pretty big impact. But, , I do think the demos are important part to see. They cuz they really do open your eyes as to what's possible. And, , I was really blown away by the capabilities. These aren't just basic co-pilots, right? They're actually doing a lot of deep analysis and you know things like can you imagine trying to figure out like if we apply this what are call containment rates going to change how it's going to change in 12 I mean that would have taken so long to do manually right you would have had to talk to a lot of different analysts too to get an answer that you felt comfortable with it's like getting a second opinion from a doctor and I think cogni and the AI assist opinions in one place. Yeah. All right. [snorts] anything else you want to add then close close us out. Beautiful. thank you so much. Yep. Please check us out on YouTube, on LinkedIn, the CX Foundation. We are you can look for the purple and black logo so you'll know you're in the right place. I'm Katherine Stone and thank you so much. Been wonderful to spend",
        "start": 1264.24,
        "duration": 2763.033
    },
    {
        "text": "us out. Beautiful. thank you so much. Yep. Please check us out on YouTube, on LinkedIn, the CX Foundation. We are you can look for the purple and black logo so you'll know you're in the right place. I'm Katherine Stone and thank you so much. Been wonderful to spend pick your brain a little bit. Yeah. So on behalf of Katherine Stone from CX Foundation, I'm Zas Caraval from CK Research and thanks for watching. , give us a like and also hit that subscribe button and I'll see you next time on my next episode of Zcast. [music]",
        "start": 1403.52,
        "duration": 2791.146
    }
]