[
    {
        "text": " Welcome to Zcast everyone. I'm Zas Caraval from ZK Research and I'm here at MLB's headquarters. It's Extremes AI Summit. I'm with Carla Gazetti. newly promoted Carl Gazetti. Yes. Yes. It's very exciting. Yeah. You're now chief product officer for the cloud apps. Yes. Yeah. And what's that job entail? What's what are you doing now? So I have now I oversee extreme platform one in addition to extreme cloud and a number of our other cloud applications and also oversee product and engineering as well as our user research and design functionality. Yeah and certainly the cloud business is your investor day fastest growing part of your business and so it's a big job now. Yeah it is a big [laughter] job. No pressure but I've got it. Yeah as I mentioned [clears throat] we are here at your AI summit. I think this is the first one of these you've done right. It is it's our inaugural AI summit. We have never done this and we really wanted to showcase some of the thought leadership that we have in this space and so this is our first opportunity. We've invited yourself and other prospects and customers and we're going to share what we're what's happening in AI. Yeah. And what I like about it is obviously when you follow the NVIDIA and things like that, there's a lot of focus on AI today. It's almost entirely been data center focused. Yep. And I do think that AI is going to have a big impact on the campus environment as well. And so I think extreme being you know that being real your real sweet spot can bring expertise to this. Now with AI and certainly not new to extreme in fact you've been using AI for quite some time. Last year you launched platform 1 which was built around AI and just refresh the audience as to what platform one was and what we're hoping to accomplish with it. So extreme platform one as you said we launched in December of last year and it has been an incredible journey since then. we GA extreme platform one this July and when we thought about extreme platform one we really thought about how AI has to be at the center of everything a lot of what we see out there is bolt-on solutions or overlay solutions but we had a wonderful opportunity here at extreme to really build from the ground up thinking about AI first but most importantly how does that really enable customers and businesses to create more capacity more capability for themselves and that's essentially what extreme platform one does it's AI at the center of it and then We take our AI core, wrap the whole experience around it, and think about what are multiple ways that we can help users exactly where they need to be because AI shouldn't be just a bolt-on. It has to be native to the entire experience.",
        "start": 5.44,
        "duration": 290.081
    },
    {
        "text": "center of it and then We take our AI core, wrap the whole experience around it, and think about what are multiple ways that we can help users exactly where they need to be because AI shouldn't be just a bolt-on. It has to be native to the entire experience. are just to help organizations run their networks better. Exactly. Yeah. Yeah. And it's interesting because the Bob Lur from the cube research and I did a survey last year that asked about the role of the network and I think it was 93% of respondents said the network was more important to business operations than just two years ago. But 83% said it's more complex. Exactly. And it just seems that this kind of complexity importance duality was just destined to be a disaster for companies if not fixed. Well, it's really interesting. We had such an interesting time to be in the networking space and for AI to be hitting the way it is right now. And when we look at it, it's exactly right that we heard from our all of our customers and from the market is we have to do more with less. And it's and the industry is making it more and more complex, more bolt-ons, more overlays. So we had a unique opportunity to really build a platform for today's business problems. I think in the market we see a lot of platforms that exist that are addressing business problems from 15 years ago. So we knew AI was coming. We knew that it was that businesses were struggling to do more with to do more with less. And we had the opportunity to really build for today's business problems on the best technology that's available today and that's AI. Yeah. And you and of course you have a lot of data available to you. You have the extreme analytics platform. , in fact, I talked to , Airman Erin Amandiola, the deputy CI of the NFL at the NFL TAC , summit and he was saying that [clears throat] the they use extreme analytics to really help them solve a lot of business problems, understanding what what fans are doing, what platforms are using, how they're moving around stadiums. And so this isn't just AI for network's sake. It actually can help organizations run their businesses better. Exactly. And that's exactly what we want to do. Like you said, networking is missionritical to the success of any business, but there is so much information, so much data when you combine that with other pieces, the insights that you can drive, the business problems that you can solve. And that's also what we wanted to do with AI and extreme platform one is so that AI could be composable and hyperpersonalized to your experience. So that way, if I'm a network admin, I can see access and have AI help me with everything to do with the network. But",
        "start": 150.48,
        "duration": 557.0400000000003
    },
    {
        "text": "that's also what we wanted to do with AI and extreme platform one is so that AI could be composable and hyperpersonalized to your experience. So that way, if I'm a network admin, I can see access and have AI help me with everything to do with the network. But delegate something to me, you can have AI give you exactly the reporting that you are looking for all within the same platform. But I rest assured that you're not going to touch anything you shouldn't. Yeah. Now, it's been GA about six months. Is that right? we GA in July, so we're at 90 days. 90 Oh, 90 days. It's a quick 90 days. It's been a very quick 90 days. what's feedback been like and how have you how's the product evolved since then? the product. So this is probably the fastest and most amount of content we've ever pushed out from extreme networks. So in the last 90 days, we have completed major journeys. we are almost at use case parody with extreme cloud IQ. and we've also added in new capabilities within AI. So this is a really exciting time and we're going to keep it this clip and we're going to continue to unify all the best use cases from across our portfolio and bring it into that composable AI first experience within Extreme Platform 1. And are there any customers you can talk about and how they use it and the results they've seen? Absolutely. So I have we have one of our customers Michelle Okoro from Aldine. She was one of our early access customers. It's been wonderful to go on this journey with her. We're seeing how customers really want to use AI in their own pace in their own way which has always been the extreme promise allowing people and customers to choose what's the best for them. And she's seen a lot of success particularly in solving business problems. for her. She needs reporting that she can pass off to her boss. She can handle things directly herself. So her team can can solve problems on their own. She doesn't need to get involved and she and or she doesn't need to ask them. She can look it up herself because AI is there to answer the question for her. She doesn't have to go and pull a report from her team. Yeah. Don't you think we're we're rapidly approaching the point once companies use it a little bit that the attitude towards AI changes too? Because when I'm sure when you first came out people were like, \"Oh my god, that's going to take my job.\" where I think now it's, oh my god, how did I ever do my job without it? Exactly. That's exactly it. And that's also how we want people to feel about Extreme Platform One. Yeah. My goal is for our customers to say, oh my gosh, I",
        "start": 285.44,
        "duration": 794.4010000000006
    },
    {
        "text": "take my job.\" where I think now it's, oh my god, how did I ever do my job without it? Exactly. That's exactly it. And that's also how we want people to feel about Extreme Platform One. Yeah. My goal is for our customers to say, oh my gosh, I this. And that's exactly how AI is. I think people are really, as you lean into it and you learn more, you realize that it can't replicate what humans do, but it can definitely unlock capacity and power and create more capability. Yeah. And some of the use cases you have, especially on like Wi-Fi troubleshooting and things like that, I think are some of the hardest problems in it to solve. Yeah. Frankly, nobody does it well, right? [laughter] Like from an engineer perspective, trying to do it manually. There's so many variables that it's almost impossible [music] to understand exactly because it's you'd be sitting there using it and everything's fine and then all of a sudden it stops using and is it somebody else hops on the network? Is there more bandwidth? Is it DNS? There's so many things it could be that without and the and the answer is in the data. Y but without having AI look at the data the the ability for a person to actually go through the data. I' I've used the analogy it's like not just finding a needle in a hay stack. It's finding a needle in a stack of needles. Exactly. Right. [laughter] Ow. Ow. Yeah. Yeah. It just a lot of them. Yeah. It is. It's true. But I mean you think about all of the time spent trying to solve a simple problem, right? it. Sometimes it's as simple as it's a broken antenna, but it could take you hours or maybe even a whole day and you have to go out to the site to try to verify it yourself. That is a lot of time spent that AI can help diagnose a lot faster and a lot easier so that it encourage it it unlocks like I said the capability for the team to go and address the problems faster. Yeah. And it seems the other thing it can bring too is more and more companies you know when I was an engineer we used to think about the network as the Wi-Fi the campus network the WAN right you can't really think of it that way anymore it's just one network it's one network and it's one outcome it's what are you trying to drive to and what is the business problem you're try trying to solve through the network it's the technology is incredible but the technology is actually not the biggest problem it's what is the human problem that we're trying to solve what's the business problem that we're trying to solve and then how does technology support that. That's the focus we've always take",
        "start": 406.72,
        "duration": 1037.121000000001
    },
    {
        "text": "through the network it's the technology is incredible but the technology is actually not the biggest problem it's what is the human problem that we're trying to solve what's the business problem that we're trying to solve and then how does technology support that. That's the focus we've always take value principle is when we took on extreme platform one and that is how we're seeing so many gains in what we've done. It goes back to what I said we created a plat a platform that solves today's business problems. We're not stitching together solutions that solved problems from 15 years ago. Yeah. And so if I'm an IQ customer, what's my transition path to platform one? You just sign up for Extreme Platform One. Everything migrates seamlessly. If you're an Extreme Cloud IQ customer, everything ports over to Extreme Platform One day zero. Yeah. And from customer feedback, what's the learning curve been like? The learning curve has been really productive so far. And I have to say that with that, you know, we really revolutionized the approach with Extreme Platform One. So, we've created ways for users to learn on their own. And it is an intuitive interface. So it definitely is a change from XIQ and from Extreme Cloud IQ, but it we hope and we've seen so far that it has been a very positive change. I think it's been really interesting because our our core users, they go straight to AI to try to solve their problems instead of looking for reports and things like that. And I see a lot of CIOS and IT directors, they're telling me, I love it. I just go and build my own my own dashboard. I don't have to ask my team for anything. I get it instantly. So, it's been really interesting how quickly people are engaging with AI to solve their problems rather than trying to actually teach themselves a new UI because they realize it's right there and everybody has that expectation right now. Prompt is the new search. So, that's how they solve their problems. Yeah. And so when we say built around AI, it's really generative AI, right? And in fact, the canvas that you have Y is a good example of that. Exactly. It's generative AI. It's not deterministic AI. And I think AI in the industry when we look at it, it's very focused on very specific use cases and it is very determinist deterministic in nature. We have taken a generative approach and so that opens up the opportunity for us to solve a much wider variety of business problems based on content and data. All right. And so going into next year, what what's on the road map for this without breaking any NDA? Without breaking any any NDAs and any problems? Well, you're going to see some of our best use cases and some of the things that we are most well known for",
        "start": 529.36,
        "duration": 1302.0800000000015
    },
    {
        "text": "right. And so going into next year, what what's on the road map for this without breaking any NDA? Without breaking any any NDAs and any problems? Well, you're going to see some of our best use cases and some of the things that we are most well known for going to enhance everything with AI behind it because what we've done is we've created a singular AI core behind Extreme Platform 1. We've unified our data. So everything that's great from our portfolio, you're going to start to see some of those biggest use cases and some of our most popular things come into Extreme Platform One in very near term. All right. And from a vision perspective, do you expect this to eventually be that true co-worker where an engineer might sit down and just ask it what's going on today? Yeah. But yeah, absolutely. I mean, that is absolutely our our goal is to get to a place where an engineer feels as though Extreme Platform One and the AI within Extreme Platform One is an actual, you know, a colleague. It's they don't like we said before, I don't know how I did my job without Extreme Platform One. So it's not taking your job, but you can't do your job without it. Exactly. Yeah. All right. And so just some recommendations to to your customers if they're interested in AI today, obviously there's a lot of things I could do. What's the best way to get started with running AI in the network? Do you know it's interesting that you asked me that question because Michelle who I was that I mentioned before, I'm sure everyone asks you that question. Everybody does ask me that question, but Michelle who I I mentioned before from Aldine, we have a lot of great conversations together. And one of the things she said to me is that she said, \"I'm looking to extreme networks to help us guide us through how to use AI within the network.\" And that has meant a tremendous amount to me because it means that she trusts that we are thinking on her behalf. Our responsibility is to look around corners and to help guide our customers into the best use cases and the best way to approach AI in networking. I think we want to expand it beyond just being deterministic. We want it to be able to be collaborative to be able to think on its own while also making sure that we have governance over it and our customers feel confident about asking it to deploy and do things on it on their behalf. Yeah. People that I've talked to that have had success with AI, their advice is always the way to get started is to just get started. Exactly. Right. You just ask it some questions and and there's no the first time you use a generative solution, you're not perfect, right? you you've got to",
        "start": 663.68,
        "duration": 1559.2020000000023
    },
    {
        "text": "talked to that have had success with AI, their advice is always the way to get started is to just get started. Exactly. Right. You just ask it some questions and and there's no the first time you use a generative solution, you're not perfect, right? you you've got to get started in fact I at the at your Paris event you had a speaker there from Microsoft Y and he said something which has stuck with me and that is there are no fast followers when it comes to AI right you jump on board and you do it or you fall behind and so I think that's a that's a good message yeah it absolutely is and the like you said the best way to start is to just start using it check it out today all right well anything else you want to add I want to thank you so much for attending AI Summit. Like we said, it's our first one ever. So, I'm I'm really excited to have you here and I'm very excited about where we're going with AI and Extreme Platform One. So, keep on watching us and watch the space. Yeah. Well, I had to come because Keith Keith Hernandez here. I'm a big Seinfeld [laughter] fan. So, maybe we'll we'll move with him later. And so, we'll find out if he's more popular for the home runs and World Series or Oh, Seinfeld. Seinfeld. [laughter] All right. so, AI is coming. It's coming to a network near you. get started just by getting started. Yes. Yeah. There in fact the solutions are easier using than you think. So on behalf of Carla Gazetti, chief product officer for cloud at extreme networks. I'm Zas Caraval from CK Richards and thanks for watching. give us a like and also hit that subscribe button. I'll see you next time on my next episode of Zcash.",
        "start": 795.12,
        "duration": 1704.722000000002
    }
]