[
    {
        "text": " [Music] Welcome to Zcast everyone. I'm Zas Caraval from CK Research and I'm here in San Diego WebEx 1, Cisco's annual collaboration conference. I'm with Sonora Jespu SVP and GM of collaboration employee experience. Did I get the title right? You did it right. Yeah. Thank you. It's it's been a while since we caught up. there's been a lot of changes in the collab organization. before we get into the payload from this event, just wanted to get a how's the business doing? How are things since you've gone with the platform strategy? How are things changed? you know, business is doing great and what we've seen over the last year is that collaboration is really standing on the shoulders of the rest of the Cisco offer and and you see that around things like controllability and manageability where having the ability to also use things like thousand eyes and spaces together with control hub is is really helping as well and that brings together really one solution. So that's been good. you know the devices business has grown. It's it's it's healthy. We see that that's needed everywhere and we have good traction as well on on on the suite business and on contact center. So super exciting but most important I would say is that the things that we presented last year at Webx1 these things have been coming out we're getting great feedback from the customers and you know on the use of of things like summarization and AI tools in suite we've gone 5x the last quarter yeah and what what's customer feedback been like with the you've rolled on a lot of features yes in a relatively short period of time AI is interesting in at some employees love it, some haven't tried it, and I think once they try it, they'd like it. But how what's the adoption been like with things like summarization and catch me up and some of the other features for summarization and and and catch me up? So catch me up is always on in in most instances and summarization is one of those features you can't live without. I mean why do you want to be a scribe if you can have technology do that for you and not at least bringing the actions up as well and the uptake on on this is very high and I can't think of a meeting without these things and and we kind of take the next step now here at Webex1 as well where we will even offer these services when when you're actually in a room without being in a meeting with with our devices you can just press and it will summarize and take actions even in a meeting where everyone's in person. Yeah. If I think about the collab business, I think the term you've been using to really drive the vision was distance zero. And I think for the most part you've",
        "start": 0.04,
        "duration": 334.99999999999994
    },
    {
        "text": "you can just press and it will summarize and take actions even in a meeting where everyone's in person. Yeah. If I think about the collab business, I think the term you've been using to really drive the vision was distance zero. And I think for the most part you've authored a blog for this WebEx one that talked about connected intelligence, right? Is the really the next phase of what you're trying to do. So can you talk about what that is and why it's important? Yeah. And this is something that we've been working on for a long time. Literally been work working on this for a decade. And there's been a lot of algorithms. It's been a lot of machine learning. It's been a lot of AI components we've been putting together. And then you know a couple years back we came up with cinematic and then we come came out with distance zero which is trying to remove the notion of distance between people that are remote and people that are in in a meeting room. What we're doing this year is we take it a step further and that is that we introduce a gentic as well to what we call something we call director and what the director will do is that it will actually sense who's talking to whom in a meeting. Not only am I talking but it will notice that I talk to you, you respond. We will then automatically agentically be able to frame all of these things in an optimal way. So where you used to have to make a choice of what you were going to do you know we will now do that automatically and it will be done by by AI and by doing this it becomes more and more easy to use these type of features and also it will improve that. So our goal is that everyone should be seen, they should be heard, and they should have an equal seat at the table and we're really pushing the boundaries of what we've been able to do there. Yeah. Is that is connected in the first when I when I think about the evolution of WebEx, the first set of capabilities that are uniquely AI like you actually needed AI to power these things. Yeah. And when we talk about connected intelligence, we think about it really in three three ways. We think about it as people to people that we've been doing for a long time as long as I you and I have known each other. Then we think about people to AI but also AI to AI and it's really bridging all of those. And if you start thinking about what we do with our suite but also with a contact center business you know sometimes it's peopleto people sometimes you work with an AI contact center agent or sometimes you actually transfer information and work between",
        "start": 169.44,
        "duration": 620.1200000000001
    },
    {
        "text": "and it's really bridging all of those. And if you start thinking about what we do with our suite but also with a contact center business you know sometimes it's peopleto people sometimes you work with an AI contact center agent or sometimes you actually transfer information and work between all of that and with connected intelligence we're actually coming out with a suite of what we call AI agents things like summarization note takingaking receptionists director etc and there's there's a whole group of these things where to take one which is which is really an ability to schedule meetings or we call it scheduleuler you and I sit here and talk we are in a meeting and then we say oh we should really have have a meeting about this and bring in person A, B and C. after the meeting, you will actually get a suggested time that fits all of these people proposed with the agenda points and the only thing you need to do is to press book a meeting after that. So what you see is that the connected intelligence is really coming coming into that. Yeah, that's interesting because all that data is generally there, but it requires an awful lot of heavy lifting to figure out when to do. In fact, typically that involves many many emails going back and forth, right? Trying to just suggest a different time. And and the beauty of all of this is that you could then really focus on what matters, which is the discussion, the outcome, the actions, where you want to bring it instead of all of that tedious work. And I for me I can't think of a meeting where I don't want these type of tools actually being turned on. Yeah. And it's interesting with Cisco's full stack approach which includes network and devices and things like that. You could actually get down theoretically to what rooms are available, which ones are big enough for the number of people you want to meet with. even I I guess an understanding of how the network performs in this area. Couldn't you? We can. And and that's also when we talk about AI, one of the things that we try to be focused on is not to talk about what I call an AI stew. I see a lot of companies talk, they put everything into the bucket of AI and you get some kind of mysterious stew. What we try to do is to really create specific dishes and we talk about AI at the edge, AI in the cloud and AI for control and manageability. And if I could talk a little bit about all three, , AI at the edge we've been working on for a long time because of our now decadel long partnership with Nvidia that we have that in all of our rooms out there, right? What we can do with that is out",
        "start": 312.16,
        "duration": 918.84
    },
    {
        "text": "could talk a little bit about all three, , AI at the edge we've been working on for a long time because of our now decadel long partnership with Nvidia that we have that in all of our rooms out there, right? What we can do with that is out do optimal framing, we can do director, we can do noise cancelling, all it's a long list of things that's happening there and there's a lot of information there. Then you have AI in the cloud which is everything around large language models, summarization, not taking actions, translation, the list goes on and on and on. And where we are also agnostic also support copilot as from Microsoft. And then you have where I think Cisco is truly unique is around AI for for control and manageability and that's where as you said the rest of Cisco comes into it with networking and not at least the things that happen on AI canvas. Now also control hub will be part of AI canvas and and that's something we launched back at at WebEx no sorry Cisco live actually here in San Diego just 3 months ago. And when you have bring all of these things together, you also get tools that can help the people that own and operate the the service. Yeah. The the integration the AI canvas I find interesting too was also talked about the Splunk conference recently or that's been rolled into it now. And so I think historically Cisco could have been accused of having a lot of single panes of glass but it does look like from a portfolio perspective that's coming down to one now. And so eventually we won't think about control hub versus you know this dashboard versus that dashboard. It would just be part of one. Yeah. And not only that, but it's I would say on the contrary because if you think of thousand eyes, thousand eyes agents now run all the way out to the device and even the phones now. Yeah. So you have that on the networking gear, you have on the access points, you have it on on the video device, on the phone, everything. So so what you see is that this type of technology is actually pervasive. and we offer that pervasively and I think one of the key strategic shifts that G2 Patel has driven very clearly in the last last year year and a half is actually converging into one Cisco where where this is actually one architecture and collaboration is a part of that architecture taking the advantage of what's happening also on the networking security and and and controllability side and If I can add one thing there as well, a lot of companies struggle with what's called almost a trust gap on on on AI and what we can bring to the table is you know all the technology we have on the security side as well",
        "start": 465.44,
        "duration": 1233.239
    },
    {
        "text": "controllability side and If I can add one thing there as well, a lot of companies struggle with what's called almost a trust gap on on on AI and what we can bring to the table is you know all the technology we have on the security side as well that in. Yeah. In fact, I like the way you've thought about AI being cloud edge based because I do think when it comes to well just technology shifts in general, we tend to swing the pendulum like everything is going to run in the cloud or everything's going to move to the edge and ultimately the best architecture is a combination of those things, right? And silicon plays a role in that too like you mentioned the Nvidia GPUs and the devices and things. So I think that's it's interesting how you've described that more as an architectural framework and running the right workloads in the right places. Yeah. And not only that, but when you have there are things that can be actually be done out at the edge and there are two advantages with that. First of all, you have the processing out there with with the GPUs. Not only that, but you don't need the data to go somewhere. You know, when we frame you in the room, we don't send that data anywhere. It's there in the room. It's not leaving it leaving there. And all of the processing, everything is happening there. Likewise, when we one of the new things that we're doing now is that we're doing audio zones with the, you know, brand new microphone pro, we can actually set up exclusion zones or, you know, really advanced audio things that's just happening in the room. That data is not going anywhere. So you're also in a a state where data don't have to go a lot of places and that's where I think talking about AI at the edge, AI in the cloud and then AI for control and manageability actually works really well. Yeah. And actually that follows the path that a lot of customers I've talked to have taken where I think a couple years ago from an AI perspective they wanted to consolidate all their data into a single location. That proved to be just not feasible, right? because there's so much data being generated. In fact, I think at the Splunk conference, G2 was on stage and they talked about how over 50% of data now is machine generated. And so if you try and consolidate that down, right, that's that's hard to do. And so most companies now are just leaving the data where it is and then they want to apply AI to those different spaces. And so I think that follows that. Yeah. And and it also depends on the functionality and the type of actions that you're taking with this data. She said, \"When we're doing camera tracking",
        "start": 625.839,
        "duration": 1510.6789999999999
    },
    {
        "text": "the data where it is and then they want to apply AI to those different spaces. And so I think that follows that. Yeah. And and it also depends on the functionality and the type of actions that you're taking with this data. She said, \"When we're doing camera tracking we don't need the data anywhere else. We just need to frame you or frame me or both of us and detect that you and I are talking together. that can happen all the way out to the edge.\" And I think the muscle that we have invested in there and the fantastic decadel long partnership with Nvidia there building stone on stone on stone on stone. It it's very good and and you know we have Deeputella from Nvidia down here at Webx1 and he is diving into the deep end talking about what's happening with AI at the edge. It's something that's really top of mind for him as well and for Nvidia where they strongly believe in in in this way of thinking. Yeah. Well, let's talk about these partnerships. And so you mentioned Nvidia. anything and and that's been a long ongoing partnership, but anything recent that you you want to highlight? Yeah, there there are two things that that we have done. We're now we've had interoperability and we've been focused on being open when it comes to interoperability on the meeting side. So, we're obviously WebEx first always. We have a great interoperability with Microsoft Teams rooms. we're extending on that now with what's called MDEP which is the next level of of Microsoft interoperability as well and we will do that on our devices and what MDEP will will do is that it will actually lift the security level as as well for for MTR and and and the Microsoft side but it runs within the room OS architecture that we have that always run WebEx at the same time and then you get the controllability through control hub and thousand eyes as well as part of that which is really the superpower of the IT organization when you do that. Then the third thing we've done now is that we've also done native integration with with Zoom that was launched at Zoomtopia couple weeks back by saw G2 on stage with Eric G2 and Eric on stage talking about that and then we have interoperability with Google and the whole thinking is that the customer should be allowed to choose and they might use more than one meeting platform then they shouldn't have a problem with doing that. We should always try to support them all. Yeah. Well, and I think what's been interesting to me is that you've built out this broader Cisco platform, but you've also opened it up. And I think that is part of G2's mandate when he first came in. I remember him talking about if a platform is not open, then it",
        "start": 765.519,
        "duration": 1822.4379999999994
    },
    {
        "text": "and I think what's been interesting to me is that you've built out this broader Cisco platform, but you've also opened it up. And I think that is part of G2's mandate when he first came in. I remember him talking about if a platform is not open, then it And that's how you drive greater value, right, for not just you but your partners, which creates a rising tide for everybody. Yeah. Yeah. So if you were to look ahead from a vision perspective you know right now I would say AI is augmenting what we're doing making this a little more efficient. What is the from your you when you look in the crystal ball what's the future work look like here? Yeah now so let me go shortterm first and think about some of the things that happening also in place like calling and meeting. So we spoke about all the AI agents both for contact center and for for suite and and one of the things we've done now is what we call receptionist which is an AI receptionist. So if you have a branch office for instance you can have a fully automated receptionist there that will be able to take the call understand context and intelligently route that call within a branch office. That's today. I mean, if you think about that and it it's building on what we have developed on the on the contact center side and we've taken that also into the calling and be able to offer that. And I think that if you start thinking about that, that's pretty mind-boggling just today. But I think that what we will see is to have an AI agent working alongside us that will also proactive proactively offer a point of view or information or being a discussion partner almost like a colleague as well in in your discussions and meetings. I think that's where we're heading. So that's one area. Then the other area where I think we just started to scratch the surface is around how you scale and operate all of these type of of installations of of technology. AI canvas is a fantastic starting point for that. But I think on top of that there will be a lot more coming. And then the final thing that I think is key is how you bring security into it. And then what Ger Patel and and Tom Gillis are talking about is how we fuse security into the fabric of everything we do that's obviously on our enterprise networking solutions but also on the collaboration side. So I think that's that's where we are heading and I'm doing one fun thing every night. I take half an hour, 45 minutes and I play around with AI and I do all sorts of crazy stuff and every single time I'm amazed by what it can do and what a great discussion partner I have in in",
        "start": 923.76,
        "duration": 2135.8779999999997
    },
    {
        "text": "and I'm doing one fun thing every night. I take half an hour, 45 minutes and I play around with AI and I do all sorts of crazy stuff and every single time I'm amazed by what it can do and what a great discussion partner I have in in biggest shift in my lifetime. much bigger than going, you know, I'm old enough to go from no internet to the internet, from the internet to mobile and from mobile to cloud. And I think going now to AI is superseding these things 10x really. Yeah, I think the receptionist use case is interesting because I think there's a lot of still a little a lot of fear out there that AI is taking jobs, but everybody I talked to says they they just have a bunch of open positions and they can't hire fast enough. And what AI is allowing them to do is to fill position. And a receptionist is an interesting one because companies used to have a full-time one, but now not everybody's coming back full-time into the office. So, if you have an office with only people coming in 2, three days a week, you may not need a full-time receptionist. And so, an AI receptionist can actually fill that gap. And not only that, but in in a branch office, you might not have it at all. And but now you can. And now you can and you can actually offload. You can just think of this if it's a car mechanic or, you know, a car garage and you have mechanics and specialists and car dealership, whatever. you you might not have a receptionist and normally you would take the mechanic's time or the car sales guys time or or the finance guys time or whatever. Now you can do that automatically. You free up time for these guys to actually do more of what they are good at which is not being the receptionist but actually being able to answer you know I need to fix this or I want to buy a new vehicle or whatever it is. Yeah. Yeah. All right. So connected experiences bringing AI assistance to everybody. Yeah. Right. And I guess the democratization of that is going to allow us to all have more time to do the things that we don't have time to do. Yeah. Anything else you want to add? No, I so looking forward to being down here in San Diego. you know, it's exciting to be with customers with partners and not at least with you. Yeah. Well, certainly the excitement around here has been great. So on behalf of Storu from Cisco Webex, I'm Zas Caraval from ZK Research. Thanks for watching. give us a like and also hit that subscribe button. and I'll see you next time on another episode of Zas. [Music]",
        "start": 1081.679,
        "duration": 2407.9379999999987
    }
]