[
    {
        "text": " Welcome to ZCAST everyone. I'm Cas Caraval from ZK Research and I'm here in Vegas at the F1 event. I'm with J Valani, head of AI for Alassian who is the title sponsor for Williams Racing now and we're going to talk a little bit about AI and so J just before we get going maybe a quick intro on yourself and your role in Atlassian. Yeah. , so as you said, Jamil Voliani, head of the AI at Atlassian. , based in Seattle. I've been with Atlassian about 2 years, but I've been in the AI industry for over 20 years. Most that's right. I worked on Bing since its infancy and a few other AI projects out there. , but I'm at Lassian now, and I've been having a great time helping over 300,000 of our customers enjoy the benefits of AI accelerating their teams. Yeah. Now, I think when I think of Atlassian, , I think Jur and I think a lot of people do, too. And I don't want to say that Elastian's AI is maybe some hidden secret. Obviously got a lot of customers using it. but talk about you obviously using AI to make Jura better, but it's much more than that, right? Absolutely. So talk about the AI portfolio they have. Yeah, totally. So Atlassian has actually been empowering teams for well over two decades, helping them track their projects, goals, knowledge through a whole host of products. And we call all of this this whole set of offerings we have our system of work. And it's our philosophy for how we know work happens best in business. We've offered products like teamwork collection or collections of teamwork collection that allow Jira confluence and loom to be packaged together to a business allowing them to enable their workforces to compete in an AI era. All of those products have our robo offering as a baseline capability in them. So all of our paying customers of all of our products have Robo accelerating their work through providing world-class enterprise search, great chat and agent building capabilities. Yeah. Now that really changes when I when I again when I think of Elastian and Jira, that's a dev tool. system of works really designed to be more cross organization. Correct. That's right. Yeah. We have certainly have our roots with Jira helping engineering teams track their issues and work items. But what we noticed over the course of many years is that these tools like Jira and Confluence and Loom and whatnot are actually applicable to virtually any team. Every team has complex projects that are have tasks that have goals that have knowledge bases that need to be maintained. All of those things come together in that system of work and we have accelerated that work through AI to make sure that we are able to help these teams accomplish more and compete in this AI era. Yeah. Now the centerpiece of the system",
        "start": 5.12,
        "duration": 303.919
    },
    {
        "text": "that need to be maintained. All of those things come together in that system of work and we have accelerated that work through AI to make sure that we are able to help these teams accomplish more and compete in this AI era. Yeah. Now the centerpiece of the system just do a deep dive on that. It's a serious set of agents. but it's it's really much more than that, right? Absolutely. So, Robo combines a worldclass enterprise search engine AI Robo Chat able to query over your knowledge and our studio which is able to let people build agents automations and more simply using natural language. And that means that anyone who needs an extra pair of hands to make a simple task way more faster can simply describe that task and an agent will be created for them to get all that work done and work alongside them as an AI teammate. Yeah. And and it's really the agent capabilities that allow you to do that now. Yeah. Now I was going to ask you about maybe giving me a customer example but maybe the best one is Williams Racing. You are the title sponsor. They've been using Jurro for a long time and they've recently started using your system or robo right. think you can talk about their use case and how it's helped them improve. Absolutely. You know, our relationship with Williams Racing is truly special. we're not only their sponsor but also their technology partner and so we've been working for nearly a year now with them to actually help them infuse our system of work and robo and their ways of working. And that means that everything from their HR department, their engineering team, the folks who work on the pit, , HQ, all those teams are now getting that system of work, Jira, Confluence, Loom are changing the way they work. So, for example, meetings are recorded in Loom now. They're tracking all of the parts, , from all of their, , all their suppliers for the car. you know through Jira through assets tracking a lot of their knowledge about track conditions you know learnings from past races and confluence and are now building robo agents to work across all that information and help their team move way faster and we've seen examples like for example they're running wind tunnel testing and we've seen and that was to redesign the fin right yeah exactly the wing exactly and previously you know when you actually ran a car through a wind tunnel test you get a bunch of data out and only a people actually knew how to interpret that data. And that was a real bummer because there's so many people around the around the globe who are trying to use that data to make the car better and try to react to whatever is learned. So now what they've done is they've trained a Robo agent to actually",
        "start": 156.72,
        "duration": 563.1990000000002
    },
    {
        "text": "data. And that was a real bummer because there's so many people around the around the globe who are trying to use that data to make the car better and try to react to whatever is learned. So now what they've done is they've trained a Robo agent to actually give feedback to the right teams tailored to what they do so they can go and actually operate on it and action on it much more quickly and as a result build a better car week after week. Yeah. And they told us at the press event they've actually seen some good results, right? It's actually helped them improve their racing. Absolutely. track I mean in F1, you know, milliseconds matter and they're shaving milliseconds off. I think their performance this year is absolutely awesome. and I think they're going to continue to rise and we're happy to help be there alongside them to help empower that transformation. Yeah. And then do have you shared they shared any ideas of how also think they're using it? I mean they're just starting this journey with you, right? They're Yeah, they're very early on. you know I think we shared earlier you've heard that all their meetings now have Loom as an example and Loom is your Yeah, Loom is a is a tool that helps you record any video content including video. Yeah. And helps you record your meetings, helps you record presentations so you can annotate them and help bring life to whatever content is there. And then Lumi powered by Robo helps you actually take what was shared in that video not just get a transcript from it but understand who were the actors, what were the actions that were decided helping you annotate that video so you can find it again later and recall that information. And because they're doing so many meetings every week on Loom, they're able to now go and use Robo to actually find what happened in that meeting. if somebody missed it or if they forgot they had an action item or a piece of insight from one of the drivers for example, they can quickly use Rover to recall that, find exactly what moment in the video had occurred and get that knowledge out right away. And what I like about that is typically with meetings, we do the meeting pretty well, but we have no idea what happened as soon as the meeting is over. Absolutely. So now that extends really the lifespan of that meeting to people that weren't at the meeting, which before, unless you had that real A type person taking notes, no one would know. Yeah. Absolutely. And and even if you're taking notes, like a lot of times after a week or two, people forget, right? They don't remember what happened, who did what, what was that insight that, you know, Alex or Carlos said in that meeting, right? All that gets typically",
        "start": 288.32,
        "duration": 799.3590000000002
    },
    {
        "text": "know. Yeah. Absolutely. And and even if you're taking notes, like a lot of times after a week or two, people forget, right? They don't remember what happened, who did what, what was that insight that, you know, Alex or Carlos said in that meeting, right? All that gets typically system of work, we're able to actually go and help people recall that instantly. Yeah. Yeah. All right. And just a couple questions. so you've got system of work built. Robo has been launched. Seems like it's been adopted really well. Without getting into any NDA material, what's what's what do you what else you guys think about from an app perspective? Well, we're really excited. earlier this year we announced that we're making Robo available to all of our paid subscribers. So there all all these teams now are able to operate like a Formula 1 team that's on the rise. and really every company is now. It's all data driven organizations. Absolutely. Yeah. I mean they're all working this way. We now have over three and a half million customers using Robo every month and that's growing 50% quarter over quarter. we have over 100 times growth in the use of Robo Search. We have 50 times growth in the use of Robo Chat. So we're just focused on making all of these tools much better. what we've seen particularly growing a lot is the studio and the agent building. we saw just in the last couple months over 2 million automations and workflows accelerated with robo agents. So we're diving deep into that to help people accelerate more of what they can build with studio and we're going to accelerate much more of the work that's happening on all these companies thanks to using agents of studio as well as retro revo. Yeah. And so last question, you know, I've seen the MIT reports and things that show companies are stuck not getting the value. , clearly there's value in AI, right? Absolutely. The Williams example, you know, I I think plays out. A couple piece of advice to customers that are in the process, we want to do AI, but you don't know how to proceed. Yes. You know, the study you brought up is really interesting. If you think a lot about how most people are using AI, it's to accelerate themselves. you know, you maybe got a few minutes to help writing that email, correcting your grammar, writing a short document. That's all great, but what we're finding is that even when we talk outside of the MIT report, when we talk to our customers and our leaders of those companies, they're saying that they don't see teamwork acceleration until they start using Robo. And that's because we built Robo with a team focus. Now when you talked about how do you accelerate companies how do companies help accelerate their transformation in addition of course using robo two things I'd recommend is one leaders",
        "start": 408.639,
        "duration": 1041.9989999999996
    },
    {
        "text": "they don't see teamwork acceleration until they start using Robo. And that's because we built Robo with a team focus. Now when you talked about how do you accelerate companies how do companies help accelerate their transformation in addition of course using robo two things I'd recommend is one leaders embracing the tools and sharing with their employees it's got to be top down right yeah well and and not just a mandate but really actually themselves sharing what they are doing with those tools with their employees sharing where they failed where they succeeded that makes it okay for you to try it and to see what that learning process is like because your leader is doing it the second thing is I would really recommend that every company has usually a trailblazer team or two. The guys who just maybe because they felt the most pain somewhere are the most open minded to trying something different or doing something new. Give them the AI tools, put a spotlight on them, help them celebrate when they have success because people will look up to them as role models and they will be evangelists from the bottoms up as well. All right. Thanks. Yeah. And good luck to the last. And I do want to point out too that one of the things I really respect about F1 is because of their hard cap, if they're using a product from a vendor, this isn't just a sponsorship, right? Even if you give them the software, they have to count that towards the cap. So I know whenever I see an F1 team using a certain product, it's actually being used and it's delivering value. Absolutely. Yeah. And we're so proud that we're able to go and help you know the Atlassian Williams team this way and that they're finding tremendous value out of Robo and our system of work. All right. Anything else you want to add? Yeah. So yeah I just want to say go Atlassian Williams and please try Robo now and let us know how we can better help you accelerate your teamwork. Yeah. All right. So on behalf of Jamal Valani, head of AI for Atlassian. I'm Zas Caraval from ZK Research saying thanks for watching. Why don't you give us a like and then that subscribe button and I'll see you next time on our next episode of Zccast.",
        "start": 531.36,
        "duration": 1220.638999999999
    }
]