[
    {
        "text": " Welcome to Zccast everyone. I'm Z Caraval from ZK Research and I'm here at Beth Page Black Golf Course, home of the 2025 RDER Cup. I'm with James Robertson from HBE who's one of the global suppliers for the RDER Cup. James, you've got a long and kind of complicated title. So, I'm not going to try and remember what it is. So, just a a little intro on yourself and what you do for HBE and what your role is with this Ryder Cup. Yeah, so I'm CTO for media, entertainment, hospitality, and sports. So I spend my days worrying about our customers in this space looking at their business needs, looking at their outcomes, trying to understand what they need to do and what they need to accomplish for you know pulling a great events like this around the globe together. Yeah, I met with Michael Cole who's the CTO of the Ryder Cup Europe earlier today and we in in fact he briefed all all of us press and he talked about how this was like the first AI enabled Ryder Cup. Yeah. And when you first heard that what did that mean to you? Well, I you know I think if you look at the history that we've had with the RDER Cup over the last few years, right, going back to when we first started to connect the course in Paris in 2018, you know, basically we got to a point where connectivity became table stakes. So, how do we engage the fans even more? How do we provide more information, more understanding to what's really going on on the course on a day-to-day, momentby-moment basis? And really that's how do we take data live data and bring it to life making actionable for the outcomes that the the Ryder Cup team need day in and day out. And so that's really we've stepped up the game from just supplying kind of base core connectivity making sure that the Wi-Fi coverage is complete making sure the fiber works the networking works and now looking at in terms of how do we create AIdriven outcomes that are actually going to influence their business. Yeah. And so a big part of what you providing here of course is the network. you're a network guy, right? Aruba is a big part of this. and talk about what are some of the AI features within the central product that being used to help manage this environment. Yeah, absolutely. So, and why were those important? Right. So, we're using HPE networking's Aruba central as the orchestration and management engine for all of the network devices around the course. And that's running in the cloud. It has AI underpinnings telling it telling us from the data what's really going on in the infrastructure. looking at it moment by moment looking at commonalities problems that are occurring and giving the network engineers an understanding of really",
        "start": 4.88,
        "duration": 290.8
    },
    {
        "text": "devices around the course. And that's running in the cloud. It has AI underpinnings telling it telling us from the data what's really going on in the infrastructure. looking at it moment by moment looking at commonalities problems that are occurring and giving the network engineers an understanding of really fix it. Right? So it's not just hey this device has gone down we've lost power in this part of the course or whatever's happened. Right? It's like we're seeing this and we know how to fix it because the AI is looking at all the data from all the data points and going if you do this this will make a better outcome. This will improve the network in different ways. And to be clear this year the network plays a bigger role in the RDER Cup than we've ever seen before. I don't think people really realize that. From ticketing to being able to purchase things Yeah. to in fact just I was looking at the Ryder Cup app. They have some cool. In fact, I found my way back here from 18 using the mapping feature on that. And if the network's not available, I'm assuming none of this stuff works. Exactly. Yeah. I mean, this is basically a smart city. Yeah. Right. That has been put together in about 4 weeks and would be torn down in about 48 hours, right, after the event. And so, you know, doing something of this complexity and being able to create the right environment from a technology standpoint that can deliver the outcomes for the business, right? to make sure that we're able to supply the needs of the fans but also the needs of the back office right moment by moment and make it as reliable as possible takes a lot of coordination a lot of planning and with the help of AI we underpin it all so we can really see what's going on in the network in real time and react appropriately yeah now where I sort of agree and disagree in the smart city with the smart city I think there's a lot of predictability around what people do and in fact I know you you do a lot of stadiums and Michael and I talked about this but here you've not, you know, because there's only four groups out in the course at any one time, right? And so they're constantly in motion. Yes. Right. And so that's I think really what makes it difficult here is and and when you thought about kind of network deployment, how do you build a network for that where all the fans are clustered around four holes, then they're going to move, right? Like that's that that to me seems like a a networking problem that you don't face very often. Well, it's a bandwidth management nightmare. Let's let's put it like that because you know you you really want to",
        "start": 149.76,
        "duration": 536.0000000000001
    },
    {
        "text": "fans are clustered around four holes, then they're going to move, right? Like that's that that to me seems like a a networking problem that you don't face very often. Well, it's a bandwidth management nightmare. Let's let's put it like that because you know you you really want to know across everything that's ubiquitous and it feels the same. But what we're having to do is again take that data the telemetry that we're getting out the network in that moment and look at it in terms of what the capacity needs around the course are. So able to basically retune network bandwidth and and frequency and spectrum to make sure that we're getting the coverage when we have literally thousands of people gathering around a single hole. Yeah. Yeah. And it's not just networking everybody, right? There was an AI private cloud here. Yes. What was that? In fact, I believe Michael said it was the first AI private cloud that he believes was used at a sporting event. Yes. And what's that being used for? So basically we're we're looking at other analytics. So the network is one component that's providing analytics to the system, but we're looking at other analytics for crowd management. everything from ticket flow to even merchandise tent to food and beverage sales right to even weather conditions so that we can help the RDER Cup team on the ground predict their needs in real time. So if we have a re weather event, people are going to start to gather in different parts of the course under tents, undercover. that may drive additional changes in not only the network in terms of the gathering and the capacity requirements in those areas, but it could also mean that you know people are looking for umbrellas. Yes. Right. And they need to get to the merchandise tent. And so we need to be able to inform the merchandise team, hey, make sure there's plenty of umbrellas ready to go or plenty of ponchos ready to go or if the president shows up. Or if the president shows up. Yeah. Which might happen. All right. And when you think out to 2027, what are some of the things you're working on today that you know obviously are future looking things that we might see in a couple years when we move this back to Europe? Well, I I the big thing is we're going to get a lot of learnings out of this because of all of the telemetry and all of the data that we're gathering that AI model while it's informing everything that's going on right in the moment. Now, we're going to be able to use that data set to allow us to predict what we need for Ireland for the Ryder Cup in Ireland. So, we're going to be able to to some extent digital twin ourselves using this data as a backdrop of this",
        "start": 275.04,
        "duration": 788.4780000000002
    },
    {
        "text": "the moment. Now, we're going to be able to use that data set to allow us to predict what we need for Ireland for the Ryder Cup in Ireland. So, we're going to be able to to some extent digital twin ourselves using this data as a backdrop of this walk into what we're going to see in Ireland in 27. And I think that's going to be very important for us to then look at it in terms of not only network coverage, but what potentially we can do in terms of additional capabilities to the RDER Cup to make again the event as seamless and streamlined as possible. Yeah, I don't think people realize how manual things are. You gave me a good example where there's you can hear them in the background. There's some a lot of generators running. Yeah. And people have to like manually look at it, decide when to fill it, they run out. But a simple IoT sensor could let somebody know, hey, you need to go put gas in it. That's that's another network enabled service that could remove a lot of that manual heavy lifting. Yeah. Exactly. These are going to be learnings that we take out of this event, right? And and apply to future events, you know, when the when the physical world Yeah. Yeah. Exactly. when the physical world is going to impact the infrastructure world, right, and the outcomes for the business. , you know, we need to be able to make sure that we're we're connecting all the dots. So, it's not just the components of the network, it's now the components of the power grid that go into behind the scenes and making this thing happen. All right, last question. Your predictions, who's going to win? Well, being with the with the accent you've got, I know being a European by birth, but a US citizen by association, you're calling for a tie. I'm gonna call for a tie. Okay. Well, let's hope that doesn't happen because I don't think anybody have with that. So, and actually that would mean the US wins again. That's right. Exactly. Yeah. All right. I think, you know, being being its own course, the US always seems to say the course is up where, you know, bombs away typically win. So, all right. Anything else you want to add about No, no. It's going to be a great event. We're really excited about getting through day one and we're going to get learnings out of this that are going to impact us the rest of the week. Well, this was the practice day, so tomorrow it really starts. Yes, exactly right. channel. I'm a James Robinson from HBE. I'm Zus Caravala from ZK Research from Beth Page Black saying thanks for watching. , give us a like, hit that subscribe button. I'll see you next time on the next episode of Zast.",
        "start": 403.199,
        "duration": 1019.1970000000002
    }
]