[
    {
        "text": " Welcome to Zcast everyone. I'm Zas Caraval from ZK Research and I'm here at Cisco's offices. I'm with Sandy Miller, SCP product management for Cisco CX. how you doing Sandy? I'm great, thank you. And it's going to be a great chat. Looking forward to it. Yeah, we're going to be talking about Cisco IQ. before we do that though, this is your first time on with me. So just a quick bio on yourself. what you do? Yeah. So as as my introduction I lead product management and marketing for CX. I've been in Cisco about four and a half years now. primarily in product management roles and then prior to that I was at Visa running product for their data products and you know I've had multiple roles all in product management and this is an exciting kind of journey through CX and the transformation we're going through. Yeah. And I want to talk about the launch Cisco had at Partner Summit. But before that, I find Cisco CX an interesting group. It's a core of the company's revenue. Yes. Right. It's but it's not it's services, not product. So it flies under the radar a little bit. And so just talk about the group in general and how it fits into the overall mission of Cisco being able to deliver great product. Yeah. So if you think of like what CX is our you know view within Cisco is we own the customer experience and relationship. So everything post sale right so traditionally if you think of CX the experience is not just about providing support the technical assistance centers we have but it's also about professional services we have customer success we also have renewals as part of it. So collectively we think of our group as owning the destiny for where we take our customers and the experience and bringing Cisco's technology to life making it easier for adoption driving you know the true value out of the technology that our customers have bought. Yeah. Now that and I've always thought a good way to think about it is you you fill the gaps between the product and the business challenges right and we connect do lots essentially right and a lot of these products do certain things how do you bring the solution to market and have that relationship with the customer as an example if you can think of customer success teams they are looking at having a dialogue with the customer about what is the intent what are you trying to do with this piece of technology and we tie those pieces together to build a technology adoption plan that tries to business outcomes. So that's one example, but you could take that across support or professional services. It's all about bringing the technology to to life for our customers. Yeah. Now Cisco CX obviously has gone through many many iterations changes over the years. Right now we are going",
        "start": 5.44,
        "duration": 321.28000000000003
    },
    {
        "text": "tries to business outcomes. So that's one example, but you could take that across support or professional services. It's all about bringing the technology to to life for our customers. Yeah. Now Cisco CX obviously has gone through many many iterations changes over the years. Right now we are going think of as the biggest transformation in the history of tech with AI. And so when you think about that in the context of the CX group, what new challenges are you are you seeing from our customers telling you about and then how does Cisco CX need to evolve? Yeah. So that's a that's a really good question and the time and place we are in is a huge opportunity for CX because with Aentic AI and Gen AI taking off in the last three years, there's a lot of value that we can drive in terms of truly transforming the business. One of the key things that problems and opportunities that we've been grappling with and our customers have been asking us is I'm always reacting. there's problems and issues. [clears throat] Cisco, you do a great job. You have some of the best technical experts, but you are showing up when there's a problem. That's great. You help me resolve those issues. But more importantly, what would be really helpful if you help me avoid those issues. That's where if we think of our vision about driving a true experience that's more proactive, personalized, and predictive, we'll bring that to life for our customers. We have an opportunity today by combining aspects of agentic AI combined with automation and human expertise. It's not one or the other, right? So when we are we're starting to do that already and that's where Cisco IQ is that foundation that so drill down on on Cisco IQ, you know, what is it and how does it differ from what you had in the past? Yeah. So if you think of Cisco IQ, it's our unified AI interface. It is not a product. It is not a service. It is not a an offer. It is the foundation that brings all of our dispars of how we communicate and deliver value to our customers. As an example, if you think of we have, you know, multiple ways our our teams can know our customers can interact with us whether it's like understanding what support cases they have or assets. And if you think of like professional services, they reach out to us and ask for a security assessment. those are getting done in disjoint have been done in disjointed ways. We're bringing all this to bear with a common you know interface that'll be available to customers and partners so you can see across the infrastructure as to what's happening so that you have a broader view when you go into an engagement with the customer telling them about we see you have you know x amount of issues and problems",
        "start": 166.08,
        "duration": 628.641
    },
    {
        "text": "interface that'll be available to customers and partners so you can see across the infrastructure as to what's happening so that you have a broader view when you go into an engagement with the customer telling them about we see you have you know x amount of issues and problems away from, you know, the mundane, the boring, [clears throat] the manual tasks that all of us perform, use AI and automation to to drive that visibility as to where the problems are and start fixing those. And that's where Cisco IQ becomes that foundation. It's one place for everything that we do within services. Yeah. Well, there's certainly a lot of heavy lifting when it comes to running it, right? And so if you can remove some of that, then there can be a lot more time spent, I guess, doing more strategic stuff. So when I think of the stuff Cisco CX has provided in the past, it's things like you know insights, troubleshooting, assessments, right? all kind of wrapped in automation. And from what I understand with Cisco IQ, you brought a lot of that together, right, under one framework. And so can you maybe drill down on that a little? Yeah. So I'll give you some examples, right? So assets, everybody kind of rolls their eyes when you talk about assets. It's fundamental. So if you don't know what hardware, what software you have and in the near future, crypto is becoming really important because if you think of where we're heading with quantum computers and ability for them to kind of break ciphers, that's going to be that's an asset as well. Your crypto is an asset. One of the key things that all of us grapple with is how many assets do I have? Where are they? Are they lost support? So with Cisco IQ, we not only want to give our customers and our partners visibility as to what assets they have, where are they in commission, not in commission through contracts and through you know telemetry, but also have a reconciliation service that talks to the customer CMDB, talks to the partners like in [clears throat] databases and ours and reconcile that all the time because a key example is with asset management when it comes to times of renewals, we spend weeks we throw people at it and then we you know everybody's frustrated because nobody has a clear view of like what is it that I have and what am I renewing so if we solve for those problems always on dynamic view that's that's what we're hoping and we are aiming Cisco IQ with combination of AI with automation will help us get there the other aspect if you think of you know as [clears throat] assessments assessments always have been a point in time. Oh, I need to do an audit and make sure I pass that audit. So, I'm going to do an assessment. Security assessment is",
        "start": 320.8,
        "duration": 915.6809999999998
    },
    {
        "text": "will help us get there the other aspect if you think of you know as [clears throat] assessments assessments always have been a point in time. Oh, I need to do an audit and make sure I pass that audit. So, I'm going to do an assessment. Security assessment is it have to be, you know, something that you have to plan for? Assessment is going and checking if something is wrong, right? So, what we want to do is ability to automate, you know, compliance, regulatory, config, every single assessment. Think of like all the documents we send our customers. If you're going to turn all those documents, generative AI is amazing at it. So all of us have used chat GPT. It can synthesize large volumes of data and give you specific actions. We're turning that into automation because generative AI is more a probabilistic system. But we live in a real world where we need deterministic outcomes. So what we're using genai is to create you know synthesize large volumes into intelligence create automation out of it because automation is more deterministic and it's a 01 whether you you're you know you have a condition that's passed or fail based on that then you can say here's specific devices that have to be hardened or failed this test. Now you take an action. So you're removing what would have taken weeks and months for somebody to kind of set up and run into a matter of minutes. and they're spending time on remediating and fixing issues. That's what we want to move towards. All right. Now, one of the things I've noticed about Cisco, particularly since the acquisition of Splunk closed, is while Cisco builds great infrastructure, it's it's also it's become really more of a an AI data company, right? When you think of all the data, in fact, Cisco recently launched data fabric. Yeah. Right. And so how is Cisco IQ using AI and the Cisco data fabric to be able to make this migration from reactive to proactive to predictive like I think everybody knows this and it's probably said a thousand times data is the fuel for AI ability to synthesize and that's why if you think of why we anchored on Cisco IQ as the core kind of plat core kind of interface is behind that is the data fabric that sits with it underneath that that brings all these dispar data sitting in silos into one place. It doesn't have doesn't mean we're sucking data, but what we're saying is we're using Cisco's proprietary knowledge over 40 years of tax information like the cases and what the resolution was how did we solve our adoption issues? What are the professional services engagements? If you think of the life cycle for customers, we do plan, design, implement, operate, optimize. There's a lot of information that sits in silos. We're bringing all this information into bear so that next time you go implement",
        "start": 467.12,
        "duration": 1230.961
    },
    {
        "text": "we solve our adoption issues? What are the professional services engagements? If you think of the life cycle for customers, we do plan, design, implement, operate, optimize. There's a lot of information that sits in silos. We're bringing all this information into bear so that next time you go implement engineer or the team who's going implementing are reinventing the wheel. So that that way you're bringing the power of thousands of these implementations to bear so that when Sundep walks in he's got this information on what the best practices are what the customer's infrastructure already looks like and what's the best way to kind of implement this right so you you're already getting ahead getting them to 70 80% and then you fine-tune it with human expertise and that's what we see the power is and the data is the fuel that feeds it and we know we've synthesized And that's what I was talking about the notion of using generative AI sucking all these despair to create intelligence out of it and that's when you start to then act on it. Yeah. And from what I understand too from a customer perspective Cisco IQ can be deployed as a private cloud public cloud or whatever model they want right and so when you talk to customers how are they thinking through that where they want to keep the data how they want to deploy it because you know the there's obviously pros and cons to each. Yeah. So that's very valid because it also depends on the customer and the regulatory environment they're they operate in, countries that they operate in. So I've been on a road show for the last three three plus months. we've met over 80 customers. Wow. Right. And every single one has a distinct different view. But going into it with Cisco IQ, what we want to offer is flexibility. We will have a SAS version that's cloud for folks who you know want the most flexibility. They give us the data from telemetry. We synthesize it use LLM give those insights and assets and assessments always on dynamic. We also have a onrem no tethered version so that you can run it on prem all the applications run on prem. There's nothing that's you know that's for folks who want flexibility but they want it on prem and then you pull in updates just like if you have an antivirus you install it on your computer it still needs to pull in updates from the cloud so that you're you're being safe right it's the same concept where we will have an on-prem version and it's just pulling you know the the next set of security updates next set of assessments and then there is a fully airgapp version for customers who are highly regulated or in the federal space who are know they they don't want any connection to the cloud and that's where we can also meet the",
        "start": 626.48,
        "duration": 1522.7200000000016
    },
    {
        "text": "the the next set of security updates next set of assessments and then there is a fully airgapp version for customers who are highly regulated or in the federal space who are know they they don't want any connection to the cloud and that's where we can also meet the countries where they need sovereignty as an as an example right so it's contained and they decide what updates they get pull they pull in and that's totally depend on the customer and that's what we will go out with as well when we go into general availability with Cisco IQ all right now I want to shift gears a little bit and talk about the partner side you did launch this a partner summit yes of course partner partners is a incredibly important part over half a million of them I think are you know that Cisco has and so how does and of course the way the partners make money off Cisco is all the life cycle services they deliver right and so how does Cisco IQ fit into partner offerings to help them drive more of what they do best yeah so that's a really good point and that was one of the reasons we also decided that you know partner summit was the right place in the right time to kind of know launch Cisco IQ because the core fundamental and the principles that we're driving towards is we want to take away the mundane the boring the repetitive task that our customers are doing a lot of it is done by our partners right so if we think of you know the the capabilities or assessments that our partners do right rather than spend time on going and checking what's wrong wouldn't be great if you already knew what's wrong, right? And where the issues are, then you can spend your time and effort as a partner to go fix those issues because that's a higher value work versus, you know, you're going to go check for leaks, right? That's a lower value. That's how I see it. And that's not any different to what we're telling our own teams, right? The the the promise is that we want to automate and drive this notion. So if you think of what is in it for the partners then they get to be able to have a better strategic relationship with the customers drive them to better notion of resiliency with simplicity and faster time to value. So you're going to have lower cost ability for you as a partner to invest in higher skilled kind of workforce without having to have thousands of people doing manual work. As a result, you'll be able to deliver a lot of these capabilities faster as well. A key example is, you know, we we've know we've rolled out migration tools and migration. We've consolidated the framework where even within our own teams, we've had hundreds of different",
        "start": 776.0,
        "duration": 1812.9620000000018
    },
    {
        "text": "doing manual work. As a result, you'll be able to deliver a lot of these capabilities faster as well. A key example is, you know, we we've know we've rolled out migration tools and migration. We've consolidated the framework where even within our own teams, we've had hundreds of different well, why? We can synthesize that and create one framework and one aspect to do migration. And we want to enable that for our for our partners as well. Same thing with services as code helps them operate in a seamless way where you're reducing the manual touch points between you know that customers or partners have to do. So that's how we're thinking about it where it becomes a notion of a growth driver for our partners ability to then build better services more valuable services and it's not any different we want to you know make sure that we are lock step with what we are doing within Cisco as well as our partners. Yeah, it's interesting too because partner transformation is something that I've talked to really all the partners about now is they're all looking at what the they're they they understand a lot of the break fix traditional partner services are going away and they themselves have to think a lot about what the next wave of their company is going to look like and it seems like you can help them get there. Yeah. And if we if we remain in the break fix maintenance to say I want to sit here and wait for somebody something to fail and that's how we help. That's a race to the bottom. Yeah. Right. Think what a terrible business that is. Right. Right. But it's also a race to the bottom. If I'm on the other side, I'm telling I'm telling my you know I'm looking at my service contract, my support contract with a partner or with Cisco and saying why am I continue to pay for something that is reactionary that's more a decade two three four decades old that is about response times and device you know replacement times that should not be the case. So the fundamental thing we're trying to do for the whole industry is redefine what support means. Support should not be about I'm going to sit here and wait for something to fail and then I'll help you. The notion is let us help meaning us and the partners see around the corners and help our customers avoid issues. That's when you try truly drive resiliency for me that is the meaning of support where you're driving that and that's why if you think of Cisco IQ fits within the notion of customer experience because we want to fundamentally change that experience for our customers. wow them so that we will call them to say hey Mr. customer miss customer you have this issue we need to address that right now like classic examples of like certificate failing",
        "start": 922.24,
        "duration": 2089.7620000000006
    },
    {
        "text": "within the notion of customer experience because we want to fundamentally change that experience for our customers. wow them so that we will call them to say hey Mr. customer miss customer you have this issue we need to address that right now like classic examples of like certificate failing now if we are proactive we can help our customers avoid those issues config issues manual errors like of the 1.6 six million cases that we saw last year. Half of those are because of config issues and manual errors. We can solve for those. That's like 800,000. God knows how many thousands of outages. All right, Sandy. So, let's wrap this up by talking about outcomes. You mentioned that before. Yeah. So, for early adopters of Cisco IQ and you know some of the the early customers that you've seen, what were some of the ways they measured the value of this? Was it greater uptime? Yeah. Was it you know better performance? when you think about those outcomes what are they? Yeah. So there we are some we are in early days we're going through early field trials. We have you know good set of customers in America and rolling this out to our customers in Europe as well as you know in Asia. The key aspects that we are measuring and and we are anchoring our customers the value that we want to see is what did you do before? If you think of asset management right how many people did this how long did it take and with this notion of intelligent asset management to Cisco IQ how how much time and effort are you saving as a result that should translate into your people doing other work that's more strategic similarly if you think of assessments there's a dimension of how many you know advisories or or risks were were highlighted and fixed beforehand ability for them to think about you know what would have cost me So because this is part of our support, we're also breaking down this notion of what were traditionally, hey, these are professional services. You need to pay one-off engagements for a security assessment. We're going to charge you X dollars, you'll come in, do an assessment, and walk away after 3 months. But the notion is this should be always on on demand so that you can run it and it's part of you. So are you saving now dollars? Are you being more resilient? Are you being more secure? And defining that is where we're heading towards. And essentially we believe like even industry come some of some of the stats we've seen is you should be able to reduce your risk by 40 50 60%. You should be able to reduce the manual effort by you know 30 to 40%. So that's where we're heading towards in terms of the promise and once we and it's just going to this is a framework right the",
        "start": 1062.799,
        "duration": 2377.682000000001
    },
    {
        "text": "be able to reduce your risk by 40 50 60%. You should be able to reduce the manual effort by you know 30 to 40%. So that's where we're heading towards in terms of the promise and once we and it's just going to this is a framework right the always going to be new regulations there's always going to be new checks that you as a customer and partners based on the industry have to run but we have a solid framework that'll continue to evolve and build and it'll be unique and personalized to a customer to a industry so that you can start to truly get value that's for your business right all right sandep So at Partner Summit, chief product officer G2 Patel called Cisco missionritical infrastructure for the AI era. Cisco IQ is what connects the dots to business value. That's right. A good way to think about it. That's a great way to think about it. All right. Anything else you want to add? No, I think this is this is great and we're really excited for where we're heading and like I said to close this out, we're trying to change this not just for Cisco, for the industry. We need to think differently. we have this great opportunity and really excited about the future. Well, the current service model has been in place for an awfully long time, right? And customer satisfaction, you know, up and down, but you're there when you need them. But certainly this whole concept of proactivity is something that's long been sought after. In fact, as a former IT pro, I remember I used to read in the trade rags all the time about how it needs to be more proactive. I got a little offended by that because it's not like I didn't want to be proactive. I just didn't have the tools to be proactive and predictive, right? So now you're giving them that now. Now it's possible and we're showing that. Yeah. All right. that was great discussion. So on behalf of Sandy Miller from Cisco, I'm C. Caraval from ZK researching. Thanks for watching. give us a like and also hit that subscribe button and I'll see you next time on my on my next episode of ZCast. Thanks. [music]",
        "start": 1210.4,
        "duration": 2576.260000000001
    }
]