[
    {
        "text": " Welcome to ZAS everyone. I'm Zas Garaval from ZK Research and I'm here at the 8x8 booth inside the Expo Hall and NRF 2026 which is of course the National Retail Federation show. I'm with Dwani Sony from 8 by8. Dwani, how you doing? I'm great. Thank you for having being here and at our booth at 8 by8. It's been a busy couple of days right here. Yeah. Yeah. Yeah, it's been a while since I talked to you. So, just remind everybody what you do at 8 byite. Yes, I am GP product management and design at a bite. Yeah. Okay. So, we're going to be talking retail obviously at a retail show. and you've got a product I want to talk about called engage and talk about some other products. but first of all, let's just talk about retail transformation in general. I know a in fact has a lot of retail customers, big vertical for you. what are you seeing in that space right now? especially in the area of AI. Oh, okay. So you started with Yeah. I'll start a little bit flipped on the CX side first and we'll get to AI obviously because AI but when you think about retail think about the brick and mortar so it's got HQ and connectivity to multi geoloccated stores right. So at that point you're looking at on-rem solutions or customers who are still on onrem and wanting to move to cloud. So that whole transformation and guiding them through that process and there's so much on prem isn't there still on prem whether we know it or like it or not but yes and but that revolution is evolution is also happening and as as CIOS IT buyers are looking at that they're looking for partners who have been there done that and have got a good reputation around that. So you then you start looking at okay so you've got the employees and you've got them covered from the UC standpoint but you've got a you need a contact center so you've got a contact center solution for that but really key is when you have HQ and connected stores is how do they communicate with each other one is just having the employees connected so they can service the customer better and that's where engage comes in but also from a retail standpoint it's also about you know being able to monitor the network remotely and have actionable outcomes comes from there, right? Okay, let me get into engage for a second. So, think about big big box retailers and you know they're looking at their contact center operations and at times they need to reach out to somebody in the store or in the warehouse to collect any kind of information. It could be like is this things still available or is there still do we have somebody as a guide who can guide the person or the customer on",
        "start": 6.0,
        "duration": 283.7610000000001
    },
    {
        "text": "times they need to reach out to somebody in the store or in the warehouse to collect any kind of information. It could be like is this things still available or is there still do we have somebody as a guide who can guide the person or the customer on able to connect those calls. It's not just UC and CC at that time. They're looking for that experience. Whether the customer was calling in from any channel, SMS, chat, voice, being able to service them on that same channel and have that connectivity from our contact center to the front line is extremely important. Yeah. Well, I'm glad you brought up front line. In fact, that's been a trend I've been following for a while, right? So while 80% of workers are frontline and only 20% are knowledge workers, it seems most of the innovation in the space has been directed to the 20%. and like what what's going on the other region? Well, that goes back to your question of like what's happening and where do you see the trends like I think this is going to pick up and there's an undercurrent which is now going to become very evident like we've service the internal collab and the internal employees for a while but we were also using the same tools we're going to service the highprofile customers and this is where engage comes in and you use those tools for a high-profile hightouch customer to service them and from a retail perspective that's extremely important your seesat your loyalty your retention that shows up and don't forget the data and this is where AI comes in very important these days these interactions whether the customer is in store or online to be able to tie that bring that customer 360 view for a retail store employee on on a zebra device or any 8 by app device right or to service a customer remotely from a corn center after they have all their online information as well included in that that's where AI shows up your journey your entire journey map for the customer sentiment demand, all of those things show up. Yeah. So, you're talking about really expanding contact center capability outside the contact center, but with a a set of tools that's, you know, for a lack of a better way, I guess, lighter, right? So, if you think about if I were to give a retail store clerk a full contact center dashboard, they wouldn't know what to do. Yeah. And frankly, they don't need it either, right? So, yeah, that's that's good. So that's the premise engage is to be able to bring more functionality to those frontline workers, right? And so and it's been interesting walking around the show floor, you know, with you know, so much of the way of automated payment systems, robots, things like that. The the one thing I",
        "start": 147.92,
        "duration": 551.84
    },
    {
        "text": "the premise engage is to be able to bring more functionality to those frontline workers, right? And so and it's been interesting walking around the show floor, you know, with you know, so much of the way of automated payment systems, robots, things like that. The the one thing I future of retail is going to look like, but it's going to look a whole lot different than what the way it looks right now. It's it's exciting just being here and like you said, like payment systems, clientelling. There's just so many new things that I got to learn overall here too. And it's the ecosystem of retail is like is is getting through going through an evolution so quickly that what we see today in 5 years, 3 years down the line is going to be massively different. But again, as a business communications leader, what we need to make sure is we're playing in their ecosystem. We're playing in the the needs of the persona we servicing or the buyers we're servicing. Right? At the end of the day, customer loyalty, customer retention, the information that we have at the at the fingertips of these employees that service them is extremely important. Yeah. Now, 8 by8 also has a you know, obviously one of the first companies bring UCCC together. from a CC perspective has a very robust set of AI capabilities u and are you seeing a lot of uptick in the AI capabilities for four for contact center for? I mean not just contact center the similar capabilities are available on our engage product also available on UC product. So if you are servicing a customer you've got the transcript the summary the action items the the keyword tracking all of those things are available at the fingertips on the cube. And so let me ask you the how's the interest been to an AI agents that's been a big topic here. I go upstairs all I see is aentic everywhere. I was at CES last week and again the agendic agents was being I mean thrown around like candy. So how are brands responding with the concept of allowing their customers to talk to AI agendic agents? I think you will see a lot of busyiness chaos until it falls to a rhythm is how I see it. Everybody wants to adopt agents and we should all of us should all the customers should but then be careful of where it means to be able to transfer to a human agent in a very seamless way without any friction that should be that should be taken care of or catered to and that shouldn't be avoided at any cost. And when we want to use agent for automation absolutely if it makes your business more efficient absolutely do it. Yeah. And so when I think about it from a retailer standpoint, I've got I'm not getting rid of human agents, right? I",
        "start": 283.759,
        "duration": 828.3989999999999
    },
    {
        "text": "that shouldn't be avoided at any cost. And when we want to use agent for automation absolutely if it makes your business more efficient absolutely do it. Yeah. And so when I think about it from a retailer standpoint, I've got I'm not getting rid of human agents, right? I how do I manage these two humans and agents together? I mean the tools these days are allowing that, right? You've got workforce management tools and that's a great point that you know today they are catering to a workforce which is made of only humans. tomorrow those are skill-based monitoring for those agents whether human or actually online automated they both should be catered to that yeah and and this also I guess the other question from Matt would would roll you know 8 by8 built their own workforce management tools historically what this industry's lived on what I call Frankensteining and contact center tools right so yeah you got workforce management one vendor quality management for another vendor contact center for a third vendor. But then when I try and take that data, put it together and do AI and I I really can't because it's different silos. And so when you were thinking about like bringing these I'm not sure AI was even in your head when you brought these products or it might have been. I mean tech evolves all the time. How much of advantage do you think that gives you though? I think we the way we've built our platform is yes all the vendors in the same in the space have you know had built by acquisition but at the end of the day how do you some still partner though they partner too but and we have to account for both of them partners and acquisition so at the end of the day when a customer buys from us the stack and the outcomes and the reporting the historical or the proactive they all need to account for the data to be absolutely accurate and that's how you you get away from that Frankenstein staff building up y and we have accounted that whether so our engage uses the same back end as the archonic center and you see it's built on the same infrastructure it's got the same client or the customer ID mapping so we can tie the whole customer's journey through any channel voice online digital anything together in the same document yeah and so now I want to tap into the thought leaders head here you know historically and we've talked about this before you know companies measured the effectiveness of their contact center using metrics like panel time, first call resolution, things like that. But AI is really changing that, right? And what and what are companies, how are they trying to measure the effectiveness of these AI tools? And what what are really the important metrics today? I think the the KPIs are absolutely",
        "start": 422.88,
        "duration": 1098.6409999999994
    },
    {
        "text": "like panel time, first call resolution, things like that. But AI is really changing that, right? And what and what are companies, how are they trying to measure the effectiveness of these AI tools? And what what are really the important metrics today? I think the the KPIs are absolutely adopt, they're also looking for new new ways to measure the success of the tools that they're using. How to Yes. I mean, we have to guide them, prompt them, remind them the same tool, same KPIs don't apply. And when you show them like the customer effort score, the autogenerated quality management or autogenerated sees they're like yeah we want to adopt that. That makes sense. Now I will now we understand why we need that sees or why we need that NPS. It's autogenerated, right? You have the control at the end of the day but it's autogenerated. So it takes a lot of cognitive and administrative load off and those are the new new KPIs that are rising in the world of AP AI. Yeah. Yeah. No, that's important. In fact, I think the if it weren't for the AI to autogenerate, I'm not sure those metrics would be useful cuz they historically haven't been useful. Right. If I think about a seesat score, all I really got was unhappy customers or happy customers, right? Yeah. So now you get keywords, why, where did it break? You can really drill down the entire journey map. And it's it's it's amazing the way you can the AI can now prompt you with like well if you injected this at this point the customer effort score goes down completely and you have a high customer health score and that's that's amazing that's amazing for as as a retailer to know. All right so now you think you're thinking your thought leadership I'll put your advice hat on. There's a lot, you know, this there's a thousands of retailers here at the show. a lot of the ones I've talked to, AI is still an idea in their head. They're experimenting with it, but they're not really sure how to get going. What kind of advice do you give them on how to start moving forward with AI without putting their business at risk? Yeah, I I go very simple. Like for me, it's like the keep it simple. Yeah, keep it simple methodology. Find a good partner, a business, a telecommunications vendor that understands your business, wants to understand the outcomes you're going for, is not dumping everything in one shot. It's transformation is a journey in the world of AI as well. You may want to start with one. You might want a partner who evaluates your business, provides you the recommendations. You start with one, then you expand and then you expand more. And that's how I think you start adopting AI, become comfortable with it, start trusting it. And that's extremely integral and",
        "start": 561.76,
        "duration": 1369.6009999999992
    },
    {
        "text": "to start with one. You might want a partner who evaluates your business, provides you the recommendations. You start with one, then you expand and then you expand more. And that's how I think you start adopting AI, become comfortable with it, start trusting it. And that's extremely integral and Yeah, I my advice has always been too that you want to start with not necessarily simple tests but mundane tasks. So you think like in a contact center people like talking to customers, right? So let them keep doing that. They don't like doing documentation. They don't like doing call up things. They don't like taking notes. Yeah. Yeah. They're all nobody does those very well. So let AI do that. In fact, my advice to people has been if there's things you're doing in your job today that you don't like doing, stop doing them. Just let them Yeah, let AI do it, right? And that'll allow us to become a lot more productive and really I think just enjoy your jobs more. Yeah, absolutely. Yeah. All right. So, we talked engage, we talked CX, anything on the employee side you want to talk about? , I strongly believe that you know the businesses thrive on frontline employees experience. So I think in future or it's like the undercurrent that's going on that's going to pick up is the customers retailers start start to now start to think about how they can connect the frontline employees more. How can they provide them with the same tools and intelligence about the customers who they the the remote people are meeting online and the in store people are meeting in person and how do they bring that customer 360 view as they serve the customer on whichever channel and at the end of the day if the frontline employees happy they're adopting tools you've got great adoption it's it's value for your money and you're getting the ROI that you want. Yeah, frontline employees very important. These are all your customerf facing tools. All your investment has gone to back office employees, the knowledge workers. So, start investing in front line. Is that right? Fantastic. I agree. 8 by8 engage is built for frontline employees. Yeah. All right. So, anything last last words? Okay. So, on behalf of Dwani Sony from 8 by8 from the 8 by8 stand and NRF from ZS Caraval from ZK Research saying thanks for watching. , give us a like and don't forget to hit the subscribe button and I'll see you next time on my next episode of ZCast. [music]",
        "start": 699.6,
        "duration": 1602.268999999999
    }
]