[
    {
        "text": " Welcome to ZCAS everyone. I'm Zas Caraval from ZK Research and I'm here in New York at the New York Stock Exchange. I'm with Ring Central. we just finished investor day. I'm with Kieran Macagon, the president and COO. and I'm excited to talk to you about the event and all the innovation you have going on. Excited to be here. Thank you. Yeah. And so just initial thoughts from the event. What did you think of it today? I think it was great. There was a lot of energy. We showcased our new products the family of air Ava and ACE and we'll talk about that with Zeus just in just in a moment. and looking forward to a an AI future. Yeah. Well, the obviously AI was a big topic of discussion. and you know just the you know for some background the the fundamental premise of my research has always been that share shifts happen when markets transition right and I think ring central was early out of the gates with cloud you caught that transition AI is coming right and so as president and co when you think about the impact is going to have you know what are your thoughts around that and how do you position ring u you know to to really catch that wave like you did with cloud. Yeah. Well, so with cloud in central pioneered the the the cloud for for PBXs and we are the leader today in the market. and our strength is in voice. We've got tens of billions of minutes that we process per year of of voice and 500 plus customers that are running on central and our prim primary modality is voice and today we've announced that we're embarking with from that strength in voice on what we call identic voice AI wisdom central which is really rooted in our strengths of of [snorts] strengths in core competency of secure reliable global voice platform which is also multimodel multimodel and going from there we're looking at a whole array array of AI products that we've announced today some of them are kind of next generation products releases 2.0 O etc. And together we call it in central 3.0 and you know we'll talk about these products. One is we all we define we define conversation in terms of three phases and ring central car is lots of conversations voice le but also multimodel on our platform pre during and post for do for pre we have a product called air which is an AI receptionist which actually actually feels your phone calls to a business of any size it's the first in in line and the reason that ring central is so well positioned to be in that to capture that vollete is because we're truly first in line. We're the ones getting the phone call. We're the ones that are first in line of communication and then everything else all other",
        "start": 5.68,
        "duration": 397.1999999999999
    },
    {
        "text": "in line and the reason that ring central is so well positioned to be in that to capture that vollete is because we're truly first in line. We're the ones getting the phone call. We're the ones that are first in line of communication and then everything else all other context the richest form of u interaction which is voice the most ubiquitous were the first in line and then the next phase of that interaction we call during is where we have our our family of products called AA AI virtual assistants which assist you in a conversation and then post the conversation is a family of products called ACE which are AI experts which essentially coach analyze and provide intelligence across the entire journey and it's a virtue circle. Yeah. And what I like about that is you're thinking about the life cycle of the phone call. I think you know historically we've done the call itself pretty good, right? I mean you're adding a lot of extra features to it but but few very few companies have actually thought about pre and post. Yeah. Right. It just the the call was focused on. Now, , , one of the things that, , Vladmis, your CEO, said was he talked about AI driving a voice renaissance. And you touched on some of that in just the description you gave me, but why does AI drive more voice? Because , we our most natural form of interaction is voice. This is how we want to communicate most natural. That's what you and I are doing right now. So the I guess if we did a text podcast. Yeah. Yeah. Yeah. Yeah. Yeah. That'd be less interesting. Exactly. Would k less emotion or probably k you know a lot of emojis with it you know u something like that. in in real life we we converse and in conversing that has so much data behind it whether it's sentiment whether it's it's intonation pausing pacing I can go on. So the the the the the that each behind that is what we are capturing and in the best position to capture and that is the renaissance because previously voice sort of was you know at best it was transcribed. Now the renaissance behind that is that you can actually uncover all of that in real time. you can listen, you can react. , and even you know virtual assistants or our heirs, our virtual receptionists, you know, it can understand intonation. And so this renaissance is now voice in many in scenarios humans to humans, humans to AI, AI to to to AI and the intelligence behind it. It's sort of you're now mining that voice data which you know you couldn't do before or didn't do before. I've heard companies refer to as dark data. Yeah. Right. you just you really had no visibility. Great way of describing it. Yeah. Yeah. Now, this transition to AI and",
        "start": 203.84,
        "duration": 725.8399999999996
    },
    {
        "text": "It's sort of you're now mining that voice data which you know you couldn't do before or didn't do before. I've heard companies refer to as dark data. Yeah. Right. you just you really had no visibility. Great way of describing it. Yeah. Yeah. Now, this transition to AI and unnoticed by your competitors, right? Everybody's got a good AI story today. And so, you know, from a product perspective, what are the keys to winning in the AI era? How do you differentiate yourself in this overly noisy landscape? One of the things that central prided itself ourselves always on is u the simplicity with which you can deploy our products with which you can buy our products with which you can manage our products and the accuracy and reliability. Those are the things that are fundamental for for central and those are the things that we care into our AI and I believe our customers are recognizing it. air has had extremely rapid adoption among our customers going from nothing to almost 6,000 customers now. we had some customers today u on the on the panels basically I would say raving about it. and it's a young product and it's a product that's not even a year old. its its its strength is in its simplicity in the fact that in fact a receptionist can set up its own dub you know its own AI receptionist to help it in in peak hours for example that I think it today being to being sold together or separately but again mostly together today with our core product for a business of any size is absolutely unique in the market you know you've got like lots ofcept ception is out there but nothing like in central that contains that simplicity and fit to purpose and the accuracy and reliability. Yeah. And one of the things that you did talk about here too was the integration of community WFM and obviously WFM's not a new market, right? We've had a lot of vendors for a lot of years. In fact, you partnered in that area historically. you know, so the question is why do you acquire and why now? Why is it important to own that today versus partnering like you have in the past? As our LCX, our contact center product matures, we listen to our customers. and our customers tell us we want to buy one solution from you. A package that has everything. and so that's that's what led us to an acquisition of Community FM. And that's what led us to a packaging that makes it again simple for our customers to buy it allin-one. have unified reporting, analytics and workforce management that can spend a number of cross departmental functions in an organization. Yeah. And actually the customer panel you had was interesting because you had a couple of traditional buyers but also a CIO and historically this industry did",
        "start": 370.56,
        "duration": 1053.5199999999995
    },
    {
        "text": "to buy it allin-one. have unified reporting, analytics and workforce management that can spend a number of cross departmental functions in an organization. Yeah. And actually the customer panel you had was interesting because you had a couple of traditional buyers but also a CIO and historically this industry did you talked to a lot of customers and so talk about the interactions you've had with your customers and how you've seen the buyers of Ring Central change over the last few years and why that is really an important step for this industry as it matures. Yeah, great question. It's super important. So the buyer has evolved from being sort of an IT buyer that is looking to buy a communication system to enable phones or agent agents and seats butts and seats. call it. I just called it telecom. Telecom. Yeah. Well, you know, lift it a little higher, you know. and what we're seeing today is the buyer is elevated to somebody who can make business decisions who can where or where this technology can enable better business decisions, better business insights, better overall organizational efficiency which everybody is looking for today and better overall sort of containment of of conversations, understanding mining like like we said, you know, dark going u u dark light. Yeah. Dang up the the the dark matter. so we're seeing actually chief transformation officers now participate in bio decisions for our for our solutions because we're helping organizations transform. It's beyond enabling dial tones or transfers or you know routing. this is now on to enabling workforce to work faster and smarter and with less. Yeah. So as this transition happens that means you got to change your go to market some because I think historically you know when I've seen I've been to Ring Central events in the past you know you show that the the on-prem market is this big. we can do it cheaper, better, faster. And there was a great value prop because you could do it cheaper, better, faster, right? But these new buyers you're talking about, they care less about that and more about your ability to transform the business. And so now you got to start thinking about business outcomes, right? And so when as you put that together, what are some of the I guess lowhanging fruit business outcomes that Ring Central can address right now? so the best way to address these outcomes is to give our customers a solution where they can see it for themselves. And we've heard you've heard today several customers talk about ACE AI expert that basically helps them analyze all these data points collect the collect the data behind conversations and use that to drive better coaching better training better insights into what what works for business, what doesn't work for business. understanding what what their customers are saying and putting it all together. For us, what they're telling us is we they're",
        "start": 535.68,
        "duration": 1413.9189999999992
    },
    {
        "text": "collect the collect the data behind conversations and use that to drive better coaching better training better insights into what what works for business, what doesn't work for business. understanding what what their customers are saying and putting it all together. For us, what they're telling us is we they're efficiency such as we were able to increase our revenue by such and such and such because we understood these patterns from the phone calls that are taking place which they didn't understand before, didn't have time, couldn't mine, couldn't put it all together. Now, you mentioned Ring Central. And that was a key theme here at the investor event. And you touched on some of the new products, but just to make sure everybody fully understands what was announced today. Can you just give a quick recap of all the new products and what they do? yeah, of course. So we we announced five things in the last two days. We announced number one air air receptionist. IA receptionist with additional features such as now lead capture, contextual transfer more languages and enhanced appointment setting. We announced AA which is an early availability control availability. it's our next generation think of co-pilot a a being AI virtual assistant which helps you answer routine questions actually within the app. So, it helps you as a user learn the our own app better. it's got a prompt-like interface and it also is now we're actually wrapping a whole family of our AI assist packages previously known in contact center as by by the names of ISIS supervisor assist essentially to this ABA family. next is we renamed in are formerly knownense into now called ACE AI conversation conversational expert conversation AI conversation expert and that is really what enables u coaching of of any kind of person agent or for sales agent for customer support agent in informal contact center to be trained better was assistance of analyzing what they say, helping their managers have insights into that and then having dashboards into all of these conversations for business. This is where the best part of ACE is these business outcomes. and then we also announced ring WM which is now workforce engagement management module that includes the acquisition of community FM and a number of QA quality modules sees etc. And then the last thing that we announced is we now have what we call customer experience bundle. And customer experience bundle is really targeted for informal contact centers. It's got advanced queue management and SMS management in situations where you don't need a formal contact center but you've got inbound outbound type of customer traffic. All right. Well, that was a big launch today. Okay, those are big. , and so, , going into next year, what's on the near-term road map? As much as you can share without violating NDAs, I don't want you to get in trouble. Well, we we're innovating rapidly. We",
        "start": 719.12,
        "duration": 1781.7599999999995
    },
    {
        "text": "All right. Well, that was a big launch today. Okay, those are big. , and so, , going into next year, what's on the near-term road map? As much as you can share without violating NDAs, I don't want you to get in trouble. Well, we we're innovating rapidly. We I know there's so much stuff coming out, right? We've never announced that many products in in like in a course of or that much innovation really in in a in such a course period of time. Expect all of these products to come up sort of with next releases, next generations. , we'll continue to innovate. will continue to harden and provide a lot more richness to each one of these products. and there's something else that's being cooked and baked, but I'll leave that for the next one. Okay. I can't wait to see that. again, so checking the time here. I know we got to wrap up soon. I know there's a lot of buyers out there that want AI, but they're very confused as to where to start, right? And so you've obviously talked to a lot of customers, some successful, some not with their pilots. What what's some advice you can give? How do companies think through this big quagmire of AI things? You know, the best thing to think about this quagmire of of AI is what problem can we help you solve? Find a specific problem. So with air, perfect example, you don't have enough receptionists and not enough front office workers to take your phone calls. phone calls translate for inbound from customers increase translate to revenue. So solve that problem. Every business has that problem. Yeah. So segment it and take it a step at a time. and we'll help you along the way. But I think the key here is you got to get started. You got to get started. I think a lot of companies you know they're dotting every eye and crossing every tea and they're almost analysis paralysis as that expression used to be where they overthink it to the point where they don't get going. And I think in AI, you just got to go in and try it. You just Yeah, you got to try it. Yeah. So, all right. Anything else you want to add? Thank you. No, that was a it was a great investor day. , you know, we'll see what the future brings. We're going into 2026, and I don't know if 2026 will be the year of mass AI adoption, but we're certainly going to see a lot of pilots into production. What excites me about what you did, use the term co-pilot, it's actually becoming more co-worker where it's completing tasks on our behalf. And so that's going to allow us all to be, you know, an order of magnitude more productive perhaps. You're right on. Yeah. So, , on behalf of Kira Meagon",
        "start": 907.839,
        "duration": 2057.918999999999
    },
    {
        "text": "about what you did, use the term co-pilot, it's actually becoming more co-worker where it's completing tasks on our behalf. And so that's going to allow us all to be, you know, an order of magnitude more productive perhaps. You're right on. Yeah. So, , on behalf of Kira Meagon Reaches. Thanks for watching. , give us a like and also hit that subscribe button. I'll see you next time on the next episode of ZCAST. [music]",
        "start": 1047.039,
        "duration": 2074.976999999999
    }
]