[
    {
        "text": " [Music] Welcome to Zcast everyone. I'm Z Caraval from ZK Research and I'm here inside Cisco's offices in New York. I'm with Fran Kasudis, Cisco's people, policy and purpose officer. Fran, it's been about a year since we've talked. we're back for Global Citizen. We are. Yeah. And how have things been? Really good. It has been a really busy time as you know. We are here during ANGA climate and global citizen week and so so many conversations and efforts around I think the topics that we really care about technology AI cyber security skilling and then how we take all of those things and ensure that we do good for the world. Yeah, it's and I want to talk to you about about some of those events. In fact, it's I always find it strange that they do all the events at the same time, but I guess it makes sense that they do all the events at the same time just from a logistics standpoint. But I want to start with the the workforce consortium. I saw a report that came out of that and this is something that Cisco's a a part of with other companies and so can you first talk about what the workforce consortium is and why it was created? Yeah. So we started this body of work about two years ago and the first report was how we together with a set of peers looked at technology roles and how we started to scenario plan around the impact of those roles as a result of AI. And what was so fascinating about the first report is that we learned that together with Microsoft, SAP, Google, IVM, Accenture, , eight-fold that we actually all were looking at roles in a very similar way. That was the first time that we saw that. This last report looks at what's happened over the last year. And what we see is that 78% of roles will be impacted by AI. And sometimes you use the word impact and people get nervous. Yes. But the way that I would translate that is you're going to see AI come in and I think some of these jobs hopefully impactful people will feel like they actually have a AI peer helping them do a lot of the gathering of insights and they'll still have to figure out how to leverage them. but so we saw that across the board AI is front and center. We also looked at about 10 of the support roles and that was interesting for us as well. We as a part of the report have 200 training offerings that are available. those offerings for the most part are all free and will allow people to really lean into their AI training. And the last thing that I would say ZS is that we saw some new and emerging roles come up. And so, , one of the roles that",
        "start": 0.04,
        "duration": 327.95900000000006
    },
    {
        "text": "are available. those offerings for the most part are all free and will allow people to really lean into their AI training. And the last thing that I would say ZS is that we saw some new and emerging roles come up. And so, , one of the roles that focused on AI risk and governance. Yeah. And actually, that's an important point because I think , one of the comments that I've been making about the internet is that it'll eliminate some jobs, it'll change some jobs, and it'll create a bunch of new jobs. And then whenever I've asked business leaders, what new jobs will it create? Well, that's the kind of thing we don't really know until it creates the job, right? And so, but that's a good point that that it it has done that. Now, the 78% number, did that surprise you? Do you believe it? Do you think because I think back to the the impact the internet has and it's probably impacted 100% of jobs today right now. It's hard for me to think of a job where the internet doesn't play some aspect of it. And so, when when you saw that, if you were if I were to ask you before the survey was run, would you have thought that? I think so. I think so. Yeah. because what you can see and it's not all at the same time and AI will not impact every role in the same way but what we can see across the company today is a lot of use cases that I think show up in the report as well and I think the other thing that the report was really meant to do is give companies but also give individuals a map around some of the skills that are going to be most important as we move forward. Yeah. Well, that's that's and I wanted to ask about that too. how you use this data then to influence your role in making sure that the Cisco workforce stays current with skills, but you always have the best people in the right places. Yeah. It's so funny because when we did the first report, I didn't understand the power of what we were going to have. I I actually thought it was a thought leadership body of work that we would put out to the world and all of us would learn. The way that I started to view it is this is my blueprint. And so what it tells me is as someone who can architect where we invest from a learning perspective, here are some of the changes we can anticipate and then here's how we keep our people ready and relevant for some of those changes as well. And so that's how we use it from an employer perspective. And what you see in the report is both an element of it for employers and then for",
        "start": 165.519,
        "duration": 589.3199999999997
    },
    {
        "text": "we can anticipate and then here's how we keep our people ready and relevant for some of those changes as well. And so that's how we use it from an employer perspective. And what you see in the report is both an element of it for employers and then for is really important. Yeah. And I know you're and so as you've gone through this transition, I know you're a big advocate of employee sentiment. You do a lot of surveys. Have you noticed a shift in employee sentiment? Are they more positive about AI now? They are. And I attribute part of that to some of the programs that we've had like teaming with AI. And something that we realized early on was that AI is a team sport. And what I mean by that is we have a program where we put training out. We ask for volunteers. They get they got trained on using AI tools and then they went back to their organizations and they hosted and facilitated discussions around how do we use this on a day-to-day basis? How does it make us better in what we do? What we found was before people went through this 62% of people felt comfortable with AI tooling. After they went through it was in the '9s. Wow. And that's what you want. And it just reinforces that when people can play with the tools, when they have a chance to explore and work together, they're going to feel a lot more comfortable and they're going to see themselves in the future. Yeah. No, I can see that. In fact, when I started my career, we put in Windowsbased systems to replace the DOS based ones the brokers had. And at first they said, I'm never going to use this. And then two days later, I was like, this is the best thing ever. So, you know, I I can see exposure to it helps. now, I want to change gears a little bit and talk to Africa. Sure. And I know Africa's a region you've been very very active in for years now and I'm I'm curious about where you see it now and what excites you about like why so much interest in Africa. Yeah, it's so interesting. And so it was seven years ago that I first became the executive sponsor for South Africa. And at Cisco, we have this approach where we identify countries, we assign a member of the leadership team. And so my role is how do I bring South Africa to headquarters and then over time it expanded to the continent, which is kind of crazy when you think about how many countries on the continent, but what makes me so excited and I I think people see it's bigger than people think too, right? Oh yeah, it really is. is that you look at the demographics. we just did a report looking at the AI",
        "start": 299.68,
        "duration": 860.2790000000001
    },
    {
        "text": "when you think about how many countries on the continent, but what makes me so excited and I I think people see it's bigger than people think too, right? Oh yeah, it really is. is that you look at the demographics. we just did a report looking at the AI find is that on the African continent, youth are using AI tools more than anywhere else in the world. The other stat that we saw was that 75% of young people say that they're going to start their own business within the next 5 years. And when you look at the demographics with that entrepreneurial spirit, you see what those opportunities can be. And then on the flip side, CS, you see that 62% of people are not connected to the internet. And so from a Cisco perspective, it's so important for us to focus on this digital divide and to do everything that we can to help more and more people get connected so that they can participate. And then from a Cisco perspective, as they get connected, that's also good for our business as well. Yeah. I guess the on the AI side, I'm not surprised if the expression necessities mother of invention. Yeah. You know, there is a region where you don't you don't have enough people to fill jobs. You it's too expensive in a lot of cases. And so if I can use AI as a proxy for people now, I can create a viable business where maybe I couldn't have before. now you mentioned the report that it's the I want to get this right. AI and workforce in Africa report done in partnership with Carnegie Melon. That's right. Right. And so what were some of the key findings in there that you thought were notable? So one of the things that we found of course is that skilling is going to be so important for the continent. today Cisco has trained 1.6 million learners on the continent. We want that number to be at at least three million by 2030. That's a commitment that we've made. what we could see in the report as well is some great projects that other companies are doing that I think can be replicated more and more. we highlight the fact that infrastructure is going to be so important for the African continent. we talk a little bit about cyber security and some of the risks that we see there as well. That was actually the first paper that we did in Africa about a year ago. And the other thing that we see is one of the biggest challenges is around energy. And I know this week in New York there's so many conversations about AI and energy and I I think we do have to bring these conversations together as well. Yeah. It's interesting because AI uses a lot of energy but it's probably the thing that will allow us to manage our energy better.",
        "start": 436.08,
        "duration": 1131.0009999999995
    },
    {
        "text": "week in New York there's so many conversations about AI and energy and I I think we do have to bring these conversations together as well. Yeah. It's interesting because AI uses a lot of energy but it's probably the thing that will allow us to manage our energy better. you need AI energy for AI but you could argue you need AI for better energy management too which is kind of a an interesting juosition. Now I know Cisco CDA the country digital acceleration program has been very active in Africa as well and can you talk you talked about the 1.6 million trained any other notable data points about the impact Cisco's had in the continent? Yeah of course so first I would just say that we have done about 60 projects on the continent from a CDA perspective about 10 are still underway. We've completed 50. The types of projects that we're talking about are things like setting up cyber security centers that not only showcase how our technology is being used to solve issues but allows us to again bring learners in to broaden their understanding of cyber security. I happened to be with one of the heads of state in Africa this week who was basically asking Cisco to bring a lot of that training into the government so that as the government is making decisions about how they run and their processes they also have the latest and greatest from a technology perspective. Those are the types of projects that we do. when I look across the continent health care, education, transportation, even digital justice, those are the types of CDA projects that we run. And you mentioned South Africa. What are some of the other obviously you're not going to transform all of Africa, right? There's some some areas that are a little rough, let's just say. but what are some of the countries that you're most excited about? Yeah, it's it's hard to create a short list because there is a lot of great momentum at this moment, but I would say top and bottom I would say Egypt, Morocco, Morocco has the World Cup coming up and so what we see is so much investment in infrastructure. I was there just a few weeks ago and we committed to building a cyber security center at the international university robot and walking through with the university president and seeing what they're doing. You get really inspired by what's possible. So I would say huge opportunities there. Kenya is significant. I think whenever I go to Kenya I see some of the fintech examples that I think are leading around the world. Nigeria, Ghana are huge opportunities as well. And then as we go further south, I would say Batswana has been really interesting. South Africa recently I spent time in Cottovois. We announced this week the data center in Cottovo, which we're really excited about. We did that with",
        "start": 574.64,
        "duration": 1452.3609999999999
    },
    {
        "text": "the world. Nigeria, Ghana are huge opportunities as well. And then as we go further south, I would say Batswana has been really interesting. South Africa recently I spent time in Cottovois. We announced this week the data center in Cottovo, which we're really excited about. We did that with And lastly, Rwanda is another great opportunity for us. Yeah. Well, great. And well, keep up the good work in Africa. I'm starting I think you know a strong Africa benefits the whole world. That's right. So let's change gears a little bit now into the whole concept of these public private nonprofit partnerships. I think you know Cisco's mission of creating a more inclusive future has largely been based on a lot of these partnerships. And so can you talk a little bit about how why they're important and how you leverage them to be able to advance Cisco's mission? It's so interesting because I find that across governments and across the private sector, we're interested in a lot of the same things. And if we don't come together more often, what you'll see is a lot of great intentions, but fragmented offerings and if we take, you know, an example like education. I have to tell you that most large-scale enterprises that I talk to, they have great efforts around education, but when we all do it separately, it it's really hard for the consumers to take in. And this kind of goes back to the ICT consortium paper. All of us came together and said, \"Here are our offerings.\" We put it in one place so that a learner can now navigate. They can take a course from Google, a course from Cisco, Microsoft, whatever it may be. So what I would say first is that these partnerships allow us to use one another's strengths. I think it allows us to come together and in many cases I think it picks up the speed because when we work with the public sector they know how to navigate that piece of it and then they take our innovation our speed and how we run and we really come together I think in a meaningful way. Yeah. And I think one of the partnerships that's been very successful with Global Citizen as I mentioned we're here for that. you've Cisco's now been a partner for seven years. That's right. Going and and and why do you you know what have you liked about it and what's caused you to keep funding it? So what I like most about it is it continues to evolve. when we started it was really about the sheer impact on the world and having an organization that truly believes they can eradicate extreme poverty is amazing and it's so courageous and I think being partnered up with organizations that see the world that way I think is really really positive and for us at Cisco seeing how some of our actions can come",
        "start": 736.0,
        "duration": 1749.2409999999993
    },
    {
        "text": "having an organization that truly believes they can eradicate extreme poverty is amazing and it's so courageous and I think being partnered up with organizations that see the world that way I think is really really positive and for us at Cisco seeing how some of our actions can come Over the years, I would say what we've recognized is that our belief in technology for good and everything that global citizen is focused on from a planet perspective, from an energy access perspective, education, we just have tremendous alignment. And this year, for the first time, we're actually going to showcase to our customers how you connect and protect an event like what we have at Central Park. And so we're bringing our technology in to really support global citizen but allowing us to showcase. And I I think this is kind of nice because it's the best of both. It's in service of this mission that's bigger, but we're pulling our technology through as well. Oh, I'm looking forward to seeing that then. Yeah, it's very cool. And what I what I've actually liked about it is just Cisco sponsors the youth leadership award. Yeah. And it's it's unbelievable the ideas that a single person has and and the willingness to just go take a chance and create a business and the impact that they can have, you know, to millions of people. And so I think it's a good lesson for everybody. If you have a good idea, don't be afraid, right? Because if you can do it with on on a small budget like that, it can be done anywhere. So and you met with Esther yesterday. I love that. And watch for that video coming soon. Yeah. And last topic I want to talk about is resiliency and resilient communities. you created a it's called a resilient ecosystem framework right to assess. So first can you talk about what a resilient community is and then how you're trying to measure that? Yeah and it it's funny because resiliency I think is interwoven on everything we talked about today. what we did was we stepped back and we looked at how we could have the biggest impact. And our recognition was communities that have a really strong government framework or government services that citizens can access. governments that have a strong technology play. communities that have clarity around education, focus on environment, these are all elements of resiliency. And so from a Cisco perspective, our projects can positively impact any one of these areas. And many times our projects start first with sitting down with the government and understanding, hey, what are the problems that you're solving for? And so, as an example, in a country like Poland, one of the biggest things that they were trying to solve for was a citizen ID so that they could deliver more and more services digitally to their ser to their communities.",
        "start": 887.44,
        "duration": 2068.438999999999
    },
    {
        "text": "what are the problems that you're solving for? And so, as an example, in a country like Poland, one of the biggest things that they were trying to solve for was a citizen ID so that they could deliver more and more services digitally to their ser to their communities. partner on. And so we define resiliency and then we work with communities around the projects that allow us with others to your point about public private partnerships to get work done. Oh, good. And I know at the global citizen you're going to be sharing a new goal, right? That's right. That's right. Of being able to impact 40 communities. And can you talk about that goal and the impact you're hoping it's going to have? Yeah. So in 2023, we met our goal of positively impacting a billion people around the world. And you did that ahead of schedule. We did that in nine years. Yeah. And it's so funny, even when I say it, I'm always like, \"Wow.\" And and by the way, the only way that we do that is through amazing partners around the world. But when we when we met that goal, we thought a lot about what do we want to do next? And we were approaching our 40th birthday as a company. And what we decided was that we want to help rebuild 40 communities around the world. We want to bring those elements of resilience into those communities. And our first community was western North Carolina. after Hurricane Helen. Yes. Yeah. And we have worked with Chief Cares as they are focused on building housing and helping people rebuild their lives which is so important. We also have done some work helping people with repairs that insurance denied which has been so hard. And so we've started with a very basic way of intersecting in western North Carolina. Our hope is that as we do more from a housing perspective, we can do more to help drive resilience there as well. Yeah, know that's a certainly a bold goal. And I want to say the billion people if you're watching this, this wasn't some fluffed up number. you were very clear on the fact that if you donated money to some organization and it helped 100 people, you weren't counting that. These were a billion people that you actually directly impacted. And so that was that's an impressive number. So yeah, Brian and his team do a beautiful job and they're so incredibly thoughtful. For us, it's really important how we do it and and to feel confident at the end of the day that we know that the work that we're doing has great impact. Yeah. All right, Fran. Well, we talked AI in the workforce, Africa, partnerships and global citizen and resiliency. Anything else you want to add? I think we've covered it. That was a lot. Yeah. So all right well",
        "start": 1049.919,
        "duration": 2369.078999999999
    },
    {
        "text": "that we know that the work that we're doing has great impact. Yeah. All right, Fran. Well, we talked AI in the workforce, Africa, partnerships and global citizen and resiliency. Anything else you want to add? I think we've covered it. That was a lot. Yeah. So all right well and and so until we talk meet again I'm Z Kaval from ZK Research on behalf of Franudus from Cisco saying thanks for watching give us a like and also hit that subscribe button and I'll see you next time on episode of Zcast. [Music]",
        "start": 1202.799,
        "duration": 2406.5779999999995
    }
]