[
    {
        "text": " [Music] Welcome to Zcast everyone. I'm Zas Caraval from ZK Research and I'm here at the Cisco stand inside the expo hall at GTC DC 2025. I'm with Will Eington from Cisco. welcome back. I just talked to you this morning and I'm with Ian Hartley, CEO of Blue Sky Compute. And we're going to have a you're Cisco customer. So we're going to talk about AI trends, some of the things you're doing with Cisco. but first just a quick on yourself and what Blue Sky does. Of course. So Blue Sky Compute is a Neocloud focused on turning AI into ROI for the world's companies. And so what that really means is we're not just selling compute. We're selling everything that goes around it that makes ROI happen for enterprise. That means data services, that means model selection, model implementation, and of course the compute to run it all on orchestrated by Blue Sky. And so what we're selling is really the outcome rather than the ingredients. Okay. And will just quick reminder as to what you do at Cisco. so I run engineering for networking at Cisco and have been very involved with the NVIDIA partnership since the inception. Okay. And I'm just curious and so there are a number of NeoCloud providers right today and it's a big booming market. what do you feel blue sky differentiator is here? Just as you point out, there are so many NeoClouds. Each one of them is selling the raw ingredients of AI. What we do at Blue Sky is focus on tying it together to produce value for enterprise. And so that means we'll consult on data services, model selection, model implementation, of course, the compute, and finally orchestrating it all to ensure that it does exactly what you want. Oh, so when you say full stack, it's not just the tech stack, but it's all the things that surround it as well. Is that a good That's 100% right. That's 100% right. and you are a customer of Cisco's you've been working with them for a while. What's that relationship like and how are you partner? So I I'll one of the things I think that we've seen is this is an example of how fast this industry is moving. So as Ian and Blue Sky have moved quickly from you know the funding and the planning stage to the buildout. We've partnered on the architecture using the new cloud reference architecture that we've talked about that has the the the the switching the compute as well as storage. And so bundling all that together as a validated solution and then working with Ian and his company. Okay. And how's your relationship with the part the partnership? You know what we love about Cisco is we're more than just a customer of Cisco. We feel like a true partner and that's evidenced not only in the products we buy but also the services",
        "start": 0.72,
        "duration": 312.24
    },
    {
        "text": "Ian and his company. Okay. And how's your relationship with the part the partnership? You know what we love about Cisco is we're more than just a customer of Cisco. We feel like a true partner and that's evidenced not only in the products we buy but also the services it all together. You know, much like Blue Sky makes sure AI works for companies, Cisco is making sure our infrastructure just works. And that's really important as you scale. Yeah. And and so your products obviously AI at the core. They are AI in some ways. And when you think about the journey you've been on, what are some of the challenges you had in scaling the infrastructure? Look, as you build out larger training clusters and you develop a diversified portfolio between inferencing and training, it's important to recognize that, you know, issues happen. And so we wanted to work with a company that was prepared to handle scale, right? The Cisco products and the Cisco networking do exactly that with Cisco's other integrated services like security and other things that they offer. It provides us an entire stack and an entire end to end that we're able to absorb and focus on doing what matters which is turning AI into ROI for clients. One of the examples would probably be in the benchmarking area. So you know there's been a lot of interest to make sure that the performance is equivalent between the Ethernet solution that we'll be deploying with Blue Sky as well as Infiniban. So our benchmarking team has gone through done that testing including with you know they made a selection with vast so including the storage side putting all that together and then reviewing that so that they don't have to start that from scratch. They can start from the the the reference architecture that we've already assembled and tested and get going very quickly. All right. And you know, so we're here at the show and you guys just announced, in fact, it just hit the press recently the new N9100 switch here. and can you tell us a little bit about the switch? Sure. Are you excited about this? So we've already been selling the the the Cisco N9300, which is Cisco silicon, and then you can add a SpectrumX license. The new addition with the N9100 is the same Nexus and sonic options that we would have across our portfolio but now with a spectrum ASIC from Nvidia. So that customers can have either option but with a common operational layer and so they can for instance use one you know the 9100 for backend the 9300 for front end or some customers could use the 9300 with Cisco silicon for both. So the whatever combination the customer Yeah. whatever choice they want but make it consistent operationally. Yeah. And what and Ian, have you had a chance to look at this yet? Is",
        "start": 158.0,
        "duration": 598.0800000000002
    },
    {
        "text": "backend the 9300 for front end or some customers could use the 9300 with Cisco silicon for both. So the whatever combination the customer Yeah. whatever choice they want but make it consistent operationally. Yeah. And what and Ian, have you had a chance to look at this yet? Is it, we're going to be What excites you about this product? Well, first of all, we're going to be the first NeoCloud in the world to deploy this product right here. What's so unique and what we're really excited about is that this provides a congruent story for us. More than just, you know, one east west fabric from one provider and a north south from the other. We're getting both from Cisco. It's an integrated story and it just works out of the box. And that's why we're so excited to be really a leader in deploying this. Not only being a leader in deploying it, we'll have the ELT units. So the early testing EFT. Yeah. Yeah. EFT units. Early testing. We're going to be deploying those right away. So very excited about taking this one with you. Yeah. If they'll let me, I'll take it right now. You need to get Jensen's signature on it first. I think that's 100%. So there we go. And Chucks. Yeah. Now Ian I know you're trying to manage distributed infrastructure for both training and inferencing and you know while people think of those are both kind of related to AI they do have they're both different as fact as their as to the impact on the network right and so since you try to do both what what kind of unique challenges does that create for it of course and so ultimately what we see a lot of other neo clouds have is just one optimized inference stack or one optimized training stack. For us, we're building holistic infrastructure that's highly flexible and it's also global first. And so that means we need a congruent story from north, south, and east, west throughout all of our infrastructure. Again, it's tracking back to that idea that it just works. And so like that's why we're very excited to be deploying something like this which really completes the picture of of you know we had the Cisco north south and now we've got the Cisco east west and it's in video which is the other aspect we've talked which we are looking to help over time is in a multi-data center context the the DCI the optics and what that takes from a a routing architecture in order to bring those together that's something we obviously have a lot of experience and for companies like blue sky compute we think that that's the next step is going beyond treating these each independently and starting you know the scale across type. That's right. Yeah. Well, that's Jensen's whole vision of the new unit of compute is really one",
        "start": 302.8,
        "duration": 859.8400000000004
    },
    {
        "text": "a lot of experience and for companies like blue sky compute we think that that's the next step is going beyond treating these each independently and starting you know the scale across type. That's right. Yeah. Well, that's Jensen's whole vision of the new unit of compute is really one several data centers tied together. Right. Yeah. And now training from what I understand drives a lot of east west traffic and infancy north south. Right. Typically like you said companies stand those up as separate instances. Right. Why did you decide to do that as one step? Ultimately, what we're seeing now is that many companies running training, of course, want to infer their models and they want to run them and they don't just want to run them in one place. They want to run them globally. And so, it's important that we have a story that's congruent across all the compute we use to offer flexibility. If you want to be on West Coast, East Coast, global in one of our partner locations, we'll have the same story, the same experience, and the same reliability everywhere. Yeah. Well, and this switch is handled for both. They're designed for both, right? Yes. Yeah. Absolutely. And I think we've we've seen that even in the inference context while some of the the medium to large might fit on a single system that things like large context windows as well as trying to get high utilization start to be benefit of having that high scale out bandwidth even for the inference case and then also being able to to to change up the the split between inference and training. Yeah. And well I know a big part of the go to market for Cisco too to remove a lot of the complexity is the validated designs. and I think you took advantage of those. and so can you talk about first of all what those are and then maybe add some commentaries how they helped you. Yes. So what we've done with the and you know we participate in multiple there's the enterprise reference architecture for NVIDIA. there's NCP which the 9100 will be a key part of which is the cloud the that's the yeah NVIDIA cloud partner program and then the new thing we're adding is the the SISO cloud reference architecture. So this has been done and the key part is we've gone through and we've tuned the software stack. So the rocky RDMA on the host stack, the configuration of the switches, the configuration of the nicks and then we've achieved that high level of utilization that's right on par with Infiniban. And then the goal is that that that can go you very quickly for a customer like Ian that he can ramp that up as as he's currently doing without having to to spend the six months experimenting. and so that's a key component. And then the vast partnership which Ian also has",
        "start": 434.16,
        "duration": 1117.7609999999997
    },
    {
        "text": "goal is that that that can go you very quickly for a customer like Ian that he can ramp that up as as he's currently doing without having to to spend the six months experimenting. and so that's a key component. And then the vast partnership which Ian also has extensive testing and configuration on how that works into the cluster. And then how did it help you? Again, it really tracks back to the the whole story, right? We are now focusing on global expansion and how do we deliver the same experience everywhere, right? This is a huge part of that. Everything you just said is a huge part of that. Working with Cisco broadly on this product and really everything else you're offering helps us realize that in a way that just lets us focus on doing what we do for customers. Yeah. And so how fast where are you looking to expand? How fast? So right now we have an east location, a west location. We are partnering with a company you'll see that very soon where we're opening up nearly 100 locations around the world that will seed some level of availability. And so really for us what's coming in the future is global inference platform. That's what we're building. And so this is part of that story. And it really does seem like a lot of the early AI use cases went to the hyperscalers. But that hockey stick expansion that we're going to see is really going to be driven by companies like yourself, the neoclass, right? And what again amazes me is the speed. like we start engaging on the architecture and design going through the benchmarking and that's very quickly progressed to purchase and starting the build out jointly with a new technology and so this is a a much faster pace where it used to take a year or two now it's counted in months yeah well you're scanning and I think during his keynote Jensen talked a lot about having to move at light speed and so yes I you know I think we're doing that so and just to wrap things up we are here at GTCDC any any thoughts from the show anything you're taking away from this? , so I've actually never been to DC before, so this has been amazing for me. And I'm now planning I have to be back every year. So that's that's my plan. But no, it's been a a great experience. , and the the number of customers to meet this week has just been awesome. Yeah. Well, it's a lot of federal and I was wondering if we'd have the audience because the because of the shutdown, but boy, this place is packed. Yes. They I think they're coming while they're on furlow in many cases. Yes. And how about you? What are your what you take away from the show? It's always wonderful to hear from",
        "start": 565.04,
        "duration": 1365.6819999999993
    },
    {
        "text": "we'd have the audience because the because of the shutdown, but boy, this place is packed. Yes. They I think they're coming while they're on furlow in many cases. Yes. And how about you? What are your what you take away from the show? It's always wonderful to hear from from our customers, partners, meeting with Cisco and our other partners. And so for us, it's just more of the same of what GTC was last year and great experience to to never get enough GTC. Yeah. So, just last question, right? Obviously, AI is hot, right? There's a lot of companies looking at it. There's been a lot of reports of companies maybe not getting the ROI that they're looking for. , I question some of those studies, but I'm just curious as if you were to make a couple recommendations to organizations looking to now scale their AI infrastructure and go on from vision and pilot to production. What piece of advice would you give? So, this is advice that is obviously a little bit self- serving, but it's it's I think well, you can help them. So, but it's also the biggest problem, right? There's a lot of people out there who will be willing to sell you equipment or ingredients and let you try and go piece it together into value. When you're building AI, you always need to be thinking value first. That's why we talk proof of value, not proof of concept. How do I make you a star, right? That's what we that's a question we answer. And Will, I have a from you. No, I I think we're we're we're seeing a lot of customers where they have existing data centers and then they're looking at how to take the the first steps. I think obviously once you get past that sandboxing and trials, you know, starting with a 64GPU cluster, looking for something that can be an extension and a common management model, that that's key. and and then you know for new neo clouds like like blue sky we're absolutely excited to work with them also. Yeah. Well certainly in the future and so I like that not proof of concept but proof of value. That's right. Yeah. Well that's that's a good piece of advice. So on that note anything else you guys want to add? Well thank you so much for your time. No thank you very much for your time. I appreciate hearing your story and it's always good to hear from a NeoCloud provider because as I said that's really where the scale for EAS can go. So on behalf of Willie Lindon from Cisco and Ian Hartley from Blue Sky Compute from Blue Sky Compute. I'm Zas Caraval from ZK region. Thanks for watching. hit that subscribe button and give us a like and I'll see you next time on this episode of ZCast. [Music]",
        "start": 691.44,
        "duration": 1605.8609999999992
    }
]