[
    {
        "text": " [Music] Welcome to ZAS everyone. I'm Zas Caraval from ZK Research and I'm here at the NICE industry analyst conference in Vienna. It's been a fun event. I'm with Tyus Wanders VP of AI transformation for Cognagi, now a nice company. Yes, that's right. Yeah. And I'm really excited to talk to you because cogni you know one of the leaders in conversational AI u now part of nice you run transformation and of course that's what we're all trying to do right so before we get into that content though u maybe just a quick intro on yourself and then what cognitive does. Sure. Yeah. So Tus wanders originally from the Netherlands now living in the Tampa Bay area US. You sound like it. I I I try. Thank you. I I have a background in enterprise system integration, did some strategy consulting. joined Cockeng about eight years ago, one of the first employees. Yeah, it's been quite a ride. And Cockeng is a u we'll call it an enterprise conversational AI platform. it's a mouthful, right? What do we do? It's natural language understanding, conversation modeling, self-service basically for for digital channels, contact center voice. And nowadays, of course, with all of the AI going on, it's it's all about a gigantic AI. Yes. Yeah. Yeah. Now, if I I think there was one of the analyst reports, maybe a Gartner report that showed all the conversation live vendors. And there, let's just suffice to say there are plenty. It's a lot. Yeah. And there you all, some of you overlap, some of you don't. And so, how does Cogni differentiate itself in a sea of so many conversational AI companies? Yeah. No, it's it's a fair question. So when we were founded when we started back in 2016 2017 there were NLU frameworks on the market IBM Watson Google Dialogflow API to but they needed a lot of coding right in order to to really create use cases on top of them. They would just help you understand which intent the customer had, right? And we were one of the first to market that had like that low code interface on top so that you could model those conversations and integrate with the systems way easier. And that was back then. We also had a really strong and still have really strong proprietary NLU engine. That's how we differentiated. It's how we well became a leader leading vendor in that space with a very strong focus on the enterprise single sign on self-hosting all of that stuff right that not many could deliver. Now in this new era of egentic AI I think we've we've been very aggressive with adopting that. So the moment it came out, it was a bit of a wow moment for everyone in the space, right? It's like, oh wow, do we do we are we still relevant, right, with the platform? And we got the questions from analysts like",
        "start": 0.04,
        "duration": 327.7990000000001
    },
    {
        "text": "been very aggressive with adopting that. So the moment it came out, it was a bit of a wow moment for everyone in the space, right? It's like, oh wow, do we do we are we still relevant, right, with the platform? And we got the questions from analysts like was like, well, what's this whole opening? What's this going to do, right? And then of course we we figured it's like, okay, these LLMs are great. They're absolutely amazing. We use them. but there's more that you need on top of it. There's the workflow management, the orchestration, the contact center integration, all the digital channels, right? And that's what we do well. So what we did is we came up with a a framework around those LLMs that an agentic framework that helps larger organizations we've not lost enterprise focus adopt computational I and and use it for customer self-service and agent augmentation. Yeah. Now, , nice, , who is, , by all accounts the CCAS leader, if you like the MQ, Forester wave, whatever document, , they're always at the top right. , and, , they acquired you, right? And so, why do you think they what was the rationale for acquiring you now? I I think frankly that, , so contact centers have always had the challenge, right, that automation is getting increasingly more important. When we started with Cogni, it was a bit of a a nice to have, right? It was it was cool to do something with chat bots, right? Now, fast forward till now, it's absolutely essential, right? The Cass vendor with the strongest AI strategy. That's those are the guys that win. So, a lot of the Sass players out there or any contact center player, they've all been eyeing and looking at the core AIS, the cognis of the world, right? the IP soft to see okay is is this something we can build or do we do we buy it do we acquire it right that capability now I think that there has been a lot of consolidation taking you know that has taken place in in the past couple of years smaller vendors that were bought but I think that now is the time at least from a nice perspective where they really recognized and said okay we're probably not going to be able to build it ourselves as well as we we we need it right as well as we need to and I I guess that there's just a really great fit between nice and cocking. I think that they saw that right just not just a technology fit but also a cultural fit. Of course, there's a lot of conversations that are involved with a process like that where they probably said and concluded, hey, now is a good time to buy these guys because we need these capabilities. There's a good cultural fit. There's there's an amazing product fit. and and that must have",
        "start": 166.72,
        "duration": 602.68
    },
    {
        "text": "there's a lot of conversations that are involved with a process like that where they probably said and concluded, hey, now is a good time to buy these guys because we need these capabilities. There's a good cultural fit. There's there's an amazing product fit. and and that must have my perspective. Now, they could have just partnered with you. Yeah, but but they of course they did that already with with Amelia with Omeia, right? And I don't think they've been unsuccessful with that, but I do think they they recognized that they needed this these capabilities in house. Yeah. Yeah. And what what's exciting to me as an outside observer is that when you I one of the things you said was in the context who'sever's got the best AI strategy is going to win. I I don't think that's completely accurate. I don't want to put words in your mouth, but it's they all all the vendors have good AI strategies and for the most part you're all using the same models and so it comes down to who's got the best data and so now with you they get the conversational AI capabilities but they have spent inordinate amounts of time building out about as complete a C CX platform not see as there is which includes Yeah. Yeah. which includes you know quality management, workforce management, scheduling you know all of that stuff to so all that data now lives in one platform. Yeah. And now they can apply the cognitive AI. Yeah. Yeah. No, and I I agree with that. When I say AI strategy, it's it's the data, but it's also the orchestration, right? It's making use of those LLMs, right, that are that have become commodity. I think we can almost conclude, right? And and then utilizing the data you have. You need some sort of orchestration capability to do that effectively, right? It's not just the conversational routing. It's like complete self-service workflows where you don't just have one LLM call or one prompt. It's way more than that. All the the ecosystem, the CRM, CDC's, you know, the of course the the agent workspaces, the augmentation, everything needs to play together and come together in order for for those use cases to work in order for, you know, for companies to get value from from from all that technology. Now, since you're VP of AI transformation, I assume you talk to a lot of customers, work with a lot of customers. I do. can you give me an example of some customers that have deployed Cogni and the kinds of transformations and results that you've seen? Yeah, I I think one of one of our most notable customers is would be Lufansa Airlines, right? which I flew to get here, which you did and your flight did not get disrupted so you probably did not have to use the bot. Yeah, maybe maybe the way back.",
        "start": 306.16,
        "duration": 879.8800000000001
    },
    {
        "text": "Yeah, I I think one of one of our most notable customers is would be Lufansa Airlines, right? which I flew to get here, which you did and your flight did not get disrupted so you probably did not have to use the bot. Yeah, maybe maybe the way back. I mean they they started using they came from the bot framework for Microsoft right one of those you know it heavy companies that really want to build it themselves right and really famous for that yeah and but they needed more flexibility quicker time to market all of the you know caner defender pitch there but they switched to cogni and then one of the first things they did is provide guidance on where people could fly during covid right and then from that you knowformational type of interaction They went to a more transactional having the bot actually solve a problem in terms of my flight got disrupted. That's the biggest challenge of any airline irregular operations as they call it, right? And then having the ability to proactively inform a customer. So your flight will be delayed or you need to rebook your flight. You get a you get an email or a text message. You click on that. The ELISA assistant, the chatbot powered by Cocking G would tell you say, \"Hey Z, your your flight's been cancelled. Here are four alternative flights. You get a nice gallery all in the chatbot experience and you can then completely rebook your flight in in the chatbot. There's no linking to some other place or it's it's all integrated fully integrated with Amadeas all the flight booking systems and and that's like that's transformational right. It's an completely new way of of doing self-service and it's it's a frankly it's a better way it's a much more pleasant way to do it that way. And how have they measured the ROI of the product? Like what yeah that's a that's a great question. So of course there's the the typical KPIs will be containment right how many of the the chats in this case they also do voice now but how many of the chats did not have to be forwarded to a human agent right to the to the contact center so that's that's the big one right how much of the of the volume can the chatbot contain and you know what that and you know what that is how much of the volume I would not know for that it differs per use case right but but we're looking at like any anywhere between 40 and 60% like very significant that's a lot of yeah and that's not just look we have many customers that see that type that level of deflection. , and and it makes sense cuz many of our our customers have like their their typical customer service use case, the reason people call them, they're not",
        "start": 445.68,
        "duration": 1137.9590000000005
    },
    {
        "text": "that's a lot of yeah and that's not just look we have many customers that see that type that level of deflection. , and and it makes sense cuz many of our our customers have like their their typical customer service use case, the reason people call them, they're not give you an example. The most the reason people call Lufansa the states, so the voice line is to check their flight status. You're like, why? We have a website for that. You can download the app, but that is one of the top reasons that that people call in. Other customers like Adidas, right? they where's my order? Where's my order? It's a very simple. You could go to the website, you could log in, right? you get order status updates, but it's still one of the main questions that people have for self-service channels like like like chat bots. So, if you focus on those use cases, you get a lot of value with relatively straightforward use. As long as you provide the endto-end experience and not just not just an FAQ, not just that, oh, this is where you can find information. It might be this, might be that. you know you want to know what you're it doesn't just say to you go to the website and check your status correct yeah exactly yeah now you you've got an interesting role because you are helping companies transform and what you talked about and I think this is the lowhanging fruit for conversation lie is those high frequency low complexity problems correct whereas my order you know with flight status things like that how far are we along and being able to let a gentic agents actually do things that are a little bit more complex yeah that's that's a great question and and I'm spending a lot of time thinking about it talking about that you know with customers we got to be close. It's I mean there's the technical you know feasibility and that's we're definitely close but organizations don't necessarily work that way. Yes. You need to you need to be willing as an organization to to expose data in certain ways to to give these agents a lot of autonomy and most organizations are not willing to do that. not yet at least right the mo so it's it's as simple as getting access to to data to an API you need to go through it there's architecture ports right you need to you need to fill out security questions all that basic stuff and then you you have a you need to have a use case and then it goes and says architecture folks they go like so how are you going to use the data what frequency what's it for is it going you know is is there PII data and like are you going to merge it with other data right and that's just a basic API",
        "start": 575.76,
        "duration": 1383.7210000000007
    },
    {
        "text": "goes and says architecture folks they go like so how are you going to use the data what frequency what's it for is it going you know is is there PII data and like are you going to merge it with other data right and that's just a basic API whole egentic thing like properly with w with with with autonomy where these agents can actually decide themselves how to solve a problem because that's the promise right that they have that they have the ability to figure something out themselves it's not prescribed that requires a huge like leap of faith you know from an organizational point of view from a from a data you know safety security point of view that I don't think a lot of or a lot of organizations are not yet there in terms of maturity. Yeah. Yeah. So even and even if it could dice I'm curious as to you know how you think this manifests itself where you know ultimately if you are going to do more complex use cases then it's not just going to be you you're likely going to have to talk to agents that are running on other systems and now we've got you know MCP we got 808 things like that. Yeah. Are those going to work? Like when I when I think about interoperability in the communications industry, you know, I can't get, you know, teams to send messages to Slack. Yeah. Right. But yet I'm supposed to believe that ADA and MCP are going to allow our agents to talk to each other. Like is this like does the industry when you talk to your peers? Yeah. Is there a realization that this is really going to be a problem if we don't fix it sooner than later? Yeah, absolutely. , so we we like to be very and I personally like to be very hands-on with technology, right? there's a ton of people that could tell you, you know, about LLMs and and then there's people that actually try them out, right? And and and and get hands on with them. And that's what we do with MCP. We do that with A2A as well. The moment you do that, you start to notice that like MCP for example, it's not quite there yet. Like authentication has not been really properly solved. Well, that's a big problem. That's a big problem. So, so to your point, like yes, this is going to be transformative. like these things are they have huge potential because we we go from a from from a you know having an API with a very specific specification to a a mechanism where agents can discover capabilities right and they can learn through natural language how to use those capabilities and that's huge that's going to be transformative but at the same time the the technology and the organizations themselves right but technology in this case as well is not",
        "start": 701.68,
        "duration": 1646.6000000000001
    },
    {
        "text": "a mechanism where agents can discover capabilities right and they can learn through natural language how to use those capabilities and that's huge that's going to be transformative but at the same time the the technology and the organizations themselves right but technology in this case as well is not sure You could have an MCP server from Figma and then you could you know you know you could you could get the capabilities and do something but doing that high volume with lots of data sources in the customer service customer experience space that's a that's another that's another next level that's not that's not there yet. Yeah. Yeah. And we're probably a few years away from that. Oh yeah. At least. Yeah. Yeah. And and so when you think about the future of contact centers, when when you talk to your customers, you what are they looking for to do? Is it like what percentage of interactions do they think they can actually handle that way? because I know there's a lot of stuff agents do, frankly, they don't really like doing the password resets, things like that. No one likes those calls, right? No. No. Exactly. Yeah. Yeah. It's I I think it really depends on the industry, right? Right. So there's different industries like some are very reluctant to you know go forward self-service go for automation even agent augmentation right we were talking about that before I you know I think that everyone's starting to realize that they have to or maybe they just they just don't know though. Yeah. Yeah. Exactly. And so so there's there's there's education involved there as well. But I think that everyone sees the potential of AI. I mean it's it's out there everywhere right? So from like a you know top down seuite everyone is you know is experiencing pressure to do something with AI to get something out of that right customer service marketing sales right those are the low hanging those are the low hanging fruits in terms of areas where generative AI has a lot of impact right yes coding as well but manufacturing for example is more is more difficult to to apply to so customer service customer experience using generative AI in those domains and those business functions. Yes, that's a no-brainer for pretty much every organization right now, but you still need to have like the the like ownership within a company. You need someone a team that really embraces that, right? And that is a a that's a mindset thing as well. If you're used to staffing thousands of agents, right? and and everything revolves around, you know, human workforce management and and doing all of that or or you think your customers expect human service, you need to be willing to kind of step out of the out of the comfort zone and try stuff out and see how your customers react to that. So, you need to gain experience",
        "start": 835.36,
        "duration": 1929.3980000000004
    },
    {
        "text": "and and doing all of that or or you think your customers expect human service, you need to be willing to kind of step out of the out of the comfort zone and try stuff out and see how your customers react to that. So, you need to gain experience do for your organization. Yeah, you know, you bring up an interesting point too and I'm glad you brought up the fact that you know, it's an organizational mindset change and I think we were talking about this earlier that when you think about CCAs historically it has been sold to this very well-defined group right the contact center manager but more and more what I'm seeing and I think you know you even echoed this you talked to me initially a lot of your deals went through IT now it's going through chief digital officers you know for the people watching this that are working in contact centers I think this becomes this transformation the contact center moves out of the contact center that that decision% and and I think that has a really interesting impact on this industry which historically sold to a very very narrow audience of buyers and I think for nice you can actually bring that discipline in to enable them to talk to a group of customers they've never actually ever talked to. Yeah. Yeah. We we like to think so. There's definitely you know at NICE right now it's it's been very it's been a very warm welcome for for cogni as an organization right great cultural fit as you mentioned before and I mean this we we spent a week here together right in larger group and and we are as new as as everyone else you know joining here matter of fact you have you know you know most of the nice people before I did right so you hopefully experience that there is a genuine connection between the people here like we like hanging out together I I I think yeah to your point we have a certain view on what automation can do and and how to position it. Do you put it in front of a contact center for example right? Whereas historically a Cass provider would see that differently, right? They would maybe want to sit in front and say like, \"Hey, if a human agent or certain use cases maybe we hand it over hand off to a bot, you know, powered by Cocking G.\" Those types of things of course are now like changing for nice as well. Now that we are part of nice, right? And it means that nice as an organization, we can be way more we can be way more progressive in terms of applying AI, right? We can actually go AI first. because it's all one one platform. Yeah. Right. It's one approach and I think it does need to be AI first.",
        "start": 981.199,
        "duration": 2201.3189999999986
    },
    {
        "text": "means that nice as an organization, we can be way more we can be way more progressive in terms of applying AI, right? We can actually go AI first. because it's all one one platform. Yeah. Right. It's one approach and I think it does need to be AI first. reminds me a lot of when I was early in my career, the internet was kind of coming into its own. And I remember I was working in this financial firm and the CEO and head of sales came to me and they said, \"We need to be on the internet.\" And I said, \"Well, what does that mean?\" Like like and we don't know, right? But just and I said, \"No, we need to be on.\" I I said, \"Do you want to put statements online? Do you want people to trade online? No, we don't want to do that. It's like, well, tell me what you want to do. And the problem was that there was so much you could do. Nobody really knew what to do. Right. And and I think the same thing's here. Oh, yeah. And so for people watching this, if they're working in customer experience, what's your recommendation on how to get started with this? Because they're certainly not going to boil the ocean and have a fully automated context tomorrow, right? No. so the good news is that with you know through agentic AI generative AI you can get started quite you know you can start you can start with an automated experience in in a matter of weeks to months right it's not a 6 month to 9 month project anymore you can go way quicker than that if you do it well actually you can do in days your interface yeah yeah we I mean we saw a demo today right it's minutes even but you want to polish it you don't want to release it you know so so let's say you know at least in at least a month so to get something production ready but that's That's enough for a first use case, right? And then and then I I think it's really a matter of what I meant before is like just trying it out like just release it, monitor it, right? Like stay on top of it, but see how your how your customers react to it. And I think that a lot like the key to a lot of use cases is setting the expectation and then offering an escalation to a human agent, right? If you force self-service on people, right? That's that's not a great experience. But if you go and say like, \"Hey, there's thanks for calling in. There's, you know, there's a you know, you're you're 12th in line right now. Would you like to try our self-service experience?\" Right? And skip the line. You might go like, \"Yeah, that's fine.\" And if you can, you know, keep your your",
        "start": 1118.64,
        "duration": 2437.8799999999983
    },
    {
        "text": "like, \"Hey, there's thanks for calling in. There's, you know, there's a you know, you're you're 12th in line right now. Would you like to try our self-service experience?\" Right? And skip the line. You might go like, \"Yeah, that's fine.\" And if you can, you know, keep your your There's only a potential upside, then you might be willing to try it out, right? And if and if you know that if it doesn't work, if the the bot or AI agent cannot help you to get connected to a human, then you're like, \"Sure, why not?\" Right? you you need something. So, you might, you know, you play along. You're not there to, you know, try to break it. So, you're like, \"Okay, I just need to have a copy of my invoice. Oh, this actually works pretty well. Oh, it actually got my invoice number. It's different two or three years ago, right? Like, it works well enough. It's quick.\" You go, \"Hey, this is actually pretty cool. It actually might work better than a person in a lot of cases in in some cases. Yeah. And and that's only going to get better, right?\" And I think this that's what everyone agrees on is if you try the latest voicetovoice models from ChatGpt, for example, right? Maybe not necessarily enterprise ready. maybe discussion about it, but that's where things are headed. It's going to sound incredibly natural. It's going to be incredibly accurate and it to in many ways to your point like better than the average human at some point. Yeah. yes, I I think I think that's case. So start small is what you're saying. Start start small but start like like do something. Don't don't try to boil your don't try to over strategize it. Just try it out. In fact, I asked the customer person who runs customer experience, one of the big hotel chains, how to get started and she said start. Yeah. Right. If you're sitting around waiting, it's not going to happen. Yeah. So, you know, last question just when we look into next year. Yeah. besides integrating with nice, what's on the road map for you guys? As best as you can talk about, I don't want you to get in trouble. So, okay. So, a lot of what you saw today, the automated insights. So, so, so you know, just recapping for the audience. becoming more data driven, right? The the most amazing thing one of the most amazing things about nice platform like like CX1 right is that so nice has a lot of data points and so many data points chats digital interactions right it all runs through the platform already so acting on that data and and generating an automation automating the automations as as Scott called it right that's going to be a big thing that's one of the things that we are actively working on you saw a demo today right",
        "start": 1239.2,
        "duration": 2676.119999999998
    },
    {
        "text": "it all runs through the platform already so acting on that data and and generating an automation automating the automations as as Scott called it right that's going to be a big thing that's one of the things that we are actively working on you saw a demo today right GA yet but but that's things are headed. That's going to be a big one. So, datadriven automations, very quick time to market, the focus on the right use cases, understanding what to automate in the first place based on the data, that's going to be huge. And I think the other thing is I think we're going to go more and more into the back office. where right now yes we can we can help you self-service you know we can route you to an agent we can do amazing agent augmentation we can collect all of the data we can create a ticket in a backend system but I think that there's going to be a lot of use cases where we can do more you know in terms of workflow automation in the back end asynchronously so after after you hung up after the call's over stuff still needs to happen right maybe we can trigger a workflow maybe we can interact with multiple systems like service now Salesforce big guy you know, I think we're going to do a lot more in in that space. That's my prediction. Yeah. And actually, and that's interesting, too, cuz now you're helping the contact center administrator, you know, chief digital officer, things like that where typically we've looked at agendic AI is a customerf facing thing, but there is a big back back office component. Oh yeah. And I think that's where things are that's where a lot of the value is going to be created, right? is, you know, being able to offer amazing experiences, self-service, and that's that's going to be that's been that's become a lot more accessible with LLMs, right? I think it's it's there's going to be a lot more focus on actually solving those problems end to end, including the the backend workflows, the automations asynchronously, humans in the loop where required, multiple AI agents, you you know what you pointed out. I think that's going to be huge. All right. Thanks. well, it was a fascinating conversation. , you know, I want to check in with you maybe six months from now. See if 2026 is really going to be the year of Agentic AI. It's certainly coming though. It is for sure. So, , anything else you want to add? No. Well, thanks for having me. Thanks for being great conversation. Yeah. Thank you. Thanks. And so, Agenda AI is coming. Nice and cognus one equals five. Maybe 5,000. 5,000. Okay. Yeah. And just get started. Just try it out. And get started. That's good advice. So, on behalf of ice wanders from Cogni,",
        "start": 1360.24,
        "duration": 2938.6779999999985
    },
    {
        "text": "having me. Thanks for being great conversation. Yeah. Thank you. Thanks. And so, Agenda AI is coming. Nice and cognus one equals five. Maybe 5,000. 5,000. Okay. Yeah. And just get started. Just try it out. And get started. That's good advice. So, on behalf of ice wanders from Cogni, Research. Thanks for watching. why don't you give us a like and also hit that subscribe button. I'll see you next time on our next episode of Zcast. [Music]",
        "start": 1494.159,
        "duration": 2963.3779999999983
    }
]