[
    {
        "text": " Welcome to Zass everyone. I'm Zas Carval from ZK Research and I'm here at Cisco House prominent 87 in Davos at the World Economic Forum. I'm with Fran Kasudus, the chief people purpose policy officer at Cisco. Fran, how you been? Good. How about you? Yeah, it's been a while since we caught up. we tend to see each other at events like Global Citizen, you know, event like this. , but this isn't just like another event for Cisco. I feel like it's really deeply tied to Cisco's mission of power and inclusive future. And so Cisco has been a fixture of W now for 26 years. I think 29 years. Yeah. Yeah. Something like that. And so from your perspective, why is it important to have a table at this event specifically? Well, if you think about what you see here in Davos, it's a really amazing intersection of the private sector, of government, of nonprofits, all in service of how we address some of the biggest issues in the world. And I have found that the focus on people in particular over the last five to six years has really been amplified. And so for Cisco, these conversations are incredibly important to us. Yeah. Yeah. And it's it I think people look at Cisco as a as a trusted provider of critical infrastructure and so you're using governments and large enterprises all over the world. Now, one of the things I've noticed about the show, I've been following it for a long time, although it's my first Davos. And full disclosure, , it's changed a lot, right? In the in the 2010s, we talked a lot about the mechanics globalization. Then we had the fourth industrial revolution. Few years ago, sustainability was a big theme, although it seems to be an underlying theme here. , but now we've clearly entered the AI era. There's not a session around where that doesn't come up, right? So true. And so looking at the agenda this week, what are the primary challenges you think that West want to address when it comes to AI? Yeah. So I would say this year what stands out is unlike previous years where the conversation was it's coming, it's so much more tangible now. And I think some of the biggest challenges that we've been talking about is the intersection of AI and the workforce. earlier there was so many assumptions that AI would come in and people would be significantly impacted and I think now what you see is a bit more nuance. I think there's an understanding that there's an evolution of work and and in some cases it's more dramatic but in many cases we're going to see that evolution and so what that drives to is conversations around how do we prepare our people? How do we ensure that they have the skilling that they need? How do we ensure that AI is safe, secure, that",
        "start": 5.279,
        "duration": 314.8010000000001
    },
    {
        "text": "it's more dramatic but in many cases we're going to see that evolution and so what that drives to is conversations around how do we prepare our people? How do we ensure that they have the skilling that they need? How do we ensure that AI is safe, secure, that are in place as well? Yeah. In fact, you brought up the workforce and this whole concept of the AI ready workforce is something that I don't think was discussed at last year's W. but now it's really more about making sure the people are comfortable with it. And I in my conversations with delegates here, it's pretty clear. I think there's a belief now that AI is going to create more jobs than it takes. However, how we get the current workforce to have the skills that are needed in a point where we're really not sure what the endgame is, right? And so when you think about that from a corporate perspective even inside of Cisco, how do you evaluate whether you have the right skills or and if they don't what those skills should be? Yeah, it's so funny because this is a conversation that I was so excited to have here and to learn from peers. I think from a Cisco perspective, what we've realized as bodies of work like the ICT consortium have been so meaningful for us because together with eight or nine peers together we're studying jobs and understanding the change. I think research at this moment is incredibly important. you said this in your question, there's an element of sequencing and timing and there may be points where things move very quickly and we have to be ready and what that means is really understanding the skills that are most important. ensuring that we start to create this bite-size training for our organization and then recognizing where they are today and what they need. I I think the last part of the two years has been all around readiness of talent and getting them to a place where they understand that the future's going to look a lot differently. Yeah. So, you know, a big part of Davos here, too, is the, you know, the Congress and obviously the Pamadan, but it's those hallway discussions that you have. Yes, you're so right. And I'm curious through the ones you've had and the goals you had coming here, have there been any like aha moments, you know, from those discussions? So yesterday I had a panel and I was between two professors, one from Stanford and one from MIT and sometimes in these conversations I think it's just really amazing to sit and listen to some of what they're learning. And so the Stanford professor shared that at the end of every year he takes his top like 10 students out for lunch. And what he realized this year was that all but two are using AI and that",
        "start": 162.64,
        "duration": 602.9620000000002
    },
    {
        "text": "amazing to sit and listen to some of what they're learning. And so the Stanford professor shared that at the end of every year he takes his top like 10 students out for lunch. And what he realized this year was that all but two are using AI and that the best practices just haven't been shared. And it was just an aha that whether we're talking about education or whether we're talking about universities, we have to create these systems to learn from those that are leading. , and that was just a powerful and tangible takeaway. , something that I've been thinking a lot about is our language. When we talk about AI, I think we've done so much to humanize AI and I don't think that serves us well. Yeah. Probably not. Yeah. and and I think it's important for us to really understand the capabilities and so whether we're talking about simulation or whether we're talking about processing power analytics to stop that so that we recognize the role that we have as humans to shape where we go. Yeah. Now you brought up leadership right as as part of that or it's implied anyways and prior to Davos I actually reposted this on LinkedIn you wrote a post talking about how AI success is a leadership issue right and it was very similar to the article that I wrote on cio.com same theme anyways and I'm curious why do you think this is the right time to change the AI discussion away from GPUs and LLMs and infrastructure to management and leadership well I think the obvious answer to that is we see all of the technology capabilities and and they're changing week over week, but adoption isn't where we thought it would be. , and if you just look at the AI readiness index, we've been stuck at 13%. So only 13% of companies feel like they're getting value from a AI perspective. Shocking, right? It is shocking. But as I talk to people in the hallways, that's what I hear. And so there's a belief that it'll come. And so to me, what's missing is really that the people side of this. And what we have found at Cisco is that when leaders use AI, their teams are twice they use it two times as much as they did beforehand. And so leaders are such a big part of the equation. And it's not just the adoption, but I think there's a role for leaders to ensure that the team stays cohesive, that there's trust, that they have collaboration. And some of our early data from a Cisco perspective shows that some of our super users, their trust in team has gone down and so that shows that we have a huge opportunity. Yeah, it is. Yeah. And so let me get that data point right. So when a leader uses AI, the usage of it in the team is twice as much.",
        "start": 308.24,
        "duration": 905.9210000000006
    },
    {
        "text": "our super users, their trust in team has gone down and so that shows that we have a huge opportunity. Yeah, it is. Yeah. And so let me get that data point right. So when a leader uses AI, the usage of it in the team is twice as much. That's that's unbelievable. You said it way better than I did. Yeah, thank you. No, I mean it just shows the the leading by example on point. Now, I think one of the things Cisco's always done a great job at is using themselves as a poster child for new technology. In fact, all the way back to the early days of the internet, Cisco is teaching companies how to leverage the internet. And so, I know internally at Cisco there's been a big, you know, get on the AI train movement at Cisco, right? And I'm curious as you've done that, what's worked? what are some of the lessons learned and more importantly what hasn't worked. So I'll tell you the funniest thing that hasn't worked because I think this is how Cisco and so many other companies have approached this. So what we have found is that when we have mandatory AI training not only are the learnings not sustainable and leveraged it actually has a negative impact on usage. Now what does that mean? what has worked at Cisco is that when we give people choice and some flexibility around how they leverage AI, we've seen tremendous impact. And so as an example in G2's engineering organization, he has made multiple AI tools available to the team. This is something that they greatly appreciate. I think it creates that environment of exploration and allows them to bring their own preference to the table. My hunch is that there will be some point that he standardizes but at this moment giving teams choice is really powerful. The other thing that we have seen work is just having fun. And so we had this virtual game of clue. Do you remember clue when we were young? Okay. where Mrs. Kudus did it in the conservatory. Yeah. Yeah. Thanks for saying I did it. You know, hit the wrench. but what we did was we had to use large data u models to figure out who did it and it was great and we had a thousand people playing and so what you'll see is probably do a pretty good job of that actually. Yeah. You know we will have fun. We will give people choice. We'll make sure that we are as transparent as we can be. We do this through some of the skill stories where we show hey this is what a cyber analyst did in 23. here's what they're doing in 25 so that we can just help our people understand where things are going. Fascinating data point there though is that people are using it, they're getting benefits,",
        "start": 462.24,
        "duration": 1201.681000000001
    },
    {
        "text": "of the skill stories where we show hey this is what a cyber analyst did in 23. here's what they're doing in 25 so that we can just help our people understand where things are going. Fascinating data point there though is that people are using it, they're getting benefits, they don't want to use it. That's right. That's counterintuitive to what I would have thought. I don't think so. That's so human. That's so human. Right. But so it just shows us that we have to meet our people in different ways. Yeah. And so have you been able to to quantify the benefits across many of the groups? Obviously for some job functions like a developer you can see lines of code written before and after but for some of the softer jobs. Yes and no. So I'll give you some of the greatest examples. So in our customer experience organization we can see that as a result of what they've been doing from an AI perspective they're able to touch more customers because they took on a productivity increase. I think on average our renewal team got back 5 hours per week. And so what Liz did was she said, \"Okay, great. Let's broaden the number of customers that you go to.\" I think that's been a great example for us. The fact that in CX we're also managing about a million cases via AI is another proof point. It allows people to go to level two, which I think is important within the engineering space. is what we see and we're looking at this week over week. We see a huge increase from a usage perspective and now our key focus is understanding the quality element of it and so that comes next for us. Yeah. And is it your I know you haven't looked at it yet but is your gut sense the quality is is it better not quite as good around the same? Do you have any feel for that? Yeah, my sense is we probably have a bit of everything. , so we have examples where it's been significant, examples where it hasn't worked, and examples where it's neutral, which means we have to figure out what we should be doing differently. , and I think that, , that'll be the case for quite some time for us. Yeah. I think, , in a lot of ways, you might have the hardest job at Cisco trying to reorganize all the culture and people. And so when you think of the people side of this, Yeah. , again, you're working to a point in time that's unknown to a to jobs that are unknown. And how are you thinking about the cultural aspect this Cisco's got a really strong culture we do and I think if I ask you today what makes an employee successful at Cisco you could tell me but in the future post AI what does that look like",
        "start": 609.839,
        "duration": 1473.6010000000003
    },
    {
        "text": "are unknown. And how are you thinking about the cultural aspect this Cisco's got a really strong culture we do and I think if I ask you today what makes an employee successful at Cisco you could tell me but in the future post AI what does that look like I think that's going to be one of the most important things that we do I think we're all going to have to realize that the changes that have been so natural like our roles have always changed but some of that change may happen a little faster and So, in one of the conversations I was having yesterday with some university presidents, perhaps we do people a disservice to prepare them for a role. We probably need to start to prepare them for skills, which means that as things shift, they're just going to feel a little bit more comfortable. There's a significant level of fear right now with college graduates, which is fascinating about what work is going to look like. And from a broader Cisco perspective, I think we just need to keep focused on what's best for our customers. that has always inspired us. the fact that we want to drive growth in everything that we do and the fact that we're going to bring transparency and try to focus on building best careers for people. Yeah. I know u in our conversations the past too a real hot button for you has been making sure your leaders are also good managers because you know how people get promoted to organizations. You're the best salesperson, you become the sales leader, right? But maybe they're not a great leader of people. So I'm not saying that's the case at Cisco, but when you think about the impact, so we talk about the impact that AI can have on employees, what about for the leadership group, how are you thinking about what their skills need to be? Even some of the softer skills that maybe aren't measurable, but then more importantly, the types of data that they can collect today to be able to you know, when they do the reviews or maybe you do reviews more often, but just describe what the leadership structure needs to look like. Yeah, it's funny. We just rolled out some new leadership expectations and I'll just share a couple of them with you. So the first is our expectations of leaders are that they leverage AI. They're driving change all in service of reinventing ourselves. And so that that's part of your accountability as a Cisco leader. the other one that we've called out is you're a coach and we want you to be a coach. And so what that means is maybe you are going to use some of the data that we have now a little differently and you're going to be able to have those conversations whether it's about quality whether it's",
        "start": 747.76,
        "duration": 1731.3599999999992
    },
    {
        "text": "you're a coach and we want you to be a coach. And so what that means is maybe you are going to use some of the data that we have now a little differently and you're going to be able to have those conversations whether it's about quality whether it's that leaders are going to have to get so much closer to the works because their ability to understand where their teams spend their time and to understand some of the potential automation that is available and to really push their teams in that direction I think that's going to be a big part of the work as well. Yeah, I was talking to one delegate here and within their organization, they're trying to make the review process ongoing instead of like once a year would stresses everybody out. If you've got the data, you know, why not do it more often? Right. That's exactly right. And I'll tell you something else that we're finding at the moment which I think is really fascinating for us is that when we started doing talent reviews focused on AI efficiency, it's putting a spotlight on different people and some of those people are lower in the organization and some of those people don't have the the big titles but what we find is that they are not only learning but they're teaching their peers. And at this moment that is so valuable for us. And so the other thing that leaders have to understand is who on their teams and it may not be some of the typical stars will be leaders in this AI era and we have to pay attention to that and then help them continue to grow as well. Yeah, that's that's fascinating. So you know last question for you. This this event is filled with maybe the most diverse set of individuals. We have country leaders, technology leaders, business leaders and even a lot of activists here. So for that audience that is trying to figure out their AI strategy I think based on your role as people policy and purpose which is unique in the industry what's one piece of advice you'd give a leader who's struggling to get their organization down this AI journey focus on your workflow focus on value don't pay attention to what everyone else is doing because what you have to ensure is that you use AI to make your company better. the other thing that I would say is it's a journey with our employees. I remember when we first started talking about AI four years ago, it scared our people and 87% of our employees feel like AI is helping them to be better. Like there's a journey there, but the journey starts with talking to your people. Yeah. I guess you know through companies I've worked for, communications makes a big difference, right? Really in any relationship whether it's personal or professional.",
        "start": 877.92,
        "duration": 2025.9219999999998
    },
    {
        "text": "our employees feel like AI is helping them to be better. Like there's a journey there, but the journey starts with talking to your people. Yeah. I guess you know through companies I've worked for, communications makes a big difference, right? Really in any relationship whether it's personal or professional. okay saying, \"Hey, I don't know. Like, I'm not sure exactly where this is going to go, but we we need to start taking a few steps in in how we leverage the technology.\" Yeah. All right, Fran. I know how busy you are at this event and I really appreciate the time you taken to sit down with me. So, on behalf of Anything else you want to add? Okay, that was good. So, on behalf of Fan Katsudas from Cisco, I'm Zas Caraval from ZK Research and thanks for watching. , don't forget to hit that subscribe button and I'll see you next time on my next episode of ZCast.",
        "start": 1027.52,
        "duration": 2086.0019999999995
    }
]