[
    {
        "text": " , welcome to Zcast everyone. I'm Z Cargal from ZK Research and I'm here inside the expo hall at AWS reinvent 2025. I'm at the Equitex stand. I'm with Greg Adgate. Greg it's been a while since we caught up. It has been. Yeah. I'm I appreciate being here. Yeah. No, it's it's great. And and what's your role at Equinex? I'm the vice president of our partner programs. So I work with our biggest alliances. I work with like that was artist. Yeah. Yeah. All right. And so it was a really interesting reinvent I thought. So you know I come to these reinvents often. I've been like I don't know 15 of them and often I find that Amazon AWS just throws out a bunch of random product announcements. This year the theme was very clear. It was we're moving into in fact Matt Gorman hammered the swing during his keynote right. We're moving into a world where we're going to have billions of agents all working together to change the way we work and we live. So that's fine. Amazon's AWS providing a lot of tooling underneath to do that. What you didn't really get to though, first of all, I want to get your thoughts on that and then the implications to the network and some of the underlying infrastructure to enable that. Yeah, I think what's coming and actually what's here now is incredibly powerful part for individuals and for organizations and AWS is building not just the tools and the experience but the underlying infrastructure to make it real. One of the things that I mean it's here, right? It's here. It's and it's rapidly evolving and like like you I've been to many reinvents and the pace of innovation has always been a theme and I'm always blown away every time they come out with new stuff and I literally wait for it cuz they they are so bad and and this year's no different. , as we talk about that army of agents scattered across the planet doing work in all different industries, you have them behind, what I think of is how do you connect them? What's the experience to be able to have that agent spin up resources in a distant place? And what we've been working on is networking solutions around that with our fabric offer to be able to move at the pace of these agents and speak the language of the agents and work with our community of network providers that are in our data centers to make sure they do so as well. Yeah. And I think it's interesting you use the word fabric because essentially that's what the network needs to be, right? If we're going to have because we're not going to be able to have all our agents where our data is all the time. As you mentioned, some agents are going to have to pull data",
        "start": 5.2,
        "duration": 323.521
    },
    {
        "text": "use the word fabric because essentially that's what the network needs to be, right? If we're going to have because we're not going to be able to have all our agents where our data is all the time. As you mentioned, some agents are going to have to pull data city, across the world. And the way we deployed networks historically has been, you know, very peaceful, right, at this part of the and it now we just have one network. Yeah. it it needs to be one network and feel like one network and adding AI to steal your phrase adding AI to the network actually makes that possible and then making sure the underlying investments in the scale of network so that you can deliver AI through the network for the AI that blend is what we are really focusing on to differentiate the amazing data centers we build but it's the connectivity between them and the connectivity between the agents and the destinations that's really going to unlock speed and value. Yeah. At over the summer I caught up with DD Gupta from Equinex and we talked a lot about this concept of distributed AI and you just had the launch there and so talk about what that is and how the fabric relates to that. at distributed AI is really the role that Equinex plays in bringing together the ecosystem of customers, partners, networks, clouds, digital platforms, and the fact that they're all over the place. And so, as you said, you may be using large language model in one part of the world and you want to take information from that model, use the network and have it do imprints in another location. And that glue that stitches it all together is is a network. So fabric is a tool to enable distributed AI. But our ecosystem of digital platforms, customers, and the data itself is is really our role in making distributed AI. Yeah. And then when you think about this world, right, we have to have the agents be able to talk to each other. We got to be able to secure them. So talk about those challenges and how you help with that. Yeah, we have an amazing networking team that is working with leaders in the industry to roll out features and test features from performance perspective, security perspective, a visualization perspective. So a lot of networking in the past, you might get dashboards on throughput and performance. You know, back in our old networking days, now we're seeing like this agent use this route for that application. the the actual visualization tool set that we provide as part of the operator is baked in and so it's a combination of agility flexibility visualization to make it real and to operate at cloud speed at AI speed and I think what's not really known yet is once we start doing all this inferencing across our",
        "start": 166.48,
        "duration": 660.7199999999998
    },
    {
        "text": "we provide as part of the operator is baked in and so it's a combination of agility flexibility visualization to make it real and to operate at cloud speed at AI speed and I think what's not really known yet is once we start doing all this inferencing across our that's going to have on bandwidth right like I've seen models where you know you think of a typical network you're using no bandwidth it's very spiky it just can be panned out right yeah so very good point and if you think about the edge that the good friendly colleague of mine describes the edge as whatever is most important to you the end user could be your pacemaker it could be your car the edge is different to all of us well data is coming from all of that and AI is going to be connected to all variations and themes of edge and and that that by definition is distributable. Yeah. So, , when you talk about infrance, you're right, you don't know. Today, large language models are hosted in specific locations, but then you start parsing data off of those models, it's going to be, well, you don't know where those patterns are going to be. And that's why you need to have the visualization to track and see and have it the intelligent network that can adapt to it as it happens. Cuz in the first request, it may look one way, the second inference request may be a completely different way. And the network has to be intelligent enough to adapt to the differences. And so how does it do that? How does the Equinex how do you build that intelligence in? Well, so the AI for the networking is thinking about well for the request to the destination applying intelligence and controls for the route. So think about in the old days of class of service headers and the NLS days. This is that on steroids where that act that request comes and the network knows which path to take or potentially to reroute during congestion. So you're insulating the network with intelligence to ensure that the performance meets the expectation. then underlying it it's understanding well that route needs more bandwidth. We need to add capacity to this specific and you can do that all dynamically now. all down here on the gas lab and it's with the data sets that AI is bringing us the size of amount of information that's moving cross country cross borders sometimes in the same city as you you need to have the ability to make the adjustments to that underlying bandmap on the fly yeah and what about the security side because that's you know there's there's a lot of data flying around in fact I think when I the customers I talked to that's the part that really scares them the most is is u there's so much",
        "start": 337.84,
        "duration": 978.1599999999995
    },
    {
        "text": "underlying bandmap on the fly yeah and what about the security side because that's you know there's there's a lot of data flying around in fact I think when I the customers I talked to that's the part that really scares them the most is is u there's so much hard track and it's hard to ensure that it's always secure and so I've seen companies pull back on their AI initiatives until they can figure that out and I historically when you think about security we've always deployed it as an overlay and I think now this has got to be some yeah it's got to be right it's in bet yeah it that's also part of it's part of the controls AI for networking But it's also part of the visualization real time visualization as it's happening and yeah it has to be embedded it's moving too fast and as things are being dynamically decided it has to be that way. Yeah. And and it is. Yeah. And and so let me let me ask you. So when you think historically about these pillars of observability, security, networking, they've always been separate things. In fact, you go walk around the show floor. I'm looking observability, observability, right? The security companies over there. Can you still deploy these things in separate silos? They do. Well, they are deployed. Should you deploy them? I think that's the journey we're on. and that's why our fabric offering has APIs available for those who are at that stage of maturity. We'll also have MCP available for those who are using agents to to provision and are are further along in the journey. and I think we'll be there for a little bit. you know, it's really up to the how networking teams and IT teams are designed and and like you said, their comfort with the fact that that task that they just assigned to an agent does really work and it's like, wow, that freed up a lot of extra time for me to do this other stuff. Yeah. And and the more adoption happens, , those controls have to be there and the the auditability has to be there. And so for the AWS customers that are here, how can you help them with that journey particularly if they are a all in on AWS? Well, AWS is going to help them primarily because they have a robust set of options and choice is where we play with AWS is they deploy direct connect which is their service for private networking in our a number of our data centers and you go to their web page and figure that out. go to our web page and figure that out. And and so it's deciding when to use private networking on which applications and who to connect to. And again, Equinex is an ecosystem of network providers, cloud on-ramps, digital platforms, a kind of",
        "start": 498.879,
        "duration": 1279.9990000000003
    },
    {
        "text": "their web page and figure that out. go to our web page and figure that out. And and so it's deciding when to use private networking on which applications and who to connect to. And again, Equinex is an ecosystem of network providers, cloud on-ramps, digital platforms, a kind of all comes together. So we can help AWS clients with being able to connect and move data more efficiently from point A to point B. You know, it was interesting listening to Matt Garmin, the CEO of AWS's keynote cuz he talked a lot more about hybrid multicloud in this keynote and I probably heard him any AWS CEO ever, right? So in fact in the analyst Q&A somebody asked him about that and he said it was a fair criticism that 5 years ago they weren't really on board with hybrid multicloud. now because customer demand they are and so I think the work you do with them now really becomes critical helping customers all that because last thing is no one's going to it be very difficult to deploy AI having everything in one all your data in one location right you're you talk about edge people want to run AI at the edge where the data is not by not trying to pull the data to AI pieces of the data that run at the edge will then be shared so in your vehicles there's computers in the car that are doing the road decision making. But then an example, you don't want to send the data to the cloud to determine whether to stop. No way. Yeah. I would never do that. it's also in other industries, you know, there's the intelligence on in in a variety of industries. Well, I think healthcare if the robots doing surgery, make the decision at the robot. own, you know. Yeah. Yeah. there's there's public sector uses as well for for AI on on devices. Okay. yeah. So it's it's going to be a mix. It's a the edge itself will retain and run AI and then we'll connect back to controls that it speaks to for further learning and education and it becomes even more intelligent as more data flows through. All right. Pretty amazing. Yeah. Now, as customers go down this path, I'm finding more and more there's less do-it-yourselfers, right? It's just it's too it's too complicated. And in fact, I ran a survey at the beginning of the year and I asked like just the role of the network in AI and 97% of things said it was more important. The network was critically important, but they also said it's more complicated, right? And so talk about the role of partners in trying to bring an ecosystem approach to AI. well, you're speaking my love language. Yeah. Yeah. I I run the partner program for us globally and we we see every day supporting our sellers and the customers",
        "start": 652.24,
        "duration": 1588.6390000000006
    },
    {
        "text": "it's more complicated, right? And so talk about the role of partners in trying to bring an ecosystem approach to AI. well, you're speaking my love language. Yeah. Yeah. I I run the partner program for us globally and we we see every day supporting our sellers and the customers things that that they might not have. They might not have skills in a particular area. They go to a company and pick up those skills. they might not have the financing their capital, so they go to a partner and a partner brings capital to it. They they might want in investment and innovation. Partners bring that to it. And so to to us we we're neutral. We want to solve the end user problem and have them grow and be successful. And so we look for and work with partners in a way that allows them to deliver their value and and ultimately serve the end user. and and so ecosystem is the answer. Yeah. And the great thing about the way you've divine designed your ecosystem is there's always a trade-off of do I go multi- vendor or do I do turnkey from one vendor if you've got the right ecosystem program in place you can actually bring the benefits of single vendor to turnkey or turnkey to to multi vendor right so it looks kind of like one vendor but when in fact it's it still gives the customers a lot of choice because they have choice within the ecosystem. I I'm impressed some of the announcements. you you think AWS is a partner with maybe it's a competitor they're doing partnerships and so when you see that cloud to cloud work yeah no they talk with Azure Google cloud right so they're they're recognizing that as an industry for us to move this forward everybody has to work together and solve for the gaps that we we all have and eventually you know we're all going to fight for our Yeah. So, I'm I'm going to riff here a little bit. I've seen so many vendors m try and maintain these proprietary stacks and walled gardens. It's been proven over time whenever you're interoperable and open, it drives utilization and creates a rising tide for everybody. Absolutely. Yeah. So, 100% agree. That's why for us we it's all about the ecosystem. It's that the ultimately the end user decides and buys like it's AWS is leading them and rightfully but there's a a whole if you're here you can see there's an entire econ to come together to deliver the full value to the end user that's what it's all about. All right gang so last question for people watching this as they're thinking about going down the AI path. How do you get your network ready for AI? I think you first do an assessment of where you are. And you can help with that, right? We can help with that and our partners",
        "start": 808.32,
        "duration": 1891.278
    },
    {
        "text": "last question for people watching this as they're thinking about going down the AI path. How do you get your network ready for AI? I think you first do an assessment of where you are. And you can help with that, right? We can help with that and our partners Yeah. whether it's tradition, believe it or not, whether it's traditional NSPs, they're investing in AI on the network. There are consulting firms, there are value added resellers that all have amazing networking practices that can assess and identify where the end user is and what they want to take on now versus their long-term goals. And so first it's sort of an assessment. , and that's where most people are. They're in they're in discovery and and then from there you start to build the actual framework for what you're trying to then operate. And then then in the end we believe the end state is the distributed AI isn't going to know. Yeah. All right. Good. N1. Yeah. I appreciate the time. Yeah. Nice to meet you. Yeah. I love your content. Oh no. Great. Thanks. I appreciate that. So on Greg Ali from Equinex. I'm Zas Caraval from ZK Richards. Thanks for watching. as usual, give us a like and hit that subscribe button and I'll see you next time on an episode of Zcast.",
        "start": 963.519,
        "duration": 2017.1989999999994
    }
]