[
    {
        "text": " Welcome to Zcast everyone. I'm Z Carval from ZK Research and I'm in the active stand I guess if you want to call it that on on outside in the auto pavilion at CES 2026. I'm with Java, old friend Javacon, president of the software systems at Aptive, correct? Yeah, intelligence system. Okay. So, it's great to see you. It's been it's been a while. And so a lot of my viewers might know you from your Cisco days, but tell me what you're doing here at Active and and who Active is. Yeah, so Active some of you might have heard of Deli, which eventually evolved into the the the software and the technology out of that reemerged as aptive which is about 8 ny old company. They build amongst other things the technology that goes into cars. The cars today are actually mini data centers in many way. Yeah. Lots of intelligent applications running in there. And historonically apps started off building hardware sensors for these for these cars. But over the last few years we've we've built the entire technology stack both the ADAS stack the autonomous driving stack and the inc cabin the experience stack the cabin itself is becoming a part of computer. So that's what we we've been building over the last few years and we supply to most of the large OEMs or car manufacturers across the globe. Yeah, that that's great. Thanks for the intro. And you know you you mentioned that these are many data centers. There are also many edge servers, right? And let's let's start with that. In fact, I saw your session yesterday on edge AI. And so when when you first took this job, fact, you told me you were trying to bring more it this industry up a little bit, right? And but the auto industry is the auto industry. And so how's that gone? The transition of this industry to something that's that thinks less auto and thinks more edge. yeah. So I I think the the automobile is probably the most underappreciated intelligent edge device. It's taken a while for the industry to get where it is. But the the industry has two challenges it has to deal with. Right. So unlike other edge devices that other device software devices which are more connected and can be easily updated cars only recently have built the ability to update themselves which means it's taken a lot longer to get the software the architecture updated where it can be continuously updated. So that's why it's the industry it's it's taken the industry a little longer. But the other challenge which I discovered after joining this industry was that the safety bar is way way higher for something like a car right inside a car. you cannot be 99% of the time right a a query with an LLM occasionally gets something wrong and you know we give it a pass but a car has",
        "start": 5.279,
        "duration": 328.8800000000001
    },
    {
        "text": "this industry was that the safety bar is way way higher for something like a car right inside a car. you cannot be 99% of the time right a a query with an LLM occasionally gets something wrong and you know we give it a pass but a car has So that means the bar for certification the is just way way higher. and I think that's why it's taken a little longer but I think with the advancements of the in compute these language models becoming smaller leaner and meaner and the car being always connected is now accelerating significantly the innovation that you're seeing both with autonomous driving and also inc cabin experiences. Yeah. And now one of the things you mentioned you use the word stack and I want to come back to that and I I toured the auto floor went to some and the word stacks all over the place right and so and historically a lot of the things in car were built by different manufacturers but they're trying to consolidate more and so talk about the importance of a single stack both from a cost perspective but also from a feature function perspective. Yeah. I mean that's there unlike other applica hardware devices that we might be used to where you know there are one or two operating systems or one or two stacks that have emerged in the auto industry. It's taken a little while for that standardization. actually the standardization hasn't quite happened. so the approaches the approach the industry has taken is there vendors like Aptive that provide a modular but a full stack solution. So we build sensors or raise them. we've built operating system so vx works which is wind river operating system that that we built. and then we've had to build the applications the application runs on top of the operating system. We we've had to add containerization so that you can separate the safety critical applications like the ADAS application from incab experience applications. And then over the top updates are now delivered through connectivity that the call has. So that is an example of a stack that we've had to build but we've had to build it in a modular fashion so that you can over time kind of swap pieces out. so that's that's the transformation that's been happening in the industry. The other thing that the industry has had to do is historically the compute was distributed across hundreds of individual ECUs. so transitioning from that architecture to a more centralized architecture has also taken some time but that's that stack is now starting to emerge. It's still pretty distributed across different OEMs. there isn't a standard there but we're starting to see some and also the ECUs have been virtualized which is been huge because now you don't have to build one to test it. You can try it out and develop it first. And",
        "start": 169.599,
        "duration": 632.5600000000003
    },
    {
        "text": "It's still pretty distributed across different OEMs. there isn't a standard there but we're starting to see some and also the ECUs have been virtualized which is been huge because now you don't have to build one to test it. You can try it out and develop it first. And through the the little showroom here you talked about how you've got two stacks drive stack like an auto stack and then the infotainment stack. Do you see a day when those come together? Yeah, it's already starting to happen, right? and and it's being enabled by a hypervisor that's now running inside these cars, believe it or not. Right. I talked about these cars being mini data centers. so you now have the ability to run containers and that's allow and the and the compute itself has become powerful enough where it can run both those applications and ELAS application by the way compute you know consumes a lot of compute right because it's an it's it's on the fly recognizing all kinds of objects and making decisions so compute has gotten powerful enough where those things are starting to come together and believe me you want that powerful and you want it on board absolutely because you can't connect to the cloud and wait for a decision to come back Right? so those stacks are starting to come come together. the other thing that's happening is the functionality is also starting to overlap. So think about the use case where is the driver paying attention or not. Right? That that that functionality typically has run out of the entertainment cluster because you've got a camera that's looking at you. so even the functionality is starting to converge where you have an incin alert that is now u driven by adas functionality. So yeah, that is starting to happen. And you know, one of the I think the great advancements over the last few years has been computer vision and the quality of that. In fact, earlier this year or I guess being there late last year, I was talking to someone from the NFL about this where when they tried to do a lot of the stuff with analytics, they tried cameras, the quality wasn't good enough. They had to use sensors everything. Now camera vision's gotten so good that they can replace a lot of that. And I remember talking to you last year about some of the all the sensors around the car. you can do much of that with cameras. So, how much more are you doing the camera vision versus sensors? Yeah. So, I think I think it's both, right? So, I think with cars, it's not just cameras, it's the radars. , right. And I think we have so we have the fusion technology which actually takes input from a camera and a radar and actually builds a 3D view of what's around you. So, we've seen enhancements not just in camera",
        "start": 323.68,
        "duration": 898.1590000000007
    },
    {
        "text": "with cars, it's not just cameras, it's the radars. , right. And I think we have so we have the fusion technology which actually takes input from a camera and a radar and actually builds a 3D view of what's around you. So, we've seen enhancements not just in camera both near and far. and in real time build a fused view of what's going on around you and the auto industry doesn't get enough credit for how much you know they are already doing in a typical car in real time. You know it's it's a it's an interesting perception challenge for the auto industry. For people that follow the industry casually, there's a perception that there hasn't been that advance much advancements because six, seven years ago, we were talking about level five, right? And that's not here yet. But along the way, I mean, cars are so much safer and so much smarter today. And have you found that that the there's just this, you know, the people in industry understand what's going on, but to the average consumer the the Yeah, I think that's true to a certain degree. I think the industry also has to do more in terms of the user experience. So while the underlying technology, the sensors, the the compute, the actual adas the intelligence in these cars has advanced significantly I think it's also the responsibility of the industry and vendors like Aptton to make sure that we are communicating that in a safe and manner where customers feel safer about what the car is doing. well the features are easier to turn on cuz sometimes your average consumer may not know how to turn on lane change and learn or you know things. I think there is any human task that gets taken over by AI there is an additional bar that the experience has to deliver which is reassuring the customer that you know we we got you right and I think that's the other piece that has taken a little longer but you're starting to see the confidence of the of the average consumer also start to you know increase because we've now been doing this for one point you made yesterday in your panel model was if we can't get the price points down to under 30,000, these things won't become ubiquitous. Right. So, I I think that's that's one of the biggest challenges the industries have the industry has because the average consumer, you know, isn't really buying a, you know, $100,000 high-end car. , and when you start to put a couple of GPUs in there, the price can increase pretty quickly. , and not to mention the sensors that and all the other cost that goes into a typical. All right, Jav. So, , Aptive being an in automotive. , I was I was going to ask you what where else your software stack can go, but I can see that, you",
        "start": 458.24,
        "duration": 1200.8790000000006
    },
    {
        "text": "and not to mention the sensors that and all the other cost that goes into a typical. All right, Jav. So, , Aptive being an in automotive. , I was I was going to ask you what where else your software stack can go, but I can see that, you you know, in a I guess a warehouse device here. So, , talk about the expansion of Aptive to other industries and what are some of the similarities and some of the differences? Yeah. Yeah. So, one of the things that we realized was that the car is probably the most advanced example of what I call is an intelligent edge physical AI device, right? And I you and and when I think of the term physical AI, it's different from digital AI which u we spent a lot of time on the last 18 months where the input is digital, right? You you type in a prompt and you get an output which is also digital. So there's AI but it's acting on a digital input with digital output here. The car is different or a physical AI is different in the sense the input is actually a physical input. It's sensing your environment. This AI in the middle and the output is actually also a physical output. The car moves your you've got to actuate it. That is a very different problem. So physical to digital to physical. It's physical input AI in the middle and physical output. That is a much harder problem to solve. and by the way, you're always you have to get it right all the time because the consequences are pretty bad if something happens. When we looked at that physical AI device, we realized that it the the typical pattern there was you needed sensors that sense the physical surroundings. You needed powerful AI and computer in the middle and then you were acting on actuators. That pattern we are seeing that with robots. We've got an industrial robot over here that can be used to move stuff around. It has sensors that sense the surrounding. It has powerful AI running to make decisions about navigating the environment or learning the environment. And then the output is the device moves. We also seeing that with drones. same thing, they've got sensors. There's a powerful AI running and then they move. so we noticed that the very similar technology stack that sensors and then X is starting to emerge in these industries and the auto industry companies like Aptive have been doing this at scale for a long long time at a much much lower cost. so we're starting to work with some of the robotics vendors and drone manufacturers to replace their stack with the stack we've got. and they've started to see some success and you're seeing some examples of this. Oh, that's great. Yeah. Well, I played pic tic-tac-toe with a robot this or",
        "start": 612.88,
        "duration": 1493.7600000000011
    },
    {
        "text": "we're starting to work with some of the robotics vendors and drone manufacturers to replace their stack with the stack we've got. and they've started to see some success and you're seeing some examples of this. Oh, that's great. Yeah. Well, I played pic tic-tac-toe with a robot this or over on the show floor. Lost four consecutive games to it. So, so the so the AI itself is getting pretty focused on the on on the robots that actually do physical things because that's that's really our focus area. So, yeah. Yeah. No, and it's it's great. In fact, all those industries are looking to bring labor cost down. Yeah. And so, the value prop there is I mean it's huge, right? So, I would expect to see more adoption there. All right, Jav, anything you just want to add? , yes. So, I think this this is an exciting time for physical AI. I think if you walked around the show floor show over here at CES, there's so much happening both with compute but also with robotics and drones and it's really an exciting Well, everywhere I went this year, whatever show floor, I saw a robot. So, CES 2026 will be known as the robot palooa. It is. It is. Yeah. All right. Congratulations on all you've done with the company and looking forward to catching up later. Yep. It's great to see you. So yeah, so on behalf of JavaCon from Aptive, I'm Zas Karen Val from ZK Research and thanks for watching and give us a like and hit that subscribe button. We'll see you next time on the next episode of ZCast.",
        "start": 762.48,
        "duration": 1622.2410000000016
    }
]