[
    {
        "text": " [music] Happy holidays everybody and welcome to another episode of What's Doing Networking. I'm Zas Caraval from ZK Research here with co-host Bob Liberte from The Cute Research. Bob, it's the holiday season. It is. It is. We've made it through another year. This is fantastic. And I think what we're going to do now is we la the last video did we talked about what to expect from Cisco in 2026. And let's talk more generally about the network or industry. and then talk we'll do a rapid fire round of some of the other vendors that I think you know certainly are notable and worth watching and so I'll start with you what what's what are a couple trends you're watching in the networking space. Yeah, I think first of all the best part is networking is kind of cool again. Yeah. Right. There's really a resurgence and an understanding that the network's going to be critical for these environments. And what I'm looking at is the fact that with all the things going on with AI and so forth, these networks are getting far more distributed. And so organizations are having to it's not just data center to cloud and data center to edge and so forth but it's all of those combined and everything in between. So keeping a close eye on that. Obviously scale is important especially in the AI space. Scale up scale out scale across things like that going on. Scale in's coming I'm sure. Yeah. Somewhere there's going to be a fourth dimension. And then I think the you know another thing that we're looking at is is sort of that whole security observability and automation trend that's coming along with AI. Yeah. The convergence of security auto security observability and networking is interesting because those three have historically been separate domains. Cisco's obviously made a big push. We talked about that. But that that doesn't mean other vendors aren't right. Everyone's got some element of observability, security, and networking. And I think it's important for the vendors to to define it along their own terms. I think that the term secure networking is used very loosely. and it means everything from we have both to we fully integrated to every port and everything in between. Yeah. And I think what I what I find really interesting and curious is that we see a lot of the vendors driving convergence but from a cultural standpoint we don't see the teams converging as much right there's still separate network right in large enterprises in particular right so I'm still I'm looking for 26 to see if we start seeing that cultural and operational convergence. We're seeing hints of it in in the software where there's multiplayer where people are allowed to collaborate in the same software and so forth from the network and security team and everyone's talking about this driving this convergence but as of right now there's still a lot of",
        "start": 0.654,
        "duration": 297.7800000000001
    },
    {
        "text": "convergence. We're seeing hints of it in in the software where there's multiplayer where people are allowed to collaborate in the same software and so forth from the network and security team and everyone's talking about this driving this convergence but as of right now there's still a lot of larger enterprises. Yeah. And I think you know it's going to be interesting to watch the impact that AI has on the network. We all understand the importance of place in the data place in the data center. You mentioned scale up scale across and scale out. And I I think more and more there's an awareness that with more inferencing coming in inferencing traffic coming more edge computing coming more physical AI coming the a the campus network we may see companies accelerate a refresh ahead of their normal depreciation cycles because the campus network plays an important role and that to me also includes Wi-Fi 7. I I think a lot of people initially when Wi-Fi 7 came out said 67 kind of the same two sides of the same coin but the people I've talked to 7 seems to perform significantly better and it's got a lot of other features in in the areas of performance not just raw speed but the performance manageability I suppose. Correct. Yeah. No, it's I I like that you brought that up because one of the things I was thinking about for 26 as well is obviously Wi-Fi 7 is I agree with you. We're seeing a lot of uptake, a lot of interest in it for the performance factors. I think we're also hearing a lot about the hybrid network with the private 5G and Wi-Fi 7 coexisting and finding ways especially as you move to the edge, you're looking for inferencing depending on what application and you're trying to, you know, trying to solve for in that space. I'm hearing a lot about that hybrid network environment persisting for those edge environments. Yeah. And I am really fascinated to see how much movement we have in physical AI which includes IoT obviously but every keynote I've seen from from Nvidia and if you believe you know the Jensen's the word of you know the the holy bible now when it comes to AI that really I don't know if it's exciting for a network engineer or terrifying or whatever but there's so many more devices that going to be connected to networks. Some are autonomous, some aren't, but really it's anything that's that you can connect will be connected. It's this vision we've had of internet of everything for a long time. And AI, I think, is going to make that a reality. But that is really going to have have a a really fascinating impact on network because it does require you to rethink security. It does require you to think observability. because it's it's just it's a it's a paradigm we've not seen before in networking.",
        "start": 151.599,
        "duration": 601.5410000000002
    },
    {
        "text": "to make that a reality. But that is really going to have have a a really fascinating impact on network because it does require you to rethink security. It does require you to think observability. because it's it's just it's a it's a paradigm we've not seen before in networking. effort either, right? It's got to be low latency, no general, very deterministic, very deterministic in order to accomplish that and enable that real time analysis for those those robotic AI tools as well. So, and obviously, you know, we we talked a lot about machine data having an impact as well. So, all that right, it's going to have greater bandwidth to carry all that more data, all that more all that data that's that's coming into and being collected and analyzed. Now, in the data center network, is compute part of the network or is network part of compute? That's a good question. Well, because the two are certainly been fused together. Yeah, DPUs and things like that that are that are coming out. It's certain there's certainly a blurring of the lines. Being on the network side, I'll go with on the network. The computer computes becoming part of the network. But I think what we're seeing again is just like with security, there's a lot more infusion and and meshing of the technologies to be really where they best fit. So instead of it being so much of a hey this is the server domain this is the network domain it's let's put the technology where it best fits for the application right and so we've seen that with the DPUs and the smart nicks where they're saying hey security belongs right at the edge of the server now we can't just build a moat around all the servers we now need to integrate it in so as more and more security gets fused in where that security goes and where it needs to sit is [snorts] also changing right whether that's top of the rack or in the server itself yeah and I guess that goes hand in hand I I mentioned edge but I think we're going to see a big uptake in edge computing both telco delivered and I and I we don't we don't actually talk about telos a lot but also from the infrastructure vendors and I just don't see how companies in fact it's interesting with AI if I were to roll the clock back 2 3 years every CIO I talked to is trying to figure out how to consolidate data now they've given up give up on that right and they want to leave the data where it is which drives more compute and networking at the edge. And so these kind of unified systems that we've seen in data centers now need to make their way to the edge. In fact, Cisco rolled theirs out, but I'm I'm fully expecting to see other vendors do that.",
        "start": 304.96,
        "duration": 846.1010000000002
    },
    {
        "text": "it is which drives more compute and networking at the edge. And so these kind of unified systems that we've seen in data centers now need to make their way to the edge. In fact, Cisco rolled theirs out, but I'm I'm fully expecting to see other vendors do that. more of that. I think the difference is people aren't trying to go back to building out data centers at the edge. They're trying to deploy the minimal amount of infrastructure that's required to do the analysis. And you're absolutely right, there's, you know, the emergence of data fabrics. it's we have access to all the data regardless of where it sits in the enterprise [clears throat] within a reasonable period of time and so forth. So I think we're we're going to see a lot more of that organizations shifting driving more compute to the edge to handle the inferencing but being having it confined to to what's actually required for that site to deliver the outcomes and the insight that's required. All right. So we got big focus on campus obviously continued focus on on data center and this whole convergence of security observability and networking and compute in a way I guess is coming here. So let's do a rapid fire now when I you know on the on the vendors and we'll we'll tackle them u maybe alphabetically so I'm not picking any favorites. So let's start with Arista. I just pulled some data points. Arista had a fantastic year last year. their AI cloud revenue $8.9 billion that's over 25% growth and they're you know they continue to grow their operating margins and they've really become they're not and they've really had a strong push in campus and so when I think about Arist in 2026 there's no doubt as AI grows and hyperscalers continue to invest in in the GPUs they're going to be one of the big winners but from a things to watch. I think their future is in campus and enterprise. They hired Todd Nightingale for that. And I'm I'm really interested to see how they do it. What What do you think they're doing there? Yeah, definitely going to watch what's going on with what's [cough and clears throat] happening in the campus there. They've just made some you know, obviously they've always been known as the performance right [clears throat] side of of networking and so they just announced that massive scalability in the campus that they have. , one of the things that I'm also looking for as they look to expand into the campus and beyond, we just talked about the distributed networking. They bought Vevel Cloud. They bought it and they've been quiet. So, I'm looking for 26 to come out and see that integration of cloud into it and that complete endto-end fabric for Arista for the enterprise as well as the hypers scale. My only concern with them in the",
        "start": 428.72,
        "duration": 1124.9800000000005
    },
    {
        "text": "They bought Vevel Cloud. They bought it and they've been quiet. So, I'm looking for 26 to come out and see that integration of cloud into it and that complete endto-end fabric for Arista for the enterprise as well as the hypers scale. My only concern with them in the value of Arista tends to be very high-end, right? They started with in in fintech actually, right? Low latency networking. They're great. And so does an average enterprise look at Arista and go, \"Wow, that's really overkill.\" Yeah, I I think that's a great question, but it's also if you that's also their strength, right? That's where they've always succeeded. And as we just mentioned, that announcement they had in the campus is all about massive scale. So they're not targeting the SMBs here. They are looking at the largest enterprises with the biggest problems and how do we effectively scale to solve those. And then I think their their downstream will be like like if we can handle the scale of these largest ones, we can easily accommodate and then it just becomes a discussion about price and their ability to win in campus. I think they need to grow up their channel. So we'll see what they do that. Yeah. All right. let's go to extreme next. they had a good year, right? They grew revenue about 2%. They're over a billion dollars now. 1.14 billion they closed. during 2025 they actually expanded EPS and gross margins. So showing I think they're more profitable which means their platform stories come together they don't have to discount as much and so they were you know named a leader in the Gartner MQ which I think is notable and you know for me what to watch for an extreme is we all know they do you know campus networking very well but it's the adoption of platform one right correct yeah I think that's really something I'm I'm going to want to look at they've got a lot of good things going for them really intelligent fabric from data center to edge. So for that distributed environment, focusing on being able to deliver that, being able to deliver on their AI capabilities, their canvas AI that they've brought out, I think are all going to be things that we're going to be looking for as proof points that they continue to innovate, continue to provide really real value for their for their clients. Yeah. And the other area, and this is true for Arista as well, can they go from security adjacent to actually security driving the business? both Arista and Extreme I think have danced around the security space. Arista is probably a little further ahead than Extreme is but they all I I think this is an area as we talked about right extreme actually has very good observability tools and they're building out the the security capabilities. So you know that to me if they want to",
        "start": 567.839,
        "duration": 1392.980000000001
    },
    {
        "text": "Arista is probably a little further ahead than Extreme is but they all I I think this is an area as we talked about right extreme actually has very good observability tools and they're building out the the security capabilities. So you know that to me if they want to drive the platform approach that would be a place. Yeah, you bring up a great point for something to watch in 26 as an overall we talked about security, but will these that the convergence of networking and security companies, right? Will will Extreme make some acquisitions to beef up their security? Will security companies buy networking companies to beef up their networking play? So, I think that's an overarching one, but certainly for these companies particular, they've got an ecosystem of partners. We'll see how those continue to develop and evolve. And they spent years bringing all those companies together, and it looks like they've done that. So, it's execution year this year year for them, right? for HP and Juniper. they completed the $14 billion acquisition and obviously the thing to watch for is just the integration of Aruba and Juniper and we saw some evidence of that at the end of the year. They announced in fact way faster than I thought they would but they they did have some capabilities between central and mist work together. I'm not really that concerned on the product side whether it's one AP two APs blah blah blah the the software's got to get taken care of first and then they'll provide a roadmap to to common hardware but your thoughts on HP Juniper does Ramy make a huge impact here I I think yes [snorts] question yes I think he does you know I think more so he seems to have when you look at all the announcements that are going on you've got Antonio and then you've got Ramy right behind him so there there's certainly a recogn nition there that he's going to help drive and and lead this transition that's going on. They're moving towards the universal hardware which is great right that's a nice path for for their customers but like you said more importantly and I think a lot of this thought this happened beforehand which was miss would become the AI engine central would become the management plane I think they've got another interesting thing for them to tap into one they've got obviously we talked earlier about you know distribution so tap into HP's channel now for the combined product I think they also have a great opportunity to tap into some of the third party tools from observability perspective that HPE has. So, that's what I'm going to be kind of looking for as as they expand throughout the year. How do they continue to bring those those networking pieces together, spell out a roadmap, but also how do they take advantage of the greater HPE environment",
        "start": 706.56,
        "duration": 1655.058000000001
    },
    {
        "text": "observability perspective that HPE has. So, that's what I'm going to be kind of looking for as as they expand throughout the year. How do they continue to bring those those networking pieces together, spell out a roadmap, but also how do they take advantage of the greater HPE environment the huge opportunity for AI factories and things like that for them to participate in. Yeah. The one, you know, I guess, in the HPE armor, if you will. In fact, I think Ry is gonna do a fantastic job on the networking side. I think HP networking is going to become, you know, a much stronger brand. I is the the compute integration though, right? And when you think about AI factories, they should be able to build an AI factory better than anybody except maybe Nvidia obviously, but but I haven't seen much in the way of the compute networking integration. HP tends to run those separate businesses and I would like to see those get, you know, much more tightly coupled. So yeah, that's a fair point. It would be great to see some really really positive examples of because they didn't have a lot of networking for that AI space prior to this. Now that they have it, seeing them pull together that complete factory, having proof points along 26, I think that would be a a good advice for them to take. Yeah. And the last vendor I'm going to bring up and then we can get to some dark horses is Nvidia. Nvidia. And it's weird to talk about them as a networking vendor. They crossed the $7 billion a quarter mark, right? So, but in that is obviously Spectrex Ethernet, Infiniband, NV links mixed in there, their DPUs are mixed in there. , and so I don't know if all that's true networking or not, but it's part of the networking stack. And, , , you know, I guess what to watch for is just the continued rocket ship that we've seen, but they are a bonafide networking vendor, are they not, Bob? Yeah, absolutely are. And I think what we're continuing to see what's driving, what's so important to not only the hyperscalers, but as we move into NeoClouds and enterprises and so forth, is that everyone's looking for that Nvidia certification, that NCP, right, that that they're able to in the reference architectures. So I think it's going to be critical for all the network vendors that really want to play in that AI factory space to make sure they're part of that program that they have reference architectures that they're that they're able to work nicely and and understand there's going to be some give and take on the the whole Infiniban versus Ethernet. And how important do you think the Cisco partnership is to Invidia? you know I think for Nvidia all of the networking partners play a significant opportunity for a distribution channel.",
        "start": 839.519,
        "duration": 1918.0170000000007
    },
    {
        "text": "nicely and and understand there's going to be some give and take on the the whole Infiniban versus Ethernet. And how important do you think the Cisco partnership is to Invidia? you know I think for Nvidia all of the networking partners play a significant opportunity for a distribution channel. are are starting to go deeper in technology, right? Cisco's obviously integrated with their Spectrum X and things like that. So, I would expect to see more things like that happen over 26 as as these network vendors want to grow and scale and especially as Nvidia wants to target the enterprise and the NeoClouds. Yeah, I know for some of the bigger SIS too like in worldwide technology with you know with WWT they they work very closely with both. I think you know prior to the two partnering I think they felt kind of stuck in the middle the obviously Cisco is the largest channel partner but they viewed Nvidia as very strategic. So I think the two partnering almost gives the thumbs up to the partner community that that it's okay to work together. So absolutely. all right. Well that that covers sort of the major networking vendors. There's a whole bunch of other dark horses. Bob. Sure. anyone you want to give a shout out to that you think is worth watching? Yeah I think there's a couple of them. I was just out at Meterup. You were at Meterup and u you know they're really innovative company. They own the whole networking stack by network engineers for network engineers. They happen to use a NAS just you know go to market model and so forth. But a lot of momentum coming out of them. So they're definitely a company to watch for 2026. some of the other things I found interesting especially with a lot of the Neoclouds coming out a lot of interest in Sonic and [snorts] I think that presents a great opportunity for Dell to take advantage. They've been a long long supporter of of Sonic, you know, before it wasn't cool and now it start again as networking comes around, as organizations are looking for those open open [snorts] solutions like that. Yeah. Yeah. Meter is interesting to me cuz I don't know if we the world needed another networking vendor, right? Because there are lots of them and you know, Nile was kind of on people's radar for a while. they kind of faded a little bit. Although I'm never going to doubt Pankage and John Chambers, right? I was going to say it's hard to bet John Chambers, right? Yeah. , so we'll see if there's a resurgence from Nile. , but Meter more and more I' I'm hearing from channel partners are taking a look at them. So they actually might be the startup that actually comes, you know, out of nowhere and and starts take some share. Dell to me, Dell's the most confusing networking",
        "start": 973.519,
        "duration": 2168.4979999999996
    },
    {
        "text": "resurgence from Nile. , but Meter more and more I' I'm hearing from channel partners are taking a look at them. So they actually might be the startup that actually comes, you know, out of nowhere and and starts take some share. Dell to me, Dell's the most confusing networking them a networking company. They're they're they're a company with a big distribution channel that happens to sell networking. They bought some assets, right, long time ago, Force 10, things like that. But they don't really have any IP. They just their biggest strength is maybe they do whatever Nvidia tells them to do and so they get some legitimacy that way. And so I I don't know. To me, Dell's on the outside looking. I think the lack of technology they actually own is their Achilles heel. I think in the AI space, you want to be able to build these complete factory. So yeah. No, I I think it's a fair comment. We'll see how it goes. Like I said, they got the most support from Jensen early out of the gate. Yeah. With the go to Dell for your AI factories and and whatnot. And so whether they were reselling Nvidia networking, right? So some of those big numbers might be coming through Dell, in which case they love them. but like I said, I think there's an opportunity with some of the Neo clouds as long as they've got those reference architectures with Sonic, they've got they've got a potential to play there. [snorts] Forinet's an interesting one too, right, to watch. They in fact Foret's just their networking business is fascinating because most people don't think if you say networking, Fordet never comes up, right? But they've got a big Wi-Fi business. They've got a pretty big campus business and they've got a huge SDWAN business and I know when I've talked you know you know to people at Cisco Forinet really is on their radar because they they do volume better than anybody and so they're never going to be the innovator. They're a great fast follower and they seem to hit the market. In fact, when we were at their analyst summit, I didn't realize how big their industrial leadup portfolio was. Correct. Right. And so they've got pockets of networking strength in a lot of places. And I don't know if I'd call them a disruptor, but certainly they down in that theme mid-market they are. Yeah. I I look at them as a value leader, right? And the reason in at the event they talked over and over again about how they own everything internally so they can deliver the most value for the dollar in what organizations are getting. So hey, you have our our forigate we can just put SDWAN on there. we can put right we can just pad that very quickly very easily. So it's for especially that that smaller mid-market SMBme",
        "start": 1100.48,
        "duration": 2420.5769999999998
    },
    {
        "text": "they can deliver the most value for the dollar in what organizations are getting. So hey, you have our our forigate we can just put SDWAN on there. we can put right we can just pad that very quickly very easily. So it's for especially that that smaller mid-market SMBme value proposition for organizations. Yeah. and the other name I wanted to kind of toss out there is is the error is Riverbed back. I know I I talked to them a little while ago. I haven't seen much from them. They seem to have gone from an SDWAN vendor to an S to observability vendor, but I think in the AI era, moving data back and forth gives SDWAN maybe or not SDWOP. , it gives another lease on life. Yeah. No, I think you're spot on. I, you know, when I've talked to them, , they've been seeing incredible growth from, you know, especially within their own install base. They were able to bring everything back together. So the observability and all the acceleration tools and now they're there suddenly this organization that what people used to might think of as old technology suddenly has sort of innovative technology to help them move all this AI data quickly. So they just made a big announcement with Oracle helping them transfer data from enterprises back into that into their the Oracle cloud. So I think yeah this is a really interesting play. I think we're going to see a lot more and hear more from Riverbed and how that ability to move data to where it's needed. Like we said, the data fabrics are going to exist. No one's moving data to a centralized location, but they do need to access and move it when they need to do the analysis. So is, you know, this this could be a really being at the right place at the right time for Riverbed. Yeah, I well I and I think this is in some ways our last stand. I don't know how long they could have existed, you know, plotting along and losing share in the space and trying to pretend to be an observability company. So, yeah, and I think like I said, the new leadership they have is really focused on driving innovation. We've seen more innovation come out of Riverbed in the last year than we had in the prior five or six. So, that's great to see, you know, a venerable name like Riverbed, right? We saw it grow from zero to a billion dollars. So, it's great to see that revival and and, you know, we'll see what 2026 brings for them. Yeah. All right. Anybody else you want to give a shout out their thoughts around? I think you know I think that's about it. We've seen Broadcom this year had a lot of AI related announcement for the silica and so forth. Yeah. And and I went to Marvel's in",
        "start": 1227.76,
        "duration": 2669.8580000000006
    },
    {
        "text": "Yeah. All right. Anybody else you want to give a shout out their thoughts around? I think you know I think that's about it. We've seen Broadcom this year had a lot of AI related announcement for the silica and so forth. Yeah. And and I went to Marvel's in something. Marll's a kind of dark horse in chip space because it's so much smaller than Broadcom. but you know and Nvidia obviously but their technology really is like if you want cutting edge networking silicon Marll does a great job of that. I mean that you know especially from a scale across standpoint just from a volume standpoint it's it's hard to see them competing there. But I think for a lot of you know you know kind of corner use cases I think there's a good value prop there that they can use to build an install base and grow. the the problem with Broadcom obviously though is if you're a Broadcom customer and you don't go all in on Broadcom, they throw a lot of punitive measures at you, right? So, yeah. So, I think just in summary, we're both expecting 2026 to be a big year for networking and it's I think that creates a rising tide. So, we should see all the names we talked about, we should see them all be winners, per se. The question is, can they be disproportionate winners and grab more share than their their competition? Absolutely. Yeah. It's going to be it's going to be fun to watch. Yeah. Yeah. the pie is going to grow. The question is how much of the pie can you grow? Exactly. Yeah. So, all right. You want to wrap us up then? Yeah. Well, again, everyone, thanks so much for watching us. This is our third edition of what's new in networking holiday special. we hope all of you and your families have a wonderful holiday season and we look forward to seeing you next year.",
        "start": 1354.4,
        "duration": 2833.536000000001
    }
]