[
    {
        "text": " wanted to draw your attention to well there was a there was an announcement which was made right some time back which was about the fact that 22 lakh rupees peranom was a package and it was actually coaxing a lot of the people to pivot towards specializing themselves and their skill sets and if you had that quality those qualities you would be appreciated and rewarded. But if you were still following the conventional models of you know for example the education or if you were following the conventional legacy aspects you might just get left out of the race. So do you feel with with something like this coming in that just accelerates the entire thought process? Quite possibly Sodi because you know all IT companies they are demanding a certain kind of skill set and also AI enabled skill set like for example they would prefer a person who has done some kind of an AI you know certification or some kind of a AI course or you know they they would prefer that they that they are making very clear because they themselves are also going through that phase of you know adopting and adapting to AI. So so which is why that change is there even if and they're making it very clear that if they're offering a certain kind of package it will not be that if you know only maybe Java or only you know Python and that's about it and you are done. Sure. That's not going to work anymore. that is that is certainly sure for the Indian IT sector if that's what that's what you meant. Yeah. Yeah. That's exactly what I was trying to understand from you. U as far as the launch is concerned what do you have to say as far as anthropics sentiment would be right now? I'd love for you to shed some light on that because this is a a big move. I think they would be pleasantly I'm not sure I don't think they'll be surprised but see the CU has always he has over the past few months even in the even in divorce he had said that you know AI is going to take away a certain number of jobs that certain engineering skills would be redundant after 6 months. We will not need engineers you know we will not need junior engineers after six months or by the end of 2000. These have been very strong statements to be made and you know everybody the entire globe was watching it was covered by the international media. So I am sure anthropic is you know kind of basking under the glory of you know what they have done and how they have kind of you know what do you say that as you said they kind of walked the talk in a way they yeah yeah absolutely they have walked the talk",
        "start": 1.1,
        "duration": 159.91999999999996
    },
    {
        "text": "is you know kind of basking under the glory of you know what they have done and how they have kind of you know what do you say that as you said they kind of walked the talk in a way they yeah yeah absolutely they have walked the talk now we are also looking at there might be more either layoffs or they might be trimming down in a different way if they they might not call it layoffs but maybe role you know changeovers would happen there would be a lot of like you know I don't know if people would be even hiring from colleges this year to an extent you know because they do have you sensed that though have you sensed that there basically in terms of the on campus hiring are there might be a slowdown there might be a slowdown for sure I mean I was I was talking to an analyst he didn't want to be quoted but he said that you know something like This it's actually it's not only about the stocks it's also about the whole sector and you know the fresh students who are maybe you know like passing out of college it's a very big jolt or rather you know what do you see what do you say kind of put them in very uncertain times maybe yeah uncertain times and they they can understand that maybe the degree is not enough maybe they have to either think of doing something else or you know maybe pivot ing their own career. so yeah, I mean it's it's like a it's like a trickle down effect. It's not only the stocks, it's the company, it's internally, it's externally, it's in the entire workforce. Fair enough. By the way, what what about the what about the Indian IT you know ecosystem. for example, I remember you were mentioning something to me a little while before we started about Zoho. I I thought that was very interesting that you were talking about that. I I would love yeah so actually Sridaru was so shru was one of the first to react on X and he said that you know how that there's a lot of fear among the industry and both globally and in India about how SARS is going to you know the companies they are going to survive AI and how it's going to impact them whether the companies are going to survive whether what will happen to the workforce how the Indian is going to be affected And he also questioned saying that how will Zoho you know survive this. Wow that's a big one. So that's a very big statement to make and and then he said that probably we all have to adapt everyone. So he yeah so he gave a very clear indication that change is here to stay and that's what everybody has to look forward",
        "start": 161.02,
        "duration": 307.19999999999993
    },
    {
        "text": "Wow that's a big one. So that's a very big statement to make and and then he said that probably we all have to adapt everyone. So he yeah so he gave a very clear indication that change is here to stay and that's what everybody has to look forward it be Jensen Huang whether it be Sam Alman whether it be Mr. himself etc or probably the people who are so enscconconed everyone is of course talking about the adaptability everyone is talking about the fact that we have to have to adapt there is no other way forward but the question I have for you Pali in in conclusion is the time factor can we can we kind of predict how quickly are we supposed to adapt because the speed at which the developments are going we we can't even seem to understand where they're coming out. They're just coming out of the woodwork, right? So I like we saw 2025 was like it's a it was a big you know year for AI when like you know particularly in India when there were so many announcements that have been made. So I mean that's a direction that all of us are moving towards and I believe that this year would also see a lot of changes in you know in Indian IT when it comes to adapting and adopting AI both you adapt to AI and you also adopt it you know within the company and you know how you can basically utilize AI still keeping the business model intact or maybe pivot it a bit and you know kind of at least go forward or rather continue to survive in the tech industry and you know because even like the the orders they have also gone down in terms of both from the UK and from the US to the Indian IT sector. Wow. So even if the revenue is not immediately hit as which we saw over the last quarter but the fact that hirings have gone gone down the you know there has been lot of trimming down in terms of departmental changes as well. So these are all indications that they are all gearing up or rather they are they are facing it that you know we we all have to I mean it's not going to just continue as it was you know that that formula is not going to continue it has to change and it will change so I would say that without sign sounding too analytical that 2026 would actually be a huge year or rather the year of pivot for Indian IT. Wonderful Palvi, thank you so much for for giving us your insights and we as always will keep bringing you back on front page as this story and other stories of course keep developing and wishing you all of the best. Ladies and gentlemen, that was of course Palvi Jakravarti an",
        "start": 313.18,
        "duration": 464.3199999999998
    },
    {
        "text": "Palvi, thank you so much for for giving us your insights and we as always will keep bringing you back on front page as this story and other stories of course keep developing and wishing you all of the best. Ladies and gentlemen, that was of course Palvi Jakravarti an the outsourcing age has actually evolved into the agentic age. So for every engineer and CEO who is watching the question is very simple. Are we selling manpower or are we actually starting to sell the results the roads for the AI economy are being paved and they are being paved at breakneck speed. The of course the ruins of the old billing models as Palvi just mentioned this might be the year where that pivot has to happen and it has to happen with a lot of elacrity. This, ladies and gentlemen, is Front Page by Aim Network. Please go ahead and like, share, and subscribe and tell us in the comments below. Is this the time to well go ahead and buy the dip or is the billable hour officially dead? And always of course remember, think AI, think AIM.",
        "start": 476.7,
        "duration": 519.3599999999998
    }
]