[
    {
        "text": " Alphabet and Google CEO Sundar Pachai has warned that if the AI bubble bursts, no company, not even Alphabet will escape the impact. Yes, you heard that right. [music] Welcome to Front Page by Aim Network. A IM network's video first newsroom that brings you the latest information that matters. Not noise, not speculation, but purely tech and truth with urgency. Please make sure to like, share, and subscribe if you haven't already. Tonight, we break down exactly what Alphabet and Google CEO Sundar Pichai's AI bubble burst warning which we have covered extensively here on front page. Please make sure to check that out. In an exclusive interview with the BBC, Sunundap Pichai called today's AI moment extraordinary, but also admitted it contains elements of irrationality. That is Silicon Valley code for yes, this is a bubble and yes, it can burst. And when asked if Google would be safe, Pichai didn't hesitate. I think no company is going to be immune, including us. End quote. That is the most direct acknowledgement yet from a big tech CEO that the global AI frenzy may be overheated. And here's where the bubble conversation gets even more interesting. Because while Sundar warns about irrationality in AI investing, Warren Buffett's Bergkshire haway has quietly shifted its bets. Recent regulatory filings show that Berkshire has become trimming its Apple holdings, the stock it once called its crown jewel and increasing its exposure to Alphabet, the parent of Google. You ask why? Here's why. Because Google's AI positioning from Gemini 3 to Tensor chips to search AI mode is now seen as a long-term compounding engine. Clearly Buffett's left tenants are reallocating towards the companies building the infrastructure of the next decade. When even Berkshire moves tells you one thing the AI bubble may burst someday but money is betting that Google survives the aftermath stronger. So just days after Sundar Pichai warned that the AI bubble could hit every company including Google itself, the bubble got even bigger because Gemini 3 is already out and the reaction has been nothing short of historic. Sam Alman tweeted, \"Congrats to Google looks like a great model.\" End quote. Sunda replied with a folded hands emoji. Even XAI and OpenAI insiders acknowledged that Gemini 3 had taken the Frontier model lead on public benchmarks. Gemini 3 Pro is now ranked number one on LM Arena, hits record scores on GPQA Diamond, ARC, AGI2, Math Arena, Apex, and dominates multimodal evaluations, prompting many in the industry to call it the most complete reasoning model ever shipped at scale.\" End quote. So, well, if this is a bubble, it's not slowing down. It's actually accelerating, swelling with trillion dollar chip deals, hyperscaler spending, and models that improve faster than the market can price them. Now, to understand why Pichai's words matter, just look at the numbers. Alphabet's market value has doubled in 7 months. Google's annual AI infrastructure spend jumped from $30 billion to $90 billion.",
        "start": 0.24,
        "duration": 459.01000000000005
    },
    {
        "text": "with trillion dollar chip deals, hyperscaler spending, and models that improve faster than the market can price them. Now, to understand why Pichai's words matter, just look at the numbers. Alphabet's market value has doubled in 7 months. Google's annual AI infrastructure spend jumped from $30 billion to $90 billion. trillion. Nvidia became the world's first $5 trillion company. $1.4 trillion in deals are tied to OpenAI, a company with under $13 billion as revenue. This is level capital without com level caution. And according to Pichai, tech is now at the point where well, we always overshoot before we correct. End quote. Pichai says the fundamentals of AI are real just like the early internet, but admits the industry may be running far ahead of reality. So if there is a correction, AI infrastructure costs will crush overleveraged startups. AI chip makers and cloud providers will see shock waves. Valuations of AI first companies will plunge. Investors may flee. Weaker models and weaker ecosystems. So, the consolidation, layoffs, and abandoned moonshots will follow. Even Google with search, YouTube, cloud, Pixel, Gemini, and its own superchips will feel the hit because this is an industry-wide capital bubble. But deep down no one including alphabet chief wants that to happen. Even as he wanted he warned sorry of irrational exuberance which I doubled down on AI. Google recently invested 1,500 cr rupees in Andhra Pradesh to build its AI and cloud data center in Visak one of India's largest state level AI infrastructure commitments to date. Google is moving training operations to the United Kingdom. part of a 5 billion well pound investment into AI data centers and deep minds expansion. Google admits AI will delay its climate targets because the energy requirements of Frontier models are immense. Google is challenging Nvidia headon with its nextG AI superchips, a clear bid to reduce dependency. And let's not forget Google's Gemini 3 which is already here. So well basically taking both rivals and the world by storm. Pichai is not alone. Sam Alman says investors are overexited and some will lose phenomenal amounts of money. Jeff Bezos says every experiment good or bad is getting funded. Now Bezos is well co-CEO of a $6.2 billion AI startup called Project Prometheus. his first operational role since Amazon signaling he's betting big on the bubble himself. And we have of course covered this extensively on Front Page. Please make sure to check it out if you haven't already. It goes by the title Good Bubble like he calls it. And of course like, share, subscribe to Front Page. Now, of course, Mark Zuckerberg is saying this not to subscribe, but it'll be nice if he says it. But anyway, coming back to Mark Zuckerberg. Mark Zuckerberg says yes this could be a bubble but not investing is a bigger mistake. Jensen Huang says this is not a bubble but trillions in GPU demand say otherwise. Even the IMF has warned if AI",
        "start": 232.799,
        "duration": 858.6079999999995
    },
    {
        "text": "nice if he says it. But anyway, coming back to Mark Zuckerberg. Mark Zuckerberg says yes this could be a bubble but not investing is a bigger mistake. Jensen Huang says this is not a bubble but trillions in GPU demand say otherwise. Even the IMF has warned if AI will crash. And it almost feels like the opening scene of the big short. You remember that one? It began with that chilling chilling line. And here is that line. Everyone deep in their hearts is waiting for the world to end. But trust me, when the IMF says a single dip in AI enthusiasm could trigger a global market collapse, when the bubble finally snaps, no one, not you, not me, not even the trillion dollar giants wants to live through that ending. Because if this bubble ever bursts, it won't just be a crisis. It'll be a movie script bigger, darker, and far more real than the big shot. That's for sure. And just when actually Wall Street started whispering, AI bubble, Nvidia walked in and flipped the entire narrative. Last night, Nvidia posted records shattering earnings. Revenue up 62% to $57 billion. Data center AI chip sales up 66% to $51 billion. The next quarter forecast $65 billion above every analyst estimate. Shares jumped 4% in after hours. Jensen Hang didn't mince words either. There's been a lot of talk about an AI bubble. From our vantage point, we see something very different. End quote. So yes, Sundai sees irrationality, but Nvidia's numbers show something else. Clearly a frenzy backed by fundamentals. And here is the front page take. The AI boom is real. The technology is transformative. But the investment climate around it is overheated, accelerated and inflated beyond fundamentals. Sundar Pichai's message is quite simple. AI is the new internet. But the bubble around AI is the new.com. And if it bursts, every company from OpenAI to Nvidia to Google will feel the earthquake. The only question now is who survives the correction and who disappears in the dust cloud. Please do let us know what you think in the comments below and please share this with your friends, colleagues and friends who don't stop talking about AI or otherwise. [music]",
        "start": 435.759,
        "duration": 1150.0309999999993
    }
]