[
    {
        "text": " Well, good evening. A lot of you have been asking us one question. Why does India's big tech and AI investment story always stop at the southern part of the country? Well, where is North India in this next wave of AI jobs and infrastructure? Tonight that answer finally arrives to Tomto toming its way on front page because Tata Group is planning one of its most ambitious multis- sector expansions in Uttar Pradesh spanning AI jobs power defense tourism and digital infrastructure following a high level meeting between Tatasan's chairman and Chandra Shakharan and Uttar Pradesh Chief Minister Yogi Adityanat this is of cost not a single project. It actually aspires to be a statewide blueprint. So, if you're all set, I'm pretty sure you are. Let's break it down. But before that, please make sure to like, share, and subscribe because, well, you definitely do not want to metouse miss out on this one. Tata Group has proposed the development of a next generation AI city in Lucknau designed to position Uttar Pradesh as a future global hub for artificial intelligence, digital innovation and startups. The AI city is expected to anchor these aspects. AI first enterprises, global capability centers, GCC's, startup incubation, advanced digital infrastructure. So in simple terms, this is Tarta's attempt to build an AI native city outside India's traditional tech corridors and that matters. Why? Because it signals a shift from metro concentration to distributed AI growth. Alongside the AI city, Tata Consultancy Services is set for a massive workforce expansion. TCS plans to scale headcount across Lucknau and Naida from 16,000 plus employees to over 30,000 in the coming years. This expansion deepens UP's digital talent pool, anchors largecale tech employment in the state, strengthens the case for UP as a serious IT and GCC destination. The discussions are also underway for new GCC setups and expanded TCS operations. across multiple cities including Vanasi a signal that this is long-term capacity building a foot and to support the scale up Tata group is partnering with IIT Kpur to train youth across Uttar Pradesh in future technologies including artificial intelligence cyber security data science drones 3D printing space technologies with a clear goal build industry Indry ready talent locally not import it later. In parallel a 48 cr rupees center of excellence in Gorakpur is under development focused on advanced technical training especially for youth from Purvanchut. Tata group also outlined plans to expand investments in Uttar Pradesh's defense industrial corridor particularly across nodes like Jasi and Babina. The focus areas include drones, missiles, defense vehicles, advanced manufacturing. For this, the group has already acquired 25,000 acres of land under Bida in Bundel Khan, signaling long-term manufacturing intent, which is very very critical. There were also discussions around well mobile device manufacturing, electronics and component production, EVs and electric buses. collaboration with Intel to strengthen the electronics ecosystem. This places Uttar Pradesh firmly within India's defense and electronics manufacturing strategy, not just",
        "start": 0.8,
        "duration": 489.039
    },
    {
        "text": "Bundel Khan, signaling long-term manufacturing intent, which is very very critical. There were also discussions around well mobile device manufacturing, electronics and component production, EVs and electric buses. collaboration with Intel to strengthen the electronics ecosystem. This places Uttar Pradesh firmly within India's defense and electronics manufacturing strategy, not just Tata Power operates a 1900 megawatt thermal power plant in Priyagra, a critical asset for the state's growing industrial demand. In parallel, solar power projects are operational in Pyagra and Banda. Rooftop solar programs are being rolled out across 75 districts. Renewable capacity is being accelerated alongside grid stability. So for an AI and manufacturing economy, power reliability as we all know is non-negotiable and this aspect is already in motion. Congratulations on that. Tata Group's hospitality arm IHCL is expanding aggressively in Uttar Pradesh. The plans include increasing hotel rooms from 2,000 to 5,000. 30 new hotels under Taj Selections and Vivanta brands properties across Aayodhya, Priyagra, Vanasi, Vindavan, Agra, Lucknau, Kpur, Gorakpur and of course a lot more. Also a museum of temples in Aayodhya with tech enabled exhibits is already underway with the first phase targeted for January 2027. Additionally, Tata Group will support the restoration of key ponds in Matura Vindavan, cleaning and conservation of major Ganga Garts, which of course translates to infrastructure for religious tourism, global visitors and cultural diplomacy. And today we have clubbed why this matters and the front page take. And here it is. When we put all of this together, one thing becomes very clear. This is basically Tata Group embedding itself into Uttar Pradesh's long-term economic transformation. AI city, 30,000 plus tech jobs, defense manufacturing, power capacity, tourism, infrastructure, skilling at scale. For years, India's tech growth story leaned south and west. Tonight, North India officially enters the AI and digital infrastructure era and Uttar Pradesh is positioning itself as a platform. Finally, the south and west have some real competition now and with that it becomes a fascinating story for India's growth ahead. Please let us know what you think in the comments below. This is Front Page by AIM Network. Like, share, subscribe and always remember think Ay, think I am. [music]",
        "start": 244.879,
        "duration": 821.3269999999997
    }
]