[
    {
        "text": " Welcome to Front Page. Forget everything you've heard about the global chip shortage. Yeah, let it go. While the rest of the world is busy waiting in line, India just shifted into acceleration mode. We are at the finish line of a massive GPU procurement and the government isn't just adding chips. They're of course dropping an additional 25,000 GPUs into the national pool. This is sitting on top of the 40,535 units which are already committed. If this clears, well, India will be operating at a staggering cluster of 65,000 GPUs. And to put it into perspective, a year ago, this kind of scale was a total myth in India. We've gone from wishing for silicon to building one of the most formidable public compute engines on the planet. Today of course on front page why India is suddenly the most economic place on earth to train a model and how 65,000 GPUs are about to change the game for every startup from Bengaluru to Chennai to Hyderabad to Mumbai well you pretty much get the picture all over India according to senior government officials technically technical bid evaluation for the fourth tender is ongoing at least four impanled cloud providers have confirmed participation yacht TA data services, E2E networks, nextgen data center and cloud technologies, sci future India. One bidder has reportedly offered up to 17,000 Nvidia B300 liquid cooled GPUs among the most in demand AI accelerators globally. Others of course are committing Blackwell generation B200 GPUs. E2E networks is 1,024 B200 GPUs expected to go live this month. NextG is at 4,096 B200 GPUs. The deployment over the next few months. Sci future 1,024 GPUs model is still undisclosed. Now we come to Y 8,192 B200 GPUs already committed from the earlier rounds. So far 40,535 GPUs have been committed across earlier rounds. Out of these 22,787 GPUs about 56% have already been allocated via the India AI compute portal. And of course it's still counting. But here's the key friction point. Only around 15,000 GPUs are actively in use today. Not because demand is weak, but because global hardware constraints are very real. Industry players point to severe HBM memory shortages, 650% spike in memory prices, five time increase in NVMe shortage costs, a broader global ND shortage. In other words, basically India isn't struggling to allocate the GPUs. That's not the problem. It's navigating the same supply chain choke points hitting hyperscalers worldwide. And what truly sets India apart is the cost. Under the India AI mission, GPUs are being very heavily subsidized, pulling GPU hour pricing below $1. Yes, the cheapest AI compute anywhere in the world. Earlier rounds discovered high-end GPU pricing around 115 rupees per GPU hour. Already far below global rates of course with government underwriting close to 40% of infrastructure costs effective prices will fall even further. So let's just forget subsidies or government experiments. That's actually old school. This emphasizes that India is treating public compute as national",
        "start": 0.08,
        "duration": 463.11999999999995
    },
    {
        "text": "around 115 rupees per GPU hour. Already far below global rates of course with government underwriting close to 40% of infrastructure costs effective prices will fall even further. So let's just forget subsidies or government experiments. That's actually old school. This emphasizes that India is treating public compute as national highways and UPI, we are now laying down the silicon tracks for the next decade of intelligence. And now of course for the truth which leaves us well slightly unnerved. Even as India talks about sovereign GPUs, edge systems and domestic accelerators, almost everything that matters today still runs on Nvidia H100s, H200's, B200s and now potentially B300s. Tonight's development reinforces a reality. Nvidia is not just back. No, Nvidia is central to India's AI mission. Not ideologically, but very, very practically. That explains why Jensen Huang, founder and CEO of Nvidia, is most likely to attend the India AI impact summit among other AI leaders. And this is why Union IT Minister Ashwini VHNOVA has been pushing the next narrative. India must build its own GPUs. VHN has said India will develop indigenous GPUs in 3 to four years. And here's where it actually gets even more interesting. While we securing the chip, Sedak is playing the long game on the actual silicon, aiming for nextg nodes that move India from user to maker. The union budget 2026 just turned this into a full-scale manufacturing war with India semiconductor mission 2.0 and the 40,000 cr rupees outlay for electronics components manufacturing scheme which is also the ECMS. The strategy is a clear three tier stack. Buy GPUs now which is India AI mission. Build the supply chain semicon mission 2.0 plus ECMS push and build the silicon made in India GPU ambition. And of course, the made in India dream just got a reality check from a Bengaluru startup called Aani Labs. They've emerged from stealth with an $8 million seed led by Peak 15 to build AI GPUs for data centers. Founded by veterans from Intel and AMD, this is no longer something that comes across as a distant dream. The founders are officially entering the arena. My friends, this shift happens just days after Nirmala Sithar Raman announced a 1,000 cr allocation to the India AI mission. We of course moving from policy to infrastructure with a plan that checks all the boxes. AI across agriculture, manufacturing, services, and education. Multilingual AI tools, and a tax holiday for foreign cloud providers until 2047. They're even actually prepping the workforce with 15,000 AI labs in schools and 10,000 technology fellowships. But you know what? Unfortunately, even at 65,000 GPUs, we are lagging behind the brute force of the United States or Chinese hyperscalers. Some single US companies already operate clusters larger than India's entire public stack. So India's different playbook has to be this cost discipline not capital burn access not closed labs and domestic model building not perpetual dependence. You know what this does? It unlocks for",
        "start": 231.84,
        "duration": 881.3599999999999
    },
    {
        "text": "United States or Chinese hyperscalers. Some single US companies already operate clusters larger than India's entire public stack. So India's different playbook has to be this cost discipline not capital burn access not closed labs and domestic model building not perpetual dependence. You know what this does? It unlocks for simple cheaper training runs larger fine tunes and equal access whether you're a tier 2 university or a Bengaluru startup. And of course here as always is the front page take a year ago we admitted we have the talent we have the data but we don't have enough compute. This move toward 20,000 25,000 more GPUs doesn't magically win the race. No, but it turns compute into public infrastructure. It buys us time for Indian accelerators and fabs to catch up. I guess being late might actually allow us to leaprog by avoiding the capital heavy mistakes others have already made. Please do let us know what you think. Is 65,000 GPUs enough to spark an Indian AI spring? This, ladies and gentlemen, is front page by AIM network. Like, share, subscribe and always remember, think AI, think India AI mission, think A IM. [music]",
        "start": 443.36,
        "duration": 1012.621
    }
]