[
    {
        "text": " Inhosis reported its Q3 numbers and everyone was waiting for one thing, AI revenue. Because this quarter, the comparison was unavoidable. TCS is openly talking about a $1.8 billion AI run rate. Accenture is putting AI numbers front and center. ACLT has started showing how the money is flowing, but emphasis complete silence on that front. What it did though was offer activity. 4,600 AI projects, 500 agents, AI work touching almost 90% of its top clients. Great. Awesome. But it also sounds carefully and calculatively incomplete. This ladies and gentlemen is front page. And tonight we want to understand is emphasis playing a longer smarter game or avoiding a number it doesn't want to show you. If you're ready let us find out what do the numbers reveal. Revenue up 45,479 K rupees. That's almost a 1,000 cr rupee jump in 90 days. The profit down sliding 2.2% 2% to 6,654 cr rupes. Why? Well, because the future is expensive. There are wage costs, labor codes, and the massive bill for building AI capacity. But what stood out on the other hand, $4.8 billion in large deals. 57% of that is net new, which is a recovery. Guidance is raised to 3.5%. Sure, there's a lot happening inside the business. Absolutely. But the market looks for one clear signal which is if AI needs to show up as a number and that signal still remains fuzzy till that happens. But you know there is something which we notice in the discourse which is split. Competitors say look how much money we make from AI. Inhosis says look how much AI we actually use. They released the scale metrics. 4,600 projects live. 28 million lines of AI generated code. 500 AI agents deployed. The Devon partnership. It was not a PR stunt. Devon is live inside client systems as we speak. Emphasis argues that AI isn't a product. They say it is the new operating system. For them, it's more like the air, you know, supply. And their logic, you can't bill for the air separately. Not at all. But of course, we think there is a deeper reason for the silence. We'll get to that in a second. Emphasis is betting on one formula, human plus agent plus fabric. Topaz fabric is their lair. It's in engineering. It's in data. It's in risk. They are positioning themselves not just as a service provider but as a distribution engine. Startups like Cognition and many alike need emphasis to get into the Fortune 500. We of course had covered this in our emphasis as distribution engine episode. Please watch it. It gives an incisive viewpoint. It is time that I of course now address the young engineers watching. Hello. Hope you're doing wonderfully well and please listen to this very closely. TCS cut 11,000 jobs and Infosys is hiring 20,000 freshers. But you know what? Wait, it is not celebration time as yet because two",
        "start": 0.24,
        "duration": 465.038
    },
    {
        "text": "It is time that I of course now address the young engineers watching. Hello. Hope you're doing wonderfully well and please listen to this very closely. TCS cut 11,000 jobs and Infosys is hiring 20,000 freshers. But you know what? Wait, it is not celebration time as yet because two the engineers who control the agents. India B the engineers who write the code the agents can now write emphasis is interested in India A they are rolling out specialized engineer roles starting salary 22 lak rupees sounds nice of course they are willing to pay but only if you are elite if you're average you remain invisible so of course we hope that with this clarification all of you determined engineers ers will find your path to success. That is truly our wish here on Front Page. Oh, and before we go into the front page take very quickly, a fact check on the US visa drama. Emphasis was clear. No one was apprehended. One employee was denied entry. One wond they are continuing the process, but they are moving the work to distributed delivery. The message, we don't need to be in the United States to run the United States. And as promised, now the front page analysis/take. Why hide the AI revenue? Why is it a mystery? It could be because reason one, cannibalization. AI automates legacy work. If Infosys shows $1 billion in EI revenue but loses $1 billion in legacy maintenance, the net growth is zero. They don't want to show the substitution effect. Reason two, the TCS trap. Once you give a number, the market demands it goes vertical. Infosys refuses to play that game. Reason three, strategic ambiguity. They want to signal that AI is everywhere, not just a SKU on a bill. Inhosis is transforming from a body shop to an agent carrier. 4,600 projects, as we mentioned, don't happen by accident. It is definitely a redesign of the enterprise. And of course now we would like to request for your inputs because we want to know are you team India A or are you worried about India B. Please do let us know in the comments below. This is of course front page by A IM network. Like share subscribe and always remember think AI think aim. [music]",
        "start": 232.799,
        "duration": 765.3760000000001
    }
]