[
    {
        "text": " This is Front Page by Aim Network. We are proud to say that we have been at the forefront of tracking quantum computing and tonight that story just got a massive boost. A Norway based European investor DSA Holding as has signed a letter of intent to invest up to $2 billion into India's quantum and deep tech ecosystem in partnership with Inaugur Ventures. Inaugurus Ventures is an India based venture builder working with founders and institutions in deep tech from quantum to frontier technologies. It actually helps turn early ideas into real working businesses and it's been doing it for a while and of course this is one of the largest private investment commitments ever proposed in India's quantum ecosystem. The commitment includes support for greater Karnavati quantum computing technology park, greater Nida robotics technology park, Indra quantum data center plus support for IIT Gandhiagar, JSS University, early stage deep tech startups working in quantum AI, robotics and advanced computing. So which basically indicates that this is an ecosystem construction. Then we come to another critical layer which is alongside this letter of intent. Norwegian green solutions as has signed anou to power these tech parks and data centers using renewable energy ecosystems. This is truly very encouraging and of course joining us today is Sumant Parimal, founding partner of inaugures who of course will help us understand this a lot better. A bit about Mr. Sumant. He is a very senior global industry leader with 27 plus years of experience across business management, consulting, research and execution of transformative technology and infrastructure projects. Today he stands at the center of one of the most important developments in India's deep tech journey. Summans, a very warm welcome to front page. We are thrilled to have you with us. Thank you. Thank you. way I am team I mean literally thanks to the entire team and you for hosting me today and for bringing the insights of this great journey which we are doing in India to propel the speed of innovation through deep tech innovation. So, so I mean on behalf of my entire partnership ecosystem, I would like to thank you all and I mean you are one of the first person to break our earlier story also in 2021 when we actually proposed setting up the India's first quantum technology park in Gujarat and again we thank you and for this entire conversation. Thank you so much and it's a true pleasure having you with us sir on front page. let's actually just set the context first for all of our viewers. How should India make sense of what just happened? Suma of course this is the dedicated efforts of our prime minister Modi G to project India as one of the global destination for global high-tech ecosystem including semiconductor to electronics to now quantum computing and of course other areas like AI and deep tech. So it's it's in you know is",
        "start": 0.64,
        "duration": 407.599
    },
    {
        "text": "course this is the dedicated efforts of our prime minister Modi G to project India as one of the global destination for global high-tech ecosystem including semiconductor to electronics to now quantum computing and of course other areas like AI and deep tech. So it's it's in you know is this entire ecosystem which is getting built up by the dynamic leader of our prime minister sir and other other tech leaders of India and this this is the two billion LOI which we got recently from one of holding company is the actually confidence shown to our business plan as well as our partnersh plans. And of course the biggest gainer is India. The country as a whole is a gainer because it's going to boost the fers further confidence of international investors in deep tech. So in in classical technologies so far in electronics and other it we we have a lot of funding coming across the broaders particularly in consumer technologies and fintech technologies. But when it comes to deep tech, these are the first big ticket outside FDI coming to India, I mean still it is in channel, it's still in pipeline. I said it's only LOI so far. We have to make it to happen with all all our efforts, combined efforts. Thank you so much. Given your experience of more than 27 years, sir, we do not have even a shade of doubt for that converting. But before I move on very quickly, I would like for you to please share with all of us how does inaugures feel because it's a big win as I mentioned earlier that this is the biggest investment yet as far as the quantum ecosystem of India is concerned and at the center of it all is inaugur. of course you have shown gratitude towards the prime minister and of course the entire ecosystem and of course the country is very very happy. But very quickly if you would like to please share your sentiment as inaugures it would be nice. Yeah. So we are working in deep tech ecosystem creations almost now 10 years. So it's it's not one day achievement. We are walking since year and year you know without recognition without any critical support but slowly the ecosystem is falling around in supporting us and now the Gujarat government recently signed theou with us for creating this greater karnati quantum computing tech park venture you know as a venture and they are likely to partner we have already invited them to be part of this SPV. So yesterday when news broke that in GIF city the Gujarat government is promoting a AI center in PPP model. similar kind of model. We are looking forward for the Gator Karnati quantum computing tech park also where the private players like inaugression and partners actually collaborate with the government players like department of science and technology, government of Gujarat, department of science and government of India, IIT",
        "start": 204.159,
        "duration": 742.7989999999999
    },
    {
        "text": "PPP model. similar kind of model. We are looking forward for the Gator Karnati quantum computing tech park also where the private players like inaugression and partners actually collaborate with the government players like department of science and technology, government of Gujarat, department of science and government of India, IIT institutions and government supported organization like model for bringing investors and innovation in in a in tech park format. So that is our agenda. We don't want to move alone. It's not only in projects but it it's the projects of the entire nation, entire partner ecosystem and entire tech entrepreneurs. So tech entrepreneurs are our biggest assets. So so this entire park which we are promoting in Gujarat are by the tech entrepreneurs for the tech entrepreneurs and for the the tech professionals you know. So I I'll attribute to them nice and very very encouraging sir. So of course as we as we move on Shri I'd like to understand the fact that what fundamentally changed in the global perception of India that allowed a $2 billion commitment like this to happen now few things is this confidence in policy sir capability or the market opportunity or for that matter execution maturity so I'll I'll say all all three three four combined you know it's it's the policy confidence of course I mentioned during the start of my discussion that is ultimately is the efforts of prime minister Modi G which is actually gaining helping us to make this kind of traction right and second thing the the hunger for growth now India is actually creating hunger for growth in not only in the consumer tech fintech and the and the brick and motor based business ecosystem but also in deep tech ecosystem system. So that hunger is also driving [clears throat] and the third of course is the large economy of India. Now today it's it's standing at the fourth in the worldwide the fourth in the GDP. So that is attracting the global investors you know that there is a money in Europe and America but there are no scale there you know in America you can have still a scale but if you see the European countries you know so the money is there but the scale is not there. So it's for their for the market they are coming to India but the good thing is earlier the end products used to see the market in India but now the end products are going to be manufactured here in India under the make in India initiative of honorable prime minister Modi G but at the same time the the funding gap which India has is coming from the some of country countries like Norway is one of our partner countries similarly UK is also our partner country Germany is also there So these are the country which are going to bridge the capital gap we are having for innovating and you",
        "start": 374.8,
        "duration": 1070.721
    },
    {
        "text": "which India has is coming from the some of country countries like Norway is one of our partner countries similarly UK is also our partner country Germany is also there So these are the country which are going to bridge the capital gap we are having for innovating and you India. sir I wanted to just very quickly ask you $2 billion is a huge amount of an investment. And we are of course at the LOI stage right now as you just mentioned of course a lot of your work will start now for it to start to get converted but would you maybe be able to shed light if possible that will this investment come through in a phased manner? how how will it work in terms of the way it will from here start to take shape? So I will add here that two billion is tips of the ice work. If we have to build the large ecosystem of the deep technology and make India one of the leading nation in deep tech then probably we have to inject 10 billion over 10 billion US dollar in this entire ecosystem. So our own three projects which you have seen starting from greater karnati quantum technology park India first quantum technology park which we proposed to government of Gujarat in vibrant Gujarat 2022. So that itself will require 5 billion plus dollar to give it a you know the reason because you know the the compute infrastructure and the deep tech facility creation and the infrastructure building is very costly right now. So so so if you consider bringing a quantum computer of course India is also developing its own quantum computer but I'm saying if if good good technology some partner quantum computers shall brought to India that itself will required one quantum computer may require around $200 million to $300 million of investment. So in data center a quantum data center we will be bringing you know hundreds of quantum servers as a AI server. So these are the big big capex game you know and similarly we are installing the quantum chip fabs in in dera so for even one technology now you understand there are four five quantum technology even one technology fab will required up to thousands of kores rupees of investment. So if we are installing four to five type of fabs starting from superconducting to photonics to you know atom trap to spin cubits. So it it will the fab itself may cost five 5,000 K rupees of bill. Wow. So so these are the deep tech investment you can see but of course not as big as semicon. So if you see the semicon fabs they're more costly it is attracting up to5 billion dollar up to5 billion capex you know one fab is build up at dera by data electronics. So if you see their capex that is a huge capex. So of course",
        "start": 540.48,
        "duration": 1394.6400000000006
    },
    {
        "text": "big as semicon. So if you see the semicon fabs they're more costly it is attracting up to5 billion dollar up to5 billion capex you know one fab is build up at dera by data electronics. So if you see their capex that is a huge capex. So of course of capex. We are still you know bit bit smaller compared to so semiconductor capex right but but but it's a good start sir. Yes it's a great start. So two billion is not enough. We have to raise many more such big tickets investments and interest from the global investors. Fair enough. But with this start and of course your experience and of course the way the entire policies are working I'm pretty sure we should be able to start achieving that and a lot quicker. Now I just wanted to now come to this fact sir you had of course mentioned the karnavati project you had mentioned the greater noa robotics you of course then there are the collaborations with IIT Gandhi JSS University and the startups etc. So the first thing I'd like to ask you is how do these pieces come together? Are we building research hubs, commercial platforms, sovereign tech capacity or a fusion of all three? It's essentially fusion of all three. Though research are happening right now in IITs including IIT Gandhi Nagar, IIT Mumbai which have been declared as one of the hub under the national quantum mission for the sensing and similarly in Kanpur is also our collaboration partner as well as partner in the national quantum mission and similarly we are also in discussion with IIC Bangalore which have been declared as a quantum computing hub and C dot along with IIT Madras they have been declared as quantum communic ation hub, IIT Delhi being declared as you know quantum material hub. So all these four hubs and other associated IITs we are collaborating with them. We are not looking for anything. we are not into a mode of eclatural rather we are we are collective effort and and they all need the money because what I feel that even the nanqu money is not sufficient to catalyze the the kind of innovation and the productization we need in national quantum mission. Right? So, so even we proposed to national quantum mission that hey even if you deploy small capital out of the national budget you have for the national quantum mission in our this ecosystem park ecosystem that we will make sure that we will attract the large FDI based on those investments fueling the growth of the tech infrastructure deep tech infrastructure in India right so we we we are requesting these kind of PPP model with the government of Gujarat as well as the government of Uttar Pradesh And of course the government of India also right sure so of course is not the approachi for sure is the approach",
        "start": 704.079,
        "duration": 1720.2400000000002
    },
    {
        "text": "infrastructure in India right so we we we are requesting these kind of PPP model with the government of Gujarat as well as the government of Uttar Pradesh And of course the government of India also right sure so of course is not the approachi for sure is the approach quantum mission alignment aspect sir I very quickly wanted you to shed light on this s what is this ecosystem as you mentioned actually look like in operational terms how will that work I'll tell you I mean see the fund is arriving at the venture level you know and before that we we want couple of our holding funds in in the European location those are the financial big centers like like in Singapore or London even even this Netherland based funds and this Norway based funds. So these are the financial hubs. So there we are actually creating a rooting pipeline which are compliant with the RBI FDI policies you know. So then these funds are lending to the innovous venture rooting these fund and deploying these funds in its SPV and ecosystem. So essentially three SPVS and are three and maybe more we have to couple of more SPV we have to form. So apart from that these the partnership with our startups our we have now around 30 plus quantum startups under our umbrella in this ecosystem. So now these startups required funding. So the most of these startups are early stage startups. So though they have applied for national quantum mission fund and af funds and other government of India and state government funds but these funds are not significant. So they needs even 10 10 K plus kind of funding. So we are trying to bring those funds also through the inog venture route. So the entire operation of is that this venture arm is going to fund the SPVS project SPV which you have already taken the name that is in Gujarat Gateri quantum technology park in UP NOA robotics technology park and one data center we have planned in quantum space in UP in Noa that is Indraas quantum data center right of course so these are the projects through which this project SPB through for which this venture arm will be rooting the fund And another rooting will be the startup fund of fund under the inog umbrella which will be rooting the fund to the our startups. So as I said 30 plus quantum startups are part of our ecosystem and most of these startups are need of the urgent need of the fund to to to sustain their innovation what they are doing otherwise in next one to two year they will die if the funding is not provided to them. Wow. Wow. So a very crucial and a very critical role that is being played right now as far as inaugur is concerned. So now of course coming to the mission alignment aspect where does the",
        "start": 869.519,
        "duration": 2048.319000000001
    },
    {
        "text": "to two year they will die if the funding is not provided to them. Wow. Wow. So a very crucial and a very critical role that is being played right now as far as inaugur is concerned. So now of course coming to the mission alignment aspect where does the does this DSA holding partnership plug-in sir does it accelerate the national quantum mission complement it or expand its ambition beyond what was originally planned? So a national quantum mission I'm not authorized to comment too much but yeah I was one of the we were including my startups were applicant to most of these proposals which are coming funding proposal which are coming under national quantum mission. So so of course see if this FDI gets gets executed I mean we are we are still at the LOI phase which will serve fingers crossed trust me. Yeah. LOI to final mandate takes some time because a lot of due diligence need to be done lot of DPR and costing cost aspects and cash flow aspects need to be done. So these these FDI is going to actually propel the innovation which are happening through national quantum mission. So are essentially in alignment because the innovations are right now at T mostly in TRL3 level TRL3 to TR4 level in most of the labs which are getting funded through national quantum mission. Our idea is to set up largest productization facility in quantum technology and deep tech in these two parts you know so that whatever innovations are happening in these IITs and national quantum mission funded startups and labs get productized and commercialized at the park. So we will do the large scale manufacturing large scale integration and setting up the large scale global supply chain based from India Indian states like Gujarat, European or maybe the other other locations also. So so the entire thing is happening in hub as a spoke model. So a hub is of course there are a couple of us of course one is hub is in venture then other hubs are hubs which are funded by national quantum mission. So we are looking forward to operate along with them and collaborate with along with them and then spokes are like SPVS and other other institutions like IIT Gandhiagar and other partner institution and partner startups through that the hub spoke model we will strengthen this entire national deep tech ecosystem and quantum tech ecosystem. Great shot in the arm sir the way you've explained it right now to us and of course the audience that it's a great shot in the arm for the overall ecosystem which brings me to this thought which is that as far as the global competition is concerned you just mentioned a while back regarding the fact that India definitely has the talent and you' compared it with America but with this particular thing where does India stand today in that race",
        "start": 1036.799,
        "duration": 2376.878000000001
    },
    {
        "text": "brings me to this thought which is that as far as the global competition is concerned you just mentioned a while back regarding the fact that India definitely has the talent and you' compared it with America but with this particular thing where does India stand today in that race the top tier of quantum and deep tech nation So of course see the global race is on right now for becoming the tech leadership. So earlier we understand I have grown in American driven technology ecosystem you know and some extent you know European driven technology system also when I started my career as a in age and you know tech professional in early 90s you know we had mostly the protocols coming from Europe tech protocols and and tech devices coming from Europe or America we hardly any Chinese-based technologies I mean the devices available in those times But we could see in last 10 years how China evolved. Now in quantum tech they are actually giving the true competition to us. So leadership slots are actually evolving from you know like what we say musical arm chair race between America and China. So sure sometime you find that China is ahead of America you know. So, so if if India has to top get into top more slots, then it has to not only com compete with the with the American ecosystem but also with the Chinese ecosystem and chi Chinese technology standards. So sir sorry you were saying sorry yes huh please sorry go ahead sir please go ahead I I I lost you for a second that's one of one of the challenge is not only know how but the speed of squs is also very important to keep India into topmost slot so right now we are lacking the speed of innovation to be very frank with this even conceptualizing such kind of project and bringing to this stage took four to five year for us. Wow. So which is not good. Which is not good. So China is doing everything in within one year. Wow. Fair enough. Fair point sir. So I guess we understand this very clearly that where we stand today is that we really need to you know pull our socks up and make sure that the speed of execution is something that is given a hell of a lot of owners. Which brings me to this very quickly sir regarding the fact that you know there is a delay or there is a speed of execution there is a problem the logical point the brain goes to the aspect of brain drain for example if it's there but it's not still under execution is still not started so does that at some level or the other maybe you know discourage the talent how do we retain the talent develop advanced capacity at home and make deep tech careers viable domestically very quickly if you could please tell us that.",
        "start": 1201.679,
        "duration": 2707.4379999999996
    },
    {
        "text": "not still under execution is still not started so does that at some level or the other maybe you know discourage the talent how do we retain the talent develop advanced capacity at home and make deep tech careers viable domestically very quickly if you could please tell us that. ventured on social media lot of NRI based tech professionals shows interest to to get involved in that. So that is a significant change. So they are looking forward to come home to build you know similar kind of tech capabilities in India. So but I'll say only thing only you know problem here is that we don't have that much cap capital available to attract such kind of talent and also the environment is not up to that mark but of course if we work on the overall environment facilities here in in India and also the the funding I mean their their their aspiration to earn higher you know if we can fulfill these two three parameters then they can be easily targeted for coming back to India which is fine and I think you have really highlighted a lot of very important aspects and I'm pretty sure the people who are the policy makers and for because you yourself sir are part of that entire system so I'm sure you are constantly reminding them of these things and of course whatever initiative that you are taking as far as inaugures is concerned what is the timeline looking like sir if I were to talk about 12 months 3 years and one decade what does success look like for you? So, of course, it is not going to be a big bang thing because I said we don't we lack in the capability like China. China is known for big bang transformation and big bang executioner projects you know. So, I myself have gone for executing IT projects in China. I've seen the kind of commitment the Chinese engineers and workers are giving for building their nation are actually not we are not working that much hard and of course I don't want to touch that point you know that point was several time touched by honorable Naran Morti G but my point is that we should be in urgency mode to build our country if we we want to be tech leader you know otherwise we will be very good mass consumer right so so so if you believe that my one-year timeline is to make things moving. So right now we have just started some operation in in the karnati this thing project by incubating our few startups and partners in IIT Gandhinagar and also in Aawad area. but I think that speed we have to multiply. So you know some procedural gaps and hurdles we face here and there you know. So I think the bureaucratic channel need to be aligned with this entire flow of the project so",
        "start": 1370.4,
        "duration": 3016.3160000000007
    },
    {
        "text": "in IIT Gandhinagar and also in Aawad area. but I think that speed we have to multiply. So you know some procedural gaps and hurdles we face here and there you know. So I think the bureaucratic channel need to be aligned with this entire flow of the project so delay in wherever we need the help of government or the local administration. So like now there is a a big procedure for applying to land and getting the land and taking possession of land you know you know then then the funding problem they will ask to like UP government you know we haveed them so many time that you you should actually kind of give some consideration in we are also startup mode so we will not be able to do similar kind of paperwork like big big corporate does for applying to the hand. So just give us some support out of the way. But now they they afraid that if they support out of the way then their job will be in problem. So these are like typical you know because we are not safe in quantum security. You know we are a constant threat from China if the sec tech security is concerned you know. Sure. We need to move fast you know. Understood sir. Of course in conclusion sir I mean you the points that you've raised are so poant and very serious. but if we were to for example ask you this finally what is your expectation given the fact that you have been dealing with all of this but of course there has been a big encouraging investment which has been made of $2 billion I do say I do understand you said it's just the tip of the iceberg but at least a good start how are you looking at 2026 as per as your expectations are concerned 2026 of course is going to be very hopeful here for us. Not only for us, our small partner, one of our key partner E- Green quant just a few day back they have got very encouraging news for their quant quantum radar project. So the Indian defense forces have actually started giving seed funding to them for developing the quantum radar. Similarly, couple of our partner startups like Sube and Han space. The Han space startup recently got incubated under our ecosystem park ecosystem at IIT Gandhiagar. They are also working in quantum sensors. So they they are getting the traction from ISRO and DRDO defense organization. So these these our own Indian organizations are coming forward and to safeguard the national security and they they are trying to invest into quantum tech ecosystem and startups. So that is a great news for us and Inog is there to enable such partners from funding as well from the facility creation in the park right. So we we Inogress are for facilitating such kind of startups and the huge cases which are",
        "start": 1527.679,
        "duration": 3349.4370000000004
    },
    {
        "text": "quantum tech ecosystem and startups. So that is a great news for us and Inog is there to enable such partners from funding as well from the facility creation in the park right. So we we Inogress are for facilitating such kind of startups and the huge cases which are defense, Indian enterprises. You know there are lot wonderful lot of huge cases are going to come in quantum technology and so those huge cases we are also going to kind of strengthen through this entire ecosystem which we are building. Fabulous sir thank you so much for being here with us on on front page. I just have to say this it has been truly a very educational discussion that we've all had. I'm pretty sure our viewers also would be very very excited to hear all of the developments also some areas of concern as you mentioned but of course we at front page wish you inaugures the entire ecosystem a very happy new year and thank you so much for ending the discussion on a high note on something which thank you thank you so much thank you to the entire AI team and you and really I wishing wishing you all from Inogress and our partners. A very happy new year to you all and we look forward and collaborating together to to keep this traction happening you know in quantum space and AI and deep tech space and so that India achieves the new heights in innovation and tech leadership. Thank you again. Thank you. Thank you so much sir. Pleasure. Yes ladies and gentlemen you ha there you have it. the gentleman who's a veteran. He's been with more than 27 plus years of experience. He spoke about the fact that yes, it is a good start but it is just a tip of the iceberg. We need to accelerate. We really need to bring in speed of execution. There is a musical chairs which is going on between the United States and the fact that and China but India needs to of course pull up its socks as far as policy as far as the entire ecosystem is concerned to really surge ahead and make sure that we are starting to make an impact. I'd just like to leave us with a very encouraging note as he had just mentioned. He mentioned it is not atlao but it is definitely cheri. This is front page on a IM network. Like share subscribe of course think AI and as we always say this with a lot of pride think quantum think aim.",
        "start": 1708.32,
        "duration": 3620.075
    }
]