[
    {
        "text": " Good evening. So if you're looking at the scoreboard, don't waste your time because the real game isn't happening on the pitch at Bankaday, Chinaswami or Eden. It is a nailbiter taking place on the boundary boards. Yes, you heard that right. Cricket in India has been simple and beautiful. It is an emotion, an identity, a religion. Last season, the IPL touched a billion lives. TV, digital, pretty much everywhere. The WPL, well, which is riding on the World Cup high, growing faster than a tech stock. And you know what? The sponsors are changing. The cola wars are dead. The soap operas are long gone. Welcome, ladies and gentlemen, to the AI wars. So if you're ready in the blue corner, Google Gemini just declared a massive number approximately 270 cr rupees for 3 years. IPL sponsorship entailing hoardings, backdrops, prime time real estate. And now in the red corner, OpenAI, the disruptor, they have made their way onto the field months ago, a two-year deal. Women's Premier League, different tournaments, identical ambition. Their fight has moved beyond San Francisco to Bengaluru to Mumbai and well also in your living room. Why you ask? Because India is beyond the market. It's actually the prize. But why cricket? Why now? Because it's about habit. AI is cool, but it's not a daily utility for everyone as yet. These giants need to become our muscle memory. Cricket delivers what Silicon Valley can't buy with algorithms. Unmatched reach, a billion eyeballs, and above all, trust. We watch with our families and we trust the brand next to our favorite captain. And they want to be the AI you use, the default, if you will. Looking at OpenAI's play, they are scaling fast. Revenue crossed $20 billion annualized. Sounds huge, right? But the burn rate is also very explosive. Computing costs are eating them alive. And here is of course the very interesting part. Ads are coming. They are already testing them in chat GPT. India is their largest active user base. They need to bridge the gap. So from cool party trick to everyday necessity. From a research lab to a consumer giant. And cricket gives them the cultural legitimacy. When the ads finally roll out, they need you to actually recognize the logo. Now, if we look at Google, Deis Habis stood at Davos and said this, \"Gemini won't show ads.\" End quote. At least not inside the chat. But you know what? Don't let that fool you. Google plays a more calculated game. Gemini is already in your pocket. Search, Android, Gmail, Workspace. They don't need ad revenue from the bot. They need you to stay in the Google universe. Gemini is ad supported. The ads just don't appear on Gemini. Quite clever. I thought the IPL deal of course reinforces dominance. It's distribution theater. Keep the brand visible, keep the users passive, win by default. Now, do you see the pattern? Fantasy gaming",
        "start": 0.24,
        "duration": 411.44000000000005
    },
    {
        "text": "to stay in the Google universe. Gemini is ad supported. The ads just don't appear on Gemini. Quite clever. I thought the IPL deal of course reinforces dominance. It's distribution theater. Keep the brand visible, keep the users passive, win by default. Now, do you see the pattern? Fantasy gaming Then of course, regulation hit, taxes hit, 7,000 K rupees pulled out of the ecosystem. A vacuum opened up. Traditional advertisers got cautious. Who stepped in? The AI platforms. AI is the new fantasy sports. But the ambition is terrifyingly larger. This isn't just about picking a team. This is about becoming the operating system for intelligence. Both sides know the truth. The marginal user in India is the cheapest to acquire. But they define the global winner. Whoever wins the Indian recall wins, yes, you've guessed it, the decade. And here, of course, is the front page take. So, the next time you see a six hit into the stands and the ball hits an AI logo, understand what you are seeing. It's not sponsorship, it's positioning. They are buying your familiarity. They are, of course, renting your attention. The revenue comes later, my friends. The logos today are for the habits of tomorrow. India is the pitch and the match. It's just getting started. Ladies and gentlemen, this is Front Page. Like, share, subscribe, and always remember, think AI, think I am. We'll take a short little break and we'll be back with lots more only on Front Page.",
        "start": 205.519,
        "duration": 572.4800000000001
    }
]