[
    {
        "text": " Naval Raviant once said h said a line that hit the industry like a cold splash of water. He said all the American AI companies talk about sharing the wealth but all the top open-source models are Chinese. End quote. And this week that didn't just feel like a guess. It felt more like a prophecy. While the West was busy watching XAI updates and refreshing OpenAI's status page, China released five frontier grade models in a single 7-day window. If you're, of course, a developer right now, you aren't just keeping up. You're basically trying to stay dry in a rainstorm of code. Let's look at the names so we don't miss the scale of what just has taken place. Kimmy K2.5 from Moonshot AI, GLM5 from Zippu AI, Quen 3.5 from Alibaba, Duaba 2 and Cance 2.0 from Bite Dance, and the M2.5 update from Mini Max. Five major releases, one week. In the United States, we measure progress by how human a chatbot kind of feels, but in China, they're measuring it by worker capacity. The pattern here is quite unmistakable. They are shipping open weights that are multimodal by default and remarkably cheap to run. First, let's start with Moonshots Kimmy K2.5. This is a manager and not just a mere chatbot. Imagine you're running a massive logistics company. Most AI today is like having one very smart intern who can answer one email at a time. Kim K 2.5 is more like having a swarm of 100 specialized floor managers. One checks the inventory, another truck tracks the trucks and of course a third handles the invoices all happening simultaneously. Then of course Kimmy uses a sparse expert architecture with one trillion parameters in total but it only wakes up 32 billion at a time. It's the difference between hiring a specialist for every problem versus trying to find one guy who knows everything about everything. It's moving the goalpost pretty much from the best answer to the best worker. I think we figured that out by now. Then of course there's Zippus is GLM5. Zippu is moving the needle from wbe coding where the computer just guesses the next line to agentic engineering. We're talking about a model trained on 28.5 trillion pieces of data, my friends. More importantly, it's built to run on domestic Chinese hardware, specifically Hui Ascend 910C chips. This is a direct response to the Western export controls that we had covered on front page earlier. The goal is a high functioning system that operates independently of Washington's supply chain. In fact, GLM5 has already cracked a 50 on the intelligence index, outperforming Gemini 3 Pro and GPD 5.2 codeex in administrative and long horizon agent task. Then at number three is Alibaba's Quen 3.5, the big shift, which is native multimodal support, not an add-on, not an not a patchwork anymore, built into the next generation Quen line itself. Reports around the release window pointed to multiple sizes",
        "start": 0.32,
        "duration": 428.4799999999999
    },
    {
        "text": "codeex in administrative and long horizon agent task. Then at number three is Alibaba's Quen 3.5, the big shift, which is native multimodal support, not an add-on, not an not a patchwork anymore, built into the next generation Quen line itself. Reports around the release window pointed to multiple sizes variants and Quen's next architecture direction showing up via developer pull requests and tooling support. The translation to all of that Quen is trying to be the default open enterprise workhorse. The model you can ship everywhere cheaply across stacks. But then you know the moment which is the magnum opus story which is bite dance. Most people still think of them as the Tik Tok company. But the reality is that bite dance is becoming the master of inference economics with dual wow 2 and sea dance 2.0. They are pushing video generation to a level of physical realism that makes western versions look like well claimation. And because they own the distribution, Tik Tok and Doin, they can ship these capabilities to hundreds of millions of users instantly. And of course, finally, let's talk about Miniax. Miniax has been signaling new iterations in its models line right in this same launch window with the market watching for coding focused improvements. And of course, the meta point is quite simple. China is trying to win by flooding the field. So builders always have a good enough model that is cheap, openish and fast to ship. Now of course consider the physical reality. AI is essentially an industrial process that turns electricity into intelligence. And while the West argues about grid capacity, China is building power at a staggering rate. In 2025 alone, they added 430 gawatt of solar and wind. To put that in perspective, that is twice Germany's entire power generation capacity. Wow. And that too was added in a single year. China is scaling the manufacturing. It is scaling the power and of course the chips at a speed that turns the frontier gap into a memory. It's like everyone is arguing over who has the best car while China is very busy building a 12 lane highway. And here, of course, as always, is the front page take. So, if you're ready for it, here we go. So, has China surpassed the United States? If you measure by closed labs and safety papers, maybe not. But if you measure by actually putting top tier intelligence into the hands of developers for pennies, the answer is getting quite uncomfortable. China isn't just catching up. They are actually now starting to change the rules. They are building a stack that is open enough to spread and fast enough to keep the west in a permanent state of reaction. Very interesting. This ladies and gentlemen is front page. Like, share, subscribe and always remember thinky I think I am.",
        "start": 215.12,
        "duration": 774.8810000000001
    }
]