[
    {
        "text": " Good evening. And I'm sure you have also observed this that every time India talks about AI, the same question does the rounds. Why aren't we building a GPD5? Why don't we have our own Stargate? Why does it feel like we're always a step behind? But unfortunately, here is the uncomfortable truth. Those questions assume everyone is playing the same game. The US is building AI dominance. China is building AI control. India on the other hand is trying to build AI at population scale for languages, voices, farmers, courts, cyber crime and public systems. And those are not the same problems. So tonight on front page we are asking something harder and more important. Why India's AI mission looks slower on the surface? Why comparing it to target is fundamentally flawed? and what kind of AI India is actually trying to build. Joining us is the journalist Palavi Chakravarti who broke this story, spoke directly to the India AI mission CEO and has tracked every hit, miss and milestone of this very journey. So if you're ready, let's get into it. A big warm welcome to you Palvi on front page. Thank you so much Sep. Thank you for the warm welcome. Pleasure having you with us. Of course, let's dive deep into it and understand and start with the timing of things because that's where pretty much most questions begin. Why did it take until 2025 26 for India to seriously fund LLMs while the US, China and even smaller ecosystems moved years earlier. I believe you know there are fundamentally few things like one is that you know India optimized for services and not really frontier research. So you know for two decades India's tech success was built on IT services SAS and applied AI. These models reward talent and scale without demanding billions in upfront capital. Frontier LMS you know by contrast they are capital incentive they they require a lot of investment. So you know the it's easier for us and China to build them quickly as against India. So which is why you know of course you know we jumped the bandwagon much later than they did. But fundamentally you know one is that there's also the fact that you know there's I probably I particularly think that India it you know it needed to be nudged. So you know when deepseek it came out so then that's when you know India really woke up that you know okay fine. So now that China has finally you know come out with their own version of Chad Jupit we also need to do something and which is just about a couple of months later India AI mission was launched of course then there is this thing about talent as well you know we don't have people who are you know very highly trained in AI and to build LLMs you require that kind of talent which is mostly picked up by the big tech",
        "start": 0.4,
        "duration": 370.32000000000005
    },
    {
        "text": "India AI mission was launched of course then there is this thing about talent as well you know we don't have people who are you know very highly trained in AI and to build LLMs you require that kind of talent which is mostly picked up by the big tech know Indian Indian companies they can't afford them. So that is again a very big reason and thirdly of course our policies and government they are you know we are fundamentally we are kind of followers we don't we are not innovators you know so which is why we we follow very well we are probably one of the best in following any kind of technology but when it comes to research and innovating something that is when India lacks and that these I believe are the precisely the reasons why you know India was And before you know it was like a cusp period 23 24 and that's when you know like India felt that probably this is the time that we need to join otherwise we'll probably completely miss the bus. Before I move on I need to ask obviously ask you this. You had made you made a big statement that we have very good followers not very good innovators but do you see that maybe changing? it is changing to definitely to an extent but you know the thing is that we took a lot of time to even imagine that we should be building our own LLMs you know because of course I mean there is a cost advantage we will be probably building LLMs at a much lesser cost than which are built by China and the US of course there is the question of data security as well we'll keep we'll have our own data within the country and we'll be able to use the data to fund other LLMs which can be built by India. So you know that is there but I mean otherwise I really don't think that there is any any other reason for this. Fair enough. So I guess it's quite clear and Palvi thank you so much for shedding that light which is that fundamentally the approach has been very different up till now. Yeah absolutely. Yes. Today the global AI landscape is already dominated by very large very capable models. So if GBT 5.2, Claude, Gemini 3, Llama 4 etc. already dominate, what exactly is the edge of an Indian LLM? So the edge of an Indian LLM is that of course we can build it in very very different languages. India has I mean it's it's a it's a country which is probably you know hundreds of languages and to build LLMs in our own local languages means that we reach out to more people [snorts] and secondly of course as I said again as I said before that there is a huge advantage of cost because compute is expensive you know and if we",
        "start": 185.599,
        "duration": 687.6800000000002
    },
    {
        "text": "hundreds of languages and to build LLMs in our own local languages means that we reach out to more people [snorts] and secondly of course as I said again as I said before that there is a huge advantage of cost because compute is expensive you know and if we if it is backed by the government you know the the 38,000 GPUs that now we have so that is only possible at such a short time because the government had pitch otherwise is it 38,000 just wondering or 40,000 now I mean see as for Abhishek Singh it is 38,000 so I will I mean that figure of course we can is debatable but when I spoke to him that's the figure that he gave me so I would I would like to go with that fair so so you know so that's there so once you know when when we have that kind of a GPU that kind of a compute infrastructure with yourself then you know to utilize that it becomes much easier and of course there'll be then that there can be much more startups AI startups that had come up come up in India fair enough of course you mentioned right now the fact that a lot of India's AI India AI's vision is centered voice first systems and indic languages you've just talked about India languages and that being an advantage or the India edge So does hyperfocusing on voice interfaces and indic languages risk India building AI call centers for the world instead of frontier AI research. that's you know it's something that possibly we have to see because we have not even come out with our first LLM yet. Sure. So that is something that we would probably have to see in the future how you know the influencing which Mr. Bishik Singh was talking about when I spoke to him that how you know after the two LMS come out it will be all behind which which are those two could you be kind enough to tell us? Yeah yeah yeah sure. So one is by Sarami which we already which they have been propagating about from the very beginning and the second would be from Bharat Chan. So these are the these are the two that are decided if he is is you know made it very clear on the public stage which means that they are almost on the final stages and I have I would not take names of a couple of AI companies but some of them have also claimed that they would also kind of like to complete their own LLMs which have been recognized by the AI mission and they would like to launch them as well during the summit. So so the whole race is now about actually you know that who is who will be the first one to launch if if I'm not mistaken. So by February yes okay by February okay",
        "start": 348.24,
        "duration": 1002.72
    },
    {
        "text": "the AI mission and they would like to launch them as well during the summit. So so the whole race is now about actually you know that who is who will be the first one to launch if if I'm not mistaken. So by February yes okay by February okay so February we have the yes February we have the summit so before that these two elements would come out that's what Mr. saying exclusively told us and so now we have to see whether they come out. I would I would like to believe that they have to actually if they have you know they have pro publicized the impact summit at such a level and there are a lot of dignies and global leaders who are coming for the summit. So they have to have something to showcase. Fair enough and a valid point. Yeah. Yeah. So meeting that deadline becomes all the more imperative then I guess very very important. Yes, definitely. So earlier I mean there were you know initially they had said that they would come out by the with the first model by within 10 months but that of course hasn't worked out yet. So we are more than a year it's been more than a year than the mission was launched. So when I asked this to Mr. saying then then he said that you know it takes a lot of time for the procurement of GPOS and that itself took 6 months because you know from 600 when you go to that kind of a huge figure yeah huge scale so it takes time and of course a lot of investment so a lot of had to be you know the money had to come in from the private sector and it takes time and all of that so now the thing is that you know it has the India emission has attracted a lot of interest global at the global stage as well and people have said that how we have late but you know the certain things which are working for us but the certain things like for example the investment itself and whether actually how much of the computers being used for you know large elements right so so that these things the experts have you know raised questions on these points now you know over the months and over the over the year at least and they're critical points to be honest very very critical points a very big critical point is also that you know we have even Mr. Singh in his previous interviews he has said that how there will be job losses you know once AI correct as yeah as AI moves and I as AI you know penetrates deep into India but what are they like you know if if the government is taking such a huge initiative how much of that initiative is actually also taking care",
        "start": 513.599,
        "duration": 1275.12
    },
    {
        "text": "be job losses you know once AI correct as yeah as AI moves and I as AI you know penetrates deep into India but what are they like you know if if the government is taking such a huge initiative how much of that initiative is actually also taking care example there are like 10,000 job losses or a lack job losses what is the government doing to you know to kind of safeguard those people. And there are graduates you know from tier 2 33 cities who are ready to come out of colleges and if they are not actually can be you know absorbed in the system what are they going to do which actually brings me to this thought since we we we you alluded to the idea to the point of job losses it has been acknowledged. Yeah. But is policy still in denial? openly admits coders are now well competing with $20 worth of AI bots. But where is the hard plan for Pali? People who will be displaced IT services jobs that will be automated tier 2/3 engineering graduates who may be unemployable in the old outsourcing model. I'd love for you to tell us about this. This is very very important. Yeah. So I mean there is we don't have a policy you know we don't have an AI policy till now which is why I mean I had also asked Mr. Singh about it and he said that as of now we don't need it. why because according to him there are there are a lot of you know guidelines AI guidelines that the mission has already you know released and so we are kind of following them and all of that is there but when it comes to job losses we are acknowledging it but the acknowledgement is there but where is the solution or where is that you know that because you know there are a lot of things so education is also involved yes if we don't have the you know if we if we are not educating or bringing AI to schools, colleges at the right time. We are not we are not going to actually you know we now we'll have to import talent. Yes. And are we are we are we are we ready to do that because this is tell me this you said you mentioned that that he believes Mr. Singh said to you that that we don't need a policy. Do you agree with that thought? As of now no we need a policy. We need a policy now because you know when we say about AI guidelines the guidelines are just specific to the usage of AI you know the correct usage of AI data security cyber security all of that. Yes. Right. but it doesn't take into account what actually AI is going to do to the Indian workforce. Yes. Right. So it has to start now. The",
        "start": 650.16,
        "duration": 1592.1589999999994
    },
    {
        "text": "are just specific to the usage of AI you know the correct usage of AI data security cyber security all of that. Yes. Right. but it doesn't take into account what actually AI is going to do to the Indian workforce. Yes. Right. So it has to start now. The one which has to you know accommodate job loss, job creation you know which are the sectors which would probably be the most affected and we don't know we don't know you know tomorrow writers might just just not have any jobs left because charge you know it's like you it's so easy to write there. I mean I'm I'm giving you an aside. You remember there was this huge huge I mean this was almost a few years back where the entire Hollywood association went up in arms and I mean you were just talking about writers so I just that just came to my mind so I thought I'll I'll just talk about that reference that but is there any is there any maybe some sort of a timeline that was mentioned to you Palvi by Mr. saying that all right wait a minute it doesn't exist right now but maybe we've started to kind of put things together in terms of a policy and it should be out by such and such time not yet no not even that no wow not yet nothing about the policy and so yeah I mean that remains a very big gap in terms of unless and until the policy is there it has to kind of you know work in tandem with the mission to actually even realize the whole impact of the mission if they are actually really serious about it and if they have if they want to take it to the grassroot level. You'd mentioned earlier that India needed nudging. Yes. right. So makes me hark back to that thought of yours. What kind of a nudge according to you would be needed for something like this to come into formulation? I don't know. I believe as we are like the discussion that we are having as we write about it and also I believe when you know the company and in fact they he himself said that you know it's so difficult to retain talent they themselves face a crisis of talent retention in India AI mission you know so yeah so he that's what he said that you know all the good talent they are being they they are like they are all taken outside most of them are outside so it's so difficult to build LLM. Now when we talk about job losses, so won't it be more if you don't have a policy in place? So it's directly connected. So they basically need to join the dots. They need to put a definitely put a time frame to it. And actually we are anyway late. Yes.",
        "start": 811.44,
        "duration": 1894.559
    },
    {
        "text": "when we talk about job losses, so won't it be more if you don't have a policy in place? So it's directly connected. So they basically need to join the dots. They need to put a definitely put a time frame to it. And actually we are anyway late. Yes. It's like ASAP. They have to and it it really needs attention more so because it's if the the summit is right on our head and we are actually showcasing ourselves as you know the global south we are like this is the biggest summit of the global south and all of that what are we actually you know doing to showcase the the the real the real problems are being solved or not because any futuristic AI view cannot happen without a concrete AI policy in place and this I'm pretty sure Well to be honest is an open secret. So I mean luminaries delegates everyone coming in for the summit well it's common knowledge that India doesn't have an AI policy and would that be I believe swept under the rug or how would you feel would it be handled because that is a very glaring aspect? I mean definitely I mean I really hope that it is not you know it's not swept under the rug and it is actually talked about and I hope that the the the leaders who are who will be joining us for the summit they themselves talk about it and the researchers who are working on the on the mission on the and if there is a draft that is being drafted and maybe not being yet made public I I hope that they do it the right way and they do it really fast. Fabulous. Palvi, in closing, what are the upsides that you would like for the entire audience and you'd like to leave us with and the expectations obviously for the summit? All right. Well, unfortunately we've lost Palvi. but there were very interesting insights that she has given. she did talk about a very fundamental ch difference in terms of the approach that India has had visav let's say a China or the United States of course it's being addressed now there is the upside of the fact that we'll be able to build because of a cheaper compute there is of course a huge yawning gap when it comes down to the AI policy and its non-existence but I believe it is being addressed and I hope it is in place as soon as possible So in final conclusion, India's AI challenge isn't about who trains the biggest model or who spends the most money. It's been established. It's about choosing where to compete and being honest about the trade-offs that come with that choice. Yes, there are job losses need to be addressed which has been obviously addressed by Mr. Singh between compute excess, talent constraints, job disruption and governance. The real test isn't actually",
        "start": 968.079,
        "duration": 2215.8399999999997
    },
    {
        "text": "been established. It's about choosing where to compete and being honest about the trade-offs that come with that choice. Yes, there are job losses need to be addressed which has been obviously addressed by Mr. Singh between compute excess, talent constraints, job disruption and governance. The real test isn't actually down to execution and with the summit right around the corner and with the fact that we have been talking about two LLMs being showcased for the world at the summit in February, we sure hope to keep those timelines and have a policy hopefully or at least a framework and the fact that this could be just that shot in the arm that India needs for its mission as far as AI is concerned to gallop from here because we were already late. Let's just try to make up for all of that time and make sure that we are always onwards and upwards. This front page by AIM network. Please do let us know what you think in the comments below. And as always, think AI, think AIM. [music]",
        "start": 1130.24,
        "duration": 2314.776
    }
]