[
    {
        "text": " Good evening. Welcome to Front Page. Look, we've been talking a lot about government victories at Davos, the World Economic Forum. Yes, the most exclusive club on earth. So, we at Front Page are doing this and we would request you to do it with us. What we're doing is that we are manifesting that for the next Star Dors, we'll be reporting everything live with the raw insights and behind the scenes from the biggest economic theater on earth. Now that we've had a moment of silence, back to the news. Karnataka was picking up the speed in terms of signingus and getting funding. and then enters Karnataka's deputy CM DK Shivakumar. He gets on stage. He pitches Nama Bengaluru. He calls it the city of the future. Standard politician talk, right? But then he drops the line that cuts through the noise. Beautiful weather is what he says. The crowd starts to laugh. The internet memes are out. But of course here is the narrative war you missed while you were looking at the memes. A few days later after the applause had faded the paperwork was signed in Bengaluru. 20 k rupees was approved for a new center of excellence. Its name is cats c a ts the center for applied AI for tech solutions. The location HSR layout at the Konx facility right inside the corridor where startups scale stall and well then scale again. This is significant because it is operational geography and global companies have noticed this. Microsoft is expanding engineering teams right here. Google is scaling cloud research and development. Meta is active. So are open AI and anthropic. And now of course Mistral AI, one of Europe's most serious AI players is in discussions to set up operations right here. And yes, they are not here for the weather. They are here actually because this is where products move from code to deployment. The funding structure explains the intent. 20 K rupees over four years split deliberately. 40% from the central government through Matei, 40% from the Karnataka government and 20% from industry partners. This matters. Why? Because when industry contributes capital, it expects delivery. Accountability follows naturally and timelines tend to sharpen when progress can no longer be deferred to the next presentation slide. Now, here is the catch. Have you ever noticed that we are the ones who always find and take the catch and let you know about it? And as always, it's a very sharp, smart one. Here it is. Cats is not trying to build the next GPD5. Karnataka knows it's not going to win the trillion parameter model war against Sam Alman. So, you know what? They aren't even fighting it. They are pivoting to the ground game. Applied AI, robotics, supply chain optimization, industry 4.0 to bridge the gap between a cool GitHub repo and a signed enterprise contract. For the startups watching this, this is what we have to say. You get testing",
        "start": 0.24,
        "duration": 414.15999999999997
    },
    {
        "text": "what? They aren't even fighting it. They are pivoting to the ground game. Applied AI, robotics, supply chain optimization, industry 4.0 to bridge the gap between a cool GitHub repo and a signed enterprise contract. For the startups watching this, this is what we have to say. You get testing support. For the MSMES, you get automation that doesn't bankrupt you. Actually you get margins which exemplifies the missing middle of India's ecosystem. India never had a gap when it came to ideas or talent. No, we've got an abundance of those. It was actually the path from prototype to production. Cats shortens that very distance. Unlike most announcements, this one comes with a scorecard. Clear metrics, startups supported, prototypes deployed, intellectual property filed, progress is intended to be measured. Stepping back, when we see this, the contrast becomes a lot clearer. The Davos speech set the narrative. The line about the weather drew attention for sure. What followed was substance though. Karnataka is placing a deliberate bet while larger powers compete to build ever more capable models. Bengaluru is positioning itself as the place where those models are put to work. This is a wager on execution, the application layer if you will and on of course outcomes over ambition. From here what will matter is not who speaks most convincingly but who delivers consistently. Davos provided the sound bite. Bengaluru is writing the code. We'll of course be watching who builds, who ships, and who simply does the talking. This, ladies and gentlemen, is Front Page by A IM Network. Think AI, think Karnataka, and definitely think AIM.",
        "start": 207.04,
        "duration": 617.7620000000002
    }
]