[
    {
        "text": " Good evening Bengaluru commuters. Please listen closely. The eye in the sky and I'm not of course referring to Alan Parson's super hit song. I'm of course talking about the cameras on the polls. Yes, they are yesterday's threat. Now the surveillance is riding right next to you. Welcome to the new narrative war on the outer ring road. And if you watch the AM network, you know well what to do. Please like, share, and subscribe. Of course, now back to the development. Police use AI cameras. They flag helmetless riders. They catch red light jumpers. Standard operating procedure, right? But this week, the game changed. A techie hacked his helmet and the helmet started acting like a cop. Meet Pankage Tanbar. Hello, Pankage. Mangaluru, engineer, systems architect. He of course brings by a GoPro. He built a digital snitch. He rigged an AI powered helmet. It doesn't just record video. It thinks it detects violations in [clears throat] near real time. It extract it it extracts number plates. It logs the GPS coordinates and then very coldly efficiently. It emails the evidence directly to the traffic police. No human intervention, just code catching chaos. The internet, it went feral. They called it peak binguru. They called it demigod behavior. They called it brilliant. They called it terrifying. [clears throat] But here is the twist. Usually the system fights the hacker. Not this time. No. Bengaluru city police did not send a cease and desist. They actually slid into his DMs officially. They called it innovative. They want to talk. And that is of course the moment this stopped being a toy and became a weapon in the civic tech arsenal. But of course, let's just pause the applause and understand what's going on. Let's look at the narrative war underneath the code because this brings up very uncomfortable questions. The spicy ones, privacy. Who owns the footage of the public road? The state or the guy in the lane next to you? Accountability. For that, ladies and gentlemen, here is the ping-pong match. Citizen A wants safer road. Citizen B captures the footage. But what if the AI is wrong? What if the code hallucinates a violation? And of course, the biggest question of all, if Pankage breaks a red light, no punkage, please don't do that. Because the point is, does his helmet snitch on him or is the watchman immune to the watch? It's time for the front page take, which is this. This is massive. the massive widening gap between what a single engineer can build in a weekend and what the state takes years to deploy. Pankage used Raspberry Pi and open APIs. He created an automated evidence pipeline solo by the way. It forces the question, if one guy at InMobi can do this for fun, why are our public systems still struggling to catch up? And here is the reality. The tools of enforcement are democratizing. Everyone is a potential",
        "start": 0.24,
        "duration": 411.67800000000005
    },
    {
        "text": "APIs. He created an automated evidence pipeline solo by the way. It forces the question, if one guy at InMobi can do this for fun, why are our public systems still struggling to catch up? And here is the reality. The tools of enforcement are democratizing. Everyone is a potential camera. We of course want to know where you stand. Drop your take in the comments below because in Bengaluru the walls have ears and now the helmets have eyes. This is front page by A IM network. We are watching the narrative and I'm pretty sure so is Pankage. Think AI. Think AI. [music]",
        "start": 206.879,
        "duration": 465.6930000000001
    }
]