[
    {
        "text": " Excl has very deep roots in India and the Indian AI ecosystem is evolving as we all know. So how central is India to EXL's innovation? Well, story today. A global data and AI company that's very quietly but very decisively been transforming how enterprises make AI real. How did you deal with resistance to change? Was there any of that? because you know that's it's it's human nature to be honest. Andy and I've been here in the company for more than 24 years. Wow. And how we've really transformed ourselves from a business process operations to digital analytics and now a data and AI company. What do you think was the real turning point today? 55% of our revenue actually comes from data and AI which is truly remarkable. A significant portion of our workforce is still in India. Yes. we attract some of the best talent from the IITs and the IM. Hello and welcome ladies and gentlemen u to a very very very special podcast and episode with a very special gentleman to be honest. we're speaking with Andy Logani, the executive vice president and chief digital and AI officer at EXL. So that is of course a global data and AI company that's very quietly but very decisively been transforming how enterprises make AI real. Andy has been part of that story for over two decades. It's not too much time but of course he's going to be sharing a lot more with us in terms of his experience the the journey that he's had the relationships that he's cultivated and the way he has seen this company literally grow into this wonderful brilliant corporate and the fact that this journey only continues of course it gives me true pleasure to welcome the man the legend himself Mr. Mr. Andy Loani, welcome to the show, Andy. How are you doing? Oh, well, Si, I'm doing great. , I'm not sure if I can be termed as a legend, but I appreciate that introduction. But, but you're right. It's been truly remarkable to be a part of this transformation journey that EXL has undertaken over the last 25 years. And I've been here in the company for more than 24 years. Wow. and how we've really transformed ourselves from a business process operations to digital analytics and now a data and AI company. so much so that today 55% of our revenue actually comes from data and AI which is truly remarkable for a company our size. So I I would really I would agree with you that the journey truly has been transformative and one with a lots and lots of learnings over the years. Wonderful. Actually that that brings me to this the first thought right off the bat Andy to be honest the first thought that actually came to my mind when I was sitting down and wondering about this entire aspect of you know two decades",
        "start": 0.32,
        "duration": 396.4779999999999
    },
    {
        "text": "lots of learnings over the years. Wonderful. Actually that that brings me to this the first thought right off the bat Andy to be honest the first thought that actually came to my mind when I was sitting down and wondering about this entire aspect of you know two decades you've seen EXL evolve Andy and and and it was a datacentric organization into an AIdriven global leader. So, first things first, looking back, and I'm sure you still have a smile on your face whenever you tend to kind of be nostalgic about this journey of yours. What do you think was the real turning point? , I mean, in terms of that moment when you realized the company was actually shifting into something entirely new. Yeah, you know, actually, it's not just on one occasion. as I mentioned what's been truly amazing and I give a lot of credit to our our CEO my boss Rohit and the entire executive team this has happened over five different tranches in the last 25 years. So we started as a BO company. Then we saw this trend that actually business process without infused intelligence and working on or or without working on these models you really can't bring insights to business. So that's when we actually made a pivot perhaps in 2006 and we acquired our first company called Inductus which was a boutique analytics firm and we took that as a start and started to build a terrific analytics brand. That was in 2006. again four or five years later we started to see that look if you don't infuse technology in operations then and and transform companies on how they deliver the experience digitally because technology was evolving. So then we made another pivot again and we started to introduce digital. Then we ma started to make a lot of data company acquisitions right. So we bought a company called you know clairvoyant. We bought a company called ITI. We bought a company called RTM. And what we did is we started to build these data assets because our biggest learning was enterprise transformation is not struggling because of lack of technology. The big issue is actually the underlying data and and that's when we made that pivot. Think about when the GPT moment happened three years back. We had the foundation of data. We had the foundation of insights and algorithms and we had the context with domain. We married that and obviously infused more investments over the years and we then transformed into a complete data and AI company and and and the journey like you said has truly been remarkable but the team has been doing it every four or five years maybe even lesser. The first increment was six, then five, then four, then three. But here is the amazing thing. Anytime we made the pivot, we've never compromised our growth rates. We've always done better and outperformed the",
        "start": 204.4,
        "duration": 749.8389999999998
    },
    {
        "text": "but the team has been doing it every four or five years maybe even lesser. The first increment was six, then five, then four, then three. But here is the amazing thing. Anytime we made the pivot, we've never compromised our growth rates. We've always done better and outperformed the testament to the effort, but then we've been rewarded for efforts that we made. So that again truly transformative. Correct me if I'm wrong. I mean what I've understood it like as you said that I mean the vision of of of the founder as obviously you being a part of the core team the inner circle so to say right from the get-go so the way I understood it is the fact that it's been something which has been more on the rights of the fact that it's been instinctive you have been aware of the environment maybe thinking slightly ahead of the curve but Andy this is something which I wanted to maybe follow up with which is that it had to obviously do with a certain amount of a client demand or was it purely as you said internal conviction and more importantly how did you and the the the top team navigate this transformation because it's it's it's to me fabulous to hear it but you guys were in constant that journey and navigating it must have been where not a walk in the park. Yeah. Yeah. Si that's an excellent question. Think about a 60,000 people organization and pivoting them to completely something new. So I I'll just share a couple of things with you. You just hit the nail on the head that you can spot a trend, you can prepare for a trend, but can you really execute on a changing trend consistently over the lifespan of a company? five times over like there has to be something about it. So I'm I'm just going to share a few things with you. First, you're exactly right, Sudi. We are intellectually curious but very grounded in staying close to our customers. As simple as it may sounds, as intuitive as it may sound, you have to stay sort of in the ecosystem of your customers. Get them on your advisory board, get their guidance and just see where things are changing and be very close to them. We also stay very hungry and agile in terms of what's happening in the VC market, innovators, what are the new things that are coming up and we always stay you know with forums like plugandplay and Gartner and many other industry events where we are always connected with okay what's the market doing because you don't want to get dumbfounded that you are living in your own world and just surrounded by your own ecosystem and not staying informed. So that curiosity element then really comes to that. So once you've formed an opinion and it's validated then to your point it's all about execution but",
        "start": 384.72,
        "duration": 1083.279
    },
    {
        "text": "want to get dumbfounded that you are living in your own world and just surrounded by your own ecosystem and not staying informed. So that curiosity element then really comes to that. So once you've formed an opinion and it's validated then to your point it's all about execution but very quick example. The moment this AI moment happened and every company talked about it. We immediately said we have all the building blocks so we're going to make this pivot. Firstly, we said we'll have to make sure that our employees are able to experiment because you want to build the trust with this. So, we created two sandboxes. One for all employees to experiment, but it had all the guardrails, all the privacy preservation, making sure you're not exposing the data, and you're giving them the tools. We call it the AI playground and the sandbox for them to just play and just get comfortable with technology. It's all also available to our sales teams because you can't just feed them something that they don't practice themselves. But then there's the other sandbox which is for people who work in the AI developing these pipelines executing this stuff. We created a a complete research and innovation environment for them and obviously a new development environment for for them in that. So the every new technology that gets introduced within two or 3 days it's on our stack for them to experiment because this workforce is not just looking at compensation and career progression they want to be at the cutting edge of the work that's being done right so so we create that environment we drive that change management and I'll just say one other thing we always drive this democratization at scale last year Sudi we had 1,500 ideas. This year we have 7,000 ideas and people are using that sandbox to create the first plot to bring it forward. Now again we are prudent about selecting only meaningful things that deliver value. We just don't go crazy over I'm going to do all 200 things but it just drives that culture. It just drives that thinking and it just drives that change management. So the big differentiation is that execution. I just want to I just want to ask you this because I'm I'm a little curious about this Andy because I found that very fascinating. the fact that that you know it's a that's a huge jump from like you've gone to 7,000 ideas. So I'm presuming it won't be just for engineers. I mean you would be open to ideas coming from every other department people who are not let's say maybe coders, hardcore engineers, whatever. But I'm sure that would be something also that you would be encouraging or maybe correct me if I'm wrong. No, Sidu, you're exactly right. That's why two different sandboxes. One's a very mature sandbox for engineers and data scientists, people who are",
        "start": 554.48,
        "duration": 1415.4390000000008
    },
    {
        "text": "let's say maybe coders, hardcore engineers, whatever. But I'm sure that would be something also that you would be encouraging or maybe correct me if I'm wrong. No, Sidu, you're exactly right. That's why two different sandboxes. One's a very mature sandbox for engineers and data scientists, people who are to build these things. They are the builder group. And then there is the complete open sandbox to the entire organization which is our AI playground which we have enabled for everybody to use it and and sort of get comfortable with. So we have done it at both levels. Both have appropriate guardrails a little bit different tool sets depending on what your needs are and what you should have. So we define the lanes but then we allow them to go at speed. We don't want to create more bureaucracy and bottleneck. and and and and a big decision was obviously for us to develop these technology stacks which you know if we get time I'll explain a little bit to you later. and and that's I think execution of these ideas and driving the complete change momentum led by every executive committee team member I think has been the biggest differentiator because you know you can like I said spot the trend see where the puck's moving but if you don't execute you're left behind. wonderful report because I guess that's clearly sheds light on the fact that how do you navigate 60,000 people for people who are watching that's one way of doing it and a very effective way which brings me to the next thought u Andy which is this that you know as far as the a lot of organizations have have talked about it and this is for me to for sure ask you because you talked about the rich experience and the background that EXL So point is this they talk about digital transformation but this feels something which is a lot more deeper. It's almost like it's been a cultural shift. you've mentioned to me in terms of the fact that how that that change in the mindset but what I want to ask you really is the fact that how did you deal with resistance to change? Was there any of that? because you know that's it's it's human nature to be honest Andy something new is getting done we are very resistant at as a human race to change so was that also part of the narrative at some level and how did you overcome that yeah I I think that's a great question see there are two or three principles on this that are very important firstly recognizing that there is a cohort of that 45,000 people that will work with AI but they may not be the developer they may not be the builders they will work with that their life is going to change as well and then there is that other cohort of",
        "start": 723.36,
        "duration": 1735.1990000000005
    },
    {
        "text": "firstly recognizing that there is a cohort of that 45,000 people that will work with AI but they may not be the developer they may not be the builders they will work with that their life is going to change as well and then there is that other cohort of and they're building developing deploying right their life on the on this side that work with AI like larger operations workforce they're going to see all these tools all these new things that has changed their life. So first big thing on this change journey was to identify not everybody can get to the builder level. So don't try and attempt that but please also equip them with tools because their life is going to change as well. That's the first principle of understanding your workforce better and and creating pathways for both not leaving them behind but make it a stretch but a stretch that is achievable. Don't try to convert them to something that they can't be right. Right? So that was like first design principle. The second design principle of change management was and this is like something that in industry people misuse this term. They call it human in the loop and they say well anything where you want to check stuff human will collaborate with AI. In principle that's fine but in design I'm seeing lots of organization do not get this right. What I mean by that, you are saying human in the loop and now you have just summarized 80 pieces of documents into such a massive summary and a summary that is not even contextual or very verbose that the person doesn't even understand and how to react with. I was just working on a screen or two screens. You have now started to bring a summary. You've started to bring an ability for me to have a chat interface to query my knowledge portal. you have now bringing nudges. AI is giving me guidance. So my life is now completely changed into like six things flowing left, right and center. So we paid a lot of attention to the design of the change in this. And the third important design principle on this, the most important is actually trust. Because if people don't trust this and you create this more as a enemy or this is a displacement strategy, you know, some efficiency and cannibalization will happen. There's there's no doubt about it, right? But you can't lead with fear. You have to lead with embracing the change and then just working along it. So those were the three sort of design principles and then you know so they're not getting too tech tactical here but lots of execution in change management and constant reinforcement these learning prays for people to learn and feel for it having the mentorship layer for questions are our learning and development team so we are also partnering with lot of academia and",
        "start": 884.639,
        "duration": 2055.0390000000007
    },
    {
        "text": "they're not getting too tech tactical here but lots of execution in change management and constant reinforcement these learning prays for people to learn and feel for it having the mentorship layer for questions are our learning and development team so we are also partnering with lot of academia and training courses but look I I'll tell you this if if you don't if you're not if you don't embrace change and you're not curious yourself and we are looking that in the workforce they're hiring there's no amount of training that is sufficient today because what you learned today Suda what I learned today it'll change in like two weeks so those were some elements of design and change which were very very critical on this journey I hope it makes sense oh it makes a hell of a lot of sense absolute and complete sensey and I think for me that one takeaway was just that one term that you use trust Because in my head res change or resistance to change comes only from there. It comes from the lack of trust or it comes from fear which is again the lack of trust which actually once I want to talk to you about this for sure which is the fact that there has to be a rewriting of rules right Andy in terms of whether as far as data and with AI is concerned. So I want to talk to you about let's say the you know making headlines recently which is the excl data.ai the new agentic AI suit of data solutions. It's a big milestone for EXL and well for those who are not into the so deeply into the tech world Andy I would like for you to maybe describe what excla.ai AI actually does. Yeah, again thank you for spotting that and and you're right. It is a again a very very transformational moment for us in this journey. simplistically put as I mentioned to you earlier Sudi what I'm still finding that in this AI ambitions that companies have data still continues to be the number one problem. there are others but data is still kind of right there perhaps top one or two problems that companies are trying to solve and any conversation I get into even though people say I'm want to embrace AI I want to deploy these use cases very quickly it becomes very clear I have this legacy debt I have this stuff lying here I just don't understand the lineage I don't understand the source of my data I just don't understand what is there for me to truly get to the modern world and it became very clear for us that at least so far we haven't seen a company launch a complete AI native end toend agentic solutions for managing data life cycle end to end and what do I mean by data life cycle establishing lineage",
        "start": 1047.76,
        "duration": 2383.119000000001
    },
    {
        "text": "get to the modern world and it became very clear for us that at least so far we haven't seen a company launch a complete AI native end toend agentic solutions for managing data life cycle end to end and what do I mean by data life cycle establishing lineage complete agentic architecture for that migration of legacy codes to these modern platforms forms a big opportunity in the regulated industry is harnessing of this unstructured data which actually was not being harnessed before and with AI generative AI it it's an amazing possibility everybody was using old ways of solving the problem and they were dealing exceptions with AI we turned it around and we said I'm going to architect an end-to-end solution which is compatible with data bricks compatible with data is actually a launch partner and we're going to continue to work with GCP and Snowflake and anybody who's in this journey. We have built now this end toend solution which actually has 65 agents like I said from lineage to migration to unstructured data to annotation to governance. So the end-to-end data life cycle has been reimagined with the agentic stack. I I I think that's what we've been able to achieve and our view is that this is going to be a gamecher because it's actually going to accelerate the speed to transformation which companies are trying to achieve and without something like this I mean not that you won't get there it's just going to take you too long and it's going to be very very hard we are already finding several of our customers who started to work with us on this journey and they've started to see tremendous value come out of it because of the share amount of time that you're saving them. Andy, correct me if I'm wrong in terms of the fact that it's a mammoth task and and and you thought of I mean this is gold whoever thought of the by the way who thought of the idea because you said nobody had thought of it. Well you know we we we have a very very solid team behind it. It was like a brainstorming session with executive team our head of data Sanjay Jooshi. We hired some external talent, very very smart talent like Kathleen and Madan. They had experience of seeing this thing but in how these were being solved with compiler codes and deterministic logic. And when we brainstormed and we felt in this journey if people will spend so much time in making data ready for AI you have to think about AI coming to data and and just reimagine how data gets managed, right? So that's sort of kind of led to the thinking and then we very quickly I'll tell you we stitched these 65 agents end to end in 15-day sprints and we completed this over like a six-month period and and",
        "start": 1213.28,
        "duration": 2698.4790000000003
    },
    {
        "text": "data and and just reimagine how data gets managed, right? So that's sort of kind of led to the thinking and then we very quickly I'll tell you we stitched these 65 agents end to end in 15-day sprints and we completed this over like a six-month period and and us taking years and years to do this. In this day and age you got to be solving things much faster. You know there's a philosophy that our co uses internally. He says innovation in 30 days. Don't give me threeear ideas. Break it into chunks and show me progress every 15 days, every 30 days. So that's a philosophical change with which we drove this. And why do I get the feeling that that you're the kind of leader who doesn't take credit and always gives it to the team. So well done on that. I always [laughter] you know it's always the team Si. It's always I know I know you're like you sound like MS Dhoni for a second but that's a good thing. Thank you. He's my favorite cricketer by the way. I don't know why but I kind of knew that. All right. you said you know like the biggest barrier Andy to well AI adoption isn't that isn't that isn't AI itself. It's actually the data. So why is it that such a persistent problem for enterprise has existed and how does EXL data.ai AI helps solve it and the point that I want to bring in this bit of your partnership with data bricks as you mentioned. Please tell us a little bit about that and how did it come together. Yeah. No, so look I one of the things is that so so two or three questions you asked. number one see what was happened in the past is just pick like one component of this EXL data.ai AI right just to make it real you look at these regulated industries 80 to 85% data is still unstructured it's lying in areas which have not been harnessed in the past how do you build an intelligent system when you are not harnessing your unstructured data that is lying with you in in multimodal formats and and have not been harnessed right so AI actually changed that possibility sort of to begin with fundamentally right and and then what we saw is yes you you have to link it to value. So, so for example, we work with healthcare payments and and we look at claims and we help payers identify areas where there's an opportunity of you know payments that have may not have been done correctly and there is probably an overcharge and there is you know some kind of a miscalculation and we accelerated big time in 2425 because we changed the whole thing. So firstly very casually drop these numbers like by the way 3 billion and like okay yeah it's a sizable thing. Now what",
        "start": 1374.64,
        "duration": 3038.236999999999
    },
    {
        "text": "is probably an overcharge and there is you know some kind of a miscalculation and we accelerated big time in 2425 because we changed the whole thing. So firstly very casually drop these numbers like by the way 3 billion and like okay yeah it's a sizable thing. Now what healthcare it's a regulated industry we made sure it's high trust it's HIPPA compliant it's free of all PII PHI we create we have a federated data lake which also is in partnership with data bricks we created a complete Medelian architecture on top of it our years of understanding and algorithms we converted that to agentic architectures but behind the first thing that we do is we did is if I have to deliver this value I have to see am I harnessing all the relevant data sources and and and that's where for example unstructured data alone lifted the saving profile to a completely new level right so we we redesigned this whole thing and we worked first on our own world right this is one difference between us and so there are a lot of sort of people who just come and give advice on powerpoints we are practitioner We do this day in and day out. I was going to draw give me some names but no. [laughter] So, so, so we essentially go and do this work and then we test it and we are able to deliver it. So, so just this example of unstructured data opened our eyes that look I can dis I can create disproportionate value and save these claims spend. We did the same thing in insurance. But let me harness those data sources that I can get. You know what is another thing that matters there. It's actually the context and domain knowledge because if I don't have that if I don't have that then I just can't create that intelligence down to data level. So it's not just a horizontal technology of hey I'll throw this at you. There are many players who will do that. Our job is take the context which is domain deep rooted in those data sources places that are treasure trove but have not been harnessed get the best AI techniques and engineering stitch it together and deliver value right and that's sort of the genesis of what things like EXL data.ai AI are for doing for us it's always starts with value and then make sure that you are harnessing those data sources that have not been harnessed and that's one example of unstructured data think about the entire pipeline usage multiple systems that are lying and nobody understands what's in there so we we our lineage agent just establish complete we call it a you know semantic technical twin lineage not to sort of but you know we are creating a complete understanding what data where data is coming from, what is it really",
        "start": 1546.559,
        "duration": 3357.0379999999996
    },
    {
        "text": "lying and nobody understands what's in there so we we our lineage agent just establish complete we call it a you know semantic technical twin lineage not to sort of but you know we are creating a complete understanding what data where data is coming from, what is it really what effort will it take for you to take this data and use it for AI pipelines. So that that's the type of things we are doing. job is to accelerate it but take it towards value which finally at the end of the day is the final goal Andy and and I guess everyone is motivated and driven to to to well finally achieve that reach that finish line and and and I'm sure it must be very rewarding and very encouraging you know partnering up with somebody like data bricks I would love for you to maybe shed some light on that only a few days back I I would had a chat with Nick Ay he was of course telling us about you know how they are planning to have a big footprint as far as India is concerned and and they're moving in and things like that in terms of what their plans are and thoughts are of course and it was a fascinating conversation because he started to talk to me about that and and the moment I I had the pleasant opportunity to know that I'm going to be speaking with you I I was like oh wow interesting I would love for you to maybe shed light on is yeah no so so so we we picked data bricks as launch partner because several of our customers were starting to work and or were in the journey of working with data bricks in like healthcare insurance just to pick those two sectors so essentially what we did is all these agents that we've developed we actually made sure that we're also developing an on data brick stack plus we are making it compatible with the unity catalog So for instance, if I am working on a particular element of the pipeline, let's say I work on annotation of a a claim video and now I have to post that annotation and the different intelligence that I drove from that data, I can post it directly into the unity catalog. Essentially what we're trying to do is make it easy for clients to deliver value, right? You know we we I so sometimes companies get too caught up with that I am going to use own this piece of technology and that piece of technology. My guidance is yes you have to make choices for the technology stack but technology is not going to be the barrier for your ambitions. What's going to be the barrier is have you really thought about the right use case? Have you really thought through end to end and are you really designing for success",
        "start": 1708.24,
        "duration": 3653.3589999999995
    },
    {
        "text": "to make choices for the technology stack but technology is not going to be the barrier for your ambitions. What's going to be the barrier is have you really thought about the right use case? Have you really thought through end to end and are you really designing for success there's more to organizationing organizing that it's combining that context with the data with AI and making it real for the customers and and we felt that data bricks will be a great partner on this journey and as we work with our clients another client is now working on snowflake they are working on the migration component they're going to migrate from a old piece of technology to snowflake and and to that client we are going to show them the compatibility with how this actually works with snow convert and how it allows you to use that to accelerate migration. So data bricks we started as a launch partner again completely aligned with their stack it's resonating with our customers and now we are expanding it in other areas as well. Wonderful. And you know what what you just mentioned Andy which I thought was again you hit the nail on the head which is the fact that finally it boils down to giving value to the customer and no wonder the synergy between you and data bricks is magical because that's exactly what the sense I got in terms of what data bricks also enjoys in delivering in coming from that mindset that they love to build for the customer and and they really want to add value to it and of because up till now through correct me if I'm wrong because this question the way I've understood it till now is this it's a simple one but I guess a slightly complex one it sounds like EXL isn't just building tools Andy it's actually going ahead and rebuilding the foundation on which AI is actually running am I right because yeah no SI very very well said our job is to make sure that clients actually get value from these deployments and value has to be quantified measured because if you can't track it then just just making soft statements just doesn't help and then your job is to do the best combination of like I said the context the understanding of the data the best way to stitch the AI to deliver the value right because there are lots of engineering choices I mean ju just think about what's happening with clients right they have they have working on all the they all of them are like working on these cloud and hyperscalers then they have these data platforms then the they have the ERP systems then there are like now low code no code agent orchestrators right so there's a lot of technology that is available at their disposal the question is what problem am I solving and what toolkit",
        "start": 1860.24,
        "duration": 3979.2810000000004
    },
    {
        "text": "and hyperscalers then they have these data platforms then the they have the ERP systems then there are like now low code no code agent orchestrators right so there's a lot of technology that is available at their disposal the question is what problem am I solving and what toolkit be making architectural choices. You just can't be all things to you know all use cases and start to sign up with everybody. You'll be making choices. But if it is driven by value, to your point, we see it becoming successful. So there were studies about 95% fail and 50% fail. I just say this very humbly to you. We've been able to put more than 90% that we've touched in production. A big reason for that has been we've said a no to a lot of things that should be pursued versus the things that should be pursued. So I'm I'm really proud of that metric because ultimately it's about putting this stuff in actual production and delivering value to our customers. Kudos to you and your team for sure Andy and and and for sure which actually brings me to this Andy of course there's been you know I have to talk to you about this and I believe it's that opportune time to the India aspect Andy you know the innovation from the ground up so the way I would like to open this up to you is this EXL has very deep roots in India and the Indian AI ecosystem is evolving as we all know. I would hope that you agree with me when I use the term at lightning speed. So how central is India to EXL's innovation well storyried today? No again sort of a great question. as you know Sudi a significant portion of our workforce is still in India. Yes. we attract some of the best talent from the IITs and the IM and we are the day zero campus recruit and perhaps put the most amount of offers to the in the campuses. So, so the first thing for us is that a large portion of our talent base is actually in India and we continue to attract terrific campus talent from India. now to your question on the innovation scene see I I I I I believe what's happening now is really really terrific because having been maybe four or five years our quality of research had gone down a little bit cuz that's where country starts to lose the edge when your universities are not doing cutting edge research right and and I think we obviously did so well with this software world but I think the new world at least O over time. Now when it happens, it happens. The the context of enterprise complexity is still a lot more. But agentic reasoning over time is going to displace software, right? So it's going to be more inferencing plus human versus",
        "start": 2025.2,
        "duration": 4313.761000000001
    },
    {
        "text": "world but I think the new world at least O over time. Now when it happens, it happens. The the context of enterprise complexity is still a lot more. But agentic reasoning over time is going to displace software, right? So it's going to be more inferencing plus human versus India is amazing to sort of embrace it. The university system is terrific to embrace it. I think our government in India at the moment is really driving the right efforts. The corporate ecosystem is coming together very nicely whether it's investment in the energy or the data centers or now actually even companies now building foundational models which wasn't the case and and I think we are on the right trajectory. It was a little bit of a late start relative to how China progressed and how US progressed but I'm 100% confident that with the measures we are taking and we see it ourselves u you know India will be a very very prominent force in this AI world in the future. What do you feel about the the all the announcements that that have been made fairly recently Andy that there's a huge push of of data centers in India. I would love for you to to weigh in on that and tell me what do you feel about all of these announcements coming in because somewhere we're no longer maybe the back office and and we are kind of really getting into a a fairly big prominent perspective. Yeah. Look, I look I think you know just like you I've kind of read that all this as well. I think the simple explanation to this is the big constraint to this over time will be actually the energy and and obviously the compute that you need to sort of really carry the workloads these AI workloads we all know take a lot of energy and compute. So ultimately and and and look so far you can see a lot of money has kind of been made at that level right a a big push in the if you look at the monetization companies in that space have a clear path to monetization and and this is a terrific enabler and a must enabler for you to sort of do the enterprise scale and the country scale deployment. So I think these are absolutely the right things in the right direction and you can see some of the big corporations you know in these announcements are taking the charge and corporates driving this mandate because I think they can see everything that's happened in the US and in China and what they've been able to do and for us it's a terrific I would say a footprint to follow and and just grow at scale and then you know India just has that scale once we do something then we we know how to scale that and scale it big.",
        "start": 2194.24,
        "duration": 4611.6010000000015
    },
    {
        "text": "what they've been able to do and for us it's a terrific I would say a footprint to follow and and just grow at scale and then you know India just has that scale once we do something then we we know how to scale that and scale it big. sure, Andy. Which actually, you know, like you mentioned that that the a large part of of the roots are still in India which which which brings me to this and I'm sure that you would be you and everyone at EXL would be thinking about this very very minutely which is of course the fact that it's a two-part question. So what is it that as far as the Indian talent is concerned Andy that that excites you let's say personally and the second part is how is E ex E Exl helping nurture that next generation of AI leaders in two great questions see firstly again Sudi we are a global company so our research and development efforts are in India, they are very very significantly in Ireland as well and they are also in the US. So we sort of make sure globally for our clients wherever we cater we have to sort of continue to think about all those geographies broadly. your specific question to India and and and you know a couple things. First thing that I really and and ex attract some of the terrific talent I would say [snorts] curiosity and the ability to sort of play with the tool set and adapt quickly. I am just seeing an amazing amount of traction how our data scientists and our data engineers are developing deep engineering skills right because this is not just writing about a just a Python code or a software code. This is about how do you engineer the best solution to deliver the value and there are so many choices at the model level at the agent level the rules that have been created right so there are lots of choices you're making in terms of stitching these things and and I am seeing that our our teams are really pivoting and the way we are helping them is lots of trainings lots of investment and research and developing and giving them the best of the toolkits from around the world to play with. Right? So that's sort of what we are doing. But I see that intellectual curiosity. I see that pivot and I see that hunger and work ethics evolving like they are always there evolving to sort of adapt to what is needed for the AI of the future journeys. Right? So I I think that's one really amazing thing I continue to see. We have some of our best talent in India and they can stand at a global stage and talk about this very very eloquently and demonstrate. In fact, some of our teams that have fine-tuned created LLMs",
        "start": 2346.24,
        "duration": 4954.720000000002
    },
    {
        "text": "So I I think that's one really amazing thing I continue to see. We have some of our best talent in India and they can stand at a global stage and talk about this very very eloquently and demonstrate. In fact, some of our teams that have fine-tuned created LLMs members were actually from India. They created a much smaller model which was much better outperformed every pre-trained model and delivered terrific results. Right? So so in summary I am seeing the teams are the the teams and the new talent is embracing AI they're making the pivot and investing in that skills and actually the work ethics is another amazing thing that you continue to rely on India at scale because there's no place you can find talent at scale you know than India and China and our job is to just make it like really really easy for them and give them the tool sets and the training and the help and the organizational culture because it it's not about the the organizations aren't the ones who will just use the best technology. The organizations that will adapt and change and with these systems continue to evolve are the ones that will lead the wave and that's the culture we are trying to embrace in our people as we work through this transition. That actually brings me to the next question. U Andy, it's it almost seems as if you know, you've got a crystal ball and you seem to be preempting where I'm going to go with this. No wonder you're a wonderful team leader. But yeah, the question is this, which is something which has been I've been very curious about. It's a huge number of people Andy that you're talking about. I mean in excess of 60,000 people globally, different cultures, all of that. So somewhere I mean we've talked about the tech, we've talked about all those factors. Of course we're going to weigh in a little more on that a little bit but the people the culture the talent that's something which is very important. I believe it's the heartbeat of the organization, any organization especially at EXL which has well seen two decades of change and has been doing the change brilliantly. So simply put, is it true if I say this that it sounds like well EXL's greatest strength isn't just its technology, it's actually its people's willingness to evolve. Yeah. So look so look at the end of the day no matter you use whatever technology agentic generative at the end of the day you need the smart intellectually curious people who are always willing to learn and and I think you know at the end of the day it's a people business even with technology you need all these people so like I said what we've done is either you are working with AI or you are working in AI or developing with AI at",
        "start": 2519.68,
        "duration": 5289.759999999999
    },
    {
        "text": "learn and and I think you know at the end of the day it's a people business even with technology you need all these people so like I said what we've done is either you are working with AI or you are working in AI or developing with AI at to change right so you have to keep getting the best talent at the same time grooming your talent to the to their limits and make sure that they're taking the most advantage and giving them the best tools. But you are exactly right that talent continues to be a very very important area. A lot of these things fail because sometimes people try to put I would say just the traditional SDLC thinking into how AI is deployed and that just doesn't work. And what really really worked for us is we never got too deep into the custom software build. We were always data engineer, data scientists and obviously architects and engineers because we were deploying you know machine learning, NLP learning and doing reinforcement learning and that became an a germanine capability to build out of right and so we have just built given ourselves a unique advantage and and our talent continues to be extremely differentiated and they stay for long and so we also have a longevity advantage because a lot of our leaders have been in the company for too long which always helps and especially when they can change with every pivot and they've seen this five times over right 24 years for you Andy. so looking ahead 3 to 5 years let's say Andy I would like to pick your brain on this one. it's a two-part question which is what do you think will define success for let's say an AI organization and second bit is there is a lot of pressure Andy in terms of you know to move fast in AI so how do you balance speed with responsibility making sure that innovation stays ethical and trust it. Yeah. No, again very very important question. So you basically asked two questions on this, right? So the the first thing I will say is that and you know a lot of this is about the how so to your first question of how should organization think about this as they're on this journey. The first important thing is that you have to erase your legacy assumptions, right? which is this is the way this was done. Let me put AI into it. You [clears throat] you should just perhaps take a step back and say if I were designing this in today's world, how would that look like? And and how you make that happen is get your engineering talent, get your tech talent, and get your experts. So I'm I'm actually giving you very specifics on rather than giving you generic consulting GAN right so so one is you have to erase the legacy assumption",
        "start": 2690.0,
        "duration": 5661.600999999997
    },
    {
        "text": "look like? And and how you make that happen is get your engineering talent, get your tech talent, and get your experts. So I'm I'm actually giving you very specifics on rather than giving you generic consulting GAN right so so one is you have to erase the legacy assumption AI at the end point I always think that AI is best done at the decision point so you have to think about in a retail segment for example your inventory your pricing at underwriting it's decision right not just the end points because then you are getting the marginal lift of this you right and then and then with the new ways of doing things you have to redefine your measurements right a lot of people are overly obsessed with the cost I'm not saying don't do that but if you're going to change the way the game's going to done you're going to look at maybe not how quickly I resp how what was my time taken to respond respond it's how quickly I remove the friction for the customer regardless of the channel that they approached me right so it's like new measurements in the way you approach this versus the old way and look organizations of the future will be the ones that learn evolve and stay focused on on value right and so that's kind of my question because look five year it five years out is too long like I said we have we we do like increments of development these days but but but I Hope sort of that gives you a perspective. Yes. The the second thing to your point and and you you this is another terrific question. How do you balance speed with autonomy? And some of this I mentioned earlier but maybe I'll just pit bring it together. The first thing that comes in the way of all of this is like we mentioned this it's the trust. Yes. So you have to trust by design and and so let's put this into two parts of it. One is okay how do you make sure that you are not exposing the organization that's all your guardrails in the design but now once you've given them the lanes you need to allow them to swim freely don't create bottlenecks and hurdles and three months of review approval process right now so the future isn't about what AI can imagine it is about what AI can consistently get right. Right? Sometimes people just get too crazy about oh AI can do this and do this. My question always in the enterprise context is because with consumer it's a little bit different but in the enterprise concept context is what can I trust consistently learn from it feed it back and keep learning. Right? I think the organizations of the futures will be the learning organizations. Yes, tech will be critical. Yes, you know, you'll have",
        "start": 2878.16,
        "duration": 5988.800999999999
    },
    {
        "text": "consumer it's a little bit different but in the enterprise concept context is what can I trust consistently learn from it feed it back and keep learning. Right? I think the organizations of the futures will be the learning organizations. Yes, tech will be critical. Yes, you know, you'll have create that feedback loop from value creation to value capture. So, there's a lot of things I said, but I hope that sort of gives you a flavor of where the future is headed and how do you balance both control and speed or autonomy at speed and and let those both vectors coexist as you are scaling these AI ambitions for the company. No, very balanced and I think a very very aerodite way that you've explained it Andy in u in in the well given the positive of time etc whatever you want to call it but yeah I think it just gives a lot of clarity and trust being at the center of it all before I let you go I have to thank you for one thing it's been a very invigorating transparent and from the heart convers conversation which I have thoroughly enjoyed and it's it's been such a pleasant surprise which of course will mean that you have now been chosen to do a rapid fire. Okay. [snorts] and of course you'll have to give a message at the end of it all. But are you ready? Andy, we're going in for the rapid fire. Okay. Sure. Very quickly, ladies and gentlemen, I give you Andy Logani, the man who's nimble on his feet. He has pivoted. Can I do the entire hype intro again or should I just start? Yeah, I'll start. Fair enough. All right. So, what's the most overhyped buzzword in tech right now, Andy? [laughter] I think it's that agentic in the way people understand it. They think that it'll just do everything and displace everything tomorrow. I think there's a bit of an overhype there. it a lot goes into making that real versus just saying, \"Oh, I'll put just agents everywhere.\" Fair enough. , if you could have an AI assistant to do one thing for you to every day, Andy, what would they be? Well, the pace of change is so fast. , I try to read and learn so much. , I would just want that AI assistant to keep me completely informed with everything that's happening. And I hope I can consume all of it. I don't think anybody can, but , that would be my AI assistant. Just teach me cuz I believe we're all students. We're all learning. So the more we learn, the better off we will be in this journey. Wonderfully said. So, and this one's a little tricky one. The next one, if AI could perfectly replicate one human scale, Andy, which one would you not want it to touch? , human ingenuity and intuition.",
        "start": 3045.2,
        "duration": 6340.3029999999935
    },
    {
        "text": "So the more we learn, the better off we will be in this journey. Wonderfully said. So, and this one's a little tricky one. The next one, if AI could perfectly replicate one human scale, Andy, which one would you not want it to touch? , human ingenuity and intuition. And finally, describe EXL's AI journey in one word. , I would say very transformative. Perfect. Well put. Andy, it's been a true pleasure. But before you go, I would like for you to give a message to everyone who's watching and all the people maybe your huge team all the people whose lives you've touched and will continue to touch and the overall ecosystem. It would be nice to hear what Andy has to say. Yeah. no, Si, thank you so much. maybe a maybe a do and a don't. as I've said in this discussion so many time that if you start with the outcome and the value and then create an alignment from there and and sort of work your way to how to make it happen. I think chances of success will increase tremendously. And I think on the don't side I'll say that I I just believe that there is a lot of panic sometimes an anxiety especially driven from the top that oh my god I'm hearing all of this and why am I not seeing the results. I just think you start with the workflow you control and the data you trust and spend that time on the design correctly because if you do that the chances of success will really really go up and and you know the this is truly transformative. I am seeing value from it. It will deliver value and very very tremendous business value done right. so I'm a I'm a big believer and Sudi again thank you so much for spending the time and I really enjoyed the conversation. It's been a true pleasure and it's it's been a true honor to have that conversation with you Andy. You bring in so much of gravitas. You bring in so much of legacy and the fact that you bring in so much of knowledge and doing it so well simply and humbly and I only wish you all the best and your team all the best always onwards and upwards. this was a very special episode of simulated reality. To be honest, if you ask me didn't feel simulated feel Thank you so much. Thank you. Very dear. Thank you. Bye. All right. Bye-bye.",
        "start": 3228.079,
        "duration": 6643.102999999995
    }
]