[
    {
        "text": " We have been told again and again that AI is coming for our jobs. An eviction notice if you will for your desk, your salary and for that matter your security. If you've been on LinkedIn lately, you felt that collective knot in the stomach of every IT professional in India. But a massive study of 651 firms just announced a reality check. The AI apocalypse isn't a mass layoff. It's actually just a management consultant's dream. While the workforce isn't being erased, the door is closing very tightly for freshers. As work becomes harder and more specialized, please don't get me wrong and think that this is the end of the Indian IT dream. It actually just might be the end of the average employee. And today I have with me Suprit Kunda, our tech journalist who has been well researching this and a lot more. and he is going to be shedding light on the context the report and what probably lies ahead. Welcome to the show Supre. How are you doing? It's a pleasure as always. Hello Sudhi. Happy to be here once again. How are you doing? Wonderful Supre. So let's just start off with the fact that 651 it's a massive report. What is the report trying to say first and foremost and what's new about the report? Right. So over the last few weeks we've heard a lot of chatter from industry leaders especially from the west. You've got Dario Amade from Anthropic, Vinod Coastal also recently saying that Indian IT is under threat. The IT service industry is under threat from AI. So what this report does is to try and paint a better picture of those statements, debunk how much of that statement is true and what are the nuances that these you know surface level statements sort of miss and this survey exactly you know puts puts puts those insights into perspective. And what is new is that u it just says that it isn't as doomed as people says okay but with a lot of caveats especially in terms of how the research is conducted which we will get to you know stage by stage but but yeah I think what this report is trying to say is that the debate is a lot more nuanced it's it's not a blanket it's not a blanket statement to make that Indian IT is a lot of sectors within Indian IT there are a lot of kinds of jobs within Indian IT and the myths that Indian IT Most of Indian jobs are just repeatable and something that that can be that is just a wrote a work or just a manual labor that can be repl is sort of false is what the report is trying to which brings me to this which is interesting which you just mentioned right that the most exposed sectors to AI actually have a demand for people isn't that counterintuitive",
        "start": 0.08,
        "duration": 331.0399999999999
    },
    {
        "text": "work or just a manual labor that can be repl is sort of false is what the report is trying to which brings me to this which is interesting which you just mentioned right that the most exposed sectors to AI actually have a demand for people isn't that counterintuitive of the core statement that the the report is trying to make. I think the report even starts off with something really strong. I think we can see this on our screen that the the report says that everyone has opinions but we have the data is okay what they say that's a strong statement and this report before we forget is from the Indian council for research on international economic relations and open AI open some of their chief economists and strategy folks have also collaborated in the report so they're serious people who do exactly of course this is a very very legitimate source a very a serious source we've got economists who've done this all their life so Again you mentioned this has 651 companies in in in the report and what they've done is they've interviewed all these people and they've addressed how much of an exposure does your does a particular job have with regards to AI exposure in the sense how much it can impact in terms of productivity increase in terms of reducing the work that a human has to do whether it's a certain part of it or end to end and this figure too as our viewers can see on our screen shows that statisticians and mathematicians or app developers, database administrations, basically a host of software engineering jobs receive the highest exposure. Give me a few numbers if you don't mind just for my reference. Right? For example, if you were to say that one is the lowest exposure and five is the highest exposure to AI, statisticians and mathematicians have an average exposure a mean exposure of 3.86 out of five. That's high. That's pretty exposed. You got app developers, database designers, and computer network administrators and basically software engineers all upwards of three and and 3.3. So they're pretty much exposed to AI, right? It's like being exposed to radiation in a way. Exactly. But the thing is the interesting aspect that even the researchers say that they were surprised is that when they asked people the industry leaders okay you've you say that these sectors are exposed to AI how much has the hiring demand drop dropped or increased surprisingly they found that the demand or the requirement for people in these sectors that were highly exposed to EI were also high right this is the graph that are that's actually quite interesting Exactly. So that's counterintuitive, right? So for example, this figure three that people can sort of see on our screen says that let's say application developers, right? High exposure to AI, but the demand for them has also increased. How does that",
        "start": 166.64,
        "duration": 634.0009999999999
    },
    {
        "text": "the graph that are that's actually quite interesting Exactly. So that's counterintuitive, right? So for example, this figure three that people can sort of see on our screen says that let's say application developers, right? High exposure to AI, but the demand for them has also increased. How does that that happens, let's also look at the people or the roles and skills whose demand are going is also decreased due to AI. Right? Now this includes data entry or even if you look at software testing inspection quality assurance which is more road to work as you mentioned exactly then you've got HR administration coordination roles all of these also have high exposure to AI highly impacted by AI but also hiring has decreased sure what is this distinction that's happening right let me reiterate one sector highly exposed to EI demand is also getting higher the other sector also highly exposed to EI moderately exposed to AI but demand is getting lower why is it is the creative aspects or the more more or less exactly you're getting there. The thing is they've broken these two down into you know profit centers and cost centers. Fair enough. One set of people the first set of people that I spoke about mathematicians, staticians, software developers, they fall under the profit sector, the profit centers of these companies. Exactly. They generate money, right? You got let's say they undertake more and more projects which means more and more revenue with regards to the cost centers they're fixed right they they of course are a huge strong backbone to the profit centers but they do not directly bring in revenue fair let's say an HR team or a powers is not listening exactly that's that's what I'm being really careful because I personally also believe that they're a massive backbone to the profit sector as well but they do not directly bring money we have by the way I I'm so sorry just a disclaimer we have a positive of time and we need to cover a few things so I'm just of course right thanks for mentioning that so this is the key aspect right so what they're saying is that more and more people you bring in the profit sector the profit center of people right you bring in more software engineers AI impacts their productivity more work gets done the job the the manual work is reduced these people sort of outsource their wte work or the repeated work to AI they can take on more projects right so that's the intuition or that that's the you know nuance that they're bringing if you can see the diagram that is being shown on the screen you got adoption of AI higher productivity this does not mean in the long run more and more people headcount is reduced you can get more people which means they get to use moreitionally basically put you put it very simply",
        "start": 320.24,
        "duration": 921.842
    },
    {
        "text": "the diagram that is being shown on the screen you got adoption of AI higher productivity this does not mean in the long run more and more people headcount is reduced you can get more people which means they get to use moreitionally basically put you put it very simply profits keep on increasing again this is what the research is trying to sort of finally that's on you to breathe everyone looks at exactly in a nutshell is that you got higher headcount higher profit because more and more projects are being undertaken because more AI is being used which I think in a way I mean I put this down for you but I guess you have already answered it but still if you could just very quickly tell me what kind of skills should people look out for right of course so based on the interviews that they've taken with the 651 companies and their industry leaders generative AI skills the ability to use these skills are quite high. You know, 68 out of 70 people said that. Then you got data analytics, data science, machine learning. Basically, something that that's really true to the technical aspects of and this is for of course all the people who are watching right now. This is very important. Of course, you got to be proficient in today's AI tools, proficient in knowing what gets you huge amounts of productivity gains, something that is much sought after today, yet something that's really fundamentally true to computer science and AI. So that those are the skills that are in demand. Finally, I'd like to ask you and this is important for for us to kind of you know debunk in a way as going back to our legacy together. the fact that there we we cannot walk away from the fact that Indian IT has had huge layoffs, massive layoffs, which brings me to this question. Does this report then give a very clear unbiased unmitigated picture to the people or is it something hidden in the nooks and crannies? Right. Of course to I think objectively answer that question yes there have been layoffs and this report does not disagree explicitly that there haven't been any layoffs. It does say that demand has declined for specific roles like manual you know quality assurance or software testing. Unless we clearly have a picture of what those layoffs in Indian IT specifically, what roles they were for, we cannot like correlate as to whether this report is being truthful to it or not or if it just misses that nuance. On the other hand, what I also find a little concerning with this report at least as per my knowledge again I'm happy to talk to the makers of the report is that this relies mostly on the qualitative aspects right the questions asked assess the sentiment. It asks, hey in the range of 1 to 5, tell me",
        "start": 466.72,
        "duration": 1195.9210000000003
    },
    {
        "text": "little concerning with this report at least as per my knowledge again I'm happy to talk to the makers of the report is that this relies mostly on the qualitative aspects right the questions asked assess the sentiment. It asks, hey in the range of 1 to 5, tell me AI. But you know, it'd be more concrete if there were exact numbers. Let's say they're talking to an IT company. Again, a valid point. They get the exact numbers like okay, these were your number of headcount in 2024. This was your in 2025. Can you explicitly tell me how many people from software engineering division were laid off because of given given these gaps? But still, how would you rate this report? And finally, how would you like to tell all of the people who might be a little anxious given all of the stuff which has been going around in terms of the rumors call it in terms of the general discussions. What would you like to say this report does for them? Of course, this report is of immense value in terms of assessing the sentiment of the IT industry folks, the decision makers in terms of understanding what they think and how their company needs to grow. And of course, there are a few nuances that you need to be careful about. This does not get the exact numbers. This is a a qualitative research at the end of the day. Gives you an insider view of what our industry leaders. It's not falling apart. It's not of course it's not falling apart based on what the report says. But of course, we need more and more IT leaders to be more open again if they can be because they're dealing with publicly listed companies out here in terms of what the layoffs were, whether AI actually disrupted it and by how much. Until we have those numbers, we cannot paint a black and white picture. But this does give you a good idea of can we summarize this Supre finally by saying this in one line that people don't need to panic if they are upskilling themselves but they definitely need to panic if they are not trying to figure things out for themselves. 100% that's always been the case. Go out there be proficient with AI tools right be proficient in building right the world needs more and more builders if not for IT companies. Tons and tons of startups are being born every day that that you know seek high quality engineers with like a good amount of skills in AI and knowing what works best and a great idea of of being a big problem solver. So this report basically reinforces that again if you can see on the screen the amount of skills that are in demand today are all demanding proficiency in AI. So you don't need to panic as long as you trust yourself and",
        "start": 605.92,
        "duration": 1448.962
    },
    {
        "text": "idea of of being a big problem solver. So this report basically reinforces that again if you can see on the screen the amount of skills that are in demand today are all demanding proficiency in AI. So you don't need to panic as long as you trust yourself and today. But yeah, Indian it is not falling apart as per this report given how they also want to invest in generative AI and associated tech. Got it. Well, as always, Supri has made his points quite elaborately and all I have to say to everyone who's watching please become a part of the profit center of a company. Upskill yourself and I guess what is being frowned upon right now is mediocrity. This ladies and gentlemen is well front page by the A IM network. Like, share, subscribe and always remember think AI, think AIM.",
        "start": 734.24,
        "duration": 1518.5620000000004
    }
]