[
    {
        "text": " Let us start with something painfully familiar. You open your laptop to do one simple thing. Let us say book a flight. Suddenly you have five tabs open. One for flights, one for hotels, one for emails and one which is well a spreadsheet and somehow you're still not done. That small everyday frustration that's the problem big tech is now racing to solve. Usually when we talk about AI on this show, it is relevant but maybe not personally for you. Trillions of parameters, giant data centers, slides that look very serious. But tonight is different. Tonight is about execution because Mark Zuckerberg just spent $3 billion to make AI stop talking and finally start doing. The company is called Manos. You probably haven't heard of them because they didn't exist two years ago and Meta just bought them in a deal that came together in 10 days. 10 days. Yeah, that's less time than most of us take to pick a phone case or for that matter take to commit to a Netflix series. So why the rush? Why did Meta drop everything for this one team? Because they realized something very crucial. The chatbot era is over. We all played and interacted with chat GPD. It's impressive. It writes poems, summarizes emails and whatn not. But let's be honest, it's lazy. It talks. It doesn't do. It won't open your calendar. It won't click the buttons. It won't finish the job. Manus has been built the opposite. They didn't build a poet. No, they built someone who actually finishes the task. A digital intern. and a relentless one. No coffee breaks, no sick leave, and most importantly, no will revert, sir. While everyone else was trying to make AI sound human, Manus was teaching AI to use a computer like a human. Their engine works in a very simple principle, which is don't tell me what to write, tell me what to do. Research this talk, book this hotel, code this website. And then it just well goes and does it. It navigates the web, clicks links, fills forms. It's the difference between asking for a recipe and having a gourmet chef cook you your meal. And the numbers, well, they explain why Meta moved so fast. In just 8 months, yes, 8 months, Manis reportedly crossed $100 million in annual recurring revenue. 8 months. At this point, if you're feeling a bit of an echo in the studio, you're not wrong. And neither is that number 8 months. They processed 147 trillion tokens, spun up 80 plus million virtual computers, and outperformed even Meta's own internal benchmarks. That, ladies and gentlemen, right there is what is the definition of traction. Manis was built by hardcore engineers from the Beijing tech scene and we all know how complicated that can get. Washington wasn't going to approve this deal. Beijing wasn't going to allow it. So, the founders did something bold and outlandish. They packed up, moved",
        "start": 0.16,
        "duration": 432.238
    },
    {
        "text": "is the definition of traction. Manis was built by hardcore engineers from the Beijing tech scene and we all know how complicated that can get. Washington wasn't going to approve this deal. Beijing wasn't going to allow it. So, the founders did something bold and outlandish. They packed up, moved operational ties, rebuilt the company to work and align with the West. The moment they landed, Meta was waiting check in hand because Meta doesn't own abstract platforms. Meta owns WhatsApp, Instagram, Messenger and right now those apps are only for talking. So let us imagine a future where they become apps for living. You open WhatsApp and type, plan a weekend trip to Paris for me and my partner under $2,000. book everything and then you just put your phone away. No Expedia, no switching apps, no spreadsheets. And then voila, two days later, you walk out of the airport smiling, looking for the Eiffel Tower with the only thing then, well, left for you to figure out is the French. Best of luck. That's the trillion dollar dream. WhatsApp as the remote control for your life. Honestly, this sounds amazing, but let's take a beat and be realistic as well. Stuffing this very powerful engineering tool into WhatsApp, that's hard. If they get it wrong, this becomes Clippy 2.0, annoying, intrusive, and very quickly muted. But if they get it right, we stop being users. We become managers. We don't click anymore. We delegate. And Zuckerberg has realized very quickly and is not betting on another chatbot. He is chasing and betting on the fact that execution beats conversation. That the future of AI isn't who sounds smartest, but who quietly gets things done. The tech is already here. Meta just bought it. Now comes the only part that truly matters. Can they ship it? This is Front Page by A IM Network. Please like, share, and subscribe till well manus starts to do it for you. Think AI. Think yeah I am. [music]",
        "start": 216.959,
        "duration": 671.6049999999998
    }
]