[
    {
        "text": " [Music] talk about it. But tomorrow we'll talk more about it. There'll be a new model drop as well which will take that entire experience to the next level. Tomorrow Microsoft will drop a brand new AI model. And that clip you just saw, yes, that one is our first real hint of what's coming. Tonight we are breaking down everything we know so far and why this next model could be the first Microsoft AI model tuned specifically for India. But before we get into it, as always, you know what I'm going to say. Yes, like, share, and subscribe. This is Front Page by A IM Network. And now, if you're ready, moving into Microsoft AI, which has been very quietly building two in-house pillars, a highly expressive, extremely fast voice model capable of generating 1 minute of natural audio in under a second, already powering co-pilot daily podcasts and co-pilot labs. So for a country like India where voice is often the first interface, this is a huge foundational shift. Microsoft's first fully in-house foundation model. A mixture of expert systems trained end to end on 15,000 Nvidia H100s designed for richer instruction following everyday reasoning, responsible consumer use, which is now live on LM Arena and gradually rolling into co-pilot. So together, these two models show where Microsoft is headed. AI that is fast, multilingual, responsible, and people first. And that's exactly why tomorrow's announcement sits at the perfect moment. Based on Microsoft's current roadmap, plus India's linguistic needs plus the company's investment strategy. This upcoming model could be India tuned, multilingual across Hindi, Canada, Marathi, Telugu, Tamil, Bengali and more. accent aware optimized for mixed speech which is English kang English etc ready for government enterprise and population scale platforms so let us actually kind of imagine this a co-pilot that understands mixed Indian speech naturally a voice model that sounds like everyday India AI that works natively across Indian languages without hacks or workarounds this is the kind of foundation required to take AI out of metro cities and into classrooms, MSMES, farms, hospitals, courts and job portals across India. Just yesterday on front page we broke it. Microsoft is investing 17.5 billion which is approximately 1.45 lakh cr rupees between 2026 and 2029 to build India's AI infrastructure, sovereign cloud and talent engines. One of the most surprising threads running through the last 48 hours is this Satya Nadella building with AI agents personally. Yes. So during his keynote, Satya opened his laptop and showed an AI agent he coded over Thanksgiving, a real internal tool built with Copilot multimodel orchestration and the evaluation first approach he now considers essential to AI development. He of course went on to joke and he said this AI is moving so fast I may have to join the co-pilot team as an intern just to keep up. End quote. And then of course he walked the audience through how that agent runs AI cloud councils",
        "start": 2.76,
        "duration": 455.479
    },
    {
        "text": "development. He of course went on to joke and he said this AI is moving so fast I may have to join the co-pilot team as an intern just to keep up. End quote. And then of course he walked the audience through how that agent runs AI cloud councils Karpathi where different models debate challenge and refine decisions. His favorite test and this is probably one of my favorite as well. I'm sure it's yours as well which is picking the all-time Indian test cricket 11 with agents arguing over Seab BBS Lakshman Capil Dave and Dhoni as captain. Funny on the surface, not really but well it revealed the mindset shift he wants the world to embrace. This generation of AI starts with the evaluation loop, not the spec. And here's where the story intersects with Goautam Adani. Just yesterday, Adani publicly said that during their meeting, Satya showed him an AI app he personally built, hands-on experimental, the same philosophy he demonstrated on stage today. Adani described it as a glimpse into how Microsoft's leadership itself is working with agents not just shipping platforms but using them to make decisions test ideas and accelerate internal workflows. So let's put the pieces together and the signal that we are getting is quite unmistakable which is when the CEO of Microsoft is building agents at home and India's biggest industrialist is discussing those very agents as part of their 360 degree partnership. It tells you where the future of AIE enterprise is actually headed. A future where leaders prototype their own tools. Companies run AI councils before decisions and India becomes one of the earliest test beds for agentic systems at industrial scale. Exactly the kind of shift both Satya and Adani hinted at in two cities 24 hours apart. So if there was one clear message to India's IT services sector today, it was this co-pilot and agents are going into full production. On stage, Satanadella called out how Indian IT is now building full-blown AI factories on top of Microsoft stack. Not just doing PC's, Cognizant, Infosys, TCS, and Vipro have all been tagged as Microsoft's frontier firms for large scale co-pilot deployment. Each committing to roll out co-pilot and agentic workflows to tens of thousands of employees and clients around the world. So what does that actually look like? Well, Cognizant has built its own multi-agent framework on Microsoft Foundry already powering a high volume internal application, which means think multiple specialized agents coordinating in the background to handle workflows that used to need entire teams. Vipro is actually wiring data agents on Microsoft Fabric into its sales and finance functions using real time data plus my fault plus fabric agents to rewire how forecasts revenue intelligence and decision dashboards are built and refreshed. Persistent is combining Foundry plus Foundry local deploying models on device for secure low latency enterprise apps. A glimpse of how edge Aai will coexist with cloud GPUs in",
        "start": 232.879,
        "duration": 874.2800000000004
    },
    {
        "text": "time data plus my fault plus fabric agents to rewire how forecasts revenue intelligence and decision dashboards are built and refreshed. Persistent is combining Foundry plus Foundry local deploying models on device for secure low latency enterprise apps. A glimpse of how edge Aai will coexist with cloud GPUs in services, Swiggy Instamart is the poster child for AI infrastructure in the wild using fabric realtime intelligence to track millions of orders, optimize 10-minute deliveries, and run dark store operations with secondle telemetry instead of our level batch reports. All on Microsoft's data stack. On the media side, Microsoft also spotlighted India's creative ecosystem including studios like collective arts networks which are using foundry and custom models to build full AI assisted pipelines for animated features like Mahabharat and Hanuman turning India into a test bed for AI first film production. So let's all put this together. These are Microsoft's proof that India's IT plus platform plus startup triangle is already shipping real agentic systems from BFSI and consulting to quickcommerce and cinema and that the 1.45 lakh K rupees AI bet announced yesterday is already being translated into live deployments not just key note promises. So if Satya set the architecture for India's AI decades, Punit Chanduk the president Microsoft India and South Asia explained the lived reality of what the next few years are actually going to feel like for founders, enterprises and India's 22 million developers. And of course he began by naming the moment the world is in perpetual beta. end quote. Basically rewiring itself around intelligence, how it's produced, where it flows and who benefits. Punit drew a straight line between India's last decade and its next Aadhaar, UPI, fast tag, Digilocker. These were the tracks of DPI. Now those same tracks are being rebuilt into AI public infrastructure, sovereign clouds, autonomous workflows, co-pilots, agent ecosystems and compute accessible everywhere from classrooms to boardrooms. Microsoft's mission, it's this. We want to be co-pilots to India's AI transformation. End quote. The translation to that basically want to become a default intelligence layer that ensures no Indian gets left behind as AI becomes abundant. Punit said something that reframed the conversation completely. Every business will need an agent factory. Every leader will become an agent boss. End quote. He explained the pattern Microsoft is now seeing across Indian enterprises. The clear tax which is 75% of gig workers filing taxes through AI minutes instead of hours. Physics VA AI tutors answering student doubts in one minute. Genpack end to-end finance workflows reimagined with agents. USD IT giants GCC's preparing for thousands of digital colleagues. These are what he calls frontier firms. Companies that behave like frontier models, always learning, always improving, always iterating. These firms aren't adding AI to old processes. They're actually rewiring the processes themselves. And in Punit's words, if the model eventually knows everything, what does your business know? Your differentiation becomes your AI factory. End quote. Punit laid out five",
        "start": 444.72,
        "duration": 1325.959
    },
    {
        "text": "like frontier models, always learning, always improving, always iterating. These firms aren't adding AI to old processes. They're actually rewiring the processes themselves. And in Punit's words, if the model eventually knows everything, what does your business know? Your differentiation becomes your AI factory. End quote. Punit laid out five headed. Digital colleagues enter the workforce. Agents with perception, cognition, and agency. Real teammates, not tools. The first API call decides the next hyperscaler. Startups no longer ask which cloud. They ask which model. The inefficiency economy collapses. Billions by hours dies when AI can do the job in seconds. So everything moves to outcomes and microtransactions. Every company builds an AI factory. Take an openweight model, infuse proprietary knowledge, then ship differentiated intelligence. Jobs get unbundled, not stolen. AI pulls apart tasks. Humans rebundle into higher order work. And that's why Pune dropped the most striking line of the day. And here it is. we will be the last generation to have stable long-term careers. End quote. This is guerilla warfare against irrelevance. Pun's final argument was deceptively simple. Countries don't win because they build frontier technology. Countries win because they diffuse technology. India is the world's best diffusion engine. AI reaching teachers, gig workers, truckers,memes. 20 million people being skilled. DPI turning into AIPI. 22 million developers moving to an agent first model. Sovereign cloud ensuring India's data stays in India. And he of course summed it up with India's moment in one line. India rises when a billion Indians rise with AI. End quote. This is exactly the shift from building apps to building agents to building intelligence as infrastructure. And finally, here it is the front page take. So if tomorrow brings a Microsoft model tailored for India's languages and workflows, it could become the layer that unlocks AI for millions. India is no longer adjusting to global AI systems. Global AI systems are now adjusting to India. And tomorrow we see the next step. Now I would like to throw it to Amitab sorry Amit Raja Nayak and Siddhhat Jindal on ground in Bengaluru today bringing you exclusive conversations developer perspectives and everything Microsoft announced beyond what we've already kind of tried to cover as much on front page. Please make sure to watch that entire segment because it shows exactly how exciting India's AI future actually looks. This is front page by A IM network. Like, share and subscribe and always remember think AI, think AIM. Hello everyone, this is Amit Rajan from AM Network. Welcome to front page. Thank you Sudep for that warm introduction. The energy is mad here at Microsoft AI tour here in Bangalore. where we saw more than thousand people attending this particular event including customers, partners, media professionals and few student organization and developers. they were all here today in Bangalore. So this is the second edition and the first edition happened back in Delhi with the announcement of 17.5 billion investment here in India in",
        "start": 673.76,
        "duration": 1761.1589999999992
    },
    {
        "text": "than thousand people attending this particular event including customers, partners, media professionals and few student organization and developers. they were all here today in Bangalore. So this is the second edition and the first edition happened back in Delhi with the announcement of 17.5 billion investment here in India in Microsoft's largest investment here in Asia. Nothing like seen before and we also seen other investment coming from different companies. but Microsoft investment is purely to build a digital public infrastructure upskilling the next workforce and in terms of enabling enterprises to become AI frontier companies. So this was a key announcement from yesterday but today we got to see the glimpse of how Microsoft has partnered with Indian IT companies including your Cognizant VIPro TCS and all of that and how they're adopting Microsoft Copilot 365 into their enterprise and how they are upskilling their workforce in terms of the new agentic era that is coming and it's pretty interesting to see also a couple of use cases that was announced from Cognizant from Swiggy and some of the other companies that have adopted these solutions into their applications and product in terms of delivering value ad to their customers. So this was something very interesting. A lot of use cases were discussed here. But another interesting part here was Satya building his own agents. So right so this was something very interesting. You might might be familiar with Adani's tweet recently which popped up saying that Satya has built his own applications. We got to see the early glimpse of hopefully that that would be the thing that Sacha is building in terms of multiple agents that he has built over a period of weeks and how it works. You're going to see more of that in the coming days and we're going to show you hopefully in the clips and also this is one side of the spectrum but also there was also another keynote by Pune Chanduk where he showcased how companies need to become AI frontier companies in the coming months alongside few trends in terms of what to expect in the coming months and days. really interesting this was the take from your Microsoft AI tour here in Bangalore. We have Siddha Jindel tech journalist covering and talking to leaders out there. So stay tuned. Don't go anywhere. There's going to be more exclusive conversation and discussion that are going to happen here. Over to you Sidat. thank you. Hi Ash. I wanted to understand like how how is your company using Microsoft suits of products and like what got you here today at the Microsoft AI tool? Well, , you know how it was, right? It was all about cloud before and then it was all about AI and generative AI, but it's all about agents now and essentially agents being your assistants. , having the ability to train your agents, build your own agents with, you know, whatever Microsoft tools",
        "start": 893.199,
        "duration": 2081.3989999999985
    },
    {
        "text": "how it was, right? It was all about cloud before and then it was all about AI and generative AI, but it's all about agents now and essentially agents being your assistants. , having the ability to train your agents, build your own agents with, you know, whatever Microsoft tools a lot of trainings recently and I have actually been you know talking to people who are actually developing solutions, developing agents and you'll be surprised to see what kind of automations that they are implementing in place to make our daily work like easier and easier. So I feel that Microsoft you know giving us the platform giving us the ability to integrate things like right out the box you don't have to like be super super super funky about you know research and R&D and whatnot you just do couple of next next ask your copilot ask your chat GPD couple of questions and you have the answer right there right so I believe that you know Microsoft being the frontier of all that enabling workforce like us to do magic with just few clicks. I think that's that's that's going to be the game changer. Thank you so much. Yeah. Hi, we have got Karan from GitHub. Hi Karan. Good to have you. Hi Sat. So like in your words like what were the key highlights from today's Satya Nadella's keynote like in your own words? Yeah I think the greatest thing is that there is so much potential for developers especially in India where developers are growing. So much innovation is happening and also how agents are really helping you throughout your software life cycle and where you can use it across from anywhere that you work with. Right? So all of this coming together is fueling so much of innovation with so many organizations so much of skilling so much of you know collaboration as well that's that's happening. So really really excited to see you know this power with developers who can really wield it for a betterment of the country and the society itself. So that was really exciting to hear about the vision and also showcase how all of the different products of Microsoft and GitHub and VS Code and Copilot etc can come together to do that like according to you like why Indians love GitHub like what makes GitHub their favorite and like you know the number is going well you know it's a whole lot of developers when they are starting to learn coding be it in their student journey or be it even their professional journey. Git and GitHub is almost a table stakes for many developers today because that's where collaboration happens. That's where software development happens as well. So it's something which really helps folks connect with each other, learn, work with their team as well and then also with all of the AI features utilize the power to bring their ideas and vision to life",
        "start": 1056.16,
        "duration": 2450.8389999999995
    },
    {
        "text": "because that's where collaboration happens. That's where software development happens as well. So it's something which really helps folks connect with each other, learn, work with their team as well and then also with all of the AI features utilize the power to bring their ideas and vision to life to aspiring Indian young developers? My advice to a whole lot of young developers or aspiring developers is that it's it's never a better time than today for anyone to be a developer because you look at all of the tools that you have available with you to build your ideas and bring it to life. You look at the collaboration available. You look at how easy it is for anyone sitting here to collaborate with anyone else in the country or even the world. itself to build a whole lot of software together. So you can think of an idea in the morning and build it in the afternoon. So so so start start utilizing all of these tools and also start thinking about how you can bring all of those different ideas into life for the betterment and helpful of yourself, your society, your organization, the country and the world itself. Like if you were to make a one bold prediction for 2026, what will it be? Well, rather than 2026, I would probably notch it up a further and then re-echo what Satya mentioned that India is on track to become the largest developer community in the next few years. So that's that's the prediction. Thank thank you so much Shan. This is Shidaran. I am part of Global Logic Hitachi group of companies. Yeah, big big platform with Microsoft AI, Azure, Copilads. It has really transformed the way you code. No matter it's traditional coding, it's all about prompt engineering, how you use the copilot, how to use the DevOps. So I think it's amazing the kind of power it gives you now. what you can do much faster with the lesser resources. It's it's exciting days. More more often I work with people like Karan on skilling and Microsoft is doing amazing work. You heard them today 20 million people to be trained what not. I think this is an amazing journey. This is my fourth year consecutive to be in the AI tour. Thanks for having me. So like what are the major challenges in DevOps which Microsoft is solving for you. So I think it has too many desperate systems and disconnected systems. You take genkins you you have so many variety of that right cloud VS and all I think putting them all together like you saw in the demo today. So you can take one platform put a Gemini there even though it's a competition right you can put a Kimi there everything. So I think that's a bigger bigger advantage. Take like an AI foundry put all of them what you are favorite with not restricted to",
        "start": 1243.6,
        "duration": 2764.758999999998
    },
    {
        "text": "demo today. So you can take one platform put a Gemini there even though it's a competition right you can put a Kimi there everything. So I think that's a bigger bigger advantage. Take like an AI foundry put all of them what you are favorite with not restricted to part of it. The open source part I love it. You love all the 11,000 models which are available on foundry. Yeah exactly. The a foundry is unbelievable. Yeah. Okay. So first and foremost Bangalore is like far more developed. No no no offense man to any place else right. I'm a Bangaloreian by heart. 25 years I'm here. I think the talent availability in Bangalore is unbelievable and nowhere else you have it across the world right number one. Number two, you should also look beyond Bangalore. There's something called Kadum if you're familiar with Karnataka digital economic vision which is beyond Bangalore. There's an initiative. So like Kubli, Darw there are so many places that you can develop. I'm part of many of these universities and board of studies like Gok or Sungor the talent there is unbelievable. Now you need to nurture that. You can't expect everybody to come to Bangalore and then choke your outer ring road then you keep complaining oh it will be there right any any town so to to answer you leave the sectoral governmental policies I think as a talent it is our responsibility to build it don't do in city colleges that's where I have been focusing on I run a foundation called techa foundation it's a section 8 company nonprofit organization working with Microsofts and Googles of the world taking them to tier 2 cities and tier three colleges cuz that is where it is more niche. You can't just feed the same kid again and again and again. Thank you Sid for that wonderful conversation with all the tech leaders. definitely loved the current demo and really interestingly to see how enterprise are going to leverage Microsoft Copilot 365 into their daily lives and how it's going to transform enterprises, consumers and all the startups out there. Really thank you guys stay tuned there going to be more announcement coming tomorrow at the Mumbai event. Satya dropped a bomb today where he mentioned that Microsoft is going to launch a new model which he couldn't talk much. but there's going to be more announcement coming tomorrow as well from the Mumbai event. Stay tuned. This is Amit Rajanak signing off from Front Page. [Music]",
        "start": 1403.28,
        "duration": 3004.629999999996
    }
]