[
    {
        "text": " nuclear energy for the first time in 60 years. And Tata Power is moving to break China's hold on solar wafers from right here in Odisha. Math, nukes, solar. Three moves that change who leads the next decade. Here are the headlines. Chinese lab Deepseek has released Deep Seek Math V2, the world's first openweight AI model to hit IMO 2025 gold medal level. Five out of six problems beat human toppers on Putinham with 118 [music] out of 120 and rival Google's Gemini Deepth think and open AAI's GPD5 [music] class reasoning by using a self-verification loop of generator verifier metaverifier showing that open self-checking [music] models can now challenge closed US giants on the hardest mathematical reasoning bench. benchmarks and potentially reshape how we build trustworthy AI. India will for the first time in 60 years allow private participation in nuclear energy through the upcoming atomic energy bill 2025 unlocking investment in small modular reactors, advanced reactor technologies and a competitive domestic nuclear manufacturing ecosystem. as the country targets 100 gawatt nuclear capacity by 2047. And finally, Tata Power is in advanced talks with the Odisha government to set up a 10,000 cr rupees 10 gawatt ingot and wafer manufacturing plant at a coastal location like [music] Gopalpur or Katak. a backward integration move that will feed its 4.55 gawatt cell module lines, open a new export base and plug one of India's last big solar supply chain gaps still dominated by Chinese imports. [music] Good evening. The whale is back and this time it brought an IMO gold medal. an open-source model from China just did something only Google DeepMind and OpenAI could do and then publish the weights on hugging face for free. Deepseek, the same lab that rattled Nvidia and wiped billions of big tech valuations with its ultra cheap R1 model has gone quiet for months. But tonight, the whale is back. They've dropped Deep Seek Math V2, a specialized reasoning model that hit gold medal performance at IMO 2025, which is five out of six problems, scored 118 out of 120 on the Putnham, beating the best human and in Deep Seek's own test, Outreason GPD5 thinking and Gemini 2.5 Pro on hard Olympiad style math, even on its first try. Oh, and one more thing. This is the world's first openweight IMO gold medal model. So, is GPD5 in danger? Google's Gemini Deep Think no longer alone at the top and is self-verification now the real arms race in AI, not just bigger GPUs. This is Front Page by A IM Network. Let's break down what Deep Seek just did. Why every serious AI lab is now watching China and what this means for the future of reasoning research and your next AI product. But before we do that, please make sure to like, share, and subscribe. Now that you've done it, let's go ahead. Deepseek has released Deepseek Math Wii 2, a math specialist model built on top of their experimental",
        "start": 0.0,
        "duration": 511.21899999999994
    },
    {
        "text": "means for the future of reasoning research and your next AI product. But before we do that, please make sure to like, share, and subscribe. Now that you've done it, let's go ahead. Deepseek has released Deepseek Math Wii 2, a math specialist model built on top of their experimental EXP base. On paper, the numbers are insane. IMO 2025 solves five out of six problems, which is gold medal tier. China Mathematical Olympiad 2024, again, gold medal level. Putnham 2024, Undergrad Math 118 out of 120, higher than the best human score of 90. This puts Deep Seek in the same elite club as Google Deep Mind's Gemini Deep Think, OpenAI's internal reasoning model that also hit IMO gold. The difference, Google and OpenAI are still closed. API only, internal only. Deepseek just threw an IMO gold brain on hugging face and said here download it. That's basically a shotfired at the entire closed model business model altogether. Most AI benchmarks today are well wibes. You throw a bunch of multiple choice questions or short answers at a model and if it gets the final number right, you declare victory. That works for AIM, HMMT, school level math. It doesn't work for IMO level problems where there is no simple final answer. You have to produce a rigorous proof. Every step can be right, almost right or completely made up. Traditional RL methods reward final answer correctness models. Quickly learn a bad habit. Bluff your way through the proof. Pray the last number matches. Deepseek math v2 flips this. It doesn't just ask did you get the right answer. It asks did you prove it properly and did you check yourself. The core idea reward self reflection not confident nonsense. Deep Seek basically put three characters inside this system. The problem solver which is the generator writes the proof also writes a mini self-critique. This step might be wrong. I'm unsure here. The reward function is wired so that admitting doubt plus fixing it later is greater than bluffing confidently and being wrong. So the best strategy is equal to find and correct your own mistakes before submitting. The ironfisted judge which is the verifier a separate model trained just to grade proofs step by step doesn't care about final answer scores like an Olympiad jury. One is fully rigorous.5 is idea correct details missing and zero is logically broken. The auditor of the judge, the metaverifier, checks whether the judge itself is being lazy or hallucinating errors. If the judge flags a mistake that doesn't exist, then the judge gets punished. Wow, how interesting. Anyway, this forces the verifier to be both strict and honest. Over time, this creates a closed loop. The generator keeps discovering new weird proofs which leads to exposing blind spots. The verifier gets retrained on these tricky proofs. Resultantly, it becomes sharper. The metaverifier keeps the whole system from gaming its own rules. So in the last training stages, Deepseek says human",
        "start": 267.759,
        "duration": 964.2579999999997
    },
    {
        "text": "this creates a closed loop. The generator keeps discovering new weird proofs which leads to exposing blind spots. The verifier gets retrained on these tricky proofs. Resultantly, it becomes sharper. The metaverifier keeps the whole system from gaming its own rules. So in the last training stages, Deepseek says human is autoleabeling its own hard proofs with a quality that matches expert judges. And this is the real story. Not just AI solves IMO, but AI builds, tests, and upgrades its own reasoning engine. Here's the brutal part. Even if you strip away all of this multi-step thinking and selfcorrection, even if you say, let's say, no chain of thought, no retries, just answer once, Deepc claims math vi 2 still beats GPT5 thinking high from open AI. Gemini 2.5 Pro from Google on a tough internal benchmark spanning algebra, geometry, number theory, combinics, inequalities comparable to China's high school math league. So especially in geometry, Deep Seek Math V2 reportedly scores almost three times of Gemini. So two things are now true at the same time. It's raw intuition. one short answer is already elite. So when you allow it to think multiple times plus self-verify its proof quality jumps even higher and this is exactly how humans work. The first draft usually is intuition. Second draft self-critique not always but yes. Final draft carefully checked solution. Deepseek just showed that self-verification plus test time compute is a more powerful lever than just make the model bigger and hope that's a direct strategic challenge to the GPD5 style of more parameters, more data, more GPUs. So why opensourcing this is a big deal? Here's why. Deepseek just released the weights, shared the training recipe, detailed the verifier plus metaverifier loop. In other words, they handed the entire ecosystem. Here's how you build a model that doesn't just answer, it checks itself. The implications here they are academia and research. You can now fine-tune or extend an IMO gold model for theorem proving, cryptography, physics, formal methods, longstanding open problems might get AI core researchers instead of just AI calculators. As far as the enterprise is concerned, this same pattern which is generator plus verifier plus metaverifier is not limited to math. So let's think contracts, code, compliance, safety checks, medical guidelines, any domain where process matters more than the final answer can use this architecture. As for geopolitics and the AI race, Chinese open models already account for a growing slice of global downloads. Now they also have the first open IMO gold model. It's a soft power move. You want top tier reasoning, you'll be running Chinese open weights. For closed labs like OpenAI and Google, the risk isn't just competition on leaderboards. It's actually commoditization of core reasoning tricks they hoped would stay proprietary. And now what this means for builders and more importantly India. If you're building AI products, here's the quiet but important shift. Until now, open versus closed was mostly about",
        "start": 496.479,
        "duration": 1415.6189999999997
    },
    {
        "text": "Google, the risk isn't just competition on leaderboards. It's actually commoditization of core reasoning tricks they hoped would stay proprietary. And now what this means for builders and more importantly India. If you're building AI products, here's the quiet but important shift. Until now, open versus closed was mostly about is equal to best brains. Open models is equal to cheaper, but good enough. Deepseek is trying to break that assumption. They're saying you can have state-of-the-art reasoning and open weights and low cost. So for India this matters because our research labs, IITs and deep tech startups can now experiment with an IMO tier reasoning engine without waiting for API access, export approvals or pricing changes. So as we think about sovereign AI, national research clouds and India a compute mission models like this are exactly what you want to host locally and extend. The next decade will be one by models that can prove they are right or admit when they're wrong. Deepseek math v2 is one of the first serious proofs of that future. And finally, it is time for the front page take. Here it is. Deep Seek just turned mathematical humility into a competitive advantage. Instead of training an AI to be the loudest kid in the class, they trained it to be the one who shows it works, checks its steps, corrects itself, and only then raises its hand. Oh, sorry. In a world where GPT5, Gemini, and others are racing to impress with bigger context windows and flashy demos, Deep Seek quietly asked a very different question. Can your model mark its own paper and still pass? If the answer to that becomes yes at scale across math, code, law, and science, the real disruption won't just be to GPD5. it'll be to how we trust AI in the first place. This is Front Page by A IM Network. Like, share, and subscribe if you want to stay ahead of stories like this. And not just which model is smartest this week, but which ones are quietly rewriting the rules of intelligence itself. [music] Good evening. This is Front Page by AIM Network, India's video first newsroom for AI and tech. Tonight, a historic rewrite of India's nuclear policy, the kind that happens once in a generation. Honorable Prime Minister Narendra Modi has announced that India will open its nuclear energy sector to private companies, ending a 60-year monopoly that began with the Atomic Energy Act of 1962. And for the first time in Independent India's history, the government will table the Atomic Energy Bill 2025 in this winter session of Parliament. a bill that could reshape India's energy, climate and national security framework for the next 50 years. So before we dive in, you know what to do. Yes, like, share, and subscribe because you will want to stay ahead as this nuclear economy takes shape just like we predicted with space tech two years ago. So well, if you want",
        "start": 725.12,
        "duration": 1809.3210000000001
    },
    {
        "text": "security framework for the next 50 years. So before we dive in, you know what to do. Yes, like, share, and subscribe because you will want to stay ahead as this nuclear economy takes shape just like we predicted with space tech two years ago. So well, if you want channels for that. And now why this is so massive. India wants 100 gawatt of nuclear capacity by 2047 up from just 8.8 gawatt today. At this pace we cannot get there with government-only reactors. The entire global leadership curve proves it. Here are the numbers. United States 30% of world output 80% private. Nuclear is treated as an industry. China 16% global share 0% private entirely state-run. France 14% share 100% stateowned. I electricate the France EDF. Russia 8% 100% state control. Rosstom South Korea 7% nearly 100% state controlled the Korea hydro and nuclear power KHN. So as you can pretty much notice every major nuclear country is either fully stateled or fully private. India locked for 60 years. Central government only no state government, no private sector, no joint ventures. That error ends now. While inaugurating Skyroot's Infinity Campus, PM Modi dropped the biggest policy bomb of 2025. We are moving toward opening the nuclear sector. We are laying the foundation for a strong role for the private sector in this field too. End quote. And he spelled out exactly what private companies will now be allowed to build. small modular reactors, SMRs, advanced Gen 3 plus and Gen 4 reactors, new nuclear innovation, potential private public power partnerships, commercial reactor components and supply chains. This mirrors what happened in space. We opened space which gave us 300 plus startups leading to skyroot private rocket factories translating to global investor rush. Now the same playbook is coming to nuclear energy. This is a once in 60 years shift. The bill aims to modify the atomic energy act 1962. Permit private sector participation in nuclear power generation. Modernize the liability law. Enable partnerships for SMRs, floating reactors, advanced fuels, create India's first competitive nuclear manufacturing ecosystem, attract global technology players, unlock tens of thousands of highskilled jobs. Evidently, this is the biggest revision of India's nuclear regulatory structure since Homie Bhaba's time. Wow. The future of AI, data centers, semiconductors, and electric vehicles depends on base load clean energy. Solar plus wind is equal to intermittent. Coal is equal to polluting. Hydro is equal to limited. Gas is equal to expensive. Nuclear on the other hand is equal to stable, scalable, clean and long-term. And small modular reactors, SMRs can power all of this. Data centers, industrial clusters, defense installations, remote regions, hy hydrogen production, EV charging corridors, giga factories. Russia is already offering India Gen 3 plus VVER 1200 reactors, floating nuclear platforms and SMRs as we covered if you remember in our IndiaRussia nuclear future episode. China is building advanced SMRs at record speed. The United States is pushing for private",
        "start": 936.56,
        "duration": 2293.082000000001
    },
    {
        "text": "hydrogen production, EV charging corridors, giga factories. Russia is already offering India Gen 3 plus VVER 1200 reactors, floating nuclear platforms and SMRs as we covered if you remember in our IndiaRussia nuclear future episode. China is building advanced SMRs at record speed. The United States is pushing for private Scale, Terapower and X Energy. India definitely cannot just sit out of this race. So what does this mean for India's future? Here it is. With this bill, India can finally build a private nuclear manufacturing industry, attract billions in global investment, fasttrack AI era energy needs, deploy SMRs across states, build national energy security, reduce dependence on imported fossil fuels, localize high value reactor components, strengthen India's climate commitments. Wow, that's a very brilliant list. Anyway, and now the front page take. This is India's biggest energy reform since independence. Nuclear is the backbone of the AI century and India just opened the gates for its own nuclear industrial revolution. Space was step one. Semiconductors was step two. Nuclear is step three. the foundation for a trillion dollar energy tech era. India is finally saying we will build the reactors of the future. We will build them at scale and most importantly we will build them right here. So please like, share, subscribe, stay ahead of the noise, stay with Front Page by A IM TV and do of course let us know in the comments below. Should India go all in on SMRs or push for full scale reactors first? [music] Good evening. This is front page by Aim Network, India's video first newsroom for AI, deep tech and national strategy. Tonight, Tata Power is preparing for one of the most ambitious clean energy manufacturing bets India has ever seen. a 10,000 cr rupees 10 gawatt ingot and wafer plant potentially coming up in Odisha a project that could do for solar what Tata's Gujarat fab is doing for semiconductors which is plug India's last big supply chain vulnerability so if you're all set let's break this down but of course before that like share and subscribe yes it keeps India first AI and tech journalism alive. And now as promised, here is the breakdown. India has solved many pieces of its clean energy puzzle which is solar cell capacity equals to growing module manufacturing leads to growing. Grids scale solar is booming but the weakest link remained the raw material base which is poly silicon gives us ingots which gives us wafers which gives us cells which gives us modules India still imports almost all its ingots and wafers the core of every solar panel. China controls over 95% of global wafer production and for years Indian solar giants have been assembling downstream components while depending heavily on Chinese upstream supply. Tata power wants to break that dependency and that too permanently. According to filings and inside sources 10 gawatt ingot plus wafer capacity 10,000 cr rupees investment backward integration for",
        "start": 1181.28,
        "duration": 2739.498999999998
    },
    {
        "text": "wafer production and for years Indian solar giants have been assembling downstream components while depending heavily on Chinese upstream supply. Tata power wants to break that dependency and that too permanently. According to filings and inside sources 10 gawatt ingot plus wafer capacity 10,000 cr rupees investment backward integration for excess capacity for exports to the middle east Europe and APAC so two possible locations which is Gopalpur which is inside Tata steel SCZ or Katak port distinct logistics. Both are near eastern coastal ports, perfect for bulk raw material import and global supply dispatch. This is basically industrial scale globalgrade export ready manufacturing. This decision arrives just days after the union cabinet approved 7,280 cr rupees rare earth magnets mission which we broke down earlier on front page. So what does that mean? Magnets plus wafers equals to the backbone of electric vehicles, solar parks, grid inverters, defense electronics and semiconductor equipment. India is stitching together its energy mobility and semiconductor supply chains piece by piece. Rare earth magnets to power EV motors. Silicon carbide fabs in Odisha to power EV electronics. Tata's ingot wafer plant to cut solar dependency. Tata's Gujarat semiconductor fab to localized chip manufacturing. 3D packaging plants, MOSFET plants, advanced SIP facilities across Andhra Pradesh, Odisha, Punjab. India's first nuclear fora being evaluated by Tata Power. Odisha is becoming India's new materials capital. Silicon carbide fab approved by the cabinet. 3D glass advanced packaging plant. Tatast steel SCZ in Gopalpur. Strong mineral base. Deep water ports and logistics infrastructure. Pro manufacturing policies and fasttrack clearances. Tata Power choosing Odisha fits the exact trend we flagged earlier on front page which is chip manufacturing is following land water logistics and state speed not just talent. Oisha move fast and the Tatas are responding. So when this plant goes live this will unveil itself. India becomes wafer independent. A historic milestone reducing reliance on Chinese suppliers. Number two, solar tariffs fall further. India's renewable becomes globally competitive. Installed capacity already above 80 gawatt. This accelerates it. Number three, exports finally open up with wafers plus cells plus modules. India can become a net solar exporter. Number four, supply chain security. Solar is national security. So just like semiconductors, just like rare earth magnets, this project closes India's last missing link in the solar value chain. Globally, solar is geopolitical. US IRA subsidies. European Union sebam and solar reshoring. Japan and Korea diversification. China cost dominance. India's response is becoming clearer. Build every upstream bottleneck here. Not just cells, not just modules, but the core materials that power the entire solar economy. In conclusion, as I'm sure you were waiting for this, the front page take. This is India building independence. A 10,000 cr rupees 10 gawatt inot wafer mega facility connected to ports aligned with the rare earth magnet mission and sitting next to India's new semiconductor materials ecosystem. This is the kind of industrial convergence India hasn't had in decades. And when the world talks",
        "start": 1419.28,
        "duration": 3232.459999999997
    },
    {
        "text": "is India building independence. A 10,000 cr rupees 10 gawatt inot wafer mega facility connected to ports aligned with the rare earth magnet mission and sitting next to India's new semiconductor materials ecosystem. This is the kind of industrial convergence India hasn't had in decades. And when the world talks building the supply chain transition. If this plant takes off, which I'm hoping it does, India will power the world's solar panels. And now we would like to ask you, please do tell us how proud this makes you feel in the comments below. With that, it's time to say goodbye and good night from Front Page on the A IM Network. Like, share, subscribe, and always remember, think AI, think sovereign, think AIM. [music] [music]",
        "start": 1670.24,
        "duration": 3304.1779999999967
    }
]