[
    {
        "text": " Good evening and welcome to front page. A few weeks ago we did a story. We told you Tamil Nadu had placed a 2.07 lakh cr rupees economic bet. Defense corridors, shipyards, electronics. We called it well in the 2026 framework. And of course if you remember we had mentioned to you that it is right as a wonderful little runup to the elections. It was a huge announcement. Tonight we are zeroing in because that design just got an upgrade at you imagine TN 2026 in Chennai. The state went beyond just cutting ribbons. It unveiled numbers 9,820 K rupees, 4,000 jobs and a policy that could change how India builds hard tech. What exactly did Chief Minister Stalin put on the table? First, the engine better compute works 5,000 crores. Then, of course, they're building the AI data centers because you can't have an AI revolution if you don't have the GPUs to power it. Second, the story geni 4,500 K rupees. Let's just think about it. Tamil Nadu creates cinema. EOS creates distribution. Now they're linking generative AI into the middle. This is the state saying we want the entire stack from the server rack to the silver screen. Then of course the niche players Phantom Digital, Revan Health, Cube 84, Marketing Tech, Health Tech, SAS, it's a portfolio approach, diversified, smart. But now comes the change in the narrative. Usually tech in India means a frantic cab ride to an IT park in a capital city. We've all gone through that paranoia. Stalin changed the script. He pointed to the map Kimur Maduray Tirunli which of course draws our attention to a very important stat. 32 out of Tamil Nadu's 38 districts now export software. The code isn't just coming from OMR. It's coming from tier 2 towns from returnee founders in Kimbour and of course from students in Triti. You imagine scaled it beyond CEOs. They took the show to the colleges 18,000 students because infrastructure of course is useless if you don't have the talent to run it. Now for the heavy lifting the deep tech startup policy they are targeting 100 deep tech startups. We of course talking about IP heavy stuff, robotics, climate tech, aerospace, quantum, the stuff that takes about 5 years to build in 10 years to pay off. And how are they backing it all? You wonder. Two words, TRL funding, technology readiness levels. They're of course speaking the language of science and not just finance. Early grants for research, scale up funds for commercialization. But the key feature government as early adopter the state is saying don't just pitch to us sell to us five departments 5 cr rupees annual budget each for pilots. So if you're a founder you know this is a gold mine a government purchase order is way better than VC money because it's validation. And of course now for the front page take we have the two lakh cr rupees",
        "start": 0.24,
        "duration": 449.28000000000003
    },
    {
        "text": "departments 5 cr rupees annual budget each for pilots. So if you're a founder you know this is a gold mine a government purchase order is way better than VC money because it's validation. And of course now for the front page take we have the two lakh cr rupees tech stack and now the deep tech plumbing. Tamil Nadu is trying to become the operating system for India's high-tech future. They are locking in the capital the policy and the center of it all is truly the culture. But there is a catch. Policy is PDF. Startups are people. The gap between them is execution speed. How fast can those data centers get power? How quickly can a kid in Maduray get that TRL? Well, if Tamil Ladu can solve the speed issue, trust me, it will become an unstoppable force. Please let us know what you think regarding can this model be scaled for the rest of India. This is front page. Like, share, subscribe, and of course, think AI. And I'm pretty sure think Tamil Nadu think I am.",
        "start": 224.4,
        "duration": 560.558
    }
]