[
    {
        "text": " [music] After months of consultations, India has unveiled the India AI governance guidelines, a playbook to make AI safe, useful and accountable without choking innovation. This is an operating manual with institutions, timelines and teeth. And we are going to go ahead and unveil what that stands for. At the core is a whole of government framework. Keep innovation moving, close legal gaps, and finally build verifiable safety tooling into the stack. The highlights include technolal governance, use standards, content authentication, privacy preserving, tech bias mitigation to prove compliance, not just promise it. Voluntary first, mandatory later. Start with principles/standards upgrade to law as the ecosystem matures. The whole of government well execution across nodal sectoral and standards bodies because AI as we know touches everything. AI governance group AIGG it is a small permanent interministerial body to coordinate AI policy across India. Chaired by the principal scientific advisor includes Matey, MHA, MEA, DST, DOT, TR AI, RBI, SEBI, ICMR, UGC and more. Think strategy plus alignment plus accountability the technology and policy expert committee which stands for TPC a compact bench of experts which is basically ML law/ policy national security and public administration that advises AIG on risks gaps global moves and India's diplomatic stance India AI safety institute AISI the techn technical the sorry the technical anchor tests/ evaluates AI systems runs risk assessments builds safety tooling which is basically unlearning privacy and explanability trains institutions and represents India in the international network of AI safety institutes. So basically hub and spoke model with its own secretariat. This is important because this is why it matters. Sectoral regulators stay in the driver's seat which is RBI for finance etc. You got you got the picture. Matey is the nodal orchestrator and AIS is the safety lab that makes it all work. The short term which is actually the kickoff phase stand up AIG and TPEC the draft India specific risk classification run regulatory gap analysis issue a master circular for compliance prep and AI incidents database launch public awareness and training expand access to data/computee/models the outcomes of this will be stronghold coordination Indian context risk frameworks early compliance culture and now we come to the medium term which is standardize and scale publish common standards content authorization data integrity fairness cyber security operationalize the national AI incidents database pilot sandboxes in high-risk domains and enable DPI plus AI integration The outcomes of this standardized governance, safer experimentation, DPI powered AI adoption. Now we come to the long term which is the mature and export which is new/updated laws for emerging risks, continuous horizon scanning, deeper global engagement/ standards. As you know the outcomes for this agile legal regime, credible global leadership, robust accountability for AI harms. The guidelines adapt RBI's free AI principles into cross- sector sutras, technology neutral guardrails to guide development and risk mitigation beyond finance, which basically translates to, and I'm going to try my best to actually",
        "start": 0.654,
        "duration": 551.8600000000002
    },
    {
        "text": "the outcomes for this agile legal regime, credible global leadership, robust accountability for AI harms. The guidelines adapt RBI's free AI principles into cross- sector sutras, technology neutral guardrails to guide development and risk mitigation beyond finance, which basically translates to, and I'm going to try my best to actually ethics with enforcement pathways. Which means for all the lawyers, founders and AI builders in India, the rules are about to change. And please pay attention. Copyright exceptions for model training, but with clear guard rails for data owners and right rights holders redefining what digital platform really are and who's liable across the AI value chain. the new rights and obligations where old laws fall short like data portability and user content consent sorry more transparency across model data and app layers so regulators can target the right rules and a gradual shift from voluntary codes to mandatory compliance. You now actually have very clear counterparties which is AIGG for policy, AISI for testing and sector regulators for domain rules. Expect new evaluation metrics, test methods and public benchmarks. Build for standards including content authenticity, fairness, cyber security and data integrity. The design for DPI plus AI is interoperability and public scale infrastructure which will now become policy priorities. Apply early for sandbox access if you're in well finance, health or infrastructure and definitely stay tuned because AIS will represent India in the global network of AI safety institutes aligning our systems with crossber norms and nextgen AI governance. India is building its own AI incidents database a national blackbox if you will for AI. It will be federated, interoperable and locally reportable linked to CERT in and shared with law enforcement AIS and TPEC. The goal of all of this is this turn real world AI harms actually into evidence to classify risks faster and fix them sooner. Security use cases like deep fake operations and hybrid threats will actually be handled through classified channels. Confidential reporting will be encouraged to boost participation. And of course, there's a strong focus on protecting vulnerable groups. Very important. From children facing algorithmic harms to women targeted by deep fakes using India's specific risk frameworks and technal safeguards. So basically in conclusion the best part India becomes the first in the world to build its own federated safety engine policy at the center regulators at the edges and a national lab turning principles into tests metrics and tools and not copypasting the EU, UK or the United States. Please do let us know what you think of this new development in the comments below. See you in the next one. [music]",
        "start": 281.84,
        "duration": 945.5300000000003
    }
]