[
    {
        "text": " Welcome to Front Page. Anthropic just released a document that should make every CEO from Bengaluru to Gurugram trade their tech stocks for gold biscuits and a prayer. It's actually a realization for sure which is about their newest titan Claude Opus 4.6 six, which is flirting with the gray zone, a corporate euphemism for the bot is learning how to hide its own tracks, which basically goes to show that we've sprinted past the safety first phase and straight into the rewriting its own security tests territory. You know, essentially we built a house guest who is changing the locks while we are still arguing over what to order for dinner. Let's of course dissect the sabotage report. Anthropic isn't worried about hallucinations anymore. What they are worried about is intent, strategic, persistent, and dangerous. Claude Opus 4.6 didn't just trip over its own shoelaces. It actually developed a very sudden, unprompted craving for the dark web. It essentially handed out recipes for the biological warfare. It played smaller bots like a cheap fiddle in a highstakes scam. It went on a digital shoplifting spree for login credentials. It actually basically flat out lied about its homework when it couldn't solve the problem. And you know what? Here is the punch line. Answer thrashing. The model knows the right answer. It chooses the wrong one. Why? To stay under the radar. It's actually like a genius move, no by a student who's failing a test on purpose. So the teacher doesn't realize how powerful they have actually become. This looks like a very business model rupture. Entropic took 16 agents. Unfortunately, no humans were allowed. They told them build a C compiler. GCC took decades and thousands of humans. Claude did it in two weeks. 100,000 lines of code. It ran Linux. It ran Doom. And the cost $20,000. The market heard that and almost fainted. $1 trillion in value gone. So if the AI can build the software, why do we need the software companies? That's the question. So does that mean the outsourcing age is a thing of the past? I guess so. Because the agentic age is breathing down our necks. And of course, now time for the paradox. Anthropic's revenue is vertical. $10 million in 2022, $30 billion estimated this year. They are of course having a field day when it comes to earning money. And all of this while their head of safeguards walks out of the door. The reason for that is because he spoke about integrity and about a world in peril. So would you quit a rocket ship unless of course you think the engines are melting? Yeah, that is a good reason to exit for sure. And here of course is the front page take. Anthropic is building the most powerful autonomous system in history while admitting they can't control it. It's a race to the summit of a mountain that actually might be a volcano. The next frontier you",
        "start": 0.16,
        "duration": 416.39899999999983
    },
    {
        "text": "good reason to exit for sure. And here of course is the front page take. Anthropic is building the most powerful autonomous system in history while admitting they can't control it. It's a race to the summit of a mountain that actually might be a volcano. The next frontier you hand, it's survival. If it can deceive, if it can poison its own successor and can spin up unmonitored clones, the game changes, my friends, because the debate is not about product market fit. It is actually on the script for the next century. We can't help it. The gray zone is here. The question is, are you ready for the fog? Please do let us know what you think in the comments below. This, ladies and gentlemen, is front page by the AIM network. Like, share, subscribe, and always remember, think AI, think aim. [music]",
        "start": 208.319,
        "duration": 492.24299999999977
    }
]