[
    {
        "text": " We treat people how they like to be treated. 60%age of our technology workforce is in India. This was like a trend set up. It's always nice to map a journey and I'm sure it just takes you [music] back as well. Get a kick when you see your transformation coming to life and you know what does it take to build trust as a technologist? You've spent more [music] than 25 years leading transformations. Most of the solutions we build in supply chain distribution are very very planet conscious. They care about what they work for, whom they work for. Are we being socially responsible? This is the latest one that you saw which I'm watching the mentalist. Well, ladies and gentlemen, according to us, I believe technology isn't just about efficiency. It's also about empathy at scale. Hello and welcome to simulated reality and today we have with us a very very special guest Priya Darshini Ramas Subramanyam she of course is the engineering director for supply chain at Tesco technology a wonderful experience of more than two decades and I believe I won't be wrong in saying this that Priya's story is about engineering with purpose and leading with well empathy And of course we are going to be unveiling a lot more as we go along this journey of simulated reality with Priya today because I think Priya I would like to start with this a big welcome to the show. Do you believe that in a world run by algorithms you actually remind us that the real transformation still begins with people? Hi Sudi, thanks for first having me here with an honor. It's a true pleasure magazine. So pleasure to be here. for anything and everything in the world especially for large organizations their biggest asset even before technology is their people. Organizations are made up of people hearts and souls and their passion that makes them a great organization or what they are. So I truly believe that people and therefore great leaders who can bring out the best in the people are the most important to drive technology and great organizations forward. Nice. Let's actually start with the start. It's always nice. Sure. More than 25 years of experience, right? which is wonderful. No, you don't. The euphemism for old is experience. Of course. Yes. So the fact that what actually brought that spark Priya as far as your journey is concerned because I mean as a technologist you've spent more than 25 years leading transformations as far as technology is concerned technology is very dynamic you know it changes it goes through so many aspects you've worked with Tesco you work with Coca-Cola you work with biggest brands and I just wanted to understand what were the early experienc experiences that actually shaped your approach to to well the transformation for today. What were those early aspects of those early learnings? Yeah, I get I get you. so I'm I was",
        "start": 0.16,
        "duration": 394.718
    },
    {
        "text": "with Coca-Cola you work with biggest brands and I just wanted to understand what were the early experienc experiences that actually shaped your approach to to well the transformation for today. What were those early aspects of those early learnings? Yeah, I get I get you. so I'm I was learned to be an electrical engineer but during the spare time a couple of us learned computer science and it was the love for problem solving. pick up a problem, apply some algorithmic thinking, give it to the computer set of instructions and you had your answers. Which years was this? these were 1992 to6 where that was a passion project during your holidays and weekends and you know why I asked you that right because in those days nobody really had that forward thinking of the fact that you know in terms of doing problem solving with let's say computers but then that's the passion that got me going then when I was working with Vipro that's when I had the opportunity to work with multiple retailers Right. So I was with Vipro. I was part of the retail center of excellence and working with multiple retailers and that's when I could see technology solving real world problems. so the passion for retail developed there and I could see how we could help solve problems for our customers make a significant impact for them and help the businesses as well. That's when that passion started. Sorry you were about to ask. No, I was just it just I was curious that you know it's it's such a a nimble mind at that time that you've had early days you're just starting up you're excited in terms of you know all the changes or the aspects that you're seeing something that you still remember that which which still brings like a little smile to your face that wow we could do this with technology technology yeah true very true and it is that combined passion then for retail and technology that attracted me towards Tesco. At Tesco's were very different being one of the world's largest retailer then we were solving problems at such a large scale that I couldn't even imagine or thought of then give me a use case the the several millions of customers that shop with us. So whatever we do our technology solutions should be solving problems at scale and across the multiple countries that we operate in. So we operate in UK, ROI, central Europe. So developons deploy multiple times just now that it then became our core purpose is to help serve our customers, community and our planet. Look at the diverse aspects. So we just are just not thinking about our customers. We are thinking of how our technology should be solving our problem for our communities and serving them and the planet. Being a food retailer means we have to be very conscious about the",
        "start": 203.599,
        "duration": 723.4390000000001
    },
    {
        "text": "planet. Look at the diverse aspects. So we just are just not thinking about our customers. We are thinking of how our technology should be solving our problem for our communities and serving them and the planet. Being a food retailer means we have to be very conscious about the build in supply chain distribution are very very planet conscious. So in summary that's what was my journey and how I landed into this and you will see some of this good work and the core purpose focus you know our half year results has been really good and along with customer service satisfaction score improvement you know and keeping both balanced is really key to us which is wonderful because I mean the fact that what brought out this this this aspect as far as the planet is concerned Because generally speaking you know it's it's it's driven by any big conglomerate or or corporate would end up thinking initially about their journey as far as satisfying the customer is concerned because that is the first thing and then maybe later on in the horizon one starts to say all right maybe we should add these elements or aspects to it because it's important that that responsibility is being shown and shouldered by Tesco. When did that kind of come through or was it something which was integral as far as the policy was concerned? So the thought and the responsibility we are a 100-y old company plus the thought and the responsibility has always been there but probably we started coining it very explicitly into our core purpose if I remember right from 2014 onwards. Fair enough. I could be slightly wrong with the timings but it was always just that we became very explicit about it because only when the core purpose is understood by the entire team behind us only then the organization powers uniformly in that direction right so we explicitly called it out saying was customers of course but our communities and our planet as well this ecosystem is really important and I'm sure there was must have been an enriching response that you might have received from everyone I'm sure everyone Everyone welcomed that thought. Of course. Yes. The younger generation these days and I'll talk about it when I'm talking to people. They care about what they work for, whom they work for. Are we being socially responsible? And if we are engaging such talent apart from what we should do socially, right? They care about it. So you might as well, you know, give them platform that they can build into and contribute. Nice. Which actually brings me to this Priya. How have those well early lessons that you that you have just walked us through stayed relevant in a world which is now being refined and redefined by data and AI. Tesco a key leverages our artificial intelligence, data analytics and automation. Okay. And we use that to",
        "start": 369.199,
        "duration": 1049.3600000000004
    },
    {
        "text": "this Priya. How have those well early lessons that you that you have just walked us through stayed relevant in a world which is now being refined and redefined by data and AI. Tesco a key leverages our artificial intelligence, data analytics and automation. Okay. And we use that to our operations end to end are very sele. So we have online stores, we have physical stores etc. a lot of our AI use cases help drive our price optimization. The range and the kind of products we bring in and their quality is driven and backed up by artificial intelligence. our online offers are powered by the breadth and reach and I'll give you a couple of examples as well. Yeah. is is powered by that and when it comes to supply chain and distribution the way we even predict our customer demand is all AI enablement. So I'll give you a couple of examples and I'll start with supply chain as a use case. at supply chain it is it is it plays a core role because we'll have to accurately predict the customer demand to ensure that availability is not compromised and a customer walks into the store products are available but at the same point in time you'll have to be very conscious about waste just to increase availability you so we do engineers develop a lot of machine learning algorithms which means crunching millions of data records of past history of sales, how does your weather look like, what are recent promotions you're running, which day of the week are you trading? So you see the number of aspects that comes in and that's all. So machine learning algorithms help us and of course these are all developed by brilliant engineers we have and that's how we predict the customer demand. Then there are a lot of optimized decision we make in ordering in how and what quantity we ship from our distribution centers into our stores. It's a very critical aspect as far as I'm sure the entire flow of work is concerned. True. And then moving on to our transport right these are intelligent metahuristic algorithms because we operate some of the largest fleets you know right from our primary transport from our suppliers into our distribution centers distributions into our stores. So we'll have to optimize for your truck pairing demand splits you know how do you effectively utilize drivers but these algorithms help us ship less air find the optimal routts and make sure we reduce our carbon dioxide emissions millions of tons of carbon dioxide emissions has been enabled by technology and that's the contribution we are making back into the planet could I request you sure because the scale at which you work would be nice. I mean, you're giving me supply chain, you're giving me , you know, , transport, you're giving me all of those wonderful little use cases. Would be wonderful if you could maybe",
        "start": 534.8,
        "duration": 1379.7990000000002
    },
    {
        "text": "into the planet could I request you sure because the scale at which you work would be nice. I mean, you're giving me supply chain, you're giving me , you know, , transport, you're giving me all of those wonderful little use cases. Would be wonderful if you could maybe numbers I'm sure are going to be well fascinating. Sure. , so, , some of our use cases, for example, we have more than 23 24 million customers shopping with us just in UK. I'm talking about I'm not even talking about would be nice how many 23 24 million customers who shop with us and this is just for UK just the UK yeah and I'm not talking about we have our customer base in central Europe and all of that so if you have to personalize that's billions of search and recommendations that we are talking about and also millions of your delivery schedules around the clock for your customers to make sure online operations are smooth. And when your back-end systems will have to make optimal decisions, they're again going through billions of data points and records to come up with some of those decisions, you know. so the scale is really really humongous and that's what makes the work very interesting for our colleagues and exciting you know. and that's what probably makes it a great place to work personally for for me as well. And you say it with so much you know like yeah it's like a everyday it is been 25 years but these numbers are mindboggling. Yeah. Which actually brings me to this point and thought which is that as far as you know the change was concerned Priya. Yeah. what what drives that aspect in terms of you know the the technological transformation especially in retail what what gets that entire impetus and how did you envage that entire situation as far as retail was concerned sure and are you referring to it from the past until now or you're referring to it because it's always nice to map a journey and I'm sure it just takes you back as well sure See it's both right. It's technology advancements but it is also that customers are becoming smarter. Yes. for them convenience is key. Oh yes. So it's it's a bit of both. You of course technology advancements and therefore we learn grow experiment. there were days where we were still for example the customer demand prediction andor personalizing the offers were all you know heritage systems driven and then when we had more data points and more globally available information available technology had to step up naturally okay and you needed big data platforms you needed cloud platforms you needed real time eventing For example, now we shop across multiple channels. The customers truly want omni channel experience, right? Irrespective of whether it is they shop with the website, mobile in storere and within in store we've given",
        "start": 705.519,
        "duration": 1743.1589999999999
    },
    {
        "text": "and you needed big data platforms you needed cloud platforms you needed real time eventing For example, now we shop across multiple channels. The customers truly want omni channel experience, right? Irrespective of whether it is they shop with the website, mobile in storere and within in store we've given do their selfch checkouts and all the offers that we offer to them are completely personalized. All this is possible only because engineers have been building those real time APIs that can transform these worlds. you know the whole real-time eventing architecture cloud platforms I'll give you an example when with when customers are moving across so many channels how do you ensure you know what's the right fate no the right quantity of stock you hold inventory management yeah is so crucial and cannot happen unless you're doing it real time across these multiple food it's an impact and correct me if I'm wrong but also it's an impact as far as your own fund flow is concerned because I mean if you're overtly stocked with inventory, you're losing out in money. That's right. Yeah. because unless we know what is the right amount [snorts] of inventory we hold and all the at all these different fulfillment points, we cannot make the right supply chain or condition. So you're bang on you know and that's the transformation you know. So of course your customer demand and of course what you would like to do as a responsible retailer for your customers and the people becoming quite techsavvy and technology enabled. So it's a combination of multiple factors that has enabled this transformation. That's wonderful because that you you talked about it from the point of view of the fact that you know is it the past or the future. Now I'd actually want to make it a little more aspirational or a little forwardlooking and I want to ask you this which is that what does it take to build trust in systems because we're talking about customers who are extremely aware very demanding and obviously there are so many different dynamics and aspects that you're constantly dealing with so I felt that it would be well poant for me to ask you this that trust in systems that actually millions of people depend on every day Priya that's a huge responsibility that you have that's right and it's also aspirational it's also exciting that the way the way things are changing moving you must be always looking ahead trying to understand that also having a peak into the future I'd love for you to shed light on that your your most interesting question is the first half but I'll cover it in the second half so see the future for retail overall is very exciting Okay. And technology is going to be a key enabler. We are all talking artificial intelligence but it's going to be more different. we are talking personalization. It's going to become hyperpersonalization.",
        "start": 889.76,
        "duration": 2074.039
    },
    {
        "text": "but I'll cover it in the second half so see the future for retail overall is very exciting Okay. And technology is going to be a key enabler. We are all talking artificial intelligence but it's going to be more different. we are talking personalization. It's going to become hyperpersonalization. experience. It's going to become unified commerce. Right. But underlying all of this, as you rightly pointed out, Sudhi, it's going to be how retailers can become more responsible and become more sustainable and ethical in their offerings to their customers. So I'll I'll cover each of these pillars. so I know currently we are all digitally evolved. We start you know AI enabled etc. But it will all move into domain specific language models. and with that use it will become very context heavy so that we can serve the customers better. automation will play a key role. For example, even now in our warehouses we are experimenting with fresh your automo robots. They are completely autonomous. They can do their own picking. no fixed paths and Oh nice. Interesting. And that's helping our core food mission and be more efficient. , now that will slowly move just not in warehouses. It'll get into your stores, right? The physical AI and automation and of course we'll have to be very responsible about it. Absolutely. and that will become it will play a key role. personalization will become hyperpersonalization where you know just imagine Sudi you are walking into a store you're shopping online the system realizes the your intent for that day and it is giving you a personalized offer so that you can make some shopping decisions. but and of course you know that's the extent of personalization and convenience will reign. you can shop online, pick up in store. You your shopping list will transfer to your device at store. The shopping list will even be ordered by the layout of the store so that if you want to pick you just pick and go, you know, all of these are in the horizon. But customers are also looking to and we have a great responsibility as a retailer to make sure we do all of this in a very sustainable manner. people would want to know how are these being ethically sourced. True. to the extent of we care about deforestation. We ensure that we are careful about sourcing products from deforestated areas right u so customers will want to know hey where are these sourced from are they done in an ethical manner. So howly responsible are you? Yeah. So technologies like all your QR codes you know IoT and to a large extent you know our simulation platforms and digital twins will help us simulate all of this and you know make sure we offer products to our customers in the most ethical manner we can. AI governance will play a huge role. ethical AI is the need and we",
        "start": 1057.52,
        "duration": 2437.078000000002
    },
    {
        "text": "a large extent you know our simulation platforms and digital twins will help us simulate all of this and you know make sure we offer products to our customers in the most ethical manner we can. AI governance will play a huge role. ethical AI is the need and we body at Tesco up to the highest levels to ensure that whatever we deploy through artificial intelligence is very ethical and governed carefully. So those would be some of the key driving factors. Not too much I feel. [laughter] Right. But tell me this. Yeah. This this immediately just kind of you know came to mind the fact that it's 100 year old company defining in terms of the experiences as far as retail are concerned. Sure. one of the market leaders you just mentioned in terms of all of the aspects that are going to be well a part of the experience for the consumer at large moving forward how much of [snorts] importance Priya does it play as far as Tesco is concerned as far as you and your team is concerned to remain let's say market leaders in terms of always trying to put these experiences that you just talked about making them a lot more well relevant to the people in terms of your consumers your customers making it as the fact that okay wait a minute Tesco did this first or you know we brought this experience first to you how much is it at the core of of of the thinking as far as the teams and everything is concerned it's just something which I thought that can I paraphrase your question if you don't mind to make sure I understood Sure, sure, sure. , if you're asking, hey, in order to make all this happen for our core purpose, how much of focus are we laying on our people and how are we helping them? Oh, brilliant. Okay. , so I believe as I told you earlier, all organizations are powered by people. That's a big asset for us. Absolutely. And that's true at Tesco as well. We are a very very people focused company and that's one of the reasons I've probably stayed with Tesco for a long time now 17 years. Speaks volumes about the culture of the company. Yeah, it's a work is exciting but at the same time we have a great culture and that's why you know I think it's a great place to work. However, so I for example at the position I sit, I have a larger responsibility and therefore I'm part of several natural working teams whose focus is only about people and career development. I can name a few. For example, we ensure that we have a team that has focused on bringing in the right talent, has the right hiring standards, looks for the right fit, just not technical skills. But what does the word right mean for you?",
        "start": 1242.4,
        "duration": 2776.1990000000023
    },
    {
        "text": "people and career development. I can name a few. For example, we ensure that we have a team that has focused on bringing in the right talent, has the right hiring standards, looks for the right fit, just not technical skills. But what does the word right mean for you? technical skills, but more importantly, are they a fit into our culture? So there is definitely a leadership round even for the lowest levels that we bring in to make sure which is wonderful. Yeah. And our practices are pretty much standardized across the globe. So it's not India specific as well. then we have NWTs that look at can we make sure our career paths are very well defined. If you as an employee so they are walking into Tesco you should just be able to open a portal look at hey what's the career path for you? What's next in line for you? what are the skills expected at that level and how can you groom yourself into those skills. Okay, so those are all very well documented. We have a central talent planning exercise that we do along with our people partners where we identify high potential talent, make sure they have a personal development plan and we help them with training opportunities, mentoring, grooming, coaching and more importantly giving them larger roles so they can experiment it and take it on. So tell me this for example as you just mentioned that an employee has a a general well idea of the landscape terms of okay this is how I'm growing this is how I'm going etc which is great but we as humans tend to want to you know over exceed or overachieve so are there is there room for the the people working at Tesco that all right there is a creative flare And it's not just okay straight jacketed that I go from here to there and then from there to there. You get my thought then at least I hope that that career path can branch out. I I have the flexibility of doing I I forgot the saying there your career is more like a jungle rather than a ladder. Right? That is very true at Tesco. So we have something called as a open job portal where we can apply into any of the opportunities we want and across the globe as well. Great. So I can be a product manager today, tomorrow if I would like to become an engineer, so be it. There is of course an assessment that checks your fitment into that skill. so you can move across several roles and there is no timeline restriction on when you move from one role to another. as long as you're ready for the next role, you sit, have a great conversation and then you move forward. so it's as open and as convenient as that for our colleagues at 17 plus years. Bri,",
        "start": 1415.76,
        "duration": 3079.5590000000034
    },
    {
        "text": "is no timeline restriction on when you move from one role to another. as long as you're ready for the next role, you sit, have a great conversation and then you move forward. so it's as open and as convenient as that for our colleagues at 17 plus years. Bri, future leaders. You've done all that. So I want to understand since you would since we're just talking about this what's what's the key in your mind or what is what are those things that you would like to imbue people with as far as mentoring them giving them maybe certain certain certain keys to work with for building their future paths for building themselves up into the roles of let's say future leaders what would you share with them. Sure. , of course you you you work with talent that have great potential. So some of what well not all of them but yeah of course those are the challenges. Yeah. If I was working at Tesco I would have been one of the other ones. You know everybody has potential just that their potential lies in different aspects. That's the only sweet way of putting it. Humans you failed in class but it's okay. You have potential. No, no. Everybody you can excel in something. Yeah, this might not be the right thing. Something you always excel in. Humans are that way. Innately gifted I feel. , so I would have a good conversation with them to first understand where their heart lies because passion is important. Without passion then you can't do anything else. Absolutely. And then you look at what do they think their gaps are? have a conversation on them on what do the organization wants. See where there is the right fitment. and then help coach them in that direction. It's important to give them a lot of psychological safety and make sure you're open to failures when they are trying new things and give them a safe environment for them to try, experiment, grow and it's okay to fail. It's okay to fail. I've had a lot of leaders support me. I've made mistakes. Everyone does. Yeah. So, the leaders who said it's okay, it's important you tried and I would like to give that back to my teams and and that's pretty much the recipe, you know, have confidence in them, have great career conversations with them, encourage psychological safety, be vulnerable, show them nice what you know, I think that's the need on their head. True. you know, and help them with it. than that. Yeah. Because I mean, you know, when when you look at seniors like yourself probably, I mean, your teams, so you tend to feel, okay, wait a minute, here's a person who's been here for so long. U I've seen the vulnerable side of this human, and it's a it's a it's a human, a brilliant human, still a human.",
        "start": 1569.2,
        "duration": 3416.1990000000055
    },
    {
        "text": "at seniors like yourself probably, I mean, your teams, so you tend to feel, okay, wait a minute, here's a person who's been here for so long. U I've seen the vulnerable side of this human, and it's a it's a it's a human, a brilliant human, still a human. amount of solace and says, \"Okay, fair. That's my pickme up. I can carry on.\" That's right. Is that one of the aspects Priya which is at the core of keeping people motivated especially during these long transformations that tend to take place especially with the area that you're working at. How do you keep that you know at the helm of things that that motivation is very important? Yeah. So what's what's the what's those secret source? So for me personally large transformation you do a transformation for a reason right so the kick that I get out of it apologies if the language is wrong it's not absolutely fine no you get a kick when you see your transformation coming to life and you know that gets that keeps me going give me an example I mean give me something that you remember that maybe a transformation that had taken place that that you kind of still maybe think about I mean I'll give you a very recent one would be nice we are transforming our complete text stack that is helping us the whole supplier ordering yeah ordering from our suppliers into our distribution centers we framed our own ambitions what timeline we wanted how would we do it etc then we face into technical challenges right you you've built your own ambitions and you have a capable set of leaders but there There are so many moving parts that need to come along and make this happen. So we've had our moments you know as a group of people arguing debating discussing but still that passion exists. So there are days like why does it feel like this and you know what can I do about it and I'm sure that's there for my team as well but then because we are aligned on that goal and we want collectively to make that happen. we see through next day we are all the best of friends cracking jokes and having coffees together. So any challenges that you've probably sensed tend to kind of crop up in these kind of events or these kind of situations which your experience over a period of time has helped you now to smooth over a lot quicker than probably what it used to be like earlier. see I feel the most important reason is difference of understanding and the ways and means people want to get there that's what brings in the differences I think or a friction or agree to disagree kind of a deal. Yeah. So as long as we are getting onto the same table having those conversations and thrashing out those differences",
        "start": 1741.919,
        "duration": 3743.3180000000048
    },
    {
        "text": "understanding and the ways and means people want to get there that's what brings in the differences I think or a friction or agree to disagree kind of a deal. Yeah. So as long as we are getting onto the same table having those conversations and thrashing out those differences agree to disagree finally you've understood each other and that's what makes it very smooth so communication is really early really really for leadership there's one important skill that I would like to call recommend and talk about communication big one for sure culture and belonging which is naturally what I would like to go ahead and speak about since you have so perfectly segueed into that that communication. Yeah. do you believe that that is at the cornerstone of the culture that you have probably been able to embellish over a period of time or build and what I want to talk about is this that you have led a lot of culture building initiatives [clears throat] but what stands out and how have you made in the entire aspect of the experience Mhm. of of working at at at such a huge company because according to me I think experience is something which stays with you Priya. Yeah, that's right. Instead of just it being you know well another metric or another thing that I just chocked out on the checklist. So has that been something that that you felt that you wanted to bring and you have been able to to bring out? No, no, true. very true and a very valid point that you're bringing out Sudhi. So currently I'm also playing the role of a co-sponsor for diversity, equity and inclusion at Bangalore. It's very close to my heart and it's really important because great companies are built by ideas boughten by a diverse set of people. You just cannot have a diverse team and not be inclusive. So inclusion is more important than just having your diversity numbers. And for inclusion to happen, you need to have equity measures as well. Fair. And that's what brings in great people. People should feel a sense of belonging, acceptance. Everybody is different. It's okay to be different. Everybody will have different ideas. It's they should be comfortable voicing it out, disagreeing, voicing their opinions, you know. And for that you need to have very inclusive leadership team right from the junior manager level and we make sure we actively talk about it at Tesco and I think that's what drives a great culture and u the managerial capability that we have who are very inclusive is what makes you know a very inclusive organization. So that's really important but it's since it's it's so close to your heart Priya and I'm sure and and and you know this is something which I have experienced on my own. Sure. You used the term feel, right? Which I think is so important",
        "start": 1907.279,
        "duration": 4090.357000000006
    },
    {
        "text": "a very inclusive organization. So that's really important but it's since it's it's so close to your heart Priya and I'm sure and and and you know this is something which I have experienced on my own. Sure. You used the term feel, right? Which I think is so important level feel that yes, this this organization means what it's talking about because a lot of times it's just maybe just a template that people end up thinking and people are sharp, people are working as understand that okay, wait a minute, this is just part of a template. This is just part of one of those things. Yeah. What is it that that extra mile that you probably like you said inclusivity is important and it's being discussed in terms of management all across the board but I'm sure there would be another or there would be other aspects that you'd be bringing in to make sure that people realize that no this is not just something that is a template this is actually what we believe in. This is actually what the culture is about for and and for people to start to kind of then say okay fine we genuinely agree we feel it. See that's also because there's a sense of resistance no pri people humans tend to have a little sense of resistance in terms of will I be able to accept it will it will it happen will do do they really mean this kind of a deal you get my thought yeah see it's right there in in our Tesco values for example one of our most important values is we treat people how they like to be treated nice not how we like to be treated very nice so that's one statement you know that I think speaks volumes speaks volumes and that's our values are something you know that [snorts] we keep sharing with all our colleagues so that you know we all embody that we are all equal at the end of the day whether you're the CEO or whether you're a junior engineer as long as all of us are looking into that value and following that that's all it takes and I think testament is clear bria more than 17 years at a company yeah sure and I'm sure there's so many others like that. Yeah. there are but you know what can I say? It's a Tesco is really a a nice organization just not exciting work but a warm culture as well and probably that's where I that's finally what matters. Yeah brings me to this aspect that do you feel that diversity of perspective shapes a better technological outcome? Of course. Yeah. without diversity of thought and ideas as early as your design thinking. Sure. something fantastic doesn't emerge, right? you should see our design discussions. You should come sometime into Tesco flows and you would see the",
        "start": 2082.399,
        "duration": 4399.5580000000045
    },
    {
        "text": "you feel that diversity of perspective shapes a better technological outcome? Of course. Yeah. without diversity of thought and ideas as early as your design thinking. Sure. something fantastic doesn't emerge, right? you should see our design discussions. You should come sometime into Tesco flows and you would see the Yes, please. You would you would see the difference of thoughts and opinions from right from which tech stack to how we should build and some emotions flying but all of that is what emotions who we are of course who we are the great products we build because finally everybody what are they aligned they're not taking anything home they're all looking at how do I build the best for our customers community and planet right as long as we are aligned there everything else is good welcome come. Yeah. Which is nice. Which is nice and open. Future horizons. Yeah. Have to get there because I mean I've been very my curiosity and excitement has been peaked by little things that you talked about hyperpersonalization. You talked about constantly tweaking the systems. So I want to obviously get into the fact that how do you see technology Priya and of course more importantly human creativity coming together to shape the next well let's say decade as far as go global supply chains are concerned. So I've covered this partially as part of my previous the cue to deep dive right so just bringing in all those points together just not supply chain even within all the other areas sure I think the penetration of artificial intelligence in a different shape or form like I said your DSLMs and being more context driven they will play a role. supply chain right now we are working on how can we simulate ourselves you know rather than looking at local optimizations how do we go across global optimizations right from the suppliers to the shelf to the customers and that means your algorithms cannot look at local minima they have to look at global minima which is a very complicated technical problem to solve then comes all your digital twins and of course with the difference aspect of personalization even within supply chain we'll have to react into it very intelligently right imagine I'm spinning up a personalized offer for you for that day and your mood and think your supply chain has to be ready so very ahead to you know just mindblowing isn't it if you were to tie all of this to together so just the sheer scale of that yeah yeah so in summary [clears throat] you know a lot of artificial intelligence digital twins for you to be ethical a lot of QR code driven technologies you know being making tracking end to end possible and whatever technology is going to enable it all of that is key global of course we've discussed that time again it's a wonderful reality that you are everyday dealing with",
        "start": 2243.359,
        "duration": 4744.997000000005
    },
    {
        "text": "to be ethical a lot of QR code driven technologies you know being making tracking end to end possible and whatever technology is going to enable it all of that is key global of course we've discussed that time again it's a wonderful reality that you are everyday dealing with but obviously I have to ask you this which is how is India contributing to that future as far as a hub of both engineering and innovation at Tesco is concerned 60%age of our technology workforce is in India that should say something about how much as an or we believe in you know the talent present in India the some of the great engineering talent we have there the just not the volume the quality of the talent we get from some of the great engineering institutes and their acummen plus the senior leadership here even globe many of the global leaders you see u India's presence so India is very well poised and at Tesco we truly work like a global organization it doesn't matter where you're sitting which region you're sitting for example if I'm sitting in Bangalore if I am owning supply chain engineering the buck stops with me there is no other counterpart you know so it's all truly global roles and absolutely accountable for everything for everything you do so just such a great talent pool here and the accumment that they are coming with in terms of their technical skills business knowledge attitude that's why I feel that the technology center is very well placed to help Tesco and what innovations or trends will probably excite you the most right now and maybe going forward also the fact that it would be nice if maybe you could share has there been incidents I'm sure there have been loads of them where the Indian the team came up with the breakthroughs which were probably implemented across the globe or there were maybe some interesting use cases that you can share with us that that okay this was like a trends setter and this is why the Indian talent is considered to be the best and that's why it is well 60% of Tesco's workforce. see I wouldn't put it to glorify anything but just [laughter] no see I would I I would rather put it this way irrespective of where your technology team is all of them are doing their brilliant work in taking that course forward. Sure. For example, if my supply chain engineering team is predominantly based of India, I have presence in central Europe and UK as well. My teams are based there as well. But let's talk about that customer demand forecasting. Yeah. that was a simple rule-based algorithm. Yeah. and then we realized oh the art of possible and it is this team that came in and built completely AIdriven customer demand predictions for the future. But it is based on hey the",
        "start": 2421.28,
        "duration": 5109.237000000003
    },
    {
        "text": "But let's talk about that customer demand forecasting. Yeah. that was a simple rule-based algorithm. Yeah. and then we realized oh the art of possible and it is this team that came in and built completely AIdriven customer demand predictions for the future. But it is based on hey the my team because I am sitting here. So it doesn't matter which part of the globes the team are sitting because all of them are passionate about the cause and they want to help make a difference. That's how they Well put Priya well [snorts] done right which of course has now got me to that point because I think you're warmed up enough sure to deal with the rapid fire. Okay. fine. I would love for you to just fly with this and say whatever comes to your mind. Yeah. And feel free one piece of career advice you wish you'd received earlier. I know this is supposed to be rapid fire but still I am a big fan of Indranoi. Okay. from her and from from one of my ex-managers I realized that work life balance is not real. It's all about prioritization. Yeah, fair. Prioritize what you need for that phase of your life. Which project is going live? What your kids want. So hardcore prioritization. I've tried to do this work life balance and I'm being burnt early on. Okay. But then you know of course there are these great leaders who teach you and you then you become a bit smarter for prioritization. Prioritization. Okay. Your go-to stress buster during long transformation projects. Do you sing? Do you play the instrument? Do you Right. I love to read books. especially fantasy novels. I love to watch. Harry Potter is fun. thriller series. Okay. Nice. Which is the latest one that you saw which you love? mine is very old. I'm watching The Mentalist. U Yeah. Have you seen it? I thought Okay. That's a old series. No, I have. It's it's really nice. There's another one which I'll suggest which is called Person of Interest. All right. I should bother. That will be another podcast. All right. You and I'll start doing if we get into that zone. Anyway, so a leadership quality you admire in others but had to work hard to develop yourself. Art of storytelling. I've seen you have done well I must say today I I' I've worked on it to be honest. I've seen leaders do it brilliantly well and I've been big fan and I've consciously worked upon it. Not still there but you know you're there. Eye of the tiger. Believe in yourself. Yeah. Sure. [laughter] So one myth about supply chain you'd love to bust once and for all. It's not a cost center. Okay. It is your heartthrop that is helping retailers operate very efficiently. Fair enough. Not a cost center. Yeah. And finally sure this is only a one word. Yeah.",
        "start": 2603.68,
        "duration": 5427.316000000007
    },
    {
        "text": "Sure. [laughter] So one myth about supply chain you'd love to bust once and for all. It's not a cost center. Okay. It is your heartthrop that is helping retailers operate very efficiently. Fair enough. Not a cost center. Yeah. And finally sure this is only a one word. Yeah. you think of innovation creativity. Nice. First word that comes to your mind when you think of Tesco. Exciting work. Nice. Well, it's been a true honor, Priya. All right. Before we let you go, I would love for you to give a message to everyone because you have been doing this for so long and it would be nice for you to maybe share maybe something which has inspired you constantly through this journey and the fact that today you're on simulated reality which is a true honor. No, I'm just kidding. [laughter] I I I've enjoyed this Si. Thanks for making this so comfortable. never felt out of place and truly a pleasure. Yeah, thank you so much. my one message would be whatever you're doing be passionate about it, enjoy it. enjoy working with people to make things happen and as long as you're passionate and you're enjoying things will fall in place. Beautifully said. very simply put, but Priya I believe has been doing this and she is continuing to do this and she's inspired so many of her team members and she is definitely leaving a wonderful footprint and will continue to do so and here's wishing you and your team all the best, all the luck, all the positivity, all the creativity and please watch the men list. [laughter] Wishing Analytics India magazine the same not just for the recording great growth and success. Thank you so much. Thank you.",
        "start": 2764.8,
        "duration": 5633.637000000009
    }
]