[
    {
        "text": " Tonight on Front Page, India's largest IT services company just made its clearest AI statement yet. For the first time ever, Tata Consultancy Services has broken out its AI numbers. And the headline is hard to ignore. TCS has crossed $1.5 billion in annual AI revenue and has completed over 5,500 AI projects globally. This wasn't buried in an earnings footnote. was actually announced deliberately at TCS analyst day 2025. And that tells you something which is TCS CEO Kitivasan didn't position AI as an add-on. He positioned it as the company's next identity. More than 54 of TCS top 60 clients are already working with the firm on AI. 85% of clients with contracts above $20 million now use TCS for AIEL work and AI revenues alone are growing 16.3% quarteron quarter far faster than TCS's core business. This is the first time an Indian IT major has publicly said AI is no longer experimental. AI is now a core revenue engine. But one sentence stood out. Kitivasan said TCS is adopting an AI first culture where the first question is what can AI do here even if it cannibalizes our revenue end quote that's not a throwaway line for decades IT services grew by billing more humans more hours more effort now TCS is openly saying it is willing to automate parts of its own billable work to stay ahead that's very there and very and and well to to be honest slightly uncomfortable as well especially for investors but it's also very honest kitasan went further he said AI is not just another technology cycle he called it a civilizational shift in TCS's framing which means digital enterprises were dataware AI enterprises are now contextaware software moves from reporting to reasoning from automation to autonomy And AI becomes a decision coach, not just a tool. This is TCS selling a future where software doesn't just run workflows. It recommends choices and takes supervised actions. That's a very different services pitch to be honest. And here's where it gets interesting. TCS isn't just selling AI to clients. It is also aggressively deploying AI internally. And that too at scale. 600,000 employees now have access to AI tools, models, and coding assistance. TCS ran what it calls the world's largest AI hackathon. 280,000 employees. Wow. Over 500,000 submissions. And instead of humans reviewing them, TCS used AI to evaluate the entries. a process leadership says would have taken actually about 90 people over 12 months but actually was done in just 3 weeks. This is TCS quietly showing clients that we are not just talking about scale we are operating at it. TCS has also introduced a fivelevel services autonomy framework inspired by self-driving cars. So let's just think of it like this. Level one and two AI assists human level. Number three is agents understand context and take supervised actions. At level five, we have full autonomy. Still theoretical, most enterprise deployments today sit around level [clears throat]",
        "start": 0.16,
        "duration": 456.4799999999999
    },
    {
        "text": "autonomy framework inspired by self-driving cars. So let's just think of it like this. Level one and two AI assists human level. Number three is agents understand context and take supervised actions. At level five, we have full autonomy. Still theoretical, most enterprise deployments today sit around level [clears throat] is now pitching autonomy upgrades as a structured repeatable service. That's clearly an attempt to productize AI transformation, not just customize it. There's another signal which many missed which is this. TCS leadership openly admitted we cannot build everything ourselves. That's why the company is accelerating partnerships, acquisitions, and ecosystemled growth, which explains the recent Salesforce consulting acquisitions, deep partnerships with Microsoft, OpenAI, Enthropic, Nvidia, Google, and of course, an early work on agentto agent protocols. This is CCS acknowledging that AI cycles move too fast for purely organic buildouts. And then of course came the most debated move. TCS is investing billions into AI data center infrastructure via its Hyperwalt venture alongside TPG. This challenges TCS's traditional asset light services DNA. Analysts questioned it directly. Management's response. Here it is. AI infrastructure deepens hyperscaler relationships and positions TCS as a one-stop AI transformation partner. So, it's a risk, but it's a calculated one. We of course have covered this extensively here on Front Page. If you haven't already seen it, please make sure to check it out. Analysts of course raise the obvious concern. If AI automates legacy services faster than new age revenue grows, how does TCS expand overall? leadership didn't dodge it. They actually answered it in a sense. This is what it is. AI will redefine value, not just replace revenue lines. Whether that holds, the next 24 months will decide. And as always, as is the ritual, here is the front page take. This is what we feel. This is not a quarterly headline. This is India's largest IT services firm publicly committing to an AIEL future even if it disrupts its own business model along the way. $1.5 billion in AI revenue is the milestone. But the bigger story is this. TCS is betting that scale plus trust plus execution discipline will matter more than flashy models in the AI services era. The question now isn't whether TCS is serious about AI. It's whether the rest of Indian IT can move fast enough to keep up. Accenture previously reported roughly $2.7 billion in advanced AI revenue and $5.9 billion in AI related bookings last fiscal year, highlighting the scale of global peers AI business. We of course would request you to stay tuned because Accenture earnings call is just around the corner and we are certain that this number is going to change and that too significantly and of course to set the context of Indian IT companies back home. Indian IT peers like Infosys, Vipro and HCL Tech haven't yet publicly broken out AI revenues to this level. though they are actively embedding generative AI cloud and agentic",
        "start": 228.0,
        "duration": 860.5589999999999
    },
    {
        "text": "is going to change and that too significantly and of course to set the context of Indian IT companies back home. Indian IT peers like Infosys, Vipro and HCL Tech haven't yet publicly broken out AI revenues to this level. though they are actively embedding generative AI cloud and agentic us know what you think in the comments below. This is front page by A IM network. You know what to do. Yes, like, share, subscribe and always remember think AI. Think A IM. [music]",
        "start": 433.68,
        "duration": 887.2399999999999
    }
]