[
    {
        "text": " Welcome to Front Page. McKenzie CEO Bob Sternfeld's latest tongue-in-cheek remark stating that its headcount just did the unthinkable. They listed 25,000 AI agents as employees. It sounds like a very bad corporate joke to be honest, but for the Indian IT industry, the punchline is a heart attack. For 30 years, the important parameter in this business was very simple. How many thousands of people can you cram into a campus? But that math just died a very very violent death. When the top five Indian IT giants add only 17 human beings to their payroll in 9 months while revenue keeps climbing, the game hasn't just changed, it's been deleted. We are witnessing the end of the body shop era for sure. We are moving from billing for human sweat to charging for digital labor by the bucketload. Whether you call them companions, agents or digital co-workers, the reality still remains the same. The billable hour is a corpse and the new law of the land is output at any cost. And of course joining me today is Mohit Pande, our very brilliant tech journalist who covers this very extensively. And Mohit will be shedding a lot of light on this because I believe yes the tremors are being felt and how welcome to front page Mohit. How are you doing? I'm good. Thank you Sud so much for having me again. As always it's a true pleasure. Mohit first and foremost I would like for you to please set the context for the viewers and the audience because this is genuinely something which is very scary. So I think Mckenzie CEO Bob I think he was speaking about this I think two to three weeks back. So he was talking about how we have now 65,000 employees and he jokingly added that 25,000 of them are AI agents. I remember you mentioning it as well. We have spoken about this before as well. Yes. And so as you can as you said right it's a very scary thing to look at if you are coming out of college or even if you're a regular employee if you see that half of the employees of a company are AI agents are you going to get a job? Do you have seats left? And we'll come to the Indian IT part later. But yeah, that's that's a very difficult thing for anyone to comprehend. But at the same time, this is something that is happening. So first and foremost before obviously and and you and I will definitely deep dive as far as you know the the people who are just starting off their careers. We're going to talk about the Indian IT as well. But first and foremost, the first thing that I would like to ask you Mohit is the accountability gap. You know so when there is a human there is a clear understanding of an accountability factor. Yeah",
        "start": 0.64,
        "duration": 320.0009999999999
    },
    {
        "text": "off their careers. We're going to talk about the Indian IT as well. But first and foremost, the first thing that I would like to ask you Mohit is the accountability gap. You know so when there is a human there is a clear understanding of an accountability factor. Yeah for a grossly not a better term but the physicality of a human being there there's an accountability job HR everyone is involved. What do you do in this case? I mean this is a digital agent and how do you handle it if a digital a agent because of its hallucination causes a real world disaster. Yeah I think there are a lot of things to unpack over there. Firstly, if we talk about the physicality part, right? Imagine one can imagine these AI agents as employees who are working from home. Sure. So, but now if you think about employees working from home, they're going to work 24/7 as well because AI agents want to get tired. So I think that is one thing and that is exactly how the CEO Bob is also talking about this right that it's all about boosting the productivity and then if you talk about boosting the productivity and I have a so earlier just before this video you were also talking about ads right anthropic has ads chat GP has ads correct what if AI agents are also anthropic by the way claude is saying we don't have ads we don't have ads so what if you're using something from chat GPT and it also has ads so one of your employees spewing ads in the How would you feel about that? I mean completely gutted. Yeah. But it's it's a weird thing. Oh but yeah. So that is what is happening right? So and so so the productivity boost right. So Indian IT has all when it comes to the Indian IT part it has always been about billable hours like the number headcount growth and everything that's been the legacy bar. And now if AI agents are coming into the picture, how do you build those things? Like if an AI agent can deliver something that can be that was taking one week, two weeks, if two of the AI agents can do it in two hours, how do you bill a client for that? Are you going to bill it the same amount? Are you going to change that? Very logical. So that productivity boost is a very big trap I think that we are getting into as well. But before we move on to the people who are just going to be starting in their careers mo we faced this as humanity in the past as well right I mean in terms of the productivity boost perspectives that is genuinely an instinct that one has that all right wait a minute if I'm doing it like this I would like to do it better",
        "start": 161.12,
        "duration": 568.6399999999999
    },
    {
        "text": "their careers mo we faced this as humanity in the past as well right I mean in terms of the productivity boost perspectives that is genuinely an instinct that one has that all right wait a minute if I'm doing it like this I would like to do it better improving and sharpening and honing the overall systems but nothing ever can you ever hawk back and think of an example which you feel has caused this kind of a tremor or this kind of a anxiety or a panic. I can't think of any example apart from the AI age that I can think of that that's what yeah that's the productivi the productivity conversation has been there ever since GPT was launched or even before that for the people who were in this field right and everyone was talking about how would it look like when AI agents enter the workforce we've been talking about this since late 2023 and now that it's finally happening it looks a little scary and some people are trying to call it off no these are not employees I would I would also say the same thing these are not exactly employees Do they have HR benefits? Are they do they also come under the labor laws as well for example? Yeah, that's a big one as well. Yeah, true. So that is something that is too early to talk about as well. But I think u but do you think there might be a framework which might have to be designed for sure? I feel yes for definitely I think so. Tech Mahindra CEO Mohit Jooshi right he was talking about how he wants to differentiate between human labor and digital labor because they're going into the same problem again right if a twoe task expand on that. So he basically said that the task that we had we were able to finish that for example in 2 hours do we now bill the clients for the two hours or we going to build the clients for the number of headcount that we had assigned for this task because the productivity boost is there but the same amount of spending it's very hard to calculate. So I think it's a very good thing that techra has taken initiative for because they could have been like thank you so much. but they just want to build it differently now. They want a differentiation between digital labor and human labor. But tell me this Mohit I mean what does that do to for example the people who are already been in tech Mahindra let's just take that as an example for example and expand on that what happens to them what is what is the reaction because yes this sounds a little more sensitive maybe as an approach so do you feel that they will take this sensitive approach a little further I think so yes for if you take",
        "start": 288.72,
        "duration": 821.0399999999997
    },
    {
        "text": "for example and expand on that what happens to them what is what is the reaction because yes this sounds a little more sensitive maybe as an approach so do you feel that they will take this sensitive approach a little further I think so yes for if you take this quarter they added employees so if a company is able to add employees and boost productivity at the same time, go revenues at the same time, are able to maintain a profit margin. I mean, there's something good that is happening over there. Maybe the clients are paying more. Maybe they're able to get more deals and that is something that happened. They were able to get most large deals this quarter and small deals as well. So, and probably also there's something in their water which we don't know. Yeah, we don't know. Yeah. So, yeah, the productivity boost is actually coming out like a positive thing for all these IT firms. At least for some IT firms. are letting go of a lot of people. So that is one thing over there as well. But I was looking at your earlier video right the anthropic one correct and we always talk about lower level employees right AI is going to replace lower level jobs but if you look at what opus did it is able to create a C compiler in just two weeks right so I think the bigger threat is to people who are on senior levels as well as as well now as well not just the lower and that is only recently happened that has only recently happened with this particular development which is taking place. Yeah. So the if all of the AI agents for example how Mckenzie said 25,000 AI agents imagine if all of them are powered by claude opus wow how the com I mean no one would have to work or maybe so everyone has to work more we still have to figure out how that scenario looks when AI agents actually enter the work because of course I mean I do I you and I have discussed this till the cows come home we've discussed this in the past that you know the fact that what are the skills required and moving forward forward and so I don't want to go into that discussion today because let's be honest I think none of the even the companies are very clear to be honest Moit that what is it that they're actually wanting from a new person coming in but I'll ask you a slightly different question from a more maybe human point of view somebody who's coming in right now you have come in but with these kind of developments taking place those people who have worked very hard they have certain dreams unfortunately they're just not being able to achieve them they're not getting the jobs. Yes. Correct.",
        "start": 417.12,
        "duration": 1067.5999999999997
    },
    {
        "text": "maybe human point of view somebody who's coming in right now you have come in but with these kind of developments taking place those people who have worked very hard they have certain dreams unfortunately they're just not being able to achieve them they're not getting the jobs. Yes. Correct. or the other on a societal platform we are removing that ladder whatsoever what to altogether that that lower rung platform in terms of where people learn life skills when they start their new jobs they learn new experiences and they that shapes them for their lives ahead. When something like this is suddenly you know jolted do you not think that we're taking that away? I think we're definitely taking that away. I I can't speak on behalf of a techie. Let's say you and I you and I have done work. We started early whenever we did. We learned we fell. We got up. But those experiences have taught us and shaped us into who we are today. Yeah. So I think I'll give you my personal example as well. Okay. When I started writing when I started journalism there was nothing like chat GPT where it could just finish me for example a news in inverted pyramid in just 2 minutes. Okay. We used to write, we used to figure out what is happening. And during that writing process, we used to get a lot of questions. We used to ask why, how and everything. Now it's just something that it generates. So this happened with me recently that someone asked me what what was that news exactly about? What was the name of that co-founder and I couldn't recollect any of that. So that is some that I think that is the ladder maybe that you're talking about the learning curve that there that is completely going to change because if someone becomes a developer someone enters into a firm and they can just generate code from claude opus they'll have to debug debugging is a different story altogether but they didn't learn anything how to code they didn't learn anything so that is that ladder is like yeah completely gone which is unfortunate coming to the Indian IT I mean it's been a bloodbath as we've all obviously seen on the L street. We've seen it happen. I mean, this has been the worst since the 2020 COVID y crisis. How do you see it? I mean, the billable hour, everyone seems to be going on about the fact that it's dead, it's finished, it's done and dusted, it's buried. Do you still see some kind of maybe a runway for it to carry on for some time? Because these are huge companies that we're talking about. It's not like they're very flexible and nimble and suddenly can turn. I think the runway is still I think there is still 2 three years left for this. But I saw a very interesting",
        "start": 543.839,
        "duration": 1338.9609999999984
    },
    {
        "text": "to carry on for some time? Because these are huge companies that we're talking about. It's not like they're very flexible and nimble and suddenly can turn. I think the runway is still I think there is still 2 three years left for this. But I saw a very interesting of all these IT firms combined is close to 300 billion right and they have a total of 6 lakh 7 lakh employees. Correct. The same valuation is of Anthropic 300 billion something and they have total of some 3,000 6,000 employees. 22.5 283 billion. Yeah. 2 close to 300 billion. 283 billion. Yeah. And Anthropic also has the same valuation approximately the same and they have 100 Indian is 32.5 billion. 22 22 point sorry 5 billion. No the total size of Indian total size. Okay. Fair. So that is like three close to 300 million in the Indian IT industry and that is the same valuation as anthropic has alone. Okay. But the size the size of their employees the number of employees is like 100th maybe less than that. M so I think that is something that Indian IT might also eventually go towards that they're going to have lesser teams or maybe more teams but more employees as well to and I think that is something that who I think sharu was also talking about right that the employees need to learn not just how to chat with AI agents they need to learn how to manage them so maybe that is something that will increase the size of these firms as well maybe they'll be able to take on more projects so I think we are heading towards that path. Okay. But you you see it still having about 2 to 3 years. 2 to 3 years it is because these agents are still maturing as well and not everyone in Indian it is also using anthropic claude opus as but that will accelerate. That will accelerate. Yeah. But that is also very expensive for these firms. that's a good point. That's a very so even if the and eventually that Indian firms are pushing more towards sovereignity. So it's like a double-edged sword in a big way isn't it? Yeah. in terms of the sheer impact on their pockets. Yeah. Visa v the sheer amount of productivity also the number of people who are looking at them blankly in their faces about the future of their lives. But I think it's a double s word as of now because eventually the cost of all these AI things will will come down will come down. So I maybe someday they would be cheaper than hiring employees. Very quickly I'd like to ask you this and then of course we'll move on to the billable aspect because the monetary impact is finally I believe every company's go-to. As far as this aspect is concerned, what do you feel will take place in the next",
        "start": 681.68,
        "duration": 1611.8389999999988
    },
    {
        "text": "than hiring employees. Very quickly I'd like to ask you this and then of course we'll move on to the billable aspect because the monetary impact is finally I believe every company's go-to. As far as this aspect is concerned, what do you feel will take place in the next you've mentioned runway all right but what do you feel will happen I think as what is happening from the employee point of view employee point of view employee point of view I think most of them as we discussed like the new types of roles are coming in and new types of requirements are there for people getting into these firms so they'll have to again this word upskill is going to come correct And but some of them will obviously as we spoke about the ladder is not there. They'll feel let's talk about that 50 year old gentleman who is in senior management for example right now he knows that okay wait a minute man I only have about 2 to 3 years to figure things out but maybe there are certain mental blocks there are certain skill set lacking or whatever you want to call it. How what would you like to say to that gentleman? I think when it comes to the Indian IT firms, it's always been like if you reach 40 years of age or maybe you're growing beyond 40, they eventually just stop caring about you in some sense. Oh wow. Because I mean I I this is not me who No, but that's a very honest state. Thank you so much. If you've been in one of these IT firms and you went through all this transformation like there was big data, then there was cloud and now AI is coming. you event don't have that skills and if you don't upskill to those skills you might eventually you'll have to switch careers so maybe it's a very scary thing to be a part of okay so now of course let's talk about the the moral mirage as you and I were discussing which was I thought that was very interesting which is that how do you sell the digital force I mean the that is what what bamboo of course I just was was told that he has talked about alternative careers in the AI world. You want to shed some light on that? Yeah, he exactly that we how we exactly spoke about the 40-year-old. He's saying switch switch the career because if you have been a software engineer all this while there maybe in the future there are no jobs for you. So maybe that is what he's talking about but not everyone agrees with him as well. Maybe because everyone wants them to be a 10x software engineer. So everyone is I mean it's both the things at the same time like people are saying just move away from software engineering. Some are saying there would",
        "start": 822.079,
        "duration": 1870.638999999998
    },
    {
        "text": "he's talking about but not everyone agrees with him as well. Maybe because everyone wants them to be a 10x software engineer. So everyone is I mean it's both the things at the same time like people are saying just move away from software engineering. Some are saying there would that everyone would be a software engineer. It's a weird it's a weird thing that is going on boundary right. Yeah. And these IT firms when it comes to the billing part as we said that Tech Mahindra for example is talking about this which is the moral mira moral mira I just want to talk to you about this how do you sell the digital force in terms of billing to a client because as you had mentioned earlier the billing hours or that entire mathematics will change. Yeah. So that is something that is still in very early stages. Tech Mahindra is also doing some pilot with I think Forester. So that might take at least one or two quarters or maybe any other companies which you might know apart from Tech Mahindra. I think LTI M tree also has onboarded some 1500 AI agents and they're also trying to figure out how we can do this. So it's a wait and watch according to me. Okay. And apart from that all these Infosys cogn and cognizant they're all partnering with Devon. Right. Right. So that AI software engineer part is also coming in. Maybe they'll have a lot of AI agents in the future. So, everyone will eventually have to figure out how are we going to differentiate. So, it's a very liquid situation right now. Nobody seems to understand in the industry how to go ahead and crack this because they themselves are trying to adjust and balance the sheer speed at which things are coming at them. Yeah. And not just the pricing, right? Like the Mckenzie CEO talking about Yeah. So many employees. It's a moral thing as well, not just about the pricing thing. How would it impact the industry? How would the people feel who want to join the company? So, I think yes, it's a very shady point. Honestly, I personally felt that wasn't the greatest statement to make. Yeah. Yeah. Why do that? Yeah. I was talking to our HR earlier and she also said that maybe if AI agents come into the workforce, they'll be able to do work better. But can we rely on them? That is the whole part. That's a big one as well. What if this electricity goes away and there are no AI agents? Yeah. And and the psychological safety aspect. What do you have to say on that? Yeah. Psych like the safety part is you can take example of the open claw thing that is happening right now. There are so many agents that are running autonomously doing the work for you. What if one of the agents just goes",
        "start": 954.959,
        "duration": 2122.5599999999968
    },
    {
        "text": "do you have to say on that? Yeah. Psych like the safety part is you can take example of the open claw thing that is happening right now. There are so many agents that are running autonomously doing the work for you. What if one of the agents just goes Yeah. I mean imagine you're sitting next to an agent and working etc. The psychological impact on you as a flesh and blood human being. Yeah. an AI agent is able to do more work than you while you're just sitting there. And so yeah, so that brings up fear, that brings up anger, that brings up resentment, that brings up not the best of happy feelings. I I mean in the end in 3 4 years everything would be happier. I think if we just get if they because of the medication, everyone will be on. No, not because of the medication because we'll just get adjusted to it. It's like I'm hope I'm just trying to be optimistic. Maybe you can be more optimistic apart from me. Fair enough. Okay. So, Moit before we we we wrap this up as always as you know the tradition on front page. Yeah. Your golden pearls of wisdom will need to drop as the front page take. Okay. So, I think calling AI agents as employees is too early of a thing, but that is something that is going to happen very soon. And my advice to everyone who's going to join all these firms is that just upskill yourself and the firms that are calling themsel their AI agents as employees. I think you just need to reook at that again a little bit because along with it comes a lot of responsibility a lot of legal trouble as well maybe in the future. No, fair point. Thank you so much Moit as always. It's been a pleasure. There you have it ladies and gentlemen. That was Mohit making some very valid points and of course I believe calling them employees was also a message to our HR. Yes. All right. So well this is front page ladies and gentlemen and I believe the final understanding is the golden mantra is to upskill. Please like, share and subscribe and always remember think AI let's not feel fear. think I am.",
        "start": 1082.16,
        "duration": 2349.519999999998
    }
]