[
    {
        "text": " The AI browser war has begun and today the first cannonball has been fired for sure. [music] Good evening. Well, we told you this was coming. If you've been following Front Page, you know we called it the AI browser war has begun. And today, the first cannonball has been fired for sure. Amazon has officially declared war on one of the hottest AI startups in the valley, Perplexity AI. This week, Amazon sent a cease and desist notice to Perplexity, telling it to stop using its AI bots to crawl and shop on Amazon through its actually new browser called Comet. You are aware of it. We said it on front page, correct? So, Amazon claims Comet violates its terms of service by running automated shopping sessions, comparing products, and even making purchases without disclosing it's an AI agent. In other words, Amazon just said this. We don't want your bots buying from us. End quote. But perplexity isn't well quietly rolling over. Its founder and CEO, Arvin Sri Navas, responded publicly saying this. We would be happy to work together with Amazon to figure out a win-win outcome for both us and them, but attempts to block our comet assistant on Amazon and hurt our users, we will have to stand up for them and not get bullied by Amazon.\" End quote. So, what he's actually really saying is this. We're open to collaboration, but we won't let big tech dictate the rules of the AI era. It's actually a diplomatic opener followed by a punchline, a very clear message that perplexity would not be intimidated and rightly so. Maybe moments later, the company's official account echoed that stance, posting this. We believe every user has the right to use the AI of their choice. Amazon wants to block Comet users from using AI assistance to shop on their platform and they are now using legal threats to do so. But we will not be intimidated. End quote. Which if actually stripped off the corporate tone pretty much means this. Amazon doesn't get to decide which AI people use. And if it tries, we'll fight back. Now before we deep dive, a very quick pause and a small little request and a message to all of you watching. We actually see you. Thousands of you watch front page every day. Thank you for that. I'm sure you laugh at the punchlines. Drop your takes and then just scroll right past the subscribe button. It's right there, man. Honestly, subscribing isn't charity. It's actually appreciation. We put in a lot of work, you know. It's actually how you tell the algorithm. This show gets me, makes me happy, and it's what actually gets you the top stories of everything tech and AI across the globe before I promise you this, anyone else does. So, please go on, tap it, and let's actually keep building this newsroom for the curious. All right. Now back to the storm. You, I",
        "start": 0.16,
        "duration": 420.029
    },
    {
        "text": "and it's what actually gets you the top stories of everything tech and AI across the globe before I promise you this, anyone else does. So, please go on, tap it, and let's actually keep building this newsroom for the curious. All right. Now back to the storm. You, I Perplexity argues that users should have the right to delegate shopping to their AI assistants. But Amazon fears losing control of what drives its $500 billion e-commerce engine, search visibility, and advertising. So, if Comet picks the cheapest option automatically, it skips the ads and recommendations that make Amazon billions. That's actually disruption. And here's where it actually gets pretty wild. Comet isn't just another browser. It's an agentic browser. It doesn't just search for you. It acts for you. It clicks, scrolls, compares, fills out forms, and if you let it, it makes the final purchase as well. But that raises the big question which is this. Who governs autonomous AI behavior online? When a bot starts making real transactions, whose rules apply? The AIs, the platforms, or yours? Well, Amazon of course has its own AI ambitions from Rufus, its conversational assistant to buy for me, an upcoming shopping agent. So, here is the conclusion. This isn't just about one rogue startup. It's actually about who gets to be your personal AI shopper. The battle line is pretty clear. Amazon wants control of your digital intent. Perplexity wants to free it. If Perplexity wins, the very structure of online commerce could shift. Imagine thousands of AI browsers doing the buying, not people. No ads, no recommendations, no sponsored products, just data, logic, and automation. That's great for consumers, but for platforms like Amazon, Flipkart or Walmart, it's actually an existential threat. This fight has major implications for India too. First, e-commerce giants like Flipkart, Misho and Geommart will need to rethink their bot policies. So, when AI browsers actually start automating comparison and checkout, Indian marketplaces must decide, do they block, partner or build their own? And second, this opens up a new opportunity for Indian AI commerce startups. Imagine local shopping agents built around data, UPI flows and multilingual price intelligence. And the third bit which is this, this will likely actually shape India's digital India act which already aims to define autonomous AI behavior. The Amazon perplexity fight could become a reference point for Indian regulators drafting the first AI conduct rule book. So yes, this browser battle in the US could write the policy script for AI commerce in India. At its core, this isn't about corder terms of service. It's actually about freedom versus control. Who owns your digital actions in the agentic era? If Perplexity succeeds, AI browsers will become the next big interface, acting independently, negotiating prices, making choices for you. If Amazon wins, big tech keeps the leash tight. Your AI will work with their platforms, not outside them. Either way, the AI browser wars have begun. The Clarion call has",
        "start": 214.64,
        "duration": 830.5080000000004
    },
    {
        "text": "If Perplexity succeeds, AI browsers will become the next big interface, acting independently, negotiating prices, making choices for you. If Amazon wins, big tech keeps the leash tight. Your AI will work with their platforms, not outside them. Either way, the AI browser wars have begun. The Clarion call has just about clicks. It's actually about control of the digital self. We please would like for you to drop in your thoughts in the comments below because we want to know what you think. Should AI be free to act anywhere online or do platforms deserve the final say? Of course, needless to say, you need to subscribe. [music]",
        "start": 422.479,
        "duration": 877.7690000000003
    }
]