[
    {
        "text": " Good evening. On one side the dream. India wants to build its own GPUs, its own sovereign stack, its own atma nirvar silicon. On the other side the reality we still fueling the rocket ship of exactly one American company that is Nvidia. And tonight's news makes one thing thumpingly clear. Nvidia is so back not just in Wall Street but right here in the nerve center of New Delhi. The government has just given an affirmative nod on a massive new tender. They are opening bids for 15,000 additional Nvidia GPUs. This takes the India AI missions national compute pool past the 50,000 mark. So just a year ago this number was effectively zero. Today we are building public compute as infrastructure. But before we decode the narrative, I'd like to request you please like, share, and subscribe. And of course, we from Front Page would like to thank you for all of your support. We of course would like to continue to thank you. So keep liking, sharing, and subscribing. That's actually what I meant. Of course, now back to the story. Over 40,000 GPUs have already been onboarded. 25,000 are alive, breathing, and crushing numbers right now. So, round one, we got the H100s. Round two, we stacked up 15,000 more. And now comes round three. Well, the heavy hitters. We are talking about 12,000 to 15,000 units of the Blackwell generation, the B 100, the B200. These are the chips that run the models that write the code that runs the world. It's pretty simple. And of course, we need to look at the economics. This is where the war is won truly. Global price for high-end compute roughly $2.5 an hour. The discovered price in India's last bid 115 rupees. But for you, yes, the developer who's watching, for the founder in Bengaluru, how are you doing? Well, the government underwrites 40% of the cost. That brings your price down 1265 rupees per hour. Now for a moment let us silence the hype. Yeah. Is 50,000 GPUs a lot for a startup? Answer is yes. For a nation trying to beat the United States or China, the answer is clearly no. You know what? I actually won't be surprised if Mark Zuckerberg has a cluster bigger than India's entire public stack sitting right in his basement. But of course, if we try to play the raw size game, we will lose and we will lose badly. So, India is playing a very different game, the efficiency game. We aren't hoarding chips for one giant proprietary model. We are pulling them, splitting them up, giving access to Saramei, to Bharat Jen at IIT Bombay, to the bright person building a vernacular voice in Jarant. Without these 15,000 new cards, all those AI for all slogans are well pretty much just pitch decks. But the question is and this is an important one and it is not a moot",
        "start": 0.16,
        "duration": 419.9189999999999
    },
    {
        "text": "to Bharat Jen at IIT Bombay, to the bright person building a vernacular voice in Jarant. Without these 15,000 new cards, all those AI for all slogans are well pretty much just pitch decks. But the question is and this is an important one and it is not a moot the cow? And that brings us to the meeting that happened this week. IT Minister Ashwini Vhnav and Vidia executives the venue New Delhi. Two massive narratives are colliding there. One sovereign GPUs. India has explicitly said it wants to design its own AI chip in 3 to four years. No Nvidia tax, no supply chain choke holds. At number two is the edge. They are discussing local manufacturing of the Nvidia DGX Spark. Yes, of course. Think of it as a very mini AI power plant in a box. One pedaflop of performance capable of running a 200 billion parameter model and it works offline. Cloud clusters are for training. These boxes they are for the real world. Railways, ports, rural hospitals where of course we have all experienced that the intent is patchy. Sorry, not the intent. Well, sometimes the intent can also be patchy but I meant the internet is patchy but the intelligence needs to be instant which clearly was missing in me two seconds back. And of course all of this is leading up to next month the India AI impact summit which is Prime Minister Modi on stage and the guest list it is the Avengers of AI Bill Gates Deis Habis Dario Ammo and likely yes the man in the leather jacket himself Jensen Wang on stage they will of course talk about collaboration but when we examine this closely 50,000 DPUs subsid ized pricing sovereign silicon ambitions India along with hosting the party is also building the venue 50,000 GPUs won't win the race against open AI but 50,000 GPUs priced at 65 rupees an hour pointed at Indian problems that might just build an ecosystem that actually matters and of course we would love to know what you think is this enough compute or just a drop in the ocean. But ladies and gentlemen, this front page by A IM network. Think AI. Think India AI mission. Think India impact Summit 2026. Think AIM.",
        "start": 209.599,
        "duration": 720.1589999999999
    }
]