[
    {
        "text": " Good evening. As we know, we are building data centers that never sleep and that too on a power grid that still blinks. We keep saying we're ready. The well, the reality looks more like a collision course. Plugging 21st century AI into 20th century infrastructure. You know, it is amazing. Absolutely it is, that India's digital economy is scaling at breakneck speed. cloud computing, AI workloads, digital public infrastructure and all of it runs on data centers. These servers are hungry. They already consume 1 gawatt of power. That actually amounts to an entire city like Indor or Jaipur's power consumption at peak hours. Data centers don't behave like normal consumers. They run 24x7 at massive scale with zero tolerance for failure. half of their energy goes into computing, another quarter into cooling. And when the grid stumbles, they don't just shut down, they actually switch to diesel. So, while we talk about green AI, the ground reality is often black smoke. Renewables aren't yet available round the clock. Diesel is expensive and dirty, and now even nuclear power is back in the conversation. The real question is actually this. Can India power its data center boom without breaking its grid, spooking investors or blowing its climate goals? And giving us a very deep insight on this is Smrui Nadik, our very own brilliant tech journalist who has covered this in her recent AIM article. Welcome to the show as always. A pleasure to have you with us. Thank you. I'm glad to be here. Wonderful. So let's start with the myth first. Let's kind of debunk the myth. The cheap power myth at that Smuty India is sold as a lowcost data center hub. Your data puts annual power costs at about well $89 million here versus $261 million in the United Kingdom. But if operators still rely on diesel smoothie at about let's say 28 cents a unit because the grid is unreliable is this cost advantage real or well largely an illusion. So when compared to our other counterparts in Germany, US and the UK, it is real but very fragile and increasingly very conditional. Also diesel is not meant to run continuously. Yet in locations with poor grid reliability or weak transmission, it can account for meaningful share of consumption especially during power outages, voltage fluctuations, peak shortages. But every hour on diesel erodess cost cap with markets like in the UK like you mentioned diesel generators cost about.28 per kilowatt hour. But at in contrast it's completely reduced amount for renewables especially around the clock renewable costs between.1 and.11. So data centers in India are generally low cost because of their cheaper grid power land and construction costs affordable skilled labor and many state incentives. So the advantage holds in regions with reliable grids and access to renewables. Elsewhere the diesel dependence and infrastructure can erode the cost gap very easily. But we tend to use diesel a lot more because the",
        "start": 0.24,
        "duration": 444.4790000000001
    },
    {
        "text": "grid power land and construction costs affordable skilled labor and many state incentives. So the advantage holds in regions with reliable grids and access to renewables. Elsewhere the diesel dependence and infrastructure can erode the cost gap very easily. But we tend to use diesel a lot more because the tier three cities. And but when in comparison if we use renewable power annual cost could drop down to 80 to 85 million dollars when compared to 110 to 118 under RTC third party. So that is a cost advantage but u we also have to look at poor grid reliability throughout the country. Okay. So before I move on to the grid aspect as you just mentioned Smuty I I just wanted for you to maybe you know shed some light on the report that you had cited in the article the I believe the report that talked about the cost factor when you mentioned I wanted to draw your attention to the fact that when we mentioned that India's cost generally speaking power cost is lower than for example the United Kingdom or Germany or United states probably right why is that if you could just very quickly talk us through that it'll just give us context no like I mentioned the compared to the renewable costs in India are cheaper there's cheaper grid power the land procurement in India construction costs are cheaper so all in all the electricity cost comes down and we also have lower tariffs here compared to other countries so it comes together that Okay. And the report aspect that that you cited in the in the article the Tatashella report what does it have to say as far as the myth is concerned? Was it was it anything specific that they kind of tried to unearth purely from the report point of view? Mhm. from not just the the Takshila report but many other data center reports reveal one thing is that renewable costs are lower than diesel but diesel helps during power outages voltage fluctuations so we increasingly use diesel it can't necessarily run throughout it needs to run it's like a band-aid solution correct me if I'm wrong smut yes it's a band-aid solution but also for fossil fuels it's cheaper in India so it makes the larger market for data center energy consumption. Fair enough. Which now of course brings me to the the turf war. we describe a trade-off between state grids for proximity and the central grid for reliability. Smoothie for hyperscalers looking at states like Uttar Pradesh or for example West Bengal does weak renewable access effectively push them onto the central grid and does that actually solve the latency issue? So definitely for Uttar Pradesh, India central grid offers greater redundancy and access to larger renewable projects that many state grids cannot match as of yet. They in comparison central grids also are more reliable, higher quality electricity. They're supported they can",
        "start": 224.4,
        "duration": 806.0000000000003
    },
    {
        "text": "and does that actually solve the latency issue? So definitely for Uttar Pradesh, India central grid offers greater redundancy and access to larger renewable projects that many state grids cannot match as of yet. They in comparison central grids also are more reliable, higher quality electricity. They're supported they can wind projects and better transmission infrastructure. So all in all, central grids can be cost-ffective and keep the energy prices relatively low. which in turn could be stable high capacity power but for some states like Karnataka, Maharashtra and Tamil Nadu the they have higher renewable penetration. So what players like Yota who have large data centers in India say is that they don't really care about the cost effectiveness. They generally tend to use state grids because they care more about the reliability and proximity more than costs and and addressing the latency factor majorly that is where the crux of the conversation is as far as they are concerned. They are more interested in that bit. Yeah, even for latency central grid hubs are better. they deliver more reliable and higher quality electricity. but for some states that I mentioned it's easier for larger players to you know use state grids fair the nuclear pivot that particular conversation is again back on the table smi given the fact that band-aid solutions like diesel the you know lack of maybe renewable energies so big tech players like Amazon Google and Microsoft are moving toward nuclear as we know and SMRs instead of waiting for well batteries but with India's nuclear capacity city which is at this given point in time at 8.8 Gaw. Is this a realistic near-term solution or are we just still very far away from that dream becoming a reality? So I believe we're still a decade away from actually using nuclear power for data center energy consumption. There are many constraints such as scale. even if all the planned reactors come online on schedule, there are many other incremental costs and they're not going to be fast enough for the data center demand and then in the closer years right now. They also have long build timelines. They take up to about 8 to 12 years from approval to commissioning in India, land acquisition, regulation, financing, etc. We also talked about small modular reactors. They are often cited as solutions but they're not ready yet. They're not being commercially deployed in India. There are many reforms or policies like the Shanti Act which are quite necessary but deployment is still years away. So in reality I think it will at least take 5 to seven years for nuclear power to come into the picture formally. But until then data centers will have to rely on grid power, renewables, storage and gas or diesel but not nuclear at the moment. But before of course I ask you in terms of what the impact on the climate will",
        "start": 407.6,
        "duration": 1146.0810000000006
    },
    {
        "text": "for nuclear power to come into the picture formally. But until then data centers will have to rely on grid power, renewables, storage and gas or diesel but not nuclear at the moment. But before of course I ask you in terms of what the impact on the climate will remember I had done a debunked with Suprit and Supri had very clearly mentioned that you know the data centers required in our country definitely is there. There is no question about there's no doubt right because the usage smithy is huge for example I I still remember from from that conversation he had mentioned like for chad GPT it is free now right for a year perplexity is free now for a year so do you feel that okay great people are talking about establishing data centers for example Google talking about visag the jam nagger facility coming up so yes those are all there which is nice and needs to applauded but this aspect which is the an which is the auxiliary aspect which needs to back all of that up as you just mentioned that we are a decade away as far as nuclear is concerned and renewables and and fossil fuels are what we are relying on what's your take on that because the boom is definitely there and we definitely need to ride the wave so the boom is there and it's only going to increase right now I think in 2024 the data center market generated around $9.17 billion and compared to what it might reach in 2030 it's going to be about $22 billion. So it is going to be difficult if we don't bring in renewable aspect in the picture. There are Yota NDT have committed to having at least 70% of their energy share as renewables. So that is something that we need to focus on more. we have cities like Mangalore coming up, we have Visak, we have Hyderabad, we have Chennai that can build hyperscalar facilities with the help of bigger giants, international giants, but even though it's lower cost, I feel like we can go lower than the diesel costs and target using renewable power more than nuclear power also at this moment because nuclear like I said is going to be a little further away. So we need to figure out how to scale AI with renewables instead of fossil fuels. Yeah. I mean and and that's a very valid fair incisive point you've made Smi being the expert. I mean you feel that the thrust definitely should should be towards renewables which actually automatically brings me to the climate question. we're looking at cooling alone consumes about 25% of a data cent's energy and puts pressure on water's stressed regions. So are policies like let's say the carbon credit trading scheme actually forcing accountability yet or smuty is the sector still largely unregulated. It is very largely unregulated still and",
        "start": 580.08,
        "duration": 1490.0809999999994
    },
    {
        "text": "we're looking at cooling alone consumes about 25% of a data cent's energy and puts pressure on water's stressed regions. So are policies like let's say the carbon credit trading scheme actually forcing accountability yet or smuty is the sector still largely unregulated. It is very largely unregulated still and the energy market also offsets are never enough since the RTC renewable power which is the roundthe-clock renewable power is not still widely used and available in India. The next best option would be procuring energy renewable energy certificates. experts have argued that data centers should be mandated to meet at least onethird of their total energy demand through these RTC renewable power procured via open access or captive arrangements. Bringing data centers under the India's carbon credit trader trading scheme would also push system systematic investment in both renewable energy and also efficiency of this renewable energy like you mentioned we have we use about84% of India's total energy consumption through data centers but that's going to rise because we have a lot of AI startups coming up a lot of investments coming up so India while it uses electricity for compute alone 25% of it. we need to focus on actually using renewable power because we have abundance of solar and water energy that can have joint proh projects from all of these infrastructure companies to work under one grid itself. Fair pointy before we we conclude today I have to ask you this [clears throat] personally as far as you being the expert is concerned we really enjoyed your article by the way I have to say that it was very well researched and it was very very extensive if for example a policy maker is watching right now maybe it's not just an example maybe somebody is actually watching right now what would you like to say to them smi personally what would you like to say to them on I mean to begin with we need a reliable grid infrastructure where power outages and voltage fluctuations are not an issue so that edge locations tier 2 tier three locations can come up. because they will also provide latency with regards to the renewable power that is available in those cities. we need faster approve approvals for larger power users. We need access predictable open access and renewable procurement rules. So this not only must align with energy digital policies but it has to align with our climate policies also. We can't keep pushing our net zero targets from 2030 to 2050 to 2070 and then maybe you know later than that. We have to ensure that we push for clean power and efficiency standards while also planning transmission storage generation around these emerging data center hubs. Until now it was not a big conversation but since the AI boom has happened in the last few years in India AI intensive workload is also a lot more AI native",
        "start": 754.16,
        "duration": 1823.9199999999985
    },
    {
        "text": "for clean power and efficiency standards while also planning transmission storage generation around these emerging data center hubs. Until now it was not a big conversation but since the AI boom has happened in the last few years in India AI intensive workload is also a lot more AI native data centers like you mentioned people are using chart GPT perlexity other AI tools a lot more so we need to keep yeah we need to keep in mind that we can't have these bottlenecks you know that could cause the blunt of the advantage that India has here and you know not give us a slower digital growth. Very well said. Well ladies and gentlemen there there you have it who of course has done a wonderful article on this it tries to cover it from a holistic point of view and I believe I agree with her when she said finally that it is about making sure that our alignment is absolutely in tune with what we are wanting to achieve globally and not find ourselves in an embarrassing situation where we are saying all right wait a minute we want all the investments there is an AI boom. We want to ride the wave, but at the same given point in time, we need to make sure that we are backing it all the way. Well, ladies and gentlemen, that was of course front page. Like, share, subscribe, and always remember, think AI, think renewables. Think AIM. [music]",
        "start": 923.68,
        "duration": 1975.4229999999982
    }
]