[
    {
        "text": " Last night, New Delhi seven local kalyan mar the prime minister 12 founders in a closed-d dooror meeting signaling a drastic change in the speed at which things are moving. Just weeks before the India AI impact summit 2026 when the world will actually land on our doorstep. The narrative it seems has shifted gear into deployment. Startups are the co-architects of India's future. Sounds nice, right? Standard political jargon maybe. But when we actually look closer, what we can read between the lines is that the prime minister signaled zero ambiguity. India must not copy the west. No Silicon Valley clones, no rapper startups. The mandate is clear. Build authentically, indigenously and specifically for the chaos, the color and the complexity of India. So why does this matter? Because next month the giants arrive. Bill Gates, Deis Hazabis, Dario Mod, Jensen Wang, the kings of compute are coming to Delhi. And it was imperative that India got its story straight before they touched down. India needed to make an emphatic statement that we aren't just a market for your products. We are builders in our own right. We have our own AI narrative, our own AI mission. And last night, we found our central players. Across two hours, the prime minister laid out five non-negotiables. At number one, ethics. No reckless deployment. Data privacy is the bedrock. Number two, language. And this is a crucial one. Hindi, Canada, Tamil, Telugu, Bengali. If your AI doesn't speak the dialect of a grandmother in rural Punjab, it's useless to India. Which signifies that digital inclusion is not merely ceremonial. It has to be palpable. And number three, solve real problems. Forget writing poetry or generating oh so cute images. Modi wants AI for agriculture, for health, for logistics. Made in India, made for the world. Trust. He emphasized it as our biggest strength because in a world of deep fakes and algorithmic bias as we all know India wants to be the safe harbor of AI. And finally at number five you build we back. So who is in the room? Server AI the multilingual heavyweights. Arajen, the IIT Bombayled, brain trust, fractal, the enterprise giants, socket AI, defense ready math models. I of course would like to mention here that for those of you who are regular watchers of AIM network, none of this should sound new to you because we have been tracking these movers and shakers since day one. Just to jog your memory on the impact these gentlemen have made and will continue to do so. They are building speechtoext 3D geni genai engineering simulations and healthcare diagnostics establishing this as the deepest cross-section of India's AI pipeline ever assembled at one table and of course to shed light on the reality behind the rhetoric we have senior editor Palvi Chakravarti joining us live from the newsroom a big welcome to you Palvi as always on front page Thank you Si. Thank you so much for",
        "start": 1.04,
        "duration": 441.1199999999999
    },
    {
        "text": "AI pipeline ever assembled at one table and of course to shed light on the reality behind the rhetoric we have senior editor Palvi Chakravarti joining us live from the newsroom a big welcome to you Palvi as always on front page Thank you Si. Thank you so much for It's always a pleasure. I'm doing wonderfully well and I believe it's quite cold wherever you are. [laughter] Yeah, I'm in Delhi and yes, it is it is pretty cold. you from front page for you. Thank you. Thank you so much. Of course, [laughter] you will be able to bring us some light today of warmth probably in this conversation. I hope so. All right. So let's deep [clears throat] dive. So why the meeting now Palvi? What was the PM's message for the founders? it's very strategic actually. you know it's just about a month away that you know we have the India AI impact summit and India this is the first time that all the 12 founders they met the PM and I believe it was long due but that was that's what the founders also believe but yeah they were all excited to you know finally meet the PM and but it was basically you know it was a status check you know what they all are doing how far they are with their models you know because server AI and you know Bhat Jan they both of them were almost ready with their models they they would be launched last time I just wanted to refresh everyone's memory all our viewers and everyone that Palubi had mentioned last time that these two models will be launched at the AI impact summit. Yeah. Yeah. Yeah. So I believe Survi will probably come out with their model maybe end of Jan. but Bharatan will launch their model at the summit. In fact, socket AI also I mean they haven't yet made it public but they might also launch their model they are almost ready with it. So so it was yeah it was basically you know the visi talking to his portfolio companies yesterday and it was like you know who is doing what where are you standing are you like see the summit is extremely important for India particularly for Modi because you know he has tried very hard to you know kind of project India as you know the next AI destination. There has been a lot of collaborations that have been happening over the last one year and so yeah this was a very very strategic meeting there was a reason that it was a rank table and so there was a formal meeting which was followed by an informal meeting with the founders which I got to know and the medium the PM basically you know he also asked like personally that you know in fact he also gave suggestions to the founders as to how yeah that how that models are working",
        "start": 222.48,
        "duration": 763.3589999999997
    },
    {
        "text": "which was followed by an informal meeting with the founders which I got to know and the medium the PM basically you know he also asked like personally that you know in fact he also gave suggestions to the founders as to how yeah that how that models are working he give us a suggestion that he probably gave any of the founders yeah so of course the founders they don't want to talk about that the exact suggestion but it was more so like that you know make sure that the model is actually be of you know can be used practically it is and it is not just you know just to be showcased and not it does that it doesn't have a practical use so that was a very clear message from the PM to all the founders and so yeah so that's about it so yeah as far as the expectations from the summit is concerned what what do you feel that we should be ready for well the expectations are of course I mean I I'm as a journalist I'm definitely keen to see what the model really are I mean there have there has been so much written about the models and you know that how they are being prepared and how each of them are unique and what is that the various USPS or the models but how actually they are they turn out to be it's something that everybody all of us wants to see so that definitely is a is a very big is something that I'm really looking forward to that whether they you know it's not just the hype you know one is that of course and the other is of course what the global leaders what they have to say at the summit if they want to announce any any new collaborations at the summit what is their view of the Indian AI ecosystem How do they see you know more the entire plan of the government and you know particularly like as we as we already know how the lot of global leaders are coming for the summit so there are a lot of announcements absolutely absolutely u I mean I'm really expecting peak what are you expecting [laughter] sneak peek I I'm not sure about that but you know I mean people are expecting announce announcements because they these people they don't travel to India very often and if they're there for the summit they will not just come here to inaugurate one you know they will be here to make some announcement either related to India or some kind of a collaboration with the government or with the mission I'm also looking at there might be some collaborations with these with the AI startups as well because if for example one of the LMS LMS they turn out to be really you know produce a future heavy then there might",
        "start": 384.319,
        "duration": 1051.199
    },
    {
        "text": "a collaboration with the government or with the mission I'm also looking at there might be some collaborations with these with the AI startups as well because if for example one of the LMS LMS they turn out to be really you know produce a future heavy then there might might be some tie-ups there and might be some you know takeovers as well. So a lot of things might just come out of the summit and of course there might be grants which might be announced both by the government and by the companies. Yeah. And there might be also be you know like basically India like this is the like one of the first such a global event from the global south. Yeah. So, so India is which is why it's all the more important for India and that's what Modi is actually pushing for and ensuring Yes. And ensuring that everybody everything goes right and he has he in fact he also said yesterday at the round table that how it's like for him it's like a Bat AI impact summit and not India you know AI impact summit. So basically the the whole the whole push has to be from Bhat and not from India. So that's the thing as far as you were mentioning a little while back Palvi that you wanted to share a little bit of data which which would interesting and incisive for the audience as Yeah. Yeah. lead up to the summit. Yeah. Yeah. Yeah. [gasps] So you know like this this meeting which happened yesterday it it it also it's important because you know like as we progress forward and we there is also a meeting lined up with Nvidia which it which makes even more consequential is what we know that how India is structuring the sovereign model development under the India emission. So you know a government report dated 29th December it clarified that India's so-called GPO grants are not free subsidies at all but a hybrid capital instrument where 40% is a pure grant and 60% is taken as equity by the digital India corporation calculated at the startup's next round of valuation. Now that mechanism means that one firms like server AI for example you know it received 247 cr worth of GPU access earlier this year. The equity component alone translates to roughly about 7.6% ownership for the government of India at seram's August 2025 valuation of 1,950 cr. Now in other words this makes the Indian state by proxy the fourth largest external shareholder in one of the country's most important model labs. Something un something unprecedented for a nondistr tech company. Now this kind of data actually shows how the government actually wants to have some kind of control over these startups and how you know each and every model is actually shaped and the final outcome. So this which is good which is good definitely",
        "start": 532.48,
        "duration": 1381.6799999999996
    },
    {
        "text": "for a nondistr tech company. Now this kind of data actually shows how the government actually wants to have some kind of control over these startups and how you know each and every model is actually shaped and the final outcome. So this which is good which is good definitely is that you know it also kind of restrains the startups a bit in terms of because they have to you know the outcome has to be in accordance with what the government wants. So it I don't know if it maybe maybe it it could be also finally Palvi the fact that we are this is a big move and maybe the to monitor it. Yeah. Yeah. Absolutely bloom and keep doing better and better maybe that might open up even more moving forward. I mean I'm just spitballing with you just speculating. Yeah. Yeah. Yeah. Of course. I mean we are I mean it's till the time the summit happens and we are past it. I mean there will be a lot of speculations but yeah I mean they are all calculated speculations I believe so some of them definitely will be in accordance to what we are expecting. Fabulous. All right Palvi. as always, it's been a pleasure having you with us on Front Page and we'll of course keep bringing you back, keep finding ways to get your insights because they're always very interesting and they shed a lot of light and give us Thank you so much. Thank you so much. A lot of depth in terms of what's going on. Of course, the best moving forward and I really wish that you can battle the cold. You look like a warrior so I don't think we are bothered. Thank you. All right. Wonderful. Well, ladies and gentlemen, there you have it. That was Palvi who of course told us as far as the insights were concerned, as far as the front page take is concerned, this is what we have as far as the India AI impact summit is concerned. You know for years the question doing the rounds where is India's chad GPD last night made something very clear that was never the goal India is building something very different frugal by design multilingual privacy first less about being the biggest model in the room more about building something that actually works at scale and I believe that's exactly what Prime Minister Modi is also nudging the founders to be very mindful off which is that it should not just be a showcase. It should be something which should be practically possible and should be working and should be helping people. So what actually changed last night was actually the size of the gap between policy and practice between ambition and execution. That gap just got smaller. Execution won't be easy. We know it. It never is. But if these wonderful 12 founders succeed, we just have to say this on front page.",
        "start": 698.64,
        "duration": 1711.0399999999997
    },
    {
        "text": "actually changed last night was actually the size of the gap between policy and practice between ambition and execution. That gap just got smaller. Execution won't be easy. We know it. It never is. But if these wonderful 12 founders succeed, we just have to say this on front page. finding its own sovereign proud path. Ladies and gentlemen, this is front page on the A IM network. As we always say, like, share, subscribe and please think AI, think Bat, think India, think AIM. [music]",
        "start": 867.12,
        "duration": 1745.751
    }
]