[
    {
        "text": " Why is everyone suddenly ditching chat GPT for Gemini? Tonight, the internet is fighting about one question. Why is everyone suddenly ditching chat GPT for Gemini? Well, let's start with the spark. Salesforce CEO Mark Beni off, one of the biggest power users of AI, dropped this bomb on X. Holy I've used Chat GPT every day for 3 years. Spent two hours on Gemini 3. I'm not going back. End quote. The reasoning, speed, images, video, everything sharper and faster. That tweet alone shook the AI world. Good evening and welcome to front page by A IM network India's video first AI and tech newsroom where we break the story first and explain why it matters. So if you find value in what we do hit like, share this forward and subscribe because the future moves fast and you deserve to stay ahead of it. Now back to what VC Jason Schuman added. Gemini is reviewing 450 plus sources for my research reports. Chad GBT might be well 10 to 15. The quality difference is night and day. End quote. Even Sam Olman in a leaked internal memo admitted that Google has been doing excellent work recently in every aspect. End quote. A rare acknowledgement that OpenAI is facing real competitive pressure. AI researcher Stefan Schubert pushed back, \"I don't find Gemini 3 as impressive as the rumors. It's good, but not knocking out chat GPT.\" End quote. This is the classic internet moment. Two people use the same model to different realities. So, what's actually true? Let's find out. People are asking how Google jumped so far ahead. The answer is, well, surprisingly simple. pre-training plus post-training as shared by vice president of research and deep learning lead at Google deep mind and Gemini co-lead Oreal vine let us first examine the pre-training despite all the noise that scaling is over Google proved the opposite the leap from Gemini 2.5 to Gemini 3 is one of the biggest jumps the deep mind team has ever delivered no walls no slowdown down just raw capability gains. On the post-training front, still a wide open frontier. Google's teams squeeze massive improvements here, too. New algorithms, better alignment, smarter tuning. That's where a huge chunk of Gemini 3's sharpness actually comes from. And then Deis Habis summed it all up in one line. The real secret is worldclass research and worldclass engineering and worldclass infrastructure all working together with relentless focus and intensity. End quote. That explains why even SM Altman in a leaked internal memo said Google has been doing excellent work recently in every aspect. And if that wasn't enough, even Som Chintala, the creator of PyTorch, who recently joined Miraati's thinking machines, said something nobody expected. He said that the Gemini 3 moment feels closer to GPD4 than anything in recent times. OpenAI around GPD4 looked invulnerable and Google looks invulnerable now with Gemini 3, which is TPUs plus Android plus Chrome. But the game isn't over.",
        "start": 0.16,
        "duration": 479.6769999999999
    },
    {
        "text": "recently joined Miraati's thinking machines, said something nobody expected. He said that the Gemini 3 moment feels closer to GPD4 than anything in recent times. OpenAI around GPD4 looked invulnerable and Google looks invulnerable now with Gemini 3, which is TPUs plus Android plus Chrome. But the game isn't over. lived experiences will determine the end game. So what's really happening? Let's find out. The part that no one is actually saying. So before Gemini 3 even entered the chat, Google was already gaining ground. Similar web data shows Google generative AI traffic share jumped from 5% to 14% in just 12 months before the Gemini 3 launch. A three-fold surge powered purely by distribution, search integration, and early Gemini models. Now coming back to how it works. Gemini 3 works end to end on Google's TPUs. And this is the real plot twist. While OpenAI runs on Nvidia GPUs and leases compute, Google is training, serving, and scaling Gemini on its own TPU stack. Ironwood, V5E, V4, all inhouse. It's the first time a Frontier model is beating competitors without Nvidia. So, what if Google starts selling TPUs widely and drops prices? The Nvidia era cracks. The price war begins. Compute becomes a commodity. This is most likely why Buffett dropped $4.3 billion into Alphabet, a bet on Google's vertically integrated AI stack, which is not a random portfolio play. Google controls the full funnel. And this is the scary part for competitors. research to chips to cloud to search to Android to YouTube to Gemini to Chrome which is one company one distribution billions of users. OpenAI on the other hand it has Chat GPT the world's most beloved chatbot but relies on Microsoft for chips data centers cloud revenue surface distribution. Google, as we know, has none of these dependencies. And with Gemini 3 inside search AI mode on day one, Google flipped the switch on its biggest weapon, India, which is the first mass market Gemini 3 country. While the United States pays for frontier models, Jio is giving Gemini 3 Pro access to millions of Indians at zero extra cost. Thanks to the Google Plus Jio 18month AI Pro partnership. So in simple words, America gets Gemini 3 as a premium. India gets it as a feature. This is why usage is exploding here. Not because Gemini is perfect. It still hallucinates, still breaks physics, still messes up details. People are switching because it's faster TPU optimizations equals low latency. It's cheaper or free. Google can undercut every competitor. So, it's everywhere instantly. Search, Android, Chrome, Jio, YouTube. It feels more agentic tool use, browser control, code execution, and better reliability. And yes, some prompts genuinely perform better research depth, multimodal reasoning, long context. So the question is, does it destroy GPT? Not universally, but for many mainstream users, it feels like the first model that actually challenges chat GPT's dominance. Paris Chopra summed it best. Google has a massive",
        "start": 243.599,
        "duration": 923.2770000000002
    },
    {
        "text": "reliability. And yes, some prompts genuinely perform better research depth, multimodal reasoning, long context. So the question is, does it destroy GPT? Not universally, but for many mainstream users, it feels like the first model that actually challenges chat GPT's dominance. Paris Chopra summed it best. Google has a massive on TPUs, cut cloud prices, push jacks, and the game changes. End quote. If Gemini proves that top tier AI can run without Nvidia, the entire industry shifts, and that's the strategic earthquake under all of this noise. So, we have reached that point. now which is the front page take. People aren't ditching chat GT GPT because Google made a better demo de demonstration. They're switching because Google finally activated its full stack advantage. Own the chips, own the cloud, own the model, own the apps, own the users, own the distribution. Chat GPT still dominates cultural mind share but Gemini now dominates infrastructure control and we are watching it happen in real time. So we would like you to please let us know if you have switched or are you staying with chat GPT.",
        "start": 468.72,
        "duration": 1054.159
    }
]