[
    {
        "text": " Good evening. The World Economic Forum is back. This year's theme, a spirit of dialogue, and the timing definitely matters. The world is moving through a very difficult phase. As we know, active conflict, strained supply chains, and a major technological reset driven by AI and compute. Capital is cautious. Governments are recalibrating. Yet despite all of this uncertainty, countries are still showing up, talking and looking for common ground, which is encouraging. As far as India is concerned, we arrive at this forum with a very clear sense of timing. The message this year goes beyond invest in India. It's about partnership and about positioning India as a reliable long-term anchor in an unpredictable world. So before we understand what the strategy really looks like and where the money is likely to flow, please stay with us. This is Front Page. Please like, share and subscribe. On the strategy front, in earlier years, India's presence at Davos was fragmented. Multiple states, multiple entry points. For the investors, it often raised a very simple question. Where does one begin? This year the approach looks very different because of Bharat House. A single venue, a coordinated narrative. The idea is straightforward. Start at one place, understand the opportunity, then choose where to engage. And of course, the pitch itself has evolved. India isn't positioning itself on lowcost labor anymore. Instead, the focus is on four areas that define the 2026 economy. and number one AI and data centers. Second is semiconductors and electronics. And number three, global capability centers. And finally, at four is the green transition. This defines a shared framework, but it also is where the competition begins. Because while the headline message is aligned, the states are no longer offering the same proposition. Each state is sharpening its own focus and staking out a very distinct role within the larger story indicating the dynamic now which is starting to take shape. Let us of course start with Karnataka. The pitch this year is direct and executionled. The emphasis is on speed moving from commitment to construction without any delays. For companies looking at global capability centers or data centers, that pace we just mentioned is the selling point. Now of course if we compare that with Telen Ghana the focus here is longer term artificial intelligence life sciences the effort is to attract high value research and specialized talent instead of just large workforces then of course there's Gujarat the message here is quite clear and unapologetic semiconductors defense manufacturing so as global supply chains are rebuilt and security spending rises Gujarat is positioning itself as the place to produce Maharashtra is leaning into its scale. It's presenting itself as the center of gravity drawing large pools of capital and ambition with an eye on the trillion dollar economy target. And then of course there are the outliers who are definitely worth mentioning. Kerala is framing its pitch around responsible investment ESG aligned with lower",
        "start": 0.96,
        "duration": 414.08
    },
    {
        "text": "scale. It's presenting itself as the center of gravity drawing large pools of capital and ambition with an eye on the trillion dollar economy target. And then of course there are the outliers who are definitely worth mentioning. Kerala is framing its pitch around responsible investment ESG aligned with lower emphasizing scale offering volume and capacity for large deploy. Finally, there are of course some very very notable shifts as well, which is Madhya Pradesh is positioning itself as an emerging mobility hub. Jarand is recasting its image, moving from a focus on extraction to a role in critical mineral supply chains. It's of course a very smart pivot and one that reflects how the competition between states is evolving. And then of course there is a SAM which brings the northeast to Davos. Its presence is definitely a statement in itself. For the first time, a SAM is on the global stage at the World Economic Forum, signaling a shift in how the region wants to be seen. The pitch covers electronics, semiconductors, tourism, and techled development, which reflects a move to showcase itself as a strategic platform and not just a regional one. But of course we can't talk about this year without addressing the two very different stories which is the heavyweight Andhra Pradesh. Chief Minister Chandra Babu Naidu is in Davos and his presence is definitely unmistakable. The pitch is Swarna Andra 2047 and it's delivered with confidence. Naidu's work is not just a feeble attempt to get noticed. On the other hand, it is an effort to set the agenda. He says Andhra Pradesh has attracted 25% of all proposed investments in India in recent months. A very striking claim. The focus areas are ambitious. Quantum technologies, space and digital governance. What Naidu is presenting is a state that wants to be run with a CEO's mindset. Then of course there's the silence. Tamil Nadu normally one of India's strongest manufacturing and export hubs a regular presence at Davos this year Tamil Nadu isn't on the ground the reason is domestic politics state elections have definitely taken priority but in a global environment this competitive silence carries weight as well it's a deliberate choice and one the world is actually starting to notice. So what does all of this mean for us? What India is offering right now is choice. A range of states with different strengths operating under a broader framework of trust. But this is also the moment to stay grounded. Every year a divorce announcements are made, memorandums are signed, headlines talk about billions. But as we have seen, what matters more usually definitely comes later when the cameras have stopped rolling. Over the coming days, we'll be watching very closely on front page who actually breaks ground, starts hiring, and turns intent into action. Because the real story isn't about which state marked its attendance. It's actually which state turns those conversations into real jobs. This, ladies and gentlemen, is",
        "start": 208.239,
        "duration": 789.441
    },
    {
        "text": "rolling. Over the coming days, we'll be watching very closely on front page who actually breaks ground, starts hiring, and turns intent into action. Because the real story isn't about which state marked its attendance. It's actually which state turns those conversations into real jobs. This, ladies and gentlemen, is you know what? The outcomes will definitely follow. And of course remember, think AI, think AIM.",
        "start": 398.16,
        "duration": 806.8820000000001
    }
]