[
    {
        "text": " And this is a state engineered computing strategy. The AIPC is currently priced at 18,999 rupees in the region. And [music] can a tiny locally built AI computer steal the lean light a limelight sorry at one of India's biggest tech summits? Because at Bengaluru tech summit 2025 something unusual happened. While other states talked about new AI data centers and new GCC setups with million and billion dollar in investments, Karnataka showed up with a small black box called Kio, a homegrown open-source AI ready personal computer built entirely by Karnatikas made in Karnataka. And suddenly the conversation shifted from global innovation to local access, local talent and a state rewriting the rules of digital inclusion. Before I move on, since it's local and we are going national, we already are national and of course we want to make sure that everyone is included. We are only going ahead and saying this. Please subscribe because that is one thing which gives us a lot of motivation to bring out the news that we do on front page which is always ahead of the curve and inspires the team to keep doing it over and over again. So we say it again very loud and proud on front page. We are proud of all of you people subscribing to our channel. Please go ahead and do that. Now of course back to Karnataka. Priyanker described KEO proudly like a product launch. He described it like a mission. KEO is an inclusion device. End quote. And for the first time a state in India or anywhere has built a personal AI computer with and here's the list. Opensource RISCV processor Linux operating system ondevice AI core no cloud needed 4G Wi-Fi Ethernet HDMI USBA USB C learning plus programming the tools which are preloaded BUD an AI agent trained on Karnataka's school syllabus and this is a state engineered computing strategy The AIPC is currently priced at 18,999 rupees in the region and it answers a question that India has ignored for too long. What's the point of AI if only the top 1% can access it? Very very poant question which brings us to why Kio matters now more than ever. So BTS which also stands for by the way Bangalore Tech Summit 2025 is pretty massive. 50,000 visitors, 1,000 exhibitors, delegations from 60 plus countries, deep tech, semicon, space tech, biotech, everything happening at once. But KO stands out because it hits the foundation. You can't build AI talent without AI capable devices. And today half of India still doesn't have access to a computer with enough power to run even basic models. Karnataka is fixing the problem at the root by putting AI capable devices into government schools, rural districts, colleges and skill centers, small businesses, homes, government offices. This is how you build an AI first generation, not through cloud credits or hackathons, but through hardware in the hands of millions. So just like the Andra script",
        "start": 0.32,
        "duration": 489.279
    },
    {
        "text": "the root by putting AI capable devices into government schools, rural districts, colleges and skill centers, small businesses, homes, government offices. This is how you build an AI first generation, not through cloud credits or hackathons, but through hardware in the hands of millions. So just like the Andra script the Karnataka equivalent. Here we go. Kio launches alongside startup policy 3.0, O new space tech policy 600 cr rupees deep tech road map quantum and electronics centers of excellence the future makers conclave which will boast 10,000 founders investors innovators so as we know for decades Karnataka built India's software brain now it wants to build India's AI infrastructure AI devices AI talent and most importantly AI governance tools. Kio is the first signal that the state is done waiting for someone else to build the future. And now here's the part most people will miss. But you don't get that on front page. We never miss. Kio is not a standalone device. It's the opening shot of a much bigger Karnataka playbook. On the eve of the Bangalore Tech Summit, also known as BTS 2025, Deputy Chief Minister DK Shivakumar announced that Karnataka is building a brand new IT city in Biri with delegations from 60 countries lining up to invest billions into Bengaluru's next expansion zone. The upcoming Greater Bengaluru Integrated Township GBIT on the Bengaluru Mysuru Expressway is being pitched as the next global technology hub powered by the same talent, hardware and innovation ecosystem that Kio is designed to democratize. This is clearly Katica scaling both sides of the equation. AI ready devices at the bottom and a brand new IT mega city at the top. So if Karnataka deploys Kio at scale in schools, district centers, grand punchiats,memes, this could become the largest grassroots AI device rollout by any government in the world. The impact well here it is offline AI tutoring for low bandwidth regions. AI tools for rural entrepreneurs, open-source computing clubs in schools, local programming ecosystems built on RAIS CV, skilling pipelines feeding India's next tech workforce, AI governance and digital access built bottom up. This is how tech revolutions start. quietly, locally, with devices that don't look like much until they reach critical mass. And here is finally the front page take. Here's the scoreboard from BTS 2025. Karnataka launches India's first statebuilt AI ready computer powered by open-source silicon, not big tech. AI agent BUDH built for the state syllabus. Deep tech space tech startup policies announced together 10,000 innovators under one roof. Delegations from 60 plus countries, 1,000 exhibitors, 80 knowledge sessions, massive push for talent, hardware, and homegrown AI ecosystems. This is more than a tech summit. This is Karnataka asking a bigger question. What good is an AI revolution if the next billion Indians can't participate? And Kio is the clearest answer we've seen so far. So the real question isn't can Kio steal the limelight. It's actually this. Will Kio become the",
        "start": 248.48,
        "duration": 981.3599999999996
    },
    {
        "text": "a tech summit. This is Karnataka asking a bigger question. What good is an AI revolution if the next billion Indians can't participate? And Kio is the clearest answer we've seen so far. So the real question isn't can Kio steal the limelight. It's actually this. Will Kio become the democratic in India or the spark that pushes every other state to build its own AI computer? Please do let us know what you think below and please stay tuned for more exclusive from BTS 2025 only on Front Page and of course subscribe. [music]",
        "start": 498.72,
        "duration": 1025.8939999999996
    }
]