[
    {
        "text": " Good evening. This is Front Page by AIM Network. So, let's start with a very hard-hitting and an uncomfortable truth. In the last 18 months, Karnataka hasn't won the biggest AI and cloud bets in India. While Ben Waluru was quiet, the giants went elsewhere. Microsoft, we'll start there, poured 17.5 billion into Pune, Mumbai, Chennai, and Hyderabad. Now let's talk about Google chose for a massive $15 billion AI mega center AWS doubled down on Hyderabad. Hyderabad and Wise are aggressively positioning themselves as the new AI capitals. They are moving like very hungry startups offering fast land power commitments and loud policy signals. The current narrative seems obvious. Karnataka is missing the hypers scale wave. But here's the interesting part. That is only half the story and the other half completely changes the script. So while everyone else is chasing hypers scale headlines, Karnataka is very quietly pulling off the hardest trick in the book which is execution. And we aren't just talking about paper partnerships. In 2025 alone, the state locked in 10.27 27 lakh kes rupees which is and here of course is that mic drop statistic more than 60% of that is already realized real factories real jobs real capital no way and here comes the plot tw plot twist as I had mentioned earlier over 70% of that cash isn't even touching bingaluru in fact around 45% is heading straight for north karnataka which means Beyond Bengaluru just graduated from a very catchy slogan to a working supply chain. Hubli, Belgavi, Kalaburi, Tumkuru, Shivamogga and Mangaluru aren't just waiting in the wings anymore. They are active execution zones and that definitely calls for a big congratulations. We of course feel very strongly that if you want to judge a state, don't judge it by how loudly it announces. Judge it by what it ships. Yes. And we start with Foxcon near Dana Hali built in two years. Already 30,000 workers heading to 50,000 plus. Majority women are the majority workforce are women producing the latest iPhones which is iPhone 17, iPhone 17 Pro Max. And this line which you are about to hear definitely stands out which is over 80% of Foxcon's output is for global exports and Foxcon did not choose Karnataka by accident. No, it chose why because execution reliability, state support, export logistics and talent proximity. We've of course covered the story deeply on front page. Please go ahead and take a look at it. So now of course back to this. So instead of betting the house on one card, Karnataka is playing a completely different game. They aren't just chasing the hype. They are building the foundation, manufacturing, deep tech, defense, and a massive women-led workforce. And let's be honest, Andra and Telangana are winning the data center race right now. They have the cheap land and the massive power guarantees that hyperscalers need. But Karnataka is pivoting to durability. We aren't looking at a single sector boom.",
        "start": 0.08,
        "duration": 429.76
    },
    {
        "text": "deep tech, defense, and a massive women-led workforce. And let's be honest, Andra and Telangana are winning the data center race right now. They have the cheap land and the massive power guarantees that hyperscalers need. But Karnataka is pivoting to durability. We aren't looking at a single sector boom. industrial capital, diverse sectors, and distributed growth. And you know what? It's not just about announcements anymore. It's actually about execution discipline. This is where Karnataka absolutely should push harder. Industry voices like Moandaspay have called it out. Pitch to Loheed Martin. pitch to Rolls-Royce because we need to bring nextgen aviation and defense manufacturing right here. Loheed Martin is prepared to establish major manufacturing in India if selected for tactical airlift programs. Rolls-Royce wants India to become its third global home market after the United Kingdom and United States especially for jet engines and naval propulsion. And of course, where does defense expertise exist already? Yes, you are right. H I Isro supply chains Bengaluru aerospace ecosystem talent credibility. If India wants sovereign defense plus aviation capability, Karnataka is simply the most logical anchor. Of course, we at Front Page are thrilled to say this that one city deserves a standing ovation tonight. Let's do it together. And the name of the city, Mangaluru. Yes, once known only as a talent exporter. Today the coastal technology gateway of Karnataka. 25 plus engineering colleges, 40,000 graduates a year. Port plus airport. Lower costs, lower attrition, higher quality of life. The result you ask? Well, it's this. GCC's shifting here. Research and development happening here. Leadership roles moving here. Tech exits happening here. So when we know of course what what CO did to all of us and it was quite brutal but here is the postco reality innovation does not need metros Mangaluru stepped up and how and of course now the front page take so here's the verdict Karnataka isn't losing but it's not sweeping the board either yeah let's be realistic it missed the hypers scale buzz but nailed the fundamentals diversified capital decentral centralized growth and a very massive women led workforce. The to-do list now is clear. Fix the power infrastructure, sharpen the global pitch, and re-enter the AI race. The real question isn't can they attract money. They already proved that. The question is, can Karnataka chase the AI hypers scale dream without losing its new execution discipline? So if we pull that off, they stop actually competing with Indian states. And you know what? They actually start competing with nations. And that too head on. This is Front Page by A IM Network. We track execution. Yes, you know that not just headlines. Like, share, subscribe and of course always remember, think AI. Think AIM. [music]",
        "start": 215.36,
        "duration": 802.0180000000004
    }
]