[
    {
        "text": " India is finally building silicon that matches its scale. Chips that live in homes, factories, substations, electric vehicles and cities. Chips. [music] India just crossed another milestone in its semiconductor journey. A working Indiadesigned silicon chip built on 40 nanometer engineered for intelligent power workloads and designed to sit at the heart of smart meters, smart grids and edge AI energy systems. Meet A R K A G KT1 India's first generation intelligent power platform on chip launched recently in New Delhi by Azimut AI and scient quietly power the country's next leap realtime energy intelligence for 300 plus million households electric vehicle charging networks, industrial systems and smart city infrastructure. And for the first time, the silicon doing that work is proudly Indian. A 40 nanometer low power mix signal SOC built for edge AI plus smart energy. ARA GKT1 is competing with the massive need for intelligence at the edge in places where cloud AI is too slow, too costly or too unreliable. This chip combines multicore compute, advanced analog sensing which is critical for meters and grid intelligence, integrated memory, intelligent power management, ultra low power operation, realtime edge inference, exactly what India's smart meter mission requires. Because unlike the cloud, the grid cannot wait. Every microscond matters. Smart meters, smart grids, industrial automation, all need intelligent power silicon that didn't previously exist here at all. India is planning one of the world's biggest smart meter rollouts touching tens of millions of homes. Those systems require chips that can well do this. Read and sense power conditions. Run lightweight AI models locally. Manage energy in real time. Operate 24 by7 in harsh temperatures. Stay secure and low power work reliably without cloud connectivity. So until now these chips came from outside India. Ara GKT1 is the first credible Indian alternative designed right here co-developed right here built on an architecture well you guessed it India owns exactly the kind of semiconductor India must master to reduce foreign dependence and build domestic IP softwaredefined silicon plus science full stack ASIC pipeline Ara GKT1 One is built on Azimo's AI's softwaredefined silicon, a programmable, flexible architecture that can be updated over time for meters, batteries, robotics or industrial systems. And science semiconductors brings the rarest thing in India which is a design which leads to fab which leads to OSAT which leads to package delivery pipeline. This is the model the world's top chip makers run. now happening right here in India with global clients in mind. India's IT minister Ashwini Weshnav said this. This milestone reflects India's accelerating progress toward self-reliance, advanced manufacturing and leadership in next generation chip innovation. End quote. The translation to that India wants design ownership, IP creation and a semiconductor ecosystem that becomes indispensable to global supply chains. Ara GKT1 is a signal of that very ambition. The high growth markets ARA GKT1 is built for smart utilities plus metering, battery and energy management, industrial robotics, smart city infrastructure, grid automation systems,",
        "start": 0.16,
        "duration": 556.93
    },
    {
        "text": "wants design ownership, IP creation and a semiconductor ecosystem that becomes indispensable to global supply chains. Ara GKT1 is a signal of that very ambition. The high growth markets ARA GKT1 is built for smart utilities plus metering, battery and energy management, industrial robotics, smart city infrastructure, grid automation systems, trillion dollar industries in the making. So whichever country controls the silicon inside them controls the future of energy and industrial intelligence. In conclusion, the front page take as always. So here's what today's launch really means. India's first intelligent power chip for edge AI is real. Built on 40 nanometer optimized for smart meters and energy systems. Proof that Indian startups can build full stack silicon with globalgrade reliability. Science ASIC pipeline positions India as a serious semiconductor design hub. Smart meter rollout plus battery systems plus industrial automation equals to massive domestic demand. India is inching toward hardware self-reliance and not just software dominance and more importantly India is finally building silicon that matches its scale. Chips that live in homes, factories, substations, electric vehicles and cities. Chips that don't need the cloud to think. Chips that actually keep the grid stable. So if Ara GKT1 scales, India will be designing the chips that power the world's energy future. Please do let us know what you think in the comments below. [music]",
        "start": 288.4,
        "duration": 745.2890000000001
    }
]