[
    {
        "text": " Not so long ago, Ashwini Vashnav stood on stage, held up a wafer and said, \"We are designing two nanometer chips in India.\" Tonight we are witnessing what that looks like when a global chip giant weighs in. Let us welcome ladies and gentlemen put our hands together for Marvel technology. The US company that builds custom silicon for AI data centers clouds 5G and storage. It's actually turning India into one of its most important design bases. And now of course it's going right to the cutting edge which is the 2 nanometer. But first let's set the context. Everyone knows Nvidia. Yeah, I'm pretty sure they are the rock stars, the face of the operation, if you will. But Marvel, well, Marvel is the roadie that keeps the amps from blowing up. They build the chips that move, store, and process data. So, if Nvidia is the brain, Marvel is the circulatory system. And without their custom silicon, those massive AI clusters are well just expensive space heaters. So what is their new weapon? That is a platform built on TCMC's 2 nanometer chip node which is custom SRM TSMC 3D chiplets talking to each other and that too vertically. I won't be incorrect to say that this is the physics of the future. And guess where this immaculate design is being drawn. We are very excited to say in Bengaluru, Hyderabad, Pune. Marvel has 1,700 employees here. That is well re nearly one quarter of their global workforce. But if you thought that that was significant, here is the statistic that really matters. 40%. India now accounts for close to 40% of Marvel's compute and connectivity deployments. They have already invested over $300 million into this ecosystem. And they are really of course putting the pedal to the metal because they plan to grow the headcount by 15% every year for the next 3 years. This erases the old narrative altogether. The cost arbitrage story well dead. The back office story buried. And what they need are engineers who can think in nanometers. Guess what? This is where it gets very very very interesting for you. Yes, if you are 20s something and are holding an engineering degree, please listen very carefully. The minister said 295 universities have access to worldclass EDA tools. Synopsis, Cadence, Seammens. Marvel is looking at that pipeline and of course are poised to capitalize. They are partnering with Indian startups. They are engaging with universities not for charity but for IP. Students are seeing real tape. They are solving power integrity problems before they even graduate. Indian startups are using the design linked incentive the DLI to tap directly into Marvel's road map. What makes this exciting is that they are not mere spectators to this revolution but the orchestrators of it all. As always in such a significant story there is a plot twist which is the whatif issue. Let me clarify. Marvel is a fabulous",
        "start": 0.32,
        "duration": 486.95999999999975
    },
    {
        "text": "tap directly into Marvel's road map. What makes this exciting is that they are not mere spectators to this revolution but the orchestrators of it all. As always in such a significant story there is a plot twist which is the whatif issue. Let me clarify. Marvel is a fabulous But Marvel has confirmed that they are in confidential talks with Indian fans. But wait, wait, calm down. Still too early to get excited because there is a catch. Marvel has laid down the law. First point, which is no legacy technology. We need advanced nodes. Number two, speed, which is yields must match the global giants. Number three is the ecosystem packaging OSAT testing and here is that niggling troubling if and it is a massive if India can deliver that. Marvel is proposing a moonshot because the vision is very specific. A fully made in India data center rack which is designed in Bengaluru fabricated in dera or a sam packaged locally integrated and deployed for Indian hyperscalers. They believe this could be real in about well 3 to 5 years. So with the India AI mission rolling out 40,000 GPUs the demand is for sure there. The question is the supply chain. And after of course all of that let me bring you to the front page take let us start with what we know is on the table here it is asset a two nanometer platform for the AI era as far as the force is concerned that is 1,700 engineers on the ground the growth aspect 15% headcount increase per year the strategy confidential talks for local fabrication. The goal is a sovereign Indian server rack by 2030. So when Ashwini VNAV held up that wafer, he was selling a dream and Marvel went on to confirm it into reality by putting a down payment on it. India's semiconductor story has entered the execution phase. The only question left is how much of the value chain will we keep? Please do let us know what you think in the comments below. Is the three-year timeline realistic or is it just corporate PR? This is Front Page by A IM Network. Like, share, subscribe and always remember, think AI, think made in India, think AIM. [music]",
        "start": 243.2,
        "duration": 811.9179999999998
    }
]