[
    {
        "text": " And with the first news for the evening. Look, first Delhi rewrites a 60-year-old nuclear law. And days later, Gautam Madani raises his hand. And if you connect that with Adani's plan to pour up to 5 billion into Google's 1 gawatt AI data center in Weisag, you can exactly see where India's next power game is headed. That's energy plus AI plus nuclear. It's all on the same map. It's the same coastline and the same player. Good evening everybody. This is Front Page by Aim Network, India's video first newsroom for AI infrastructure and the new power games of this decade. Before we dive deep, make sure to like, share and subscribe to our channel. So just a few days ago on front page we broke down a once in a generation policy shift which was the atomic energy bill of 2025. This marked India finally opening up nuclear energy to private players and this was about ending a monopoly that started with the atomic energy act of 1962. You know we say then that nuclear is the backbone of the EI century and India just opened the gates for its own nuclear industrial revolution and tonight chapter 2 of that story has arrived. Look the Adani group has officially signaled interest in entering India's nuclear power sector not with hype but with a condition. Adani group's CFO Jeshinder Robbie Singh has said that this group is very interested in nuclear energy but will move only if the government creates a clear public private partnership model and of course if all of the liability norms are properly defined. In simple words, it's we're ready to play but show us the rules. He also hinted that Adani could take on projects similar to international collaborations where Indian infrastructure players partner with global reactor technology providers. This is clearly a trial balloon from one of India's most aggressive infra conglomerates right after New Delhi unlocked the sector. So on paper this sounds pretty straightforward. So the government makes a public private partnership model, private players build reactors and India gets more power. But in reality, two words decide everything which is the public private partnership structure and the liability that the public private partnership model decides which is who owns the reactor, who sells the power and at what tariff and who bears the construction risk. you know cost overruns, delays and the liability further extends to you know if there's an accident who pays and by how much and how much risk sits on the private balance sheet or whether global reactor suppliers are even willing to come in India's current you know civil nuclear liability framework which has historically scared off many foreign players because it extends recourse down the supply chain but for a group like Adani the ask is pretty clear they're asking for bankable PPAs which is power purchase agreements predictable tariffs and capped clear liability so projects are financable at scale so until those",
        "start": 4.799,
        "duration": 410.001
    },
    {
        "text": "historically scared off many foreign players because it extends recourse down the supply chain but for a group like Adani the ask is pretty clear they're asking for bankable PPAs which is power purchase agreements predictable tariffs and capped clear liability so projects are financable at scale so until those will start with an if now here's where it gets really interesting because Adani is becoming one of India's biggest EI infrastructure landlords because let's line it up 2023 Adani announced a 300 megawatt integrated data center and a tech park in Weisac and it's powered with up to 100% renewable energy and it's tied to submarine cables and APAC digital routes. Cut to two years in October 2025 Google partners with Adani to build a 15 billion 1 gawatt AI data center campus in Weissac, its largest outside the United States. And now Adani says it may invest up to $5 billion into Google's India AI data center project through Adani connects. So you have massive AI data centers on the Andra coast. Power demand running into gawatt and a government openly saying we want 100 gawatt of nuclear energy by 2047 up from 8.8 gawatt today. And the same group now are signaling saying that we're open to nuclear if the PPP that is the public private partnership model and the liability mathematics works. So listen this is not random because AI clusters need 24 bar 7 high density and low carbon power and solar and wind are interremittent. Gas is pretty costly and coal is quite dirty and nuclear plus renewables is the only combination that can feed your 1 gawatt plus AI data hubs and of course you have the hypers scale cloud regions where you have always on GPU farms and the industrial clusters around them and look Adani is already building the data centers and the government is rewriting the nuclear laws. So essentially tonight's signal is that we're willing to be the bridge between those two worlds. So here's a quick snapshot of where India is today. We have 23 reactors, 8.8 gawatt in nuclear capacity, all operated by the NPCIL and the target is up to 100 gawatt by 2047. So the atomic energy bill of 2025 aims to allow private participation in nuclear power generation, modernize liability provisions, enable SMRs, Gen 3 plus and Gen 4 reactors with advanced fuels and build a competitive nuclear manufacturing ecosystem. As Amitab Kant recently pointed out, opening up space, drones and geospatial unleashed hundreds of startups and private players. And now nuclear is poised to become the next wave of that sort of liberalization. So Adani's statement is the first large corporate saying publicly that if you open the door properly, we'll walk in. But what could a nuclear AI and an Adani model look like? Because if this moves ahead, here's the kind of architecture you could see over the next decade. So you have a state or a joint venture",
        "start": 209.92,
        "duration": 762.7999999999998
    },
    {
        "text": "saying publicly that if you open the door properly, we'll walk in. But what could a nuclear AI and an Adani model look like? Because if this moves ahead, here's the kind of architecture you could see over the next decade. So you have a state or a joint venture and then you have a global technology partner that provides the reactor design. Then Adani type infrastructure player builds, operates and maintains the plant. Then of course you're going to have long-term PPAs with the national grid AI data center campuses you know from Google and others. the large industrial offtakers, you know, on the coast of Andhra Pradesh, which could literally mean that upstream equals nuclear plus all of your renewable parks. And the mid-stream situation is going to be high voltage transmission into the EI zones and downstream you have 1 to2 GB AI campuses for Google, hyperscalers and Indian AI startups. So nuclear stops being just an energy story. It becomes the base layer of India's AI economy. And of course this isn't a clean fairy tale because this raises serious questions. You have concentration of power. So how comfortable should India be with the same conglomerate controlling ports, power transmissions, data centers and now possibly nuclear? And then of course you have the regulatory capture. Can a private public partnership model contract be designed to protect public interest and not just corporate IRS? And then of course will private public partnership nuclear projects be held for stricter disclosure, audit and safety standards than what we've seen in the other infrastructure sectors then of course you have the tech dependencies. So which countries reactor tech will these PBPs use Russia, France, US or homegrown SMRs? And that choice has long-term geopolitical consequences because those questions don't go away just because AI needs power. So where does this leave us? The government has made its move opening the nuclear door after 60 years and now Adani is the first major private player to step forward and say once again give us the PPP and liability framework wherein and at the same time Adani is tying itself deeply into Google's $15 billion AI hub and India's data center boom. So put together this looks less like a random bet and more like a deliberate play to own the backbone of India's AI century. the ports that bring in hardware and the data centers that run the model and the power potentially nuclear that keeps it all alive. So if the atomic energy bill 2025 gets the balance right, India could be finally building a worldclass nuclear industrial base, you know, power its AI semiconductor and data center ambitions with a clean base load and of course give domestic players a chance to scale globally. But what if it goes wrong? You know, we risk overconentration. weak liability and long-term public exposure to private markets. Look, for now, one thing is clear. The nuclear",
        "start": 389.6,
        "duration": 1101.4399999999998
    },
    {
        "text": "semiconductor and data center ambitions with a clean base load and of course give domestic players a chance to scale globally. But what if it goes wrong? You know, we risk overconentration. weak liability and long-term public exposure to private markets. Look, for now, one thing is clear. The nuclear was not a one-day headline. We're watching this the first corporate pieces slide into place and they're being placed by Adani on the same coastline where India's a future is being built. So, this isn't just about the reactors. It's about who powers India's next wave of intelligence. So please tell us in the comments. Should India welcome conglomerates like Adani into nuclear power again as long as PPP and the liability rules are all right or should nuclear remain a tighter more state controlled domain. This is Front Page by Aim Network. Like, share and subscribe and always remember to think AI and think AIM.",
        "start": 560.88,
        "duration": 1182.401
    }
]