[
    {
        "text": " [music] Good evening and welcome to Front Page by Aim Network India's video first tech newsroom where you get the big stories first and without any noise. Tonight we are going straight to the east coast because Visak just landed the biggest AI infrastructure investment of the year after Google. And before you ask yes we have covered this months ago on front page. So basically when no one else was talking about it, we were. Today it's official. As per ET's reporting and to maintain transparency, we also reached out to Meta. They have not officially announced it yet, but we will keep all of you updated once we hear from them. However, as per multiple reports, Meta Platforms, the company behind Facebook, Instagram, and WhatsApp, it has actually partnered with Cifi Technologies to build a massive 500 megawatt hypers scale AI data center in parades, my apologies, 25 km from Vishaka Patna. The investment 15,266 cr rupees the developer cifi technologies end user meta location Kolkata highway corridor the capacity 500 megawatt AI grade hypers scale so this will be one of the largest AI data centers ever built on India's east coast this is the Indian landing point of meta's most ambitious project ever the $10 billion Water worth subc cable, the world's longest 24 fiber pair AI backbone running over 50,000 kilometers. So why does this matter? It bypasses the volatile Red Sea corridor. It creates a new US, India, Brazil, South Africa AI route. It brings one Pbbps which is a pabyte per second of capacity and it transforms Visac into India's second AI coastline. Meta will land water directly at Cphi's Visac landing station. Exactly what we actually reported earlier on front page. One of the reasons why you should subscribe to Front Page and the A IM network. Anyway, coming back to Wisac, today's announcement confirms it. So for decades Mumbai was India's only subc hub but hyperscalers need redundancy plus resilience for AI workloads and Weisac brings a second coast lower latency for US AP pack roots security away from congested west coast corridors a policy push backed by the India AI mission the proximity to TCS's upcoming 21 acre IT campus this as we can all is a very long-term AI infrastructure bet. India's data center capacity is exploding 1.5 gawatt today 2.5 gawatt by 202728 IC 3.5 to 4.5 gawatt by 2030 which is 25 to30 billion investment Mumbai today is equals to about 53% of all current capacity Chennai and Hyderabad on the other hand rising Next, if this is true, Meta will be joining Google, Amazon, GeoT, TCS and Airtel on India's coastlines. 500 megawatt hypers scale cluster, lowest cost power on the east coast, shortest route to its brand new global subc cable, sovereign scale AI compute capacity, which all equals to an unbeatable base for model training, inference, and real scale workloads. A second digital coastline AI grade data center jobs. Private investment in",
        "start": 0.654,
        "duration": 486.81899999999996
    },
    {
        "text": "scale cluster, lowest cost power on the east coast, shortest route to its brand new global subc cable, sovereign scale AI compute capacity, which all equals to an unbeatable base for model training, inference, and real scale workloads. A second digital coastline AI grade data center jobs. Private investment in global position in subc AI networks. One more step toward sovereign compute. Most importantly, confidence that India is no longer just consuming data. We are actually shaping global AI infrastructure. In conclusion, the front page take. We said this earlier. Weag is the next big AI city and tonight makes that undeniable. If the deal goes through, Meta's 500 megawatt data center won't just be another investment. It'll actually be the backbone of a new AI coast. A cable that touches four continents and a bet that India is the center of the world's next digital decade. Please do let us know what you think in the comments below. And of course, for more groundup, optimistic independent tech journalism, the kind you won't find on mainstream television, please make sure to like, share, and subscribe to A IM Network. You know what you're doing. You're actually helping us bring these stories first. You're supporting independent reporting and you're backing India's rise in the global AI race. [music]",
        "start": 246.959,
        "duration": 640.7169999999996
    }
]