[
    {
        "text": " What was built as a futuristic 20,000 cr rupees work, live, play township is now facing sustained protests from a farmers who see it as well a threat to their livelihoods and the region's agricultural backbone. [music] Karnataka's grand plan to build India's first AI city from the farmlands of Biridi has hit a serious roadblock. What was built as a futuristic 20,000 cr rupees work live play township is now facing sustained protests from a farmers who see it as well a threat to their livelihoods and the region's agricultural backbone. The proposed greater Bengaluru integrated township which is the GBIT spans 9,600 acres and is envisioned as a zerocarbon, zero waste and zero traffic metropolis. Deputy Chief Minister DK Shivakumar has pitched it as Bengaluru's second central business district designed to attract AIdriven industries, high-tech manufacturing and more importantly green innovation. The blueprint allocates 2,000 acres for AI and technology industries and 1100 acres for ecological zones including the revival of Mangala lake and the Vusha Bhavati River. The state claims the project will create a sustainable tech hub that balances progress with environmental responsibility. Shiva Kumar's official note calls it a project built on inclusion, sustainability and dignity. End quote. For farmers in Baramangla and Ku Garali, this vision looks very different on the ground. Protests across 26 hamlets have continued for over 200 days since the preliminary land acquisition notification was issued in March. Farmers argue that 90% of the earmarked land is fertile agricultural land that sustains and here is what it actually does. Sericulture, coconut farming and dairy production. An economy worth roughly 1,00 K rupees annually that's a huge amount. Karnataka Pradesh Ray Rayata Samiti KPRS general secretary T. Yashwant accused the government of rushing the process and ignoring alternatives such as redeveloping barren land or vertical infrastructure. This is what he said. This is life support for farmers and there will be no going back if natural resources are damaged. End quote. The core of the dispute lies in how the land is being acquired. Legal experts note that the government invoked the Karnataka Urban Development Authorities CUDA act rather than the central right to fair compensation and transparency in land acquisition, rehabilitation and resettlement which is the RFC TLA RR act 2013. The state government maintains that the protests are not unusual. ID Minister Priyanker downplayed the backlash stating it's not the first time we're doing an industrial city. End quote. He pointed to Karnataka's history of developing 30 plus special economic zones, electronic city and the aerospace park all on former farmland. What is new in this? He said emphasizing that the government will consult farmers but that such conflicts are part of any large-scale project. Ker is in the government would balance growth with fairness for us. The farmers also are important. We are not saying we will not listen to them. End quote. The dispute, however, has very deep roots. A similar township plan was first proposed in",
        "start": 0.48,
        "duration": 477.942
    },
    {
        "text": "are part of any large-scale project. Ker is in the government would balance growth with fairness for us. The farmers also are important. We are not saying we will not listen to them. End quote. The dispute, however, has very deep roots. A similar township plan was first proposed in protests reflect a recurring tension in India's infrastructure push between the promise of high-tech growth and the realities of agrarian life. Karnataka's broader innovation strategy includes building a quantum city in Heraghata signaling its intent to anchor Bengaluru as India's well quantum capital. But for many in biridi the cost of progress feels too high. Karnataka has announced a 600 cr rupees deep tech fund ahead of the Bengaluru tech summit which actually kicks off on the 18th of November till the 20th of November India's first statebacked fund focused on deep tech and AI the plan is this 150 cr rupees for AI and frontier tech rupees for startups beyond Bengaluru 75 cr rupees via Kitwin equity support 48 cr rupees for new incubators at IIT Dharv and I IIIT Dharv and another 110 crores for innovation hubs across 11 universities. So additionally doesn't stop there. Additionally, 200 K rupees is earmarked for deep tech startups with a joint 1,000 cr rupee fund being explored with venture capital partners. So, Karnataka's 20,000 cr rupees bid the AI city stands at a very tricky intersection where innovation meets resistance for the government. It's part of a larger tech vision alongside well a 600 K rupees deep tech fund and a quantum city in the works for the farmers. It's a fight to protect fertile land worth 1100 K rupees in annual agri output. But you know what? This isn't Karnataka's first standoff between progress and protest. From electronic city to aerospace park, the state has actually faced resistance before and bounce back. The real test now is whether it can actually do so again. This time with inclusion and innovation moving in step. [music]",
        "start": 243.04,
        "duration": 752.0200000000004
    }
]