[
    {
        "text": " Welcome to front page. In 1947, a newly independent India stood before the world. We of course were a nation with a broken economy. But what was wonderful was the fact that we had an unbreakable will and we wanted to construct our own future. We called it a trrist with destiny. Fast forward to today, February 2026. We are standing at the edge of a second independence movement. But this time around, the territory isn't land, it's intelligence. For 30 years, we've been the world's back office. We were the people the West called at 3:00 a.m. to fix their tech issues while they sat in the captain's chair. But this week, at the India AI impact summit in New Delhi, the power dynamic is changing hands. This is the first time the global south has grabbed the steering wheel of the most important invention since the steam engine. We are of course moving from a nation that supports technology to a nation that builds it. We put 10,000 cr rupees on the table to build a national brain that doesn't answer to Silicon Valley. We aren't just trying to keep up. We declaring that the future of AI isn't going to be decided in a Paulo Alto garage. It is going to be built in the heart of India. We believe this is India's digital sovereignity finally realized. And helping me well talk about this and a lot more as always is the brilliant Mohit Pande who is our very own tech journalist who covers the IT sector. He covers India AI startups and of course he also covers AI Bhat. Welcome to the show. How are you doing Mo? is always a wonderful pleasure to I'm doing great Sud thank you so much for having me today and pleasure looking forward to this discussion proud moment no how are you feeling I mean this is the first time that India is on the global stage with such a huge summit well I mean we at AIM have been talking about it for the last 3 4 years at least that India should build sovereign AI models ever since GP launched and now finally that it's happening it feels like a very proud moment and finally things are taking shape let's let's actually start Moit I mean I think The first thing that is a is a moment of focus for for us as as an ecosystem is the fact that we are going to be showcasing two models. Yeah. From our 12 founders who are the startups and and people who are building up these models Bajen Same of course the others. The prime minister had met with them. This was about 3 weeks back, four weeks back. We had done a story on it as well. it was more on the lines of like a catchup or a progress report on where do we stand? How important do you feel is this moment for us?",
        "start": 0.32,
        "duration": 329.75899999999996
    },
    {
        "text": "met with them. This was about 3 weeks back, four weeks back. We had done a story on it as well. it was more on the lines of like a catchup or a progress report on where do we stand? How important do you feel is this moment for us? founders after they met Prime Minister Modi and every there was one statement that stood out out of everyone was the questions that our prime minister was asking them that stood out for them like how how does this guy know so much about Indian AI and apart from Servam and Bharat Jan there are six more models that are going to come out that is what India has said. Would you like to shed some light on that? Yeah. So basically Servam and Bharajan are building the base models like the foundational models. So other companies like Socket, GAN, Gani AI and Fractal as well and Tech Mahindra. So they are building models that are focused on specific sectors. They also built from scratch. Bahen and correct me if I'm wrong, Servam are the language models. These are also the language models. The language models. It's like for example, Servam and Bharajan are building the GPTs. Sure. and Tech Mahindra and everyone is focusing on specific sectors like healthare, education and socket is focusing on defense, techra is focusing on healthcare. So these are going to be models that are trained on that specific sector specific data set. So they can be specialized for that. If you like for example you cannot ask medical questions to GPT it can give some stupid answers. So they want to focus on those sectors although of course that's another conversation but GPD is going towards healthcare [clears throat] but that brings me to this then Mohit that this this 100,000 GPUs number then becomes all the more relevant no because that's what the the government is pushing for. Yeah. So they had 34,000 GPUs as of now. That is I think a mix of H100s and Intel GPUs and AMD GPUs and I think Minister Ashwini Vashnav is saying that they're going to get around 100 100k GPUs by the end of this year. So I mean that is going to be a huge number but and I think most of those I would when you say a huge number as always it would be nice for our viewers to understand the context in terms of the comparison because we always talk about it from the point of view of China and US it being a two- horse race. We of course are trying to make sure that we are part of that race and probably hopefully galloping ahead at some point. I think when you compare it to OpenAI or maybe XAI they have a lot more GPUs but since we are starting out we are focusing on specific sectors and plus the one thing that I think is most",
        "start": 166.64,
        "duration": 610.241
    },
    {
        "text": "of that race and probably hopefully galloping ahead at some point. I think when you compare it to OpenAI or maybe XAI they have a lot more GPUs but since we are starting out we are focusing on specific sectors and plus the one thing that I think is most going to focus on the inference part of AI now because the training I think has already been done these models are already ready according to me and they're just going to announce it at the impact summit I think servers all these releases is an evidence for that right so I think when it come but inference also requires a lot of GPUs because now these models are built. Now it's going to come to our smartphones, our laptops. True. So these have to keep running all the time. Fair. So I need I think we will obviously need more GPUs, but 100,000 is a good start. I think as long as they are good GPUs like Black For I I believe there was also discussions about maybe the B300's also coming into the the frey as far as that is concerned. Before I move on to the revenue aspect, Mu, I wanted to ask you there are going to be luminaries at the India summit. , what sort of a what sort of an impression do you feel that these demonstrations or the launch of these indigenous models which have been made with a lot of hard work, what kind of an impression do you feel that do you expect it'll create? I think it's going to be a very great summit with I think the most excited me personally is Sam Alman is coming again to India and and and this I think this is the first time Anthropic CEO is coming. I'm not sure. So that is something that is very interesting to me because we are competing with all these giants all this while and finally they'll come to India and they'll see how our models are performing. Mhm. Maybe they might be happier this time not like the last time when Sam Alman came but yeah I hope and it creates a great impression right because as our ministers are saying like this is like the biggest summit of the global south true so I think it's a great testament to what India can build and now that we are focusing on use cases I think yeah it's like a very different it's not even a competition with open eye or anthropic anymore but why should we even think of it that way to be honest that's what that's what exactly we have been talking about right I think we discussed this as well last time that the economic service said that it's very expensive to build foundational models and now that we have built foundational models now we are focusing on use case and I keep going back to me and Amit",
        "start": 308.32,
        "duration": 867.9990000000001
    },
    {
        "text": "been talking about right I think we discussed this as well last time that the economic service said that it's very expensive to build foundational models and now that we have built foundational models now we are focusing on use case and I keep going back to me and Amit back one and a half year back that Nand Nilkini he used to keep talking about that we shouldn't get into this race of building foundation models we should focus on use case and I think now people are finally realizing that he was actually Right. But yeah and I think people are understanding that and even Yan Leon used to talk about it when he came to Bangalore for one of the Meta AI summit that India should focus on the use cases which makes sense also Mo to be honest I mean why why compete at something where you already know that it's a losing battle that's far and far ahead leaps and bounds. So how about creating your own trajectory and yes we have another battle that we can actually live on actually win on for example serv for the last week they've been releasing so many models that are outperforming GPT and Gemini on indic tasks so we have a battle that we can win on and they can never win on that because we have our own benchmarks we have our own data sets I don't think GPT gemini and all these models have ever seen an Ora language model or maybe Ora text true so if we can outperform on that I think we We have a whole race not even the race we have a whole the the there was another model which I believe has been released today the the server model server area so it's not a model it's an architecture so basically all everyone is building a lot of AI agents right cloud code people have just gone crazy building agents so what server has decided they're going to make an orchestration layer an orchestration platform now enterprises can use these clawed agents to assign agents specific tasks okay so that is something that no one is actually talking about that you're building all these agents how will you enter them into enterprises true so serum has cracked that part as well so I think Indian engineers are now showing a lot of initiative I promise yeah and of course I'm also looking forward to bullbul the launch of bulb yeah bulb was actually launched and it's a great model as well it's in 22 indic languages and I I haven't tried it myself but I was looking at x and a lot of people have already started building apps on it as well nice so that is I believe it's free right through February 2026. Yes, it's free for this month. So yeah, it would be great if more people build apps and figure out how to use this",
        "start": 439.599,
        "duration": 1129.521
    },
    {
        "text": "and a lot of people have already started building apps on it as well nice so that is I believe it's free right through February 2026. Yes, it's free for this month. So yeah, it would be great if more people build apps and figure out how to use this Okay, let's let's get to this Mohit in terms of the revenue shift. What do you feel about that? So 200 plus industry models here is the fact it giants are moving this is of course your wheelhouse. IT giants are of course now moving from from cool demonstrations to the real money. launching 200 plus models for banking, farming and hospitals as you just mentioned. You glossed over that. What do you feel will the west use? While the west uses AI to write bad poetry, not that you use it, your poetry is wonderful. India is using it to run massive industries. So I don't think I've ever shown you any of my poetry, but at the same time, so is this [clears throat] the end of the research theater is my final point. [sighs] So we've been talking about Indian IT for the last two three episodes right that they're building a lot of AI agents they are partnering with a lot of firms but after the prime minister Modi met all these 12 startups he also met CEOs of these IT firms like HCLT VIPro and TCS so the discussion over there was one thing was about building these 200 plus models that are going to focus on farming banking hospitals like the enterprise part they are not focusing so much on the bhat part of things that servan trying to do. They're trying to build models for enterprises. So that is going to be something very interesting and the revenue shift is definitely going to happen because as we saw with this anthropic correct shaking up the whole market now Indian it is going to say that we are going to build our own agents and we are ready to we there's no SAS apocalypse that are going to happen anymore. So we are self-reliable. So the whole India summit is just focusing on that self-reliable just to be honest very encouraging moment but because of the positive of time I know you and I have a lot more to of course speak about but I' I'd like you to very quickly tell the viewers about tier 2 and tier three cities which I feel has forever excited me that and the fact that the $90 billion magnet which is the 2047 bet which I believe I spoken to Prahu also about which is going to be the magical ical year. So these two points I want you to very quickly touch upon. And then finally the job losses in terms of what's going on. I think that is the favorite thing you and which is right at the end.",
        "start": 572.56,
        "duration": 1397.2810000000002
    },
    {
        "text": "also about which is going to be the magical ical year. So these two points I want you to very quickly touch upon. And then finally the job losses in terms of what's going on. I think that is the favorite thing you and which is right at the end. the last layoff and job losses. It's sad but it's okay. So I'll talk about the second question first. The $90 billion magnet. So basically during the budget we covered this right? Yes. That the government has given a tax holiday till 2047. M so a lot of these firms from like Google and Microsoft they're going to come and build data centers they're not going to pay any tax so that is eventually going to increase the revenue but then comes the sovereignity part the part point point is there are still Google and Microsoft that are coming up and building data centers so this is also going to give benefits to go adxel and all these companies that are building data centers so that I think someone posted on x I don't remember the name today that we have we kind of have to stop giving so much of our data into these models because we are actually just giving away our intelligence to that's been going on for so long that conversation has been going on for so long. So I think this this data center bit is something that is very important and coming to the tier 2 and tier three cities part that is something so there I think when the government selected those eight additional startups are the after the fourth ones they also announced some 200 AI labs in tier 2 and tier three cities. So basically these labs are about upskilling the people that are working so that they can maybe work for the data centers, maybe build up new startups, new initiatives. So that is something that is also very amazing. I I'll have to check with more cities that are building these. I don't remember the exact names but there are a lot of cities in Madhya Pradesh and all these states. So and as you know that these cities have mostly not spoken so much about AI. Mhm. So I think the whole pan India movement kind of a thing that is a good thing. There's a big shot in the arm. I feel I think that'll be a big one. But very quickly two things which which have stood out for me. The fact that yes our states different states have AI policies as far as the states are concerned but what about the national AI policy? That is one. Very quickly what are your thoughts on that? the fact that we are calling the world to us and what is their feeling going to be that if we don't have an AI policy that's one second very quickly I want you to tell me about the job",
        "start": 707.76,
        "duration": 1653.9210000000012
    },
    {
        "text": "is one. Very quickly what are your thoughts on that? the fact that we are calling the world to us and what is their feeling going to be that if we don't have an AI policy that's one second very quickly I want you to tell me about the job figures I'll as always share with you I know these figures give you nightmares and you wake up at night sweating 6 million people in IT are at risk of losing repetitive tasks we've discussed this till the cows come home and they still haven't so when it comes to the policy part I'll give you a little bit of a personal perspective I I think we are a little too early in the game of AI development at least India to build very large policies or regul policies make sense regulations I don't think so the creativity yeah I think so but at the same time it is also said that regulations actually boost people's creativity because they're able to but I think it's a little bit from a very interesting point of view thank you but I think policy I think they might be framing a lot of policies and I think that must be in the loop I think they might announce some of them at the impact summit. I hope they are good. I hope they are more giving more freedom to startups. They want to create most researchers can create more things. I need sorry again Mohit positive of time but your take is it's going to be a big impactful summit. Yeah. So sorry of cutting you through but we of course going to restart our discussion and continue with it when we are going to be back with front page. But here it is ladies and gentlemen that is Mohit Pande as always bringing his wonderful insights to this discussion. We are truly looking forward to this India AI impact summit. there are loads of things which are going to be up front and center on the stage. It's a proud moment for India. We have the international rock stars coming to this particular summit. There's so much to look forward to and of course we're going to be covering it and we're going to keep telling you how things will progress. Till then like, share, subscribe and always remember think AI, think aim. [music]",
        "start": 837.279,
        "duration": 1865.9310000000023
    }
]