[
    {
        "text": " [music] Because OpenAI has hit the big red button. Sam Alman has declared an internal code red for chat GPT. He's paused ads, slowed down agents like Pulse and Shopping, and is rerouting people and GPUs into one thing, which is shipping a new reasoning model next week that OpenAI says is ahead of Google's Gemini 3. Is this the long rumored International Math Olympiad gold medal model finally breaking its cover? Or is it just a benchmarking theater to calm investors and win back users from Google and Deepseek? Because right now, Gemini users are already spending more time per visit than Chad GPT. Because just look at this Financial Times chart on your screen. and Open AI's own executives say that Chad GPT downloads are down double digits since August. And at the same time, investors are dumping tech while assets in leverage ETFs hit record highs. You know, it's pure thrill cashing in a nervous sort of market. Last year it was Sunda Pichai hitting code red inside Google after chat GPT blindsided them. This year it's Sam Alman slamming the same button at OpenAI. So why is OpenAI betting the house on one new reasoning model? But let's understand what does code red actually change for you the user or you the builder or you the investor if you're watching. Let's break it down. But before that make sure to like, share and subscribe to AM Network. You surely do not want to miss out on this one. So according to the information Sam Waltman sent an internal memo and a slack message telling employees that chat GPT is at a critical time. So inside openAI code red means this which is to rep prioritize chat GPT above everything. Delay monetization experiments especially ads which has quietly taken the internet by storm. And remember we had covered this previously on front page as well even before the world was talking about it. I guess this is how we going to wait it for now. Besides, the company wants to slow roll AI agents for shopping and health and first and foremost ship a new reasoning model next week that beats Gemini 3 in Open AI's own tests. So on the chopping block for now is display and shopping ads inside Chat GPD. As you very well can see in the image, consumerf facing AI agents that were meant to book travel, handle purchases and manage health workflows and of course pulse the personalized news/market intelligence product. All of that goes to the back burner so the company can fix core issues that users keep complaining about which is one the model behavior you know fewer weird refusals fewer hallucinations and less therapy speak and speed and reliability which is fewer timeouts more consistent quality between multiple sessions and of course some elements of personalization which is chat GPT that actually remembers your preferences and feels like your assistant And then of course you have",
        "start": 0.654,
        "duration": 390.58000000000004
    },
    {
        "text": "fewer weird refusals fewer hallucinations and less therapy speak and speed and reliability which is fewer timeouts more consistent quality between multiple sessions and of course some elements of personalization which is chat GPT that actually remembers your preferences and feels like your assistant And then of course you have Google's Nano Banana Pro and others in the image generation arms race because Sora 2 is not soaring anymore because internally Nick Turley who handles Chad GPT is reminding the teams of the stakes involved because Chad GPT still handles around 70% of global assistant activity and around 10% of search like queries on the internet. And remember, if that share drops, while Gemini 3 and Deep Seek Wi 3.2 Special sprint ahead on reasoning benchmarks, OpenAI's $500 billion story quickly starts to look fragile. And let's talk pressure, of course, because Google's Gemini 3 launched last month with super strong reviews, especially on reasoning and image generation. And Google says Gemini's monthly active users have jumped from 450 million in July to 650 million in October, which is still below chat GPT's 800 million by the way. But you know, the growth curve is quite steep. And the Financial Times chart that we showed a few minutes ago says that Gemini users now spend more minutes per visit than ChatgPid users. Folks, that's a trust and an engagement problem, not a benchmark scores problem. Because remember three years ago it was Google that declared a code read when Chad GPT threatened search. Now the roles are quite reversed because China's deepseek on the research side especially the deepseek v3.2 to special has just matched Gemini 3 Pro on several reasoning tasks and another model achieved gold medal performance on the international mathematical olympiad benchmark something only internal open AAI and Google deep mind models had done before and it's also being discussed all over new rip's event and conference this week as the open-source friendly challenger so look in one corner you have Google closing the product and the UX gap in the other you have deepse proving that you You don't need US level compute to hit frontier reasoning and OpenAI cannot coast on the we launch chat GPT first story anymore. By the way, congrats on completing 3 years Chad GPT. So what is OpenAI actually going to ship next week? Look, we don't have a name yet. Reddit is joking. It's going to be called GPT 5.103 minimax thinking light, but we know a few things already. Altman says that it scores ahead of Gemini 3 in open internal evaluations and it's a reasoning model like the O3 and the International Math Olympiad internal models you know meaning it may come with longer chain of thought better at math logic code and tool use. It's going to be slower but more deliberate. You know, think deep research and thinking mode inside of chat GPT and it's expected to power an upgraded",
        "start": 199.44,
        "duration": 726.3399999999999
    },
    {
        "text": "Math Olympiad internal models you know meaning it may come with longer chain of thought better at math logic code and tool use. It's going to be slower but more deliberate. You know, think deep research and thinking mode inside of chat GPT and it's expected to power an upgraded questions and a more powerful deep research experience, possibly better agentic behavior where the model plans tool calls and it trades. But there's a big question that people are asking. Is this a true new generation or just heavier finetuning on the same old backbone? because semi analysis claims that OpenAI has not completed a full new pre-training run since GPT40 and that was over a year ago and in their view GPT5 is mostly post-raining and routing tricks on the same underlying base model and you know if that is true the new reasoner might be a super specialized compute heavy head on top of an older backbone and it's going to be optimized first to win benchmarks and LM Marina leaderboards of course and only secondarily tuned for real world UX. And that's exactly why some power users in the community are quite skeptical because you see comments like great, it'll think 30 seconds longer before gaslighting you or they nerf 5.1 thinking they're going to nerf this too. Or please don't hype another model unless you're actually going to keep it stable. But on the other hand, Mark Chen from OpenAI is out there saying that scaling is not dead contrary to former OpenAI boss. Again, we have covered this extensively here on front page. So, make sure to check it out if you haven't already, of course. But moving on, he said OpenAI has algorithmic breakthroughs in pre-training and data efficiency. Within one year, they want AI interns doing implementation and debugging and within 2.5 years, they want AI doing end-to-end research. Look, if you connect all those dots, this new model could be like the first visible step in that road map. A reasoner tuned not for your homework answers, but for running experiments, writing code, and iterating on ideas. So, next week's release is more than just beating Gemini on a single chart. It's open AI testing whether it can start turning Chad GPT into the default AI researcher and an analyst for millions of people. And of course, let's talk about business and trust because code red is not happening in a vacuum. So the past few months, users have been angry about four things. One is routing and censorship because sensitive conversations are getting silently routed to safer models and sometimes number ones. Users feel manipulated and say OpenAI is offloading legal risk onto them. Number two is model quality drift. So has GPT 5.1 or 4.5 been nerfed? Why do they feel weaker than the week they were launched? And the semi analysis thesis that OpenAI has hit a pre-training wall after GPT40 gives those complaints a technical",
        "start": 369.52,
        "duration": 1062.7409999999995
    },
    {
        "text": "is offloading legal risk onto them. Number two is model quality drift. So has GPT 5.1 or 4.5 been nerfed? Why do they feel weaker than the week they were launched? And the semi analysis thesis that OpenAI has hit a pre-training wall after GPT40 gives those complaints a technical Chad GPT. People have started seeing test ads like a pelin banner popping up mid conversation and for many pro subscribers that's an instant deal breaker. They're literally posting on X at Sam Waltman. do not do it. And lastly, it's the feature scroll. Sora video, Atlas browser, shopping tools, teacher mode. But the core chat sometimes feels slower, dumber, and less reliable. And the harsh take from semi analysis is that real innovation has stopped. Open is now a commercial harvesting machine living off previous user growth. So code red is in a way the response to that narrative by publicly delaying ads and agents and doubling down on core chat. It's openi saying that look we hear the trust issues. We know gemini and deepseek are catching up and if we don't fix the base chat GPT no amount of pulse atlas or sora models will save us. Look, whether users believe that depends on whether this new reasoning model feels like in their hands and how OpenAI avoids quietly nerfing it two months later. At the same time, folks, don't be fooled. This is not OpenAI is suddenly becoming anti-commercial. Because this week two big MOS quietly tell you where the money engine is shifting because the Thrive Holdings deal in which OpenAI is taking an ownership you know in Thrive Holdings which is one of Thrive Capital's holdings division that acquires IT and accounting firms and also Thrive Capital is one of OpenI's biggest investors. So, OpenAI didn't put cash in, but in exchange for the stake, it will provide models, engineering support, and get access to data from Thrive Holdings portfolio companies in IT services and accounting. But what does OpenAI get? It's a it's going to get a rich stream of structured enterprise data to train on a guaranteed pipeline of corporate deployments where chat GPT style agents become embedded in core workflows. Again, this is a circular deal. investor funds OpenAI. OpenAI boosts investor portfolio and everyone shares the upside. The Accenture partnership is another one because Axenture is putting tens and thousands of its consultants and operators on Chad GPT enterprise which is the largest certification and upskilling push that OpenAI has ever had. So together they're launching a flagship AI client program to build agentic workflows across customer service, finance, supply chain and HR. use the agent kit framework to design custom agents for large enterprises and hardwire open AI into big ticket transformation projects. So look, even as ads get inside Charpd and they get delayed, enterprise monetization is accelerating because OpenI's internal projections reportedly aim for revenue to climb from 10 billion",
        "start": 538.72,
        "duration": 1400.9009999999992
    },
    {
        "text": "use the agent kit framework to design custom agents for large enterprises and hardwire open AI into big ticket transformation projects. So look, even as ads get inside Charpd and they get delayed, enterprise monetization is accelerating because OpenI's internal projections reportedly aim for revenue to climb from 10 billion 2027. And while the company also looks to raise around hundred billion more for compute and data center buildout again code red is basically signaling that this at the moment is protect the consumer brand while we lock in enterprise and private equity deals. So what does all of this mean if you're watching from India or you know anywhere from the world building with AI? Number one, if you're a normal chat GPT user, expect random, you know, fewer refusals, better long form answers even when you enable thinking or deep research and hopefully hopefully no permanent ads yet. But also expect more personalization because GPT remembers your style, your projects, your company, which raises fresh questions about privacy and data control which is always going to be there. And if you're a developer, you may soon get API access to a stronger and a slower reasoning model that competes directly with Gemini 3 deep think 3.2 special. So you have good news, better agents, better tools, better evals. Bad news is that pricing and rate limits might be steep and history tells us that behavior can change post launch. But if you're a large enterprise or a global capability center, the accenture partnership is a preview of what's coming because you have packaged agentic workflows for finance, HR, and supply chain. And you get certified chat GPT enterprise rollouts at scale. And via deals like Thrive Holdings, OpenAI is trying to act as a research arm of a private equity and IT services companies. So look, the real race now is who can turn reasoning models into reliable auditable systems that CFOs will sign off on. So is this the new reasoning model going to be open's big comeback or just another entry in what people are now calling the any day now economy? On one side you have author Pedro Domingo's joking, I thought OpenAI already had AGI, I want my $1 trillion back. and power users are saying don't get our hopes up again please if you do not keep it stable semi analysis accusing the company of hitting a pre-training wall and hiding behind routing ads and PR and on the other side you have open mark chin promising algorithmic breakthroughs AI interns in one year and full AI researchers in 2.5 years and Sam Alman calling code red putting ads agents and pulse on ICE to fix the base chat GPT and a brand new reasoning model that he's going to unveil if it really beats Google Gemini 3 in the wild, it could reset this entire conversation overnight. But here's the real question I want to leave",
        "start": 710.32,
        "duration": 1704.9809999999998
    },
    {
        "text": "putting ads agents and pulse on ICE to fix the base chat GPT and a brand new reasoning model that he's going to unveil if it really beats Google Gemini 3 in the wild, it could reset this entire conversation overnight. But here's the real question I want to leave feel like a thinking partner that gets better every day you use it? Or will it be another benchmark trophy that slowly gets nerfed in the name of efficiency and risk management? Well, we'll know soon enough. Next week, of course, when this model drops, we'll benchmark it live side by side against Gemini 3 and Deep Seek and see if the Code Red Panic was worth it after all. Until then, please watch the charts, user time per visit, and will Chad GPT's curve bend back up against Gemini or investor flows into AI and leveraged ETFs, you know, are we in a rational buildout or pure thrill chasing? And please tell us in the comments which model are you betting big on for serious work in 2026. Is it Chad GPT, Gemini, Deepseek or any other open-source model? Folks, this is Front Page by Aim Network. Live, share and subscribe. And always remember to think AI, think AIM. [music]",
        "start": 865.76,
        "duration": 1823.0910000000001
    }
]