[
    {
        "text": " [music] Naveen Raalo is one of the few people in AI hardware with a track record of seeing the future early and shipping it. He founded Nirvana systems, one of the first companies to design AI specific accelerators before deep learning blew up. Intel acquired Nirvana and Ralph became the GM of Intel's AI products group shipping shaping sorry the company's early AI hardware and software strategy. He's an engineer, a chip architect, a neuroscientist by training and someone who's been well obsessed with how intelligence emerges from physical systems. So guess what? After years away from the spotlight, he's back, ladies and gentlemen, with a new company, Unconventional AI. And we finally know what he's building. So, if you're curious to know, let us find out. Unconventional AI isn't trying to make a faster GPU. It's actually isn't even calling itself a chip company. Instead, it's a full stack attempt to rethink how learning and intelligence should work in hardware, not as software running on a GPU, but as dynamics encoded directly in circuits. Their first prototype, expected to be one of the largest analog AI chips ever built, uses a mixed signal architecture, which means analog circuits that behave like neural dynamics in the physical world. digital control logic for precision, stability, and interfaces. And of course, a mapping that lets models like transformers, diffusion models, flow models, and energy based models run as physical dynamical systems, not as layers of matrix multiplies. So clearly the vision is not to simulate intelligence, but to embody it. Ralph believes digital computers built for perfect numerical computation are the wrong tool for modern AI. AI today is stochastic, fuzzy, temporal, context heavy and brains don't run deterministic code. They run physics and they run it on 20 W. So meanwhile, global AI compute is heading toward well an energy crisis. As we all know, data centers already consume up to about 4% of the United States grid, and AI demand could require hundreds of gaw more just this decade. Analog circuits naturally express the differential equations underlying many modern AI models. They compute by evolving a physical state over time rather than crunching numbers. So if GPUs simulate intelligence, RAW wants silicon that behaves like intelligence. The first chip will be manufactured by a major fab likely TSMC with the intention of eventually scaling to millions of units. The confirmed elements, massive analog compute arrays, low heat and ultra low energy usage makes signal architecture a theoretical mapping from AI model parameters to analog physical parameters. And RAW makes a very provocative claim. Transformers may be overparameterized because GPUs force them into matrix multiply form. A physical dynamical system may require fewer parameters to achieve the same behavior. Ralph doesn't say he's building AGI. No. But he does argue this substrate is a better foundation for intelligence that understands causality, time, and physical dynamics. GPUs don't have time built into them. Physics does. He sees",
        "start": 0.654,
        "duration": 513.3000000000001
    },
    {
        "text": "A physical dynamical system may require fewer parameters to achieve the same behavior. Ralph doesn't say he's building AGI. No. But he does argue this substrate is a better foundation for intelligence that understands causality, time, and physical dynamics. GPUs don't have time built into them. Physics does. He sees hardware where understanding isn't a software trick. It's actually a property of the systems dynamics. Rouse unconventional operates like a research lab with industrial ambition. They're hiring across the stack. dynamical systems theorists, energybased model experts, analog plus digital chip architects, algorithm hardware mapping researchers. Ralph says the goal is to find a paradigm analogous to intelligence within 5 years. Yeah, you heard that right. and to have a manufacturable design ready, one that could be produced at the scale of tens of millions of chips. And despite being well a potential competitor, companies like Nvidia, Google, Microsoft are seen as possible collaborators. Nvidia built the current dominant platform. Unconventional wants to build what comes after it. And to p pursue this moonshot, unconventional AI has secured a massive $475 million seed round at a whopping $4.5 billion valuation coled by A16Z. So with this unconventional AI aims to build a new substrate for AI that computes via physical dynamics, develop model architectures optimized for analog behavior, radically reduce AI's global power footprint, turn theoretical breakthroughs into manufacturable silicon, create hardware that supports future AGI research by default. So this is not clearly an iteration of GPUs. It is, as we can all see, a whole new path. So finally, after months of speculation, here's the big picture. He's trying to build a new physical substrate for intelligence, inspired by how brains work and driven by the energy limits of the GPU era. So if this works, AI won't just get more efficient. The entire computation model could shift from digital simulation to physical dynamics as the engine of intelligence. It's bold. It's risky and deeply unconventional. But you know what? Ralph is one of the few people in the world with the technical background and the conviction to attempt it. And today for the first time we finally understand the direction. This is front page by A IM network. And I'm pretty sure you've understood our direction which is like, share, subscribe. Yes. Well done. And always remember, think AI, think AIM. [music]",
        "start": 260.4,
        "duration": 874.2510000000001
    }
]