[
    {
        "text": " started my career by enabling people to talk to each other irrespective of where we are and this person was let go from his job [music] because of his accent. We at SAUS have an opportunity to make life better for all 8 billion people on earth. My god, that is a huge problem to solve. The customer support agents when they use saas, they have tears in their eyes. They are feeling so joyful. because everything is pretense. Sonas as AI technology ensures that you remain yourself very authentic. However, in my humble opinion, not even sky is the limit for us. Now if I have saunas on these devices or the ear plugs I can be we have grown in just two years from [music] zero revenue to $50 million of AR right now. Beautiful wonderful teaching but tough to implement though right outside Silicon Valley in America if there is one place where talent density is highest [music] is Bangalore. There used to be this sci-fi series called Star Trek. Captain Kirk. Yeah, Captain Kirk had this [music] device called universal translator. This divine intervention which created SAS in my humble opinion. So from the engineering science point of view, I'd like for you to maybe please tell us about that. [music] Perhaps proving that you can travel time as a dimension like you travel space as a dimension. Hello and welcome ladies and gentlemen to simulated reality. Well, today we're going to be discussing something which is well deeply human. Our voice. It's actually how we are heard, understood, and well sometimes judged. What if technology could actually change that? Not by altering who we are, but by helping us to understand each other better. Today we are joined by the managing director of SAS.AI Mr. Nitesh Vn who well has achieved that yes by redefining global communication through real time speech AI. He's a man who's truly a force of energy. He's gone through very deeply personal transformative experiences. So we're going to be talking to him about that and a lot more as we go along this journey. And of course he said this in his own words which I believe defines the ethos at SAS which is clarity isn't conformity it's actually connection. Welcome to the show Nesh. True pleasure to have you with us. Thank you Sud. It's a pleasure to be here with you today. So Nit it's been well two decades that you have been building. You have been in the engineering ethos. So what got you to well go towards voice? What sparked that bright idea? So I've been in the communications industry for more than two decades. started my career by enabling people to talk to each other. Yeah. Irrespective of where we are, right? earlier it used to be landlines and then mobile communication technology came. I built it from scratch. however that solved only one part of the problem. there are other human aspect of",
        "start": 0.16,
        "duration": 434.5570000000001
    },
    {
        "text": "started my career by enabling people to talk to each other. Yeah. Irrespective of where we are, right? earlier it used to be landlines and then mobile communication technology came. I built it from scratch. however that solved only one part of the problem. there are other human aspect of until I met the founders of Sonus. Oh okay very interesting. So you know it's a story why sus came into existence. So, Sonis was built out of Stanford University where two of our founders Sean and Max, they're a friend and this person went to a country called Nicaragua. Mhm. In Latin America. Yeah. and he was working in a contact center and this person was let go from his job because of his accent. interesting. Okay. And when he came back and met Sha and Max at Stanford University, they both felt that this is unfair. So I guess I was right Nesh when I mentioned earlier that sometimes we judged. Yes. Because judged because of his voice, because of his accent. and they decided to solve that problem using technology using AI. our founder co-founder Shahed decided to join both Shan and Max to solve this problem. he's been a serial entrepreneur and solved many problems in past right I would say it was a divine intervention nice when such a event happened and these three founders continued on a journey which became a multi-year journey solving problem related to accent dialect different languages over a period of multiple years at a science and engineer endeavor. You know, it's amazing that you just put it across so simply, but my god, that is a huge problem to solve and the fact that you use the term divine intervention. Do you believe Nesh that everything that we do comes from a very deeply personal place and I believe this as you put it across and thank you for sharing that story because it is I believe very close to your heart. But was it is it something that you believe in that it has to be deeply personal for it to make that kind of an impact? Yes. Yes. So when I when I met the founders of the company Shhat Sean and Max I felt that this is something which will give me a purpose in my career going forward. Okay. I made people talk to each other through mobile communication irrespective of where they are and through technology at SAS we are now making people talk to each other by being themselves. Yes. Which I guess is is the secret source. Yes. Irrespective of what language they speak, what accent they speak, what dialect they speak, communication can be clearer using sus in between. Wonderful. which is actually that you know you said that they solve the problem through engineering and science which is actually something which brings me to this thought which is that how is the culture of well let's say a deep",
        "start": 221.28,
        "duration": 840.4770000000002
    },
    {
        "text": "speak, communication can be clearer using sus in between. Wonderful. which is actually that you know you said that they solve the problem through engineering and science which is actually something which brings me to this thought which is that how is the culture of well let's say a deep different from let's say large enterprise environments and something which is which started off with with something where somebody had this emotion where it's unfair and then building something which was completely out of the And obviously all of you are coming from very you know wonderful backgrounds. You're coming from huge conglomerates in terms of the background. So I really want you to maybe get into that a little bit that that how much of the environment influences a journey like this. So as human beings we are sum total of the external stimulus given to us. Yes. By our environment. Sure. fact that you know humanity have so many challenges the best way to solve those challenges is through technology. when you come from a large corporate you sometimes realize that you know how to solve a problem but it takes lot more time to solve that problem when you are working in a smaller setup in a startup the speed becomes part of your day-to-day life you know whatever you do every decision you make has an impact true and you are driven by a purpose a sense of accomplish accomplishment that you solved a problem and as an engineer that matters the most not just to me but to every engineer I agree that you're solving a problem and as you grow in your respective career what matters more than anything else is the impact you create on the society so I truly believe that technology can make life of human beings better sure and sus As a unique company, we at SAS have an opportunity to make life better for all 8 billion people on earth [snorts and laughter] because speech is so unique to all of us. Every one of us. That is the sweet spot that you just hit. But tell me this Nish in terms of the fact that as far as you were concerned what was that moment that you realized like you mentioned obviously you had made people talk you did it from scratch and then this event takes place in your life. You move towards it. small company, small environment. Everyone is very enthused about making this work. Every engineer wants to solve a problem. Fabulous. But there are obviously given the fact that we are all humans, there is a sense of doubt. There is a sense of well, will we be able to do it? Will we not be able to do it? Maybe. What was that moment for you that you realize, okay, wait a minute, we're on the right path and this definitely is the future because you were building it from scratch.",
        "start": 428.72,
        "duration": 1228.637
    },
    {
        "text": "sense of well, will we be able to do it? Will we not be able to do it? Maybe. What was that moment for you that you realize, okay, wait a minute, we're on the right path and this definitely is the future because you were building it from scratch. when something different is said and done people don't believe it. Yes. When Galileo said that earth and the rest of the planets rotate around sun people did not believe him. True. And he was just stating the fact. True. So when the founders of Sana said that we can solve problem related to speech making it more clear [clears throat] making it neutralize from an accent perspective we can have people talk irrespective of the language they speak globally. people didn't believe it but here we are today few years down the line we have solved these problems very hard problems yes we now have close to 750,000 users on sana's platform congratulations and it's only going to keep growing I'm sure it's only going to keep growing by leaps and bounces we launched some of our products like accent translation noise cancellation less than 2 years ago we're growing by leaps and bounds. In fact, one of the hard technology problem which I'm trying to solve along with my colleagues at SAS is how do we scale this technology, make it available to millions and millions of people. So the next generation of platform which we are building will support 100 million users. Wow. Across various use cases. That's wonderfully aspirational which we are solving for. Yes. you kind of just summed up when you talked about Galileo or when you talked about all of those aspects and the journey and I'm pretty sure that you believe in that one little thought that energy follows thought. Yes. And it does definitely in your case thought is an energy. It is. Okay. So especially you know I'm sure someday you will meet our founders as well especially Shhat. Shahed talks about that everything is manifested. Yes. You first think about it and you believe it so much that universe does not have a choice but to manifest it for you. Beautifully said. Beautifully said. Okay. Coming to the fact that you you as you mentioned earlier that it was because of a very unfortunate situation that you know the decision was taken. It was unfair that a person losing his job because of his accent. Right? But I want to get into this aspect which is that sus was born out of this person experience. how is it that AI the [clears throat] the real time speech AI help level the playing field in well global conversations how did you all decide that okay we need to make it a lot more inclusive. Mhm. Because one thought could be that okay this is an issue let's just try to sort this out but making it inclusive",
        "start": 625.839,
        "duration": 1597.6780000000006
    },
    {
        "text": "speech AI help level the playing field in well global conversations how did you all decide that okay we need to make it a lot more inclusive. Mhm. Because one thought could be that okay this is an issue let's just try to sort this out but making it inclusive you had to get to. Yes. So I wanted to understand that as as the journey in terms of the thought. So you know the story about you know friend of our founders who were discriminated because of his accent. Sure. The way he spoke is actually a story of millions of agents in CX industry in customer support industry. I personally have witnessed that the customer support agents when they use saunas they have tears in their eyes. Wow. They are feeling so joyful. Wow. You know it is not very common that you are abused on a customer support call by your customer because of the way you speak. True. And CX industry agents are hired not necessarily for their talent but how they're able to mimic an accent, right? Which in my humble opinion is fake. Yes, it is not authentic. True. You are who you are and sus removes that barrier. Okay. You remain who you are. Authentic self and continue to talk in your own authentic voice and everything else is taken care by sas. And from a business perspective as well, it improves all the business mattresses in a dramatic manner. Yeah. So we we have you know the top BO customers various enterprises use SAS technology now when we work with them they have reported improvement in multiple business mattresses whether it is customer satisfaction score or it is time to resolve an average call being landed at a customer's desk number of escalations are dramatically reduced. In fact, at a humanity level, their attritions dramatically go down because their agents are happier and happier agents mean happier customers. Absolutely. You're right. Because I mean, I was just thinking about it as you were walking us through this entire thought process. It's isn't it so simple at the end of the day, the moment you're actually not pretending because everything is pretends. Yes. And and and I think you've hit the nail on the head that the moment you have a sense of belonging to your own self, you have a sense of authenticity, everything else just changes. Everything else just vanishes. The fears are gone. Everything else is gone. So, was that probably the thought in terms of right at the get- go that maybe we'll hit that emotion, make sure that everyone blossoms through that perspective or was it something that all of you kind of stumbled upon? So, you know, speech is very unique to every individual. So, all 8 billion people on earth on planet earth have their unique voice signature. Yes. Right. when we meet our friends, why do we enjoy that setting? Because",
        "start": 814.56,
        "duration": 1997.7580000000007
    },
    {
        "text": "was it something that all of you kind of stumbled upon? So, you know, speech is very unique to every individual. So, all 8 billion people on earth on planet earth have their unique voice signature. Yes. Right. when we meet our friends, why do we enjoy that setting? Because Yes. We're not pretending. True. We're not trying to put our role most of the time, you know, most of the [laughter] times. and I think that authenticity matters a lot. So sus as AI technology ensures that you remain yourself very authentic and be understood by the other person and that automatically brings joy when when as a person when you talk you know there are certain nuances which are very unique to yourself. Yes. You know true the way you take a pause. Yeah. The way you express your emotion. Yeah. Okay. , you know, I'll give you an example from my own life. I have family who live in live in US. , my brother and sister. When my brother calls me without looking at his number on my phone, when he says hello, I can figure it out. This is my brother calling me. True. That is so true. His accent has changed over a period of two decades. It's not the same way he used to say hello earlier. Absolutely. Fair point. Yeah. SAS does that in real time for everybody and that's just one problem you solve. That is just one issue. Just one problem you solve. so many of these things happen when the purpose takes higher precedence than all other commercial interest. Beautifully put. Okay. Magic happens. Yes. So the way sus was created and that's why I said this was in divine intervention that event happened in somebody's life. Yeah. and friends decided to address it because it was unfair and everything else just unfolded from that we now have solved noise cancellation is a problem yes that's a big one so you know irrespective of where you are you can be in Bangalore traffic the notorious I had to bring that up I had to bring [laughter] that up being in Bangalore or you can be at the airport you can be at home where dog is barking okay any sort of environmental noise. You may be typing while talking. Sure. Sana is able to differentiate that noise from your authentic self voice and without removing your authenticity increases your clarity. So at a at a at a science level, you know, SAS operates at the sound engineering. So you know all the speeches and the dialects and the languages spoken in the world are based on something what is called phonms. Y sas takes 10 millisecond samples of our speech. Okay. works on it at a form level transforms various aspect like language like accent removes all the background noise without taking your authenticity away away without taking your emotions away without taking [snorts] that small pause",
        "start": 1016.88,
        "duration": 2382.7990000000004
    },
    {
        "text": "what is called phonms. Y sas takes 10 millisecond samples of our speech. Okay. works on it at a form level transforms various aspect like language like accent removes all the background noise without taking your authenticity away away without taking your emotions away without taking [snorts] that small pause which actually brings me to this from an engineering lens since we we are getting into that direction as far as the conversation is concerned. I'd love to understand how do you teach a machine for example to well translate accents in real time. You talked about noise cancellation. You talked about that from those factors without actually and and and what are the some of the hardest technical problems probably that that your team has faced and is constantly let's say facing and is probably trying to overcome because we're looking at well like you put it and god speed on that that 100 million subscribers is where the vision is today but what are the kind of issues or what are the kind of challenges is I'd really like for you to maybe share that. It's a very dynamic ecosystem that you're dealing with. Yes. So we we have already solved many hard problems you know as I mentioned not taking your authenticity away. Yeah. Same time increasing clarity taking care of reverb taking care of surrounding noise. the challenge has been in doing it in real time. Yes. So we don't do any speech to text conversion then text to speech conversion right. SAS AI technology which is a patented technology SAS is a native AI company which means we build everything ourselves which is wonderful everything everything from scratch and solving it in real time. so when you're talking to someone you don't really feel that there is AI in between h that's something which we've all solved the the the other hard problems we are solving now is to scale globally yes right yes we have as I mentioned about 750,000 subscribers on sus platform using various u solutions we have in fact we recently launched our language translation B2C app which is now being used by people across 76 countries. 25 plus languages are supported by our language translation app. Wonderful figures I must say. Yeah. And what taking it to 100 million users globally. Yes. Is another hard problem. we solving that as we speak. we are also looking at where else sus can go. The impact on humanity sus can create can be phenomenal. I can give you an example. What are the few things that actually I was going to ask you what are the few things that actually come up on the top of your head the moment you say that in terms of the other problems. Yeah. Yeah. So take an example of 911 service in America. Yes. one can dial 911 irrespective of the emergency you may have you are provided help yes",
        "start": 1210.16,
        "duration": 2763.4380000000015
    },
    {
        "text": "things that actually come up on the top of your head the moment you say that in terms of the other problems. Yeah. Yeah. So take an example of 911 service in America. Yes. one can dial 911 irrespective of the emergency you may have you are provided help yes which is not understood by the operator by the 911 operator I'm told it can take up to sometimes 7 minutes depending on the language you're conversing wow before you can get an help that is a matter of life and death at times yes sana's technology ology can make that language translation happen in real time. Fabulous. Just one simple use case. There are similar use cases. In fact, the other day me and one of my colleague were talking about edtech industry and we started calling few friends and we learned there are more than 100,000 teachers in India. Yeah. who are teaching kids different subjects including language, including math, science outside India. [snorts] And then we spoke to a few founders of these cutting edge ed technology platforms and they were so excited to know about SAS. few of them immediately gave a go ahead to deploy SAS technology there on their platform. so we are now integrating our tech with their platform. and it just an amazing feeling to know you're touching so many lives. The kids globally will learn better. Yes. From teachers sitting far away irrespective of the language they speak, irrespective of the accent they have. Yeah. Irrespective of the dialect they have. Right. and everybody can be themselves because that's a huge one. I'll tell you why I say this is because I experienced it myself. One of my professors was wonderfully knowledgeable, voracious reader, brilliant at explaining everything. But unfortunately, a lot of times and I well would get lost in translation. It was tough. Yes. and and a lot of times it was difficult and I think that's a huge area which which which can embellish so many lives to be honest. So you know Sudi you may recolct there used to be this sci-fi series called Star Trek. Yeah. Yeah. Yeah. [clears throat] My mother's favorite. Yeah. So Star Trek Captain Kirk Yeah. Captain Captain Kirk, right? had this device called universal translator. I was going to I was I was think my mind immediately went there where I started to think beam me up Scotty. Yes. My favorite line and this universal translator could translate any language of the galaxy. Yes. Okay. this divine intervention which created SAS in my humble opinion is is a beginning of something like that. [clears throat] Wow. So that means we'll be able to speak with each other and cling on eventually. Why not? [laughter] Why not? Yeah. But that's fascinating. That is wonderfully aspirational in terms of the way you're thinking as far as that is concerned. Yes. It's actually what are the most exciting for example",
        "start": 1404.159,
        "duration": 3159.917
    },
    {
        "text": "that means we'll be able to speak with each other and cling on eventually. Why not? [laughter] Why not? Yeah. But that's fascinating. That is wonderfully aspirational in terms of the way you're thinking as far as that is concerned. Yes. It's actually what are the most exciting for example looking right what kind of other innovations u are is is sus looking at in in terms of your road map you've just mentioned the fact that noise cancellation has been something which has been achieved fact that real time AI speech is but that's in the legacy as far as the company's concerned but what other innovations do you believe are fair in terms of let's say 911 or edtech etc but what are the constant other innovations that you're looking at nish because the sense I get from you is that that you're constantly on this journey of honing and sharpening and honing and sharpening yes so the soas is a category leader in this new AI I category called speech AI. Okay. Where you deal with speech at a basic science level. Yeah. you know before I answer a question in fact our team is so diverse you know our scientists are based out of many countries and they work globally together. We have our scientists based in Spain, Austria, Germany, Poland, Korea, US, India. [laughter] and they all work with each other and they've created the beautiful technology called SAS clearly resonates the inclusivity aspect as far as SAS is concerned. Absolutely. However, in my humble opinion, not even sky is the limit for us. I would love to have sus in every device we carry with us. I would like to have a sus as an icon on my phone, your phone, every single smartphone shipped all over the world. You click that icon, sus is on. Nice. Magic happens. You click that icon on the receiving end, sus is on, magic happen. And it can do wonderful things. I'll give you an example. Not that we are necessarily working on this problem right now. there are a billion plus people on planet earth who have hearing deficiency. Wow. Yes, you're right. And with the constant use of these earplugs. True. By youngsters. Yes. The hearing deficiency will happen at an earlier age than what it has been happening in past. Which mean that hearing deficiency will become bigger problem. Wow. Now if I have sus on these devices or earplugs, I can be a personal companion for you compensating loss of your hearing deficiency in real time. Fascinating. Imagine so my mom with age she's now 75 her you know capacity to hear have come down and I've been requesting her mom why didn't you take hearing aids she doesn't want it the doctors advised because it's ugly yeah okay right it's inconvenient it's inconvenient yes right if I wish I could put susas in a phone and make the magic happen someday",
        "start": 1604.96,
        "duration": 3554.2390000000005
    },
    {
        "text": "have come down and I've been requesting her mom why didn't you take hearing aids she doesn't want it the doctors advised because it's ugly yeah okay right it's inconvenient it's inconvenient yes right if I wish I could put susas in a phone and make the magic happen someday beautiful and I only can just say I mean that's such a wonderfully poant thought that you've conjured up and I only wish that that can happen sooner than later. Yes. And I believe your team will be I'm sure working on it as as we are speaking or at least thinking about it. I would like sus to be in every device shipped anywhere in the world be it a mobile phone like a default setting desktop you know which becomes a personal companion. I believe AI as technology is not to replace humans but to complement humans to operate at the best version of themselves and SAS is one such example. Yeah, that's what it's true. You're I mean the way you put it across because obviously there is a lot of fear in terms of people when when generally the sentiment is that AI will replace humans, AI will do this or AI will do that. But I think on the contrary just the fact that this is the definition of how AI is complemented humans in a big way and that is science. Yes. Yes. I think and and moving forward I think people should not really always go ahead and resist that kind of change. Not at all. Not at all. And that is something I believe I don't know I get that sense that all of the team at SAS and everyone at [clears throat] Sonis has embraced change and is constantly doing it which is converse to well how the human race thinks. We always resist it. Yes. Yes. So, so you know they say that change is the constant thing the only constant thing in life. Yes. Yes. the only time you are not changing when you're dead. [snorts] Yeah. Fair. Yep. and AI can be very personal and sus is an example that how personal AI as technology can be. However, not giving up your humanity. I think at SAS what is very important for us is that we keep the human aspect of life intact and at the core at the forefront. Yes. And make communication clearer that you're understood irrespective of the dialect you speak. Sure. The language you speak, the accent you may have. Sure. And you become more confident of yourself. Right. and operate at a level where your talent is recognized and you are not limited by all these aspect of speech which sus can solve right and the word becomes a level playing field and nobody is discriminated yes that's what it is that's the magical mix isn't it yes level playing field and yes the equal opportunity that everyone should go",
        "start": 1806.08,
        "duration": 3905.039000000001
    },
    {
        "text": "are not limited by all these aspect of speech which sus can solve right and the word becomes a level playing field and nobody is discriminated yes that's what it is that's the magical mix isn't it yes level playing field and yes the equal opportunity that everyone should go well way which actually brings me to this is of course it's it's already being used by thousands of agents in contact centers across regions like well India Philippines the countries you mentioned across the globe right so how is it that it's changing their dayto-day experience that is part one the other aspect is what does success look like to you as far as or for that matter the core team the founding team at at SAS is concerned which is beyond the metrics. Yeah. So from Gurang to Bangalore to Coatu to tier 2 tier three town in Urisa to Manila to Mexico City to Jamaica. SAS is enabling hundreds of thousands of agents in CX industry, right, to be themselves, right? Express themselves based on their talent, not worrying about how how do they sound, how do they sound, right? And sus takes care of they sounding better, clearer irrespect of where they are working. You know, if you go to an call center BO environment, you will find it sometimes can be pretty noisy. Yeah. Yeah. you may even receive a call from your customer. Your customer can be in a very noisy environment. Yes. Or he could be noisy himself. But he could be noisy himself. SAS takes care of all of that, right? All of that. It of course into more business for our customers. all business mattresses are positively impacted by using SAUS as technology. But what really gives joy to me to everyone at SAS is the the gratification you see on face of an agent and it is irrespective where they are all over the world. Wow. Okay. SAS today supports from an accent translation perspective we support all Indian dialects Indian accent on the source side we support Philippine Filipino accent we support now African accent we support Middle East accent and on our target accent side we support American accent we support British accent in fact Now it's much easier for us because we solve the problem at a basic engineering and science level. I would like for you to maybe please elaborate on that because you know this thought definitely comes to my mind that it's so tough from let's say just to the engineering and the science point of view to get that dialect right or for that matter languages is one thing but the dialects just if you were to take India as a use case the dialects are different I mean there's the the nuances are so different so how is it that you've been able to crack that and of course not just within India, you've cracked it across the world.",
        "start": 1983.44,
        "duration": 4316.879000000002
    },
    {
        "text": "the dialects just if you were to take India as a use case the dialects are different I mean there's the the nuances are so different so how is it that you've been able to crack that and of course not just within India, you've cracked it across the world. view, I'd like for you to maybe please tell us about that. Yeah. So you know as our initial models which we built are our AI models, our AI algorithm which we built we worked at the basic sound properties level. M and then the same model is trained with hundreds of thousands hours of real speech data. Okay, where all combinations, combinations of gender, combinations of speech coming from different noisy environments, combination of different dialects, different people from different parts of the world talking and training our models again and again again and again. We have refined our technology so much that today in fact we have a universal model now. Okay. Which can translate any of these source accent I talked about to any of the target accent single model. Wow. Okay. In fact SAS the speech model is deployed especially in CX industry on some of the devices which are 10 year old. You know it's a very small footprint. M. So we all are familiar with what we call a large language models. Yes. So SAS has a large speech model and we convert that into a small speech model. Okay. Suitable for our customers who are using devices within their environment which may not be very very you know cutting edge technology devices. And another very interesting aspect with Sonos does is we do everything locally on the machine. Okay. That's a beauty of our algorithm which is so fine tuned. So we do not take any data outside a customer's promises. Nice. So our customers don't have to worry about privacy. Yeah. I was going to get to that that you're automatically addressing those concerns. Yes. Yes. So it's a it's a and again this is an problem not just solved you know in a month or two. It's a multi-year journey. Yeah. we it sounds very simple now but it has taken many years. We launched our commercial model in 2024. Okay. so we have grown in just two years from zero revenue to $50 million of AR right now. Let's do that. Let's share the number again. It's nice. It has a nice echo to it. [laughter] We had no revenue in 2023. Wow. Okay. what was the belief though that kept kept you guys going? I mean I think I think rather than targeting all these business numbers, business mattresses, I think the the the founders and the the core team at SAS focused on solving hard problem. When you solve hard problem, take an example of language translation which our team launched on October 15th. We now have a B2C app which you can download. I",
        "start": 2191.76,
        "duration": 4685.600000000002
    },
    {
        "text": "numbers, business mattresses, I think the the the founders and the the core team at SAS focused on solving hard problem. When you solve hard problem, take an example of language translation which our team launched on October 15th. We now have a B2C app which you can download. I download. Sure. For sure. Go to sus.ai and you know our app is available it's available both on Android and iOS iOS ecosystem and try it yourself. Okay. so it's it's it's it's not what money you will make, it's about what problem will you solve when you pursue purpose. Nice. Right. everything automatically happens. My grandmother when I was a kid in her own words she used to tell me and I still remember it very well that never go after money. [clears throat] Okay. Do something which gives you joy, right? Help others, right? Everything else in life will happen automatically. Beautiful, wonderful teaching but tough to implement though, right? tough to implement in one's own life. Tough to implement. But when like-minded people come together, yeah, I think that makes all the difference. That makes all the difference because then your energy attracts Yes. the same like-minded people like and that's how it happened. Yes, you know these founders they did not start the company saying oh in fact you know Sean one of who's a CTO right decided to drop from his undergrad studies at Stanford because he was so excited about solving his problem he did not finish his degree that's wow yes my [snorts] god that's true inspiration that's true belief in the idea yes in fact shad who's our other co-founder was actually invested in the company and when he heard the story and he saw the potential he actually decided to build it. What about you? Huh? Same thing happened with me, you know, who leaves a company like Reliance, right? I've been with Reliance for so many years. my previous company, Radises, was acquired by Reliance. Right. Right. I had the privilege of meeting Mr. Bani, right? attended his family weddings. How was that by the way? Out of the world. [laughter] Yes. Out of the world. We only saw the photographs. Yes. Yes. Yes. Yes. Yes. In fact, my wife and I attended their first, you know, family wedding with with Amani. My daughter was so excited about he said, \"Next time I'm coming with you.\" [laughter] So, I think I think that's that's that's what matters the most. purpose in life what matters the most. and then you attract like-minded people. Yeah. it becomes joy solving problems. So true. So when one [snorts] one looks at like say like a $50 million annual recurring revenue, do you feel today that really doesn't matter? Because I guess that I believe was never part of the journey. Correct me if I'm wrong. Yeah, I don't think we the journey was started like that. And all these numbers",
        "start": 2378.4,
        "duration": 5074.168000000002
    },
    {
        "text": "at like say like a $50 million annual recurring revenue, do you feel today that really doesn't matter? Because I guess that I believe was never part of the journey. Correct me if I'm wrong. Yeah, I don't think we the journey was started like that. And all these numbers know, he himself says we'll beat it. Nice. and the whole team unanimously you know says yes we will sh so I think for at sas is less about you know what numbers we do we for sure are on a path to build a decapon yes you know I I really feel humbled that we can do that as such a tiny small team but it's absolutely going to happen but more than that we will leave a longlasting impact. How big is the team that actually I mean you said that we're about 100 people in India. Nice. And another 75 people outside India. So less than 200 people globally. Very diverse you know we have fascinating you know across that's why we appreciate the diversity. Yes, we appreciate that we all come from different parts of the world. I asked you that is because I imagine my god global impact you want to I mean such a wonderful footprint that that you're establishing. So you know logic says oh maybe it's a huge team and it's all of that but that's less than 200 people. Yes. Yes. Yes. Yes. That's the power of AI. Yeah. And be prepared you know a smaller teams will create bigger impacts in our world going forward. Wonderful. Which obviously brings me to to the fact that building in India going forward I'd definitely like to pick your brain on that in terms of the fact that as far as well why Bangalore why now? Let's start there in terms of the fact that you set up SAUS at the center is in Bangalore. But why now? Why here? Yep. Yep. so first of all you know the team in Bangalore at SAS is part of a larger global team. Okay. it's an extension of team spread all over the world. of course the innovation started in Palo Alto yes out of Stanford University with our founders. we continue to have an outstanding team based out of our polo alto office. we expanded that team every function. So in India we have scientist and at SANAS we just don't have speech scientist we have speech scientist data scientist applied scientist we have team which works on neural networks we have team which works on machine learning we have team which takes care of inference taking our model from initial speech chunks to making a continuous stream we have team which works on our management platform which makes it scalable to 100 million users going forward. we have team which works on our app delivery mechanisms by which our algorithms can work on tiny desktops nice without taking any you know speech",
        "start": 2575.68,
        "duration": 5464.7280000000055
    },
    {
        "text": "to making a continuous stream we have team which works on our management platform which makes it scalable to 100 million users going forward. we have team which works on our app delivery mechanisms by which our algorithms can work on tiny desktops nice without taking any you know speech humble opinion outside Silicon Valley in America if there is one place where talent density is highest yes is Bangalore. I agree sir. Yeah. challenge in Bangalore is not about availability of talent is how do you identify the talent how do you attract the talent and more than that how do you retain the talent true true and I think sas has cracked that code and would you like to share a little bit sure [laughter] yeah how I think I think in my humble opinion in tech industry u money compensation is hygiene. Okay? you can sometimes attract people for money but that's not the way you retain them. Okay? You retain people by giving them a purpose and a culture which will enable them to achieve that purpose. So I work with all Gen Z's. In fact, I'm perhaps one of the oldest employee in SAS. Not at all. [laughter] not in spirit for sure. And I relate to Zenzi at Sana's because I have two kids, both are Zenzi, right? my daughter, you know, who is a budding doctor finishing her MBBS now doing her internship at St. John's Medical College in Bangalore. Wonderful. and I and my son who's still in school in his high school. I see them very different. I never challenge my father when I was growing up. My default answer to my father always was yes. Yes. Yeah. That's not true with my son. Or else I used to pretty much duck my father. But yeah, that's another story. You know, so my father my son will will say you're wrong. M so Zenzi is willing to challenge the status quo. At SAS we have young engineers who are willing to challenge the status quo but it's sorry but I want to add to what you're just saying the fact that it's also well kudos to you that that you're not being your parent or you're not being exactly like your parent. That's a tough one right? Yes. Yes. So you know innovation happens when there's no fear. Correct. Okay. You have to take fear of anything. Fear of failure, fear of not being able to perform. when people operate without fear, truly magic happens. Yes. You provide the environment where people can challenge each other, where people can express their ideas and opinions, where people are trusted to work on PC's, where people are given enough time and and and that's that's that's I truly believe youth especially you know I've seen you know innovation happens in Silicon Valley but I see similar culture here in Bangalore. So I mean we chose Bangalore in",
        "start": 2772.24,
        "duration": 5832.59300000001
    },
    {
        "text": "people are trusted to work on PC's, where people are given enough time and and and that's that's that's I truly believe youth especially you know I've seen you know innovation happens in Silicon Valley but I see similar culture here in Bangalore. So I mean we chose Bangalore in Bangalore boy. Okay. So that would have helped that helped a lot. We leverage the ecosystem. He's been a serial entrepreneur built many companies. He's been a founder of Practto and many other companies. He invest in in many companies. He's a champion of entrepreneurship. So we've leveraged that ecosystem and we have a phenomenal team. I cannot be more proud of the team we have in our Palo Alto office, in our Bangalore office, in our Manila office, in our office all over the world. Our scientists are spread everywhere with the kind of scale and with the kind of aspirations that we have discussed up till now. what is that one or maybe few special things that you look at Nish in terms of the team and I'm sure a lot of people would be very very curious to know because I'm hoping that the team is only going to keep growing so potentially maybe a lot of people would want to be a part of SAIS and this journey. So what what is it that you maybe look at in terms of when you're scouting for that talent that that special magic that you Yeah. So I'll I'll I'll I'll repeat what Sh says okay because I truly believe in it. What matters the most is intent. Okay. Nice. Rest everything we learn together. True actually. So I look at the intent when I meet people. Okay. I look at the intent, you know, are you willing to challenge the status quo? I hope the intent was good today that you saw you know Sudhi like I said you know before we started talking together that you know universe has conspired us to meet today which is a good thing. Yeah. and now we're going to remain connected. Yes, we will forever. We shall share our voice. Yeah. But that's true isn't it Nish that at the end of the day it's it's it's the fact that if the attitude is right everything else follows. So I have a framework which I tell my team you know you can speak to anyone in my team behind my back and they'll say Nesha C1 C2C3 framework. So I call it C1 plus C2 in the bracket multiplied by C3. C1 is competence right? Okay. which is defined by your your aptitude. Okay. What do you know? Your skill. Sure. C2 is your commitment which is defined by your attitude. Yes. How do you take things up? When you commit, you deliver. Yes. At SAS, we say that sun can rise from west. We will deliver on time. Nice. So and you know and C1 and C2 are",
        "start": 2963.44,
        "duration": 6195.633000000014
    },
    {
        "text": "skill. Sure. C2 is your commitment which is defined by your attitude. Yes. How do you take things up? When you commit, you deliver. Yes. At SAS, we say that sun can rise from west. We will deliver on time. Nice. So and you know and C1 and C2 are is multiplier, right? And C3 is what I call collaboration. It is what I call intent. Yes. Okay. is what I call camaraderie. Okay. So you can learn skill. Competence can be built over a period of time. The C2 commitment your attitude bring to the table. Sometimes you know you build that attitude while you're growing up as a child. Okay. No matter how good you are with respect to your competence, no matter how committed you are as an individual, magic happens when you talk together in a team and that's where collaboration camaraderie comes into play which is a multiplier effect. Yeah. And I think SAS that is what really happens. So we we we have brilliant minds which we were lucky to pick up. Honestly I I sometimes I feel we're just lucky to have the people who are with us today. but we all work together in one team and we've done magic and this journey of magic is going to continue. Yeah, kudos to that and of course onwards and upwards which actually I want to you know I've been wondering about this but what inspired the name sance it's very unique name yes it is it is so so sas as a word combination of phenoms can be pronounced like sus in multiple languages okay. So is the ethos of why SAS as a company was created. Nice. That no matter what language you speak, what dialect you speak, you will call SAS as SAS. That's interesting. That is so interesting that that the fact that it just goes to that deep level of a thought and so much was put behind that thought. Well done. Whose idea was it? Our founders. [laughter] Okay. So we've cracked as as far as Sus is concerned the environment is well as you mentioned is wonderful. It's collaborative. It's filled with intent and commitment and as you said that money is just hygiene right. So that aspect is well pretty much on track but as far as a startup energy is concerned how do you maintain that and how do you continue to go ahead and maintain that because I believe that's very important right we discussed this earlier that decisions get taken a lot quicker when you guys are starting up visav for example the administrative red tape that you had to deal with huge conglomerates correct Correct me if I'm wrong. I believe that is the soul of where Sus is today. So retaining that soul, how do you still manage to do that? So the positivity believing that you can bring change, you can make other people's life better.",
        "start": 3144.88,
        "duration": 6572.237000000015
    },
    {
        "text": "to deal with huge conglomerates correct Correct me if I'm wrong. I believe that is the soul of where Sus is today. So retaining that soul, how do you still manage to do that? So the positivity believing that you can bring change, you can make other people's life better. Yes. True. You know once you start believing that you start manifesting it okay and energy then automatically comes a good example can be you know being a parent I'll quote as an example no matter what time of the day or night it is if my daughter were to call me and ask me something it doesn't matter how hard day I had hours I've been awake I will just make that thing happen Yes. Okay. So, because you own it. Yeah. Because you know, she's my baby. She's my daughter, right? when you run a company, you own it. Nice. When you lead a team, it's a privilege. You feel accountable for it. So, you feel humbled by it. Absolutely. SAS has three values which we live every day you know core of our ethos and that's what the energy keeps going at SAS the first value of SAS is customer obsessed everything we do we're obsessed about our customers solving challenge their problems and it's just not the companies we work for it's the people behind those companies like I talked about then a call center agent cries with joy joy. There is no compensation in the world which can replace that. True. Right. So, we're highly customers obsessed which is one of our values. The other value we have as a company is innovate or die. okay. Innovation is what keeps you going. True. Forever otherwise you will perish. And that we do in every product we build, every problem use case we try and solve is always always innovate, innovate. There's always a better way of doing it. There's always a faster way of doing it. Sure. and the third and the most important one in my humble opinion from a people perspective is extreme accountability. Absolutely. So we hold all of us Yes. accountable. So to me that's a big one. The culture is always top down, right? So, you know, take like take an example of family as well. We cannot tell our children don't do this, do that [snorts] unless you're setting an example yourself. Are you leading as a parent as an example? Yes. If you would like your children to wake up early, do you wake up early? Actually, if you want your children to spend less time on devices, do you do that? Agreed. You know, companies are no different. You know as leaders all of us our whole leadership team global exec team we lead by example and we live these three values of sas in our day-to-day life and this energy is just a byproduct si it automatically happens. [snorts] Yeah,",
        "start": 3338.4,
        "duration": 6942.395000000017
    },
    {
        "text": "Agreed. You know, companies are no different. You know as leaders all of us our whole leadership team global exec team we lead by example and we live these three values of sas in our day-to-day life and this energy is just a byproduct si it automatically happens. [snorts] Yeah, placed all the three pillars perfectly positioned. But one little followup before I want to get into the debate as far as your inclusion and the accent aspect of things. innovation is obviously at the bedrock of everything that Sonis does. But tell me this Nish does it is it sometimes overwhelming that in terms of wow we need to constantly keep innovating does that sometimes well maybe weigh down on the fact that I don't know is there maybe a little how should I put it for the lack of a better word a writer's block at times [snorts] that happens because innovation is constant creativity so I just would like for you to maybe talk about that because it's fascinating for you to con and and the team at SAS to constantly keep innovating on a regular basis. So when you create a new category h in the industry let me let me let me give you an analogy. So take an example of city like Bangalore. Yeah. Okay. Quick commerce which is some of these you know 10-minute app delivery apps. Yeah. True. Did not exist few years ago. Yes, they didn't. Right. and it's remarkable that they're still able to deliver given Bangalore's traffic. Can you imagine that? Yeah. that has changed the way we live our life in the city. Absolutely right. And of course it has positive impact not just for us as consumers but it has given employment to so many people. So many people. Yeah. So the responsibility lies on the company when you create a category. Sure. Right. You have to continuously innovate. Sure. Okay. SAS is a leader in speech AI as a category. We created that category. Okay. True. Right. We now have people, you know, who are coming and doing the same thing. Okay. But it is the responsibility of the leader to continuously innovate. Yes. Okay. And so with great power comes great responsibility. Absolutely. Absolutely. Absolutely. So it's not easy to create a category which I humbly believe happen with this divine intervention. Yes. But it has a and will continue to now the responsibility lies on all of us. You know many of us have recently joined SAS and the responsibility lies on everybody not just on founders. So now we are a family which is taking this this notion forward and it's just a beginning si in my humble opinion what we Sus has done so far is just the beginning. It's just the beginning. picture. Absolutely. Which brings me to this thought. The debate n has been this fact as you know the accent technology often sparks this debate. Mhm.",
        "start": 3527.839,
        "duration": 7325.677000000014
    },
    {
        "text": "it's just a beginning si in my humble opinion what we Sus has done so far is just the beginning. It's just the beginning. picture. Absolutely. Which brings me to this thought. The debate n has been this fact as you know the accent technology often sparks this debate. Mhm. which is that some see it as well empowering others well worry it kind of maybe sometimes erases identity. Mhm. Right. So how do you think about let's say the user agency the dignity aspect of things and the fact that where to draw that let's say ethical line if at all in terms of building technology like this so whenever something pathbreaking happens sure there would always be naysayers true which is true isn't it fact that such conversations happen tells me that we are rightath we are on the right path si correct [laughter] so to us to founders to us as a leadership team to every every member of sana's family it's actually a motivation to continue to innovate okay yeah and keep the authenticity the human aspect of speech alive Every product we build, every feature we deliver, we ensure that communication is clearer. Yes. You are heard and understood, right? Irrespective of the dialect, the accent, you know, you're talking and you are never judged because most important I believe. it's easier said than done. Yes, it is. But that is where the true value which sus has created and so some of these it's perfectly okay for people to say things they want to say to me that's gives me more energy nice and motivation wonderful to continue to innovate. Yes. which obviously makes it also and again I believe that it there is a sense of transparency I'm pretty sure that that you bring to the table that I believe everyone at SAS brings to the table is that true in terms of the fact that there has to be transparency yes which has to be which is going to build that trust with the users if that is not there then y see fact that you know we have 750,000 users of SAUS. Yes. Accent translation, noise cancellation technology. True. Just in CX industry. Just in one industry. Just in one. Yeah. Okay. you're obviously tapping edtech. You're talking about the the 911. Yes. Emergency services and others will follow. But we also give the power in the hands of the user. Right. Okay. So the app we deliver as part of our delivery mechanism the the end user have access to switch it on and switch it off. Yeah. They keep it on because they feel empowered with the technology. Yes. So to me AI is a companion, a personal companion for every human being on earth to perform as the best version of himself and herself. Sure. And SAS is one step in the direction. Do you believe though I mean this this it's",
        "start": 3724.88,
        "duration": 7741.596000000016
    },
    {
        "text": "feel empowered with the technology. Yes. So to me AI is a companion, a personal companion for every human being on earth to perform as the best version of himself and herself. Sure. And SAS is one step in the direction. Do you believe though I mean this this it's tends to have which is the fact that how much should one share with AI in terms of for AI to not get into too many person spaces the safety aspect the privacy aspect how would you like to address that thought so that has been at the core when we're building a product okay so what we have done we have given the control of AI mm M in the hands of our customer or users. Right. So we do not collect any data whatsoever. The the our algorithms our model is deployed locally on your machine. And even when we take it to other industries, we're going to continue to have the same delivery model. Fair. So you're not putting any thing which you are concerned about which is privacy of your customers data, your own privacy. None of that is being stored anywhere on cloud. Okay. Or with sus it stays with you. And that's where the beauty comes into play. Like I talked about you know it's just not about building large speech models. It's taking those large speech model and building small speech model which is working with you on your devices. So you don't have to worry about privacy and it's important in my humble opinion privacy is very important. Sure. And one should not ignore it at all. So you know the the data privacy is core of every solution which we build and deliver. The road ahead I'd like to definitely feel excited about talking about that you've already mentioned that that there are certain things on the horizon but I specifically wrote this down which was that so beyond contact centers where do you see SAS making the next big leap? We've talked about edtech. We've talked about that. But since we both agree that picture of Yeah. Where do you see that in terms of what is truly real time human level speech understanding [clears throat] look like in your road map? So, Sonus has recently launched the language translation B2C app which is now being used by people in 76 countries. We launched it on October 15. Mind you, congratulations. we are supporting 25 languages as of now and we're going to expand that footprint going forward. and this language translation is more accurate than any other language translation available as a solution from even big companies. What's the barometer? I just want to understand that the in terms of the the gauging of the fact in terms of the accuracy aspect how is there like a a model that you say okay based on this particular benchmark that it's more accurate these are the",
        "start": 3934.079,
        "duration": 8113.516000000017
    },
    {
        "text": "big companies. What's the barometer? I just want to understand that the in terms of the the gauging of the fact in terms of the accuracy aspect how is there like a a model that you say okay based on this particular benchmark that it's more accurate these are the for my own knowledge. Oh yes yes there are matrices by which you measure multiple aspect of language translation. Yes. Okay. And accuracy is one aspect. And accuracy is more important especially take an example of in CX industry. Sure. Or you know I talked about the 911 use case. Yes. Or in healthcare industry. Yes. Or edtech for that matter. Or tech ed techch for that matter. So and you will have to play between various parameters. Yes. If you want it to be accurate, then you might have to slow down from an conversion speed perspective. So creating that balance between accuracy, speed, naturalness of your voice. Yes. Right. Keeping the emotions intact. Wow. Multiple aspect. Yes. Removing the noise at the same time. You know, we tend to be so interesting that you just made all those thoughts because we don't really realize that there's so many little nuances that they are there. Yeah. But yeah, interesting. See, when you're speaking, they say it's not what you say matters. It's how you say matters the most. Fair and this how you say is what sus preserves. Fair right while dealing with language or accent translation for that matter. So these nuances is what sas the scientists at SAS preserves and work on right by so just for language translation model which we have built we had taken 18,000 hours of data wow to train our model again and again and again and again wow that's how refined it is and as of now we have launched it a B2C app, right? we are going to take it to other industry use cases. Okay. And scale it. To me, I would say SAS has arrived. Mhm. When 8 billion people on planet Earth are using SAUS in one form or the other. Well, that's the big leap for sure. So we have a lot of work to do. Well, less than 200 people. That is mindboggling. Yes. All right. So we are at that point now. Uhhuh. Where it's a rapid fire. Sure. Shoot. You're going to be Maybe I should, you know, stand up. You want to do a little bit of like a warm up or a few stretches here and there. All right. So if you're all set. Mhm. Let's go. So, if you weren't building voice AI, what completely different career would you have chosen? Huh, interesting one. I think I would do something intersection of philosophy and metaphysics. Okay. Perhaps proving that you can travel time as a dimension like you travel space as a dimension. Answering questions of whether there is multiverse or not. Answering question how we as beings have",
        "start": 4123.679,
        "duration": 8572.55600000002
    },
    {
        "text": "have chosen? Huh, interesting one. I think I would do something intersection of philosophy and metaphysics. Okay. Perhaps proving that you can travel time as a dimension like you travel space as a dimension. Answering questions of whether there is multiverse or not. Answering question how we as beings have Maybe become an author [laughter] or a teacher. You do realize right that since you've been so nice and kind to tell me that our relationship is only going to continue from here on. That's our second podcast. [laughter] All right, we'll do it. Si one tech myth you wish people would stop believing immediately that AI will replace humans. Very nicely put. So, what's tougher? Fixing latency or convincing people that AI won't replace them? Well, you've answered that. Next one. Your go-to stress buster after a day of well debugging humans and machines. , so I think my stress buster is when I'm talking to my daughter, listening to her stories of how she work with that patient and this patient and how she helped human beings. Nice. , that's a big stress buster. When I talk to her, I feel like solving technology problems are easier. are listening to my son, you know, who will tell me what he did in his robotics class and he challenging me saying you're wrong. So going back to family, spending time with my family is my stress buster. I must say you're very blessed. You have very talented children. Yes, I am indeed. Thank you. Very blessed. Okay. So if Sus could give you any accent for a day, which one would you pick and why? I would not pick any other accent than mine. Nice. Because sas will take care of everything else. Nice. No matter with whom I'm talking any part of the world, right? Anywhere in the world, irrespective of the accent or the language, sus will do the magic. Fair enough. Finally, if you were to define sus in one word, what would that word be? Magic. Perfect. Perfect. It's been a true true pleasure having you with us on simulated reality and I just can say the fact that we could have gone on and on as far as the conversation is concerned because there is just so much that we still need to cover like I had mentioned earlier that second edition of the podcast is going to be right around the corner but I have to truly say this that you brought a beautiful voice today to simulate ated reality and we are very grateful for that voice to echo on this platform. Thank you so much Sudi. It's been an honor and sheer pleasure for me to be here today. Thank you for hosting me. Appreciate it. So kind of you. Thank you so much. And let the magic go on. Let the magic go on.",
        "start": 4354.08,
        "duration": 8929.916000000014
    }
]