[
    {
        "text": " Good evening. For 5 years, the narrative has been loud and on top of that, it has been vicious. Indian IT is dead. Generative AI will cook the service companies. Why hire emphasis or service companies when you can just prompt an AI? The story was simple. Silicon Valley builds the tech, Bangalore gets replaced. End of story. Except reality just punched that narrative in the face. The startups everyone thought would kill Indian IT, they aren't hunting Infosys. They are actually begging Infosys to sell their product. And here is the news that broke the internet today. Infosys, the giant with 3.3 lakh employees, has partnered with Cognition to deploy Devon, the world's first fully autonomous AI software engineer. And they're deploying it for real, not just testing the waters. Internal engineering teams, they get Devon. Client delivery, Devon is there. Managed service inside the Fortune 500. Say hello to Devon because Devon is running the show. Infosys is plugging Devon directly into Topaz. That's their massive AI fabric. They're fusing infrastructure, data models, and autonomous agents into one stack. And the internet's reaction, pure chaos. People are realizing that which didn't die, which just became the distribution layer for the entire global AI economy. And now it is time to analyze the narrative behind the news. Why is Cognition the darling of Silicon Valley shaking hands with a 40-year-old service giant? Quite simply, for distribution. Period. Cognition sells one Devon. Inhosis can deploy 10,000 Devons by next Tuesday. Startups don't have 40 years of trust. They don't have the SLAs's. They don't have the CIO's phone number at the world's biggest banks. Guess who does? Infosys does. Infosys already runs the back end of the global economy. Banking, insurance, retail, energy. So, if you want to sell AI to the enterprise, you don't knock on the front door. You plug into Infosys and then Inhosis takes you to 500 clients overnight. It is the ultimate distribution system which keeps compounding the momentum. And to clarify, Infosys didn't sign this today. They've been running Devon secretly for 6 months and the data is terrifyingly good. Complex Cobalt migrations done in record time. Legacy JCP serveled conversions accelerated. Tech debt deleted. Engineering pods didn't just improve, they doubled their output. which is why emphasis is repositioning. So the Q3 results are coming up on January 14th and please expect the narrative to shift. They are telling the market we are not competing with AI, we are scaling with AI. And now I would of course like to address the 22year-old engineer who's watching this. Hello. So if you're a junior coder, the ground just moves beneath your feet. Devon is not a chatbot. It is an agent. It writes, it tests, it debugs, it deploys. Which means routine coding is dead. We of course had mentioned this to all of you weeks ago regarding emphasis offering 21 lakh rupees salaries for AI specialists which should not be",
        "start": 0.48,
        "duration": 422.72
    },
    {
        "text": "feet. Devon is not a chatbot. It is an agent. It writes, it tests, it debugs, it deploys. Which means routine coding is dead. We of course had mentioned this to all of you weeks ago regarding emphasis offering 21 lakh rupees salaries for AI specialists which should not be be interpreted as survival. Two Indas are forming inside it. India A you control the agents you get the salary spike. India B you write routine code you get displaced. I guess that brings our focus to well expect layoffs expect restructuring. The assembly line is pretty much closing. The hybrid era of human plus agent is opening. So what happens next? 14th of January emphasis Q3 earnings. This partnership will dominate every analyst question. How fast does this scale? What happens to the margins? If emphasis proves it can act as the carrier for aentic AI, the stock narrative changes overnight. Which of course now brings us to the front page take. AI is not destroying Indian IT. No, AI is absorbing Indian IT into the global stack. Cognition builds the brain. Emphasis provides the body and the clients provide the money. This is the new word. Human plus agent plus enterprise fabric. Emphasis is shipping it. The question is, are you ready to work alongside it? There's front page by Aim Network. Think AI. Think emphasis. Think Devon. Yeah. Like, share, subscribe. [music]",
        "start": 211.84,
        "duration": 590.336
    }
]